{
  "title": "Seasons",
  "category": "earth-space-science",
  "imageFile": "100_1680.jpeg",
  "imagePath": "images/earth-space-science/100_1680.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Winter Weather and Seasonal Change\n\n## Core Science Concepts from Image Analysis\n\n- **Seasonal weather patterns:** Snow accumulation visible on trees, ground, and objects indicates winter weather conditions with freezing temperatures and precipitation\n- **Effects of cold temperatures on water:** Snow coverage demonstrates the solid state of water and how temperature changes affect matter\n- **Impact of winter weather on human structures and activities:** The snow-covered wagon and fence show how seasonal conditions affect the tools and equipment people use\n- **Weather variation across regions:** The mix of evergreen (snow-covered) and deciduous (bare) trees illustrates how different plants respond to winter conditions\n\n---\n\n## Lesson Title\n\n**Winter's Blanket: Observing and Recording Seasonal Weather**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 3-ESS2-1: Represent data in tables and graphical displays to describe typical weather conditions expected during a particular season.\n  - 3-ESS2-2: Obtain and combine information to describe climates in different regions of the world.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Describe typical winter weather conditions and how they are visible in nature and around communities.\n2. Collect and organize weather data using tables and simple graphs.\n3. Explain how different materials and objects are affected by winter weather.\n4. Compare winter weather patterns in different environments (like snowy regions versus warmer regions).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Large printed or projected image of the snowy winter scene\n- Chart paper and markers\n- Optional: small container of ice or snow (if available in your region)\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or printed poster where all students can see clearly. Allow 30 seconds of silent observation time.\n\n2. **Pose these discovery questions to the whole group:**\n   - \"What do you notice covering the trees, the wagon, and the ground in this picture?\"\n   - \"How do you think this place looks different in summer?\"\n   - \"If you touched the snow on that wagon wheel, what do you think would happen to your hand?\"\n   - \"Why do you think snow sticks to some things but not others?\"\n\n3. **Record student responses** on chart paper without correction. Celebrate curiosity over accuracy.\n\n4. **Wonder prompt:** \"I wonder what this same place would look like in spring or summer. What do you think would be different?\"\n\n**Transition:** \"Today we're going to become winter weather detectives. We'll explore how snow and cold temperatures change the world around us, and we'll learn how to record what we observe so scientists can study weather patterns.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Ice cubes or frozen water blocks (prepared ahead)\n- Various materials in a tray: cotton ball, aluminum foil, plastic wrap, paper towel, cloth, foam\n- Shallow trays or small containers (one per pair/small group)\n- Cups of warm water (teacher-controlled)\n- Thermometers (regular or picture cards showing temperature scale)\n- Observation worksheets with simple data table (included below)\n- Pencils, crayons\n\n**Activity: \"How Does Snow Stick to Different Materials?\"**\n\n**Step-by-step student directions:**\n\n1. **Organize students into pairs.** Distribute one shallow tray and one ice cube to each pair.\n\n2. **Show the ice cube:** \"This ice cube represents snow or ice from cold winter weather. You're going to test different materials to see which ones ice sticks to best.\"\n\n3. **Each pair receives 5-6 different materials** (cotton ball, foil, plastic, paper, etc.).\n\n4. **Students place the ice cube on each material one at a time** (keeping a 30-second contact time). They observe and record:\n   - Does the ice stick?\n   - Does it stick a lot or a little?\n   - Does water drip off?\n\n5. **Students draw or mark their observations** on the data table:\n\n| Material | Does Ice Stick? | How Much? (Draw) |\n|----------|-----------------|------------------|\n| Cotton Ball | Yes / No | |\n| Aluminum Foil | Yes / No | |\n| Plastic Wrap | Yes / No | |\n| Paper Towel | Yes / No | |\n\n6. **Teacher check-in:** Circulate and ask: \"What do you notice happening to the ice? Why might snow stick better to some things than others?\"\n\n**Connection to photograph:** \"Look back at the wagon in our winter picture. You can see snow stuck heavily to the metal parts and wooden parts. What you're discovering right now is why that happens!\"\n\n**What students should record or document:**\n- Completed observation table\n- Simple drawings showing which materials had the most/least snow or ice sticking\n- 1-2 sentence observation: \"Snow stuck most to _____ because _____.\"\n\n**Teacher Role:**\n- Circulate to each group every 2-3 minutes\n- Ask guiding questions: \"What do you notice?\" \"Why do you think that happened?\"\n- Prevent answers; allow discovery through observation\n- Manage warm water cups for safety; assist with thermometer reading if needed\n\n**Expected Student Outcomes:**\n- Students discover that different materials interact with ice/snow in different ways\n- Students create a basic data table showing their findings\n- Students make simple inferences (e.g., \"Rough things stick better than smooth things\")\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with key vocabulary\n- Photograph displayed again\n- Student observation data from Explore phase\n- Picture cards showing winter vs. other seasons (optional)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Ask 2-3 pairs to share one thing they discovered\n   - Record findings on a class data table visible to all\n   - Note patterns: \"Which materials had the most ice stick to them?\"\n\n2. **Introduce key vocabulary (8 minutes):**\n\n   **Vocabulary with Third Grade-Friendly Definitions:**\n\n   - **Season:** A time of year with its own special weather and conditions (winter, spring, summer, fall)\n   - **Temperature:** How hot or cold something is; we measure it with a thermometer\n   - **Precipitation:** Water that falls from clouds to Earth (rain, snow, sleet, hail)\n   - **Weather:** What the air is like outside on a certain day (sunny, rainy, snowy, cold, warm)\n   - **Winter:** The coldest season of the year when it snows in many places and temperatures are very low\n\n   **Teaching method:** Use a simple diagram on chart paper or whiteboard:\n   - Draw a simple thermometer showing \"warm\" (top) and \"cold\" (bottom)\n   - Show the photograph and label: \"Winter weather has very cold temperatures and snow (precipitation)\"\n   - Point to the wagon: \"This metal wagon is covered with snow because winter precipitation stuck to it\"\n\n3. **Connect back to photograph (4 minutes):**\n   - \"In the picture, we see snow—that's precipitation—falling and sticking to trees, the wagon, and the ground\"\n   - \"Winter is the season when it's coldest, and in many places, we get lots of snow\"\n   - \"The temperature in this picture is below freezing, which means water turns into ice and snow\"\n   - \"Just like in your experiment, snow sticks better to some materials—look at how much is on the metal wagon!\"\n\n4. **Check for understanding:**\n   - Quick thumbs up/sideways/down: \"Do you understand what season this picture shows?\"\n   - Sentence frame: \"Winter weather includes _____ and _____.\" (students fill in blanks with vocabulary)\n\n**Expected Student Outcomes:**\n- Students use new vocabulary correctly (can identify season, temperature, precipitation, weather)\n- Students connect their hands-on experiment to the winter scene in the photograph\n- Students understand that winter is characterized by cold temperatures and snow\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Large paper or poster board (one per pair)\n- Magazines or printed images showing winter and non-winter scenes\n- Markers, crayons, scissors, glue\n- Optional: picture cards of different regions (snowy, tropical, desert)\n- Observation worksheet: \"Winter vs. Not-Winter\"\n\n**Activity: \"Winter Weather Around the World\"**\n\n1. **Introduce the task (2 minutes):**\n   - \"We learned about winter weather by looking at a snowy place. But not all places on Earth have winter like this. Some places are warm all year. Let's investigate!\"\n\n2. **Activity structure (12 minutes):**\n\n   **Option A (If using magazines):**\n   - Provide each pair with 2-3 winter images and 2-3 non-winter images (tropical beach, desert, warm forest, etc.)\n   - Students sort images into two columns on a paper: \"Winter Weather\" and \"Not Winter Weather\"\n   - Students must explain one reason for each sort (e.g., \"This is winter because there's snow and ice\")\n\n   **Option B (If using picture cards of regions):**\n   - Show picture cards of three regions: snowy mountains, tropical island, desert\n   - Students complete a comparison table:\n\n   | Region | Type of Weather | Temperature | Precipitation | Clothes You'd Wear |\n   |--------|-----------------|-------------|----------------|--------------------|\n   | Snowy Place | Cold | Very Cold | Snow | Coat, gloves |\n   | Warm Island | Hot | Hot | Rain | Light shirt |\n   | Desert | Hot/Dry | Hot | Little | Hat, light clothes |\n\n3. **Share findings (3 minutes):**\n   - 2-3 pairs show their sorted images or completed table\n   - Class discusses: \"Where is it always winter? Where is it never winter?\"\n\n**Teacher Role:**\n- Facilitate sorting without correcting; ask: \"Why did you put that image there?\"\n- Provide sentence frames: \"This is/isn't winter because _____.\"\n- Guide students to notice temperature, water (snow/rain), plant life, and clothing clues\n\n**Expected Student Outcomes:**\n- Students recognize that winter weather (snow, cold) appears in some regions but not others\n- Students apply vocabulary to new situations (temperature, precipitation, season)\n- Students create a visual or written comparison showing understanding of climate differences\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of seasonal weather patterns and data representation.\n\n**Activity: Formative and Summative Assessment**\n\n**Formative assessments used throughout lesson:**\n- Observation during Explore phase (did students record data accurately?)\n- Questioning during Explain phase (can students use vocabulary?)\n- Group share-out in Elaborate phase (do students recognize non-winter regions?)\n\n**Exit Ticket (Summative Assessment) – Administer at end of Session 2:**\n\n**Format:** Simple worksheet or verbal response to teacher\n\n**Questions:**\n1. **Draw or write:** \"Draw what you see in this winter picture. Label one thing that happens because of cold winter weather.\"\n\n2. **Multiple choice (read aloud):**\n   \"In winter, the temperature is very _____.\"\n   - A) hot\n   - B) cold ✓\n   - C) windy\n\n3. **Observation task:**\n   Show a new winter photograph (different from the lesson image). Ask:\n   \"What winter weather do you see in this picture? Name two things.\"\n\n4. **Vocabulary application:**\n   \"Finish this sentence: Winter is a season when _____________________.\"\n\n**Success Criteria:**\n- ✓ Student correctly identifies winter as a cold season\n- ✓ Student names at least one type of winter precipitation (snow, ice)\n- ✓ Student uses the term \"temperature,\" \"weather,\" or \"season\" correctly\n- ✓ Student describes visible winter conditions in the photograph\n\n**Expected Student Outcomes:**\n- Students who meet all success criteria demonstrate readiness for Grade 4 weather/climate concepts\n- Students who partially meet criteria may need additional exposure to seasonal vocabulary and data recording\n- Record observations for differentiation planning\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified data table with pictures:**\n   - Instead of writing, provide a table where students simply point to or circle pictures showing whether ice stuck (smiley face = yes, frown face = no)\n   - Reduce number of materials tested from 6 to 3\n\n2. **Sentence frames and word banks:**\n   - Provide pre-printed options: \"Winter is when it is _____ (cold/hot). We see _____ (snow/rain/sun).\"\n   - Display vocabulary words with pictures on a classroom poster for reference throughout lesson\n\n3. **One-on-one or small group teacher check-ins:**\n   - During Explain phase, work with small group to review vocabulary using the photograph\n   - Use concrete objects (ice cube, cotton, foil) to practice matching words to observations\n\n### Challenge (For Advanced Learners)\n\n1. **Predict and test with new materials:**\n   - Challenge students to predict which materials ice would stick to BEFORE testing\n   - Ask them to explain their predictions using what they know about surfaces\n   - Extension: Test with wet vs. dry materials and compare results\n\n2. **Create a winter weather data chart:**\n   - Have advanced students create their own table showing temperature, precipitation, and daylight hours across three months (November, December, January)\n   - Use real weather data from local newspapers or weather websites\n   - Students create a simple bar graph showing temperature changes\n\n3. **Compare regions using climate data:**\n   - Provide actual temperature and precipitation data for three regions (snowy area, tropical, desert)\n   - Students create a Venn diagram comparing winter weather in two different regions\n   - Ask: \"Why do you think some places have snow and others don't? What makes a place cold in winter?\"\n\n---\n\n## Extension Activities\n\n1. **Winter Weather Journal (1-2 weeks):**\n   - Students observe the weather outside each day and record what they see in a simple journal\n   - Draw or write: temperature (hot/cold/warm), precipitation (snow/rain/none), what animals might be doing\n   - At the end of the week, create a class bar graph showing how many snowy days, rainy days, and clear days occurred\n   - **Connection to 3-ESS2-1:** This is direct data collection and graphing of typical seasonal weather\n\n2. **Design a Winter Wagon Cover (Real-World Application):**\n   - Revisit the photograph and discuss: \"How could we protect this wagon from snow and ice in winter?\"\n   - Students design a simple cover using their knowledge of materials from the Explore activity\n   - Sketch or build a prototype using paper, plastic, or cloth\n   - Test it with ice/snow on a small model wagon\n   - **Connection to 3-ESS3-1:** This touches on designing solutions to weather-related impacts\n\n3. **Winter Around the World Photo Gallery Walk:**\n   - Collect 6-8 photographs of winter scenes from different regions (snowy city, arctic animals, ski resort, frozen lake, winter in Japan, etc.)\n   - Create a gallery around the classroom with each photo labeled with the region\n   - Students do a \"gallery walk\" with clipboards and observe how winter looks in different places\n   - Complete a simple checklist: Does this winter have snow? Is it near mountains/water? What can you see?\n   - Discuss as a class: \"Winter looks different in different places. Why?\"\n   - **Connection to 3-ESS2-2:** Directly addresses combining information about weather and climates in different regions\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing:** If your region doesn't have winter snow/ice, adapt by using ice from freezers or discussing winter in other parts of the world throughout the lesson\n- **Safety:** Supervise warm water use during ice experiments; ensure hands are dry before testing frozen materials\n- **Photography:** Consider taking photos of your class doing the Explore activity to display alongside the lesson image; students love seeing themselves as \"weather scientists\"\n- **Classroom display:** Keep the winter photograph and class data tables posted throughout the unit as reference for future lessons on weather and seasons\n\n---\n\n**This lesson provides a strong foundation for 3rd grade Earth and Space Science standards while maintaining student engagement through direct observation, hands-on exploration, and real-world connections to the winter photograph.**",
  "inputTokens": 2881,
  "outputTokens": 3902,
  "cost": 0.022391000000000005,
  "generatedAt": "2026-02-12T21:51:38.328Z"
}