{
  "title": "Seasons",
  "category": "earth-space-science",
  "imageFile": "100_1680.jpeg",
  "imagePath": "images/earth-space-science/100_1680.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Winter Weather Observations\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Seasonal weather patterns and snow formation:** The photograph shows snow accumulation on trees and landscape during winter, demonstrating how water freezes and falls as snow during cold seasons.\n- **Daylight and seasons:** The bright, clear winter sky and low sun angle indicate shorter daylight hours characteristic of winter months.\n- **Earth's tilt and seasonal changes:** The bare deciduous trees (which lose leaves) contrasted with snow-covered evergreens demonstrates how organisms and landscapes change with seasons and available sunlight.\n- **Water in different forms:** Snow, ice, and the frozen lake visible in the background represent water in solid form, connecting to the water cycle and temperature effects.\n\n---\n\n## Lesson Title\n\n**Snowy Discoveries: How Weather Changes Our World**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 75-90 minutes (can be split into two 45-minute sessions)\n- **NGSS Standards:** \n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n  - (Science & Engineering Practice: Planning and Carrying Out Investigations; Crosscutting Concept: Patterns)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how winter weather (snow and cold) changes what they see in nature.\n2. Compare what plants and trees look like during winter versus other seasons.\n3. Explain that snow is frozen water that falls from the sky during cold weather.\n4. Predict how daylight and temperature change from season to season.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about winter weather using the photograph.\n\n**Materials:**\n- Printed copy of the photograph (or display on screen/smartboard)\n- Chart paper and markers\n- Optional: small samples of real snow in a container (if available in your region)\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it on a screen. Ask students to sit in a circle where they can all see clearly.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you notice is covering the trees and ground in this picture?\" (Listen for: snow, white stuff, ice)\n   - \"Have you seen snow like this before? When?\" (Activate prior experience)\n   - \"Why do you think the evergreen tree on the left still has its needles, but the tree in the middle has no leaves?\" (Introduce the idea that trees change)\n   - \"Look at the sun in the sky — does it seem very bright and hot, or not as bright? How does that make you feel?\" (Connect to daylight and temperature)\n\n3. **Prediction prompt:** \n   - \"If we could visit this exact spot in the summer, what do you think would be different? Turn and tell your partner what you think.\"\n   - Chart student responses on paper (accept all ideas without judgment).\n\n4. **Validation statement:** \"Great thinking! Today, we're going to be nature detectives and discover how winter weather changes the plants, trees, and even the light we see outside.\"\n\n**Transition:** \"Now let's explore winter weather changes by doing our own investigations!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate seasonal patterns through observation and hands-on discovery.\n\n**Materials:**\n- Pictures or samples of tree branches (real branches if possible, or printed images)\n- Chart showing the four seasons with images\n- Small containers of ice cubes or snow (if available)\n- Magnifying glasses (optional, one per 2-3 students)\n- Paper and crayons for recording observations\n- Outdoor access (if weather/time permits) OR photos of winter, spring, and summer landscapes\n\n**Activity:**\n\n**Part 1: Tree Observation Station (10-12 minutes)**\n\n1. **If outdoors:** Take students on a short 5-minute walk outside to observe real trees. If indoors (or cold/unsafe), use printed photos or show the lesson photograph again.\n\n2. **Provide step-by-step directions:**\n   - \"Look carefully at a tree or tree picture. Does it have leaves? Does it have snow on its branches?\"\n   - \"Use your magnifying glass (if available) to look very closely. What do you see?\"\n   - \"Touch or look at a branch. Is it smooth? Bumpy? Cold?\"\n   - \"Draw what you observe on your paper. Color it to match what you see.\"\n\n3. **Recording:** Students sketch the tree they observe and label whether they see snow, leaves, or bare branches.\n\n**Part 2: Water States Discovery (8-10 minutes)**\n\n1. **If you have ice or snow samples:** Show students the frozen water.\n   - \"This is frozen water. It comes from the sky when it's very, very cold.\"\n   - Allow students to touch it (briefly). Ask: \"Is it hard? Is it cold? Does it feel like the water from the sink?\"\n\n2. **If no samples available:** Use the photograph and discuss:\n   - \"See how white and hard the snow looks? That's frozen water.\"\n   - Display a cup of water alongside a picture of snow: \"This water (liquid) can turn into snow (ice/solid) when it gets cold enough.\"\n\n3. **Recording:** Students draw the ice/snow and write or dictate: \"Snow is frozen water.\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What do you notice? Why do you think the tree looks this way? What would happen if the snow melted?\"\n- Resist providing answers; instead, encourage students to observe and wonder.\n- Take notes on student observations for the Explain phase.\n\n**Expected Student Outcomes:**\n- Students observe that winter trees may have no leaves or snow on them.\n- Students recognize that snow is frozen water.\n- Students produce drawings or descriptions of winter characteristics.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student observations to Earth and Space Science concepts.\n\n**Materials:**\n- Chart paper and markers\n- Seasonal comparison chart (images of same location in winter, spring, summer, fall)\n- \"Winter Word Wall\" poster (pre-made or created together)\n- The original photograph\n- Picture of sun at different heights in sky (for reference)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - \"Who wants to share what they drew? What did you notice about the trees?\" \n   - Display 2-3 student drawings on the board.\n   - \"I see you noticed snow! I see you noticed no leaves! Great observations!\"\n\n2. **Introduce key vocabulary with demonstrations (8 minutes):**\n\n   - **Snow:** \"Snow is frozen water that falls from clouds when the weather is very cold. It's solid, not liquid.\" (Show photo and point to snow)\n   \n   - **Winter:** \"Winter is the coldest season. It happens at the same time every year. When it's winter where you live, it's very cold and sometimes snows.\" (Show calendar month)\n   \n   - **Season:** \"A season is a time of year with its own special weather and patterns. There are four seasons: winter, spring, summer, and fall.\" (Show seasonal chart)\n   \n   - **Daylight:** \"Daylight is when the sun is in the sky and it's bright outside. In winter, we have less daylight and more darkness.\" (Compare sun position in photo to summer sun position)\n   \n   - **Temperature:** \"Temperature tells us how hot or cold something is. Winter has a low temperature — it's very cold.\" (Use thermometer or point to winter/summer comparison)\n\n3. **Connection back to the photograph (4 minutes):**\n   - \"Remember this picture? Let's name what we see now that we know new words.\"\n   - Point to elements: \"We see snow on the trees. Snow is frozen water. The sun is low in the sky because it's winter, so we don't have as much daylight. The trees have lost their leaves because it's cold.\"\n\n4. **Check for understanding (2-3 minutes):**\n   - Quick questions: \n     - \"Is snow frozen water? Yes/no, show me with thumbs up/down.\"\n     - \"Is winter hot or cold?\" (Cold responses)\n     - \"Do we have more or less daylight in winter?\" (Less)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Snow** | Frozen water that falls from the sky when it's very cold. |\n| **Winter** | The coldest season of the year when snow often falls. |\n| **Season** | A time of year with special weather. There are four seasons. |\n| **Daylight** | The bright time of day when the sun is in the sky. |\n| **Frozen** | So cold that water turns hard like ice. |\n\n**Expected Student Outcomes:**\n- Students can identify snow as frozen water.\n- Students understand that winter is a cold season with less daylight.\n- Students recognize seasonal patterns in trees and weather.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding of seasonal patterns and daylight changes to new contexts.\n\n**Materials:**\n- Four seasonal scene pictures (winter, spring, summer, fall) — same location if possible\n- Sorting cards or pictures of winter vs. summer items\n- Chart paper: \"What We Do in Winter vs. Summer\"\n- Student journals or paper\n- Crayons/markers\n- Optional: photos of students' own community in winter from past years\n\n**Activity:**\n\n**Part 1: Seasonal Comparison (8-10 minutes)**\n\n1. **Display four pictures** of the same landscape in each season (or use four different winter/spring/summer/fall scenes).\n\n2. **Direct students:**\n   - \"Look at these four pictures. Which one shows winter? How do you know?\"\n   - \"What changed from winter to summer? Point to something different.\"\n   - Students walk to the winter picture and stand by it.\n\n3. **Guide thinking:**\n   - \"In summer, trees have leaves and there's no snow. In winter, there's snow and trees are bare.\"\n   - \"The sun is higher in the sky in summer, so we have more daylight. The sun is lower in winter, so we have less daylight.\"\n\n**Part 2: Real-World Application (7-10 minutes)**\n\n1. **Introduce the scenario:** \n   - \"Imagine you're visiting your grandma in a different place, and she asks you: 'Is it the same season here as where you live?' How would you know? What would you look for?\"\n\n2. **Student activity — \"Winter Detective\":**\n   - Show students 3-4 photos of outdoor scenes (one must clearly be winter, others mixed).\n   - Students point to or mark the winter picture: \"How did you know? What did you see?\"\n   - Listen for answers: snow, cold, bare trees, bright sun low in sky.\n\n3. **Creation task:**\n   - \"Draw a picture of what you might see outside if you looked right now. Is there snow? Are the trees bare? Is the sun high or low?\"\n   - Students sketch and label with invented spelling or teacher scribe: \"winter,\" \"snow,\" \"cold,\" \"no leaves.\"\n\n**Teacher Role:**\n- Ask guiding questions rather than telling: \"What tells you it's winter?\" \"Where is the sun?\"\n- Affirm all attempts and observations.\n- Help students make explicit connections: \"You said the trees have no leaves — that's because it's winter and it's cold!\"\n\n**Expected Student Outcomes:**\n- Students can distinguish winter from other seasons using visual cues.\n- Students apply understanding of daylight and temperature to new situations.\n- Students produce drawings and descriptions showing understanding of winter characteristics.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of seasonal patterns, snow as frozen water, and winter daylight changes.\n\n**Formative Assessment (Throughout Lesson):**\n- Observation during Explore: Do students notice snow and trees? Do they attempt to describe what they see?\n- Discussion responses during Explain: Can students identify snow as frozen water? Do they connect winter to cold and less daylight?\n- Categorization during Elaborate: Can students distinguish winter from other seasons using multiple clues?\n\n**Summative Exit Ticket (5-7 minutes at end of lesson):**\n\n**Option 1 (Picture-Based — Best for All First Graders):**\nShow the original photograph again. Ask:\n1. **\"Point to the snow. Is snow frozen water? Yes or no?\"**\n   - (Correct answer: Yes; point to white areas)\n\n2. **\"Is it summer or winter in this picture? How do you know? Tell me or draw it.\"**\n   - (Correct answer: Winter; evidence might include: snow, bare trees, low sun)\n\n3. **\"In winter, do we have more daylight or less daylight than summer?\"**\n   - (Correct answer: Less daylight)\n\n**Option 2 (Verbal Interview — for students needing oral assessment):**\nAsk individually:\n- \"What is snow made of?\" (Listen for: water, frozen water)\n- \"How do you know it's winter in this picture?\" (Listen for: snow, cold, bare trees, less sun)\n- \"When it's winter, is it light outside longer or shorter than in summer?\" (Listen for: shorter, less time)\n\n**Success Criteria — Students Demonstrate Understanding If They:**\n- Identify snow in the photograph\n- Recognize that snow is frozen water\n- Name at least one characteristic of winter (cold, snow, bare trees, less daylight)\n- Use seasonal vocabulary appropriately (snow, winter, season, frozen, daylight)\n\n**Expected Student Outcomes:**\n- 80% of students correctly identify snow as frozen water.\n- Most students (70%+) can name at least one winter characteristic.\n- Students use new vocabulary (snow, winter, season) in responses and drawings.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary:** Focus on just \"snow,\" \"winter,\" and \"cold\" rather than all five vocabulary terms. Revisit other terms in subsequent lessons.\n\n2. **Concrete manipulatives:** Provide real snow or ice to touch and explore multiple times. Allow extended sensory exploration before moving to abstract discussion.\n\n3. **Visual supports:** Use the seasonal chart repeatedly throughout the lesson. Point to pictures rather than relying solely on verbal descriptions. Provide simplified picture cards for exit ticket (just two options: winter or summer).\n\n4. **Sentence stems for sharing:** Provide frames: \"I see ___.\" \"The tree has ___.\" \"Snow is ___.\" This scaffolds participation during discussions.\n\n5. **Buddy system:** Pair with a peer during Explore and Elaborate phases to support observation and recording.\n\n### Challenge (for advanced learners):\n\n1. **Predict and explain:** Ask, \"If you came back to this exact spot in three months, what would you see? Why?\" Push for reasoning about seasonal transitions.\n\n2. **Multiple factors:** Ask students to identify multiple winter clues simultaneously: \"What's different about the sun, the trees, AND the water in this winter picture compared to summer?\"\n\n3. **Research extension:** Provide a reference chart and ask: \"How many hours of daylight does our town have in December? How many in June?\" Have students compare numbers (if developmentally appropriate).\n\n4. **Creative writing/dictation:** Ask, \"If a tree could talk, what would it say about winter? Why does it lose its leaves?\"\n\n5. **Regional variation:** If your area doesn't get snow, compare your winter weather to this snowy winter. Ask, \"How is winter where you live different from this picture? How is it the same?\"\n\n---\n\n## Extension Activities\n\n1. **\"Winter in Four Weeks\" Observation Journal:**\n   - Assign students to observe the same outdoor spot (their yard, school grounds, local park) once a week for 4 weeks.\n   - Each week, they draw and describe what they see: Is there more or less snow? How much daylight? Are trees changing?\n   - This extends understanding of seasonal change over time and deepens observation skills. Can be done as a class project with photos taken by the teacher.\n\n2. **Explore Other Winter Animals and Plant Adaptations:**\n   - Read a book like *Animals in Winter* by Henrietta Bancroft or *Over and Under the Snow* by Kate Messner.\n   - Discuss: \"What do animals do in winter? Why do some animals go to sleep? How do trees survive the cold?\"\n   - Students create a \"Winter Animal Adaptation\" chart or poster showing one animal and how it survives winter.\n\n3. **Water States Experiment Station:**\n   - Set up a simple station with ice cubes, water, and heat (sun in window or warm location).\n   - Over several days, students observe: What happens to the ice? Does it melt? What do we call melted ice? (Water)\n   - This concretely demonstrates the water cycle connection and reinforces that snow/ice is frozen water that can change back to liquid.\n\n---\n\n## Notes for the Teacher\n\n- **If your region doesn't get snow:** Adapt by showing videos or photos of snowy landscapes. Discuss how weather and daylight change in your region's winter (even if no snow). Focus on the daylight observation (1-ESS1-2) which is universal.\n- **Connection to daylight standard:** This lesson emphasizes the 1-ESS1-2 standard by having students observe the low sun position in the winter photograph and explicitly compare winter daylight to summer daylight multiple times.\n- **Safety reminder:** If taking students outdoors in winter, follow all weather and safety protocols. Ensure adequate supervision and appropriate clothing.\n- **Prior knowledge consideration:** Some First Graders may have limited experience with snow (especially in warm climates). Respectfully honor all prior knowledge and build from there.",
  "inputTokens": 2850,
  "outputTokens": 4175,
  "cost": 0.023725000000000003,
  "generatedAt": "2026-02-12T21:50:06.186Z"
}