{
  "title": "Seasons",
  "category": "earth-space-science",
  "imageFile": "100_1680.jpeg",
  "imagePath": "images/earth-space-science/100_1680.jpeg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Winter Weather and Snow\n\n## Core Science Concepts from Image Analysis\n\n- **Water and the water cycle:** Snow is frozen water that falls from the sky; it can melt and evaporate in warmer conditions (observable as snow on trees, ground, and objects).\n- **Weather patterns and seasons:** Winter brings cold temperatures and precipitation in the form of snow; weather changes how the environment looks and feels.\n- **Effects of temperature on materials:** Cold temperatures cause water to freeze into snow and ice; snow accumulates on surfaces and objects in winter.\n- **Human adaptation to weather:** People prepare structures and objects (like the wagon shown) for winter weather by storing or covering them; humans and animals change their environment to meet their needs during different seasons.\n\n---\n\n## Lesson Title\n\n**Snow Blanket: Exploring Winter Weather and Cold**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 75–90 minutes (can be split into two sessions of 40–45 minutes each)\n- **NGSS Standards:** \n  - K-ESS2-1: Use and share observations of local weather conditions to describe patterns over time.\n  - K-ESS2-2: Construct an argument supported by evidence for how plants and animals (including humans) can change the environment to meet their needs.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe what snow looks like and how it covers things in winter.\n2. Explain that cold weather makes water freeze into snow.\n3. Identify ways that people prepare for cold winter weather.\n4. Use words like \"cold,\" \"frozen,\" \"snow,\" and \"winter\" to talk about the season shown in the photograph.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Spark curiosity about winter weather and snow by exploring the photograph together.\n\n**Materials:**\n- Printed photograph (large format on poster board or displayed via projector)\n- Chart paper\n- Markers (various colors)\n\n**Activity:**\n\n1. **Display the photograph** prominently so all students can see it clearly. Ask students to sit in a semicircle facing the image.\n\n2. **Pose opening questions** to activate prior knowledge and observation:\n   - \"What do you see covering the trees, the wagon, and the ground in this picture?\"\n   - \"How do you think this white stuff feels? Is it hot or cold?\"\n   - \"Have you ever seen snow? What did it feel like when you touched it?\"\n   - \"Why do you think the wagon is covered with snow? Where did the snow come from?\"\n\n3. **Encourage predictions and wonder:**\n   - Say: \"I wonder why some things have more snow on them than others. What do you think?\" (Point to the evergreen tree with heavy snow versus the bare tree.)\n   - \"If we left a glass of water outside on a very cold day like the one in this picture, what might happen to it?\"\n\n4. **Capture student responses** on chart paper (use pictures and words). Validate all responses without correcting.\n\n**Transition:** \"Great questions! Now we're going to do an activity to learn more about what happens when it gets really, really cold—just like in this winter picture.\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students discover through hands-on investigation how water freezes when it gets very cold.\n\n**Materials:**\n- Ice cubes (prepared ahead; approximately 10–12 per pair of students)\n- Small clear plastic cups (one per student)\n- Warm water in a pitcher (approximately 70–80°F)\n- Paper towels\n- Aprons or old shirts (to protect clothing)\n- Optional: salt, food coloring, small twigs or leaves\n\n**Activity:**\n\n**Part 1: Observing Ice and Cold (12 minutes)**\n\n1. **Organize students into pairs.** Give each pair 2–3 ice cubes and a paper towel.\n\n2. **Provide exploration directions:**\n   - \"Touch the ice cube carefully. How does it feel? Is it cold? Is it hard or soft?\"\n   - \"Look very closely at the ice. What do you see? Can you see through it?\"\n   - \"Try to squeeze it. Can you break it? Can you bend it?\"\n   - \"Now rub it on the paper towel. What happens?\"\n\n3. **Circulate and ask questions without giving answers:**\n   - \"What did you notice when you touched the ice?\"\n   - \"How is ice different from the water we drink?\"\n   - \"Where do you think this ice came from?\"\n\n4. **Students record observations** by drawing what the ice looks like on a worksheet or in a science journal (simple sketches are appropriate for Kindergarten).\n\n**Part 2: Freezing Water Demonstration (10 minutes)**\n\n1. **Gather students around a table or demonstration area.** Show them a clear cup of warm water.\n\n2. **Say:** \"This is warm water. It feels like the water from the sink, right?\" Let students carefully feel the outside of the cup (not the water itself).\n\n3. **Introduce the concept:** \"In winter, when it gets very cold outside—as cold as in that snowy picture—water turns into ice. Watch what happens.\"\n\n4. **Show pre-prepared ice cubes again.** Explain: \"This water became ice because it was so cold outside. Cold made it freeze hard.\"\n\n5. **Ask:** \"If we put this warm water outside in the freezing cold, what do you think would happen? Would it stay like water, or would it turn into ice like these cubes?\"\n\n6. **Optional extension:** Add a small drop of food coloring to a cup of water and show how it moves and mixes (unlike how it would move in ice). This helps illustrate the difference between liquid water and frozen water.\n\n**Teacher Role:**\n- Guide exploration without explaining; let students discover properties through touch and observation.\n- Ask open-ended questions: \"What did you find?\" \"How did that feel?\" \"What changed?\"\n- Ensure safe handling (no ice in mouths; hands dried immediately if wet).\n\n**Expected Student Outcomes:**\n- Students will recognize that ice is cold and hard.\n- Students will understand that ice is frozen water.\n- Students will make a connection between cold temperatures and freezing.\n\n---\n\n### 3. EXPLAIN (17 minutes)\n\n**Objective:** Introduce key vocabulary and formalize understanding of snow, ice, and cold weather.\n\n**Materials:**\n- Chart paper and markers\n- Photograph (displayed again)\n- Vocabulary word cards with pictures (prepared ahead)\n- Real ice cubes and a sample of snow (if available and fresh)\n\n**Activity:**\n\n1. **Gather students on the carpet.** Display the photograph again.\n\n2. **Group Share-Out (5 minutes):**\n   - Ask: \"What did you discover when you played with the ice cubes?\"\n   - Invite 3–4 students to share (e.g., \"It was cold.\" \"It was hard.\" \"It melted on my hand.\").\n   - Affirm their observations and record key words on chart paper.\n\n3. **Introduce Key Vocabulary (10 minutes):**\n\n   Present each term using the photograph and ice cubes as references:\n\n   - **Snow:** \"The white fluffy stuff that falls from the sky when it's very, very cold. Look at the trees and ground in this picture—they are covered with snow.\"\n   \n   - **Ice:** \"Water that froze because it got so cold. The ice cubes you touched are frozen water—just like the frozen water that makes snow.\"\n   \n   - **Cold/Freezing:** \"A very low temperature when it's winter. When it's this cold, water turns from a liquid into ice or snow.\"\n   \n   - **Winter:** \"The coldest season of the year. In winter, snow falls and covers the ground and trees.\"\n   \n   - **Freeze:** \"When something cold turns hard. Water freezes when the temperature drops very low.\"\n\n4. **Check for Understanding (2 minutes):**\n   - Point to different parts of the photograph: \"Is this snow or is this a tree?\" (Students answer.)\n   - Hold up an ice cube: \"Is this water or is this ice? How do you know?\" (Students respond.)\n   - Ask: \"What season do we see in this picture? How do you know it's winter?\"\n\n**Vocabulary Chart:**\nDisplay a simple chart with pictures and words in the classroom for future reference:\n\n| Word | Kindergarten Definition |\n|------|---------|\n| **Snow** | White, cold, frozen water that falls from the sky |\n| **Ice** | Frozen water that is hard and cold |\n| **Cold** | A very low temperature that makes you shiver |\n| **Winter** | The coldest season with snow and ice |\n| **Freeze** | When liquid water turns hard and cold |\n\n**Expected Student Outcomes:**\n- Students will use the term \"snow\" and \"ice\" to describe what they see in the photograph.\n- Students will understand that snow is frozen water.\n- Students will connect cold temperatures to freezing and winter.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Apply understanding of winter weather to real-world contexts; explore how humans and objects adapt to winter.\n\n**Materials:**\n- Art supplies: construction paper, cotton balls, glue, markers\n- Picture cards of winter clothing (hats, mittens, scarves, coats) and winter objects (sleds, snow shovels, snowplows)\n- Optional: toy wagon or model wagon (to connect to the photograph)\n- Sentence frames written on chart paper: \"In winter, people wear ___.\" \"In winter, we use ___ to help us.\"\n\n**Activity:**\n\n**Part 1: Winter Clothing and Preparation (9 minutes)**\n\n1. **Ask students:** \"Look at the picture again. Why do you think snow covers everything? How does snow make us feel? Is it comfortable?\"\n\n2. **Introduce the concept:** \"When it's cold and snowy like in this picture, people have to get ready. We wear special clothes and use special things to stay warm and safe.\"\n\n3. **Show picture cards** of winter clothing and objects. Pass them around or display them on the board.\n   - Mittens, hats, scarves, boots (Keep hands and feet warm!)\n   - Snow shovels (To clear pathways)\n   - Sleds (For winter fun and transport)\n   - Blankets and covers for wagons (Like in our picture!)\n\n4. **Facilitate discussion:**\n   - \"Why do we wear mittens in winter?\" (To keep our hands warm and from freezing.)\n   - \"Why is that wagon covered in snow? Could someone use it in this weather? What do we do with it?\" (Store it, cover it, wait for spring.)\n\n**Part 2: Winter Weather Preparation Art Activity (9 minutes)**\n\n1. **Distribute art supplies** and a half-sheet of white construction paper to each student.\n\n2. **Give directions:** \"We're going to make a winter scene just like the one in our photograph. You will show snow falling or covering something.\"\n\n3. **Students create:**\n   - Glue cotton balls onto paper to represent snow.\n   - Draw a simple tree, house, or object underneath.\n   - Use markers to add details (sun, ground, etc.).\n\n4. **As students work, ask guiding questions:**\n   - \"What does your snow cover?\"\n   - \"How much snow do you think would fall in a winter like the one in our picture?\"\n   - \"Is it cold where your snow is falling?\"\n\n**Teacher Role:**\n- Circulate and ask students to explain their winter scene.\n- Prompt thinking: \"Tell me about the snow in your picture. Why is it there?\"\n- Ensure all students engage with art materials; assist as needed with fine motor skills.\n\n**Expected Student Outcomes:**\n- Students will identify ways people prepare for winter weather.\n- Students will create a representation of a snowy winter scene.\n- Students will explain connections between cold weather and how humans adapt (clothing, storage, preparation).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of winter weather, snow, ice, and cold temperatures.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation during Explore:** Did students successfully identify and describe properties of ice (cold, hard, clear)?\n- **Questioning during Explain:** Can students use \"snow,\" \"ice,\" and \"cold\" in context?\n- **Artwork in Elaborate:** Do students' winter scenes show understanding that snow covers objects and falls from the sky?\n\n**Exit Ticket / Summative Assessment (5 minutes):**\n\nGather students and ask them to respond to the following (accept verbal responses, drawings, or a combination):\n\n1. **\"Show me with your hands how cold and frozen ice would feel. Brrr!\"** \n   - **Success Criteria:** Student demonstrates a shivering or cold response; indicates understanding of cold.\n\n2. **\"Point to something in our classroom that is cold, like ice or snow.\"** (Note: Accept logical answers; if nothing is available, accept verbal descriptions.)\n   - **Success Criteria:** Student identifies a cold object or describes one accurately.\n\n3. **\"Tell me: What is snow? How is snow made?\"** (Simplified for Kindergarten: \"Where does snow come from?\")\n   - **Success Criteria:** Student provides a response indicating snow is cold, white, falls from the sky, or is frozen water. (Any one of these is acceptable.)\n\n4. **\"In our picture, why do you think the wagon is covered with snow? What does the cold do?\"**\n   - **Success Criteria:** Student indicates snow falls and covers things, or that cold weather brings snow.\n\n**Assessment Recording:**\n- Create a simple checklist with student names and objectives (e.g., ✓ = met, ◐ = developing, ✗ = not yet).\n- Use student artwork and verbal responses as evidence of learning.\n\n**Expected Student Outcomes:**\n- 80% of students will correctly identify snow as cold and frozen.\n- Most students will explain that snow falls from the sky and covers things.\n- Students will use vocabulary: \"snow,\" \"ice,\" \"cold,\" and \"winter.\"\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary:** Use only \"snow,\" \"cold,\" and \"winter\" with struggling students; introduce additional terms as they show readiness. Pair terms with consistent gestures (shivering for cold, falling motion for snow).\n\n2. **Hands-on ice exploration:** Extend the Explore phase for students who need more sensory input. Provide ice cubes in zippered bags (sealed, for safety) so students can manipulate them without direct melting and mess. Ask only one observation question at a time.\n\n3. **Picture supports during Elaborate:** Provide a template outline (simple tree or wagon shape) for students to complete rather than creating from scratch. Pre-glue some cotton balls to demonstrate the concept.\n\n### Challenge (for advanced learners):\n\n1. **Cause-and-effect exploration:** Ask advanced students deeper questions during ice exploration: \"Why does ice feel cold? Where did this water come from before it froze? What will happen to the ice if we leave it in the warm classroom?\" Guide them to hypothesize about melting.\n\n2. **Winter adaptation research:** Have advanced students sort picture cards of winter objects into categories: \"Things we wear,\" \"Things we use,\" \"Things we put away.\" Discuss reasons for each category.\n\n3. **Water cycle introduction:** Show students a simple diagram of the water cycle and discuss: \"Water falls as snow, then the sun warms it and it melts, then it goes back up into the sky.\" Use the photograph to point out where snow comes from and where it goes.\n\n---\n\n## Extension Activities\n\n1. **Winter Weather Journal:** Over two weeks, have students draw and describe the weather each day (snowy, cold, sunny, windy). Create a class chart showing which weather happened most. Connects to K-ESS2-1 (observing patterns over time).\n\n2. **Freeze Exploration Lab:** Provide small containers of water and salt mixed together (a homemade ice pack). Have students predict, observe, and describe what happens when salt meets ice. Does the ice melt faster? Why? This extends understanding of how temperature affects water.\n\n3. **Winter Animal Hunt:** Take students on a nature walk or show photographs of winter animals (squirrels, birds, deer). Discuss: \"How do animals stay warm in winter? What do they eat? Where do they sleep?\" This connects to K-ESS3-1 (how animals meet their needs in different environments).\n\n4. **Melting Ice Investigation:** Leave ice cubes in different classroom locations (sunny window, shaded corner, warm radiator, cold floor). Check them throughout the day. Which melted first? Why? This deepens understanding of temperature and states of matter.\n\n5. **Winter Clothing Scavenger Hunt:** Create a classroom display with winter clothing (borrowed from home or from dramatic play area). Have students match clothing to body parts and discuss which parts get cold first in winter.\n\n---\n\n## Teacher Notes\n\n- **Safety:** Ensure ice exploration is supervised. Dry hands immediately after touching ice to prevent discomfort. Do not allow ice in mouths.\n- **Timing:** This lesson can be taught as two 40–45–minute sessions (Engage & Explore on Day 1; Explain, Elaborate & Evaluate on Day 2) or as a continuous 90-minute block.\n- **Prior Knowledge:** This lesson works best if students have experienced cold weather or have seen snow. If not, build on their imaginations and the photograph.\n- **Vocabulary:** Keep language simple and repetitive. Use the photograph and real objects (ice cubes, cotton balls) as concrete references for abstract concepts.\n- **Connection to Standards:** This lesson emphasizes K-ESS2-1 through observation and K-ESS2-2 through discussion of how humans adapt to winter weather.",
  "inputTokens": 2964,
  "outputTokens": 4159,
  "cost": 0.023759000000000002,
  "generatedAt": "2026-02-12T21:49:22.933Z"
}