{
  "title": "Seasons",
  "category": "earth-space-science",
  "imageFile": "100_1680.jpeg",
  "imagePath": "images/earth-space-science/100_1680.jpeg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Winter Wonders—Snow, Seasons, and Change\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Water's Solid State:** Snow accumulates on objects and land, demonstrating that water can exist as a solid (2-ESS2-3)\n- **Seasonal Weather Changes:** The image shows winter conditions that change landscapes and the appearance of vegetation and structures over time (2-ESS1-1)\n- **How Ice and Snow Cover the Land:** The frozen lake and snow-covered ground illustrate different landforms and bodies of water in winter (2-ESS2-2)\n- **Evidence of Change Over Time:** The contrast between evergreen trees (holding snow) and deciduous trees (bare branches) shows how seasons transform Earth's appearance (2-ESS1-1)\n\n---\n\n## Lesson Title\n\n**Snow Blankets Earth: Exploring Water as Frozen Solids**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (80 minutes total)\n- **NGSS Standards:** \n  - 2-ESS2-3: Obtain information to identify where water is found on Earth and that it can be solid or liquid\n  - 2-ESS1-1: Use information from several sources to provide evidence that Earth events can occur quickly or slowly\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify water in its solid form (ice and snow) in the photograph and in their local environment\n2. Explain that snow and ice are frozen water that covers land and water during winter\n3. Compare how different objects and plants look when covered with snow versus without snow\n4. Describe how winter weather changes the appearance of the land and bodies of water over time\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Spark curiosity about winter, snow, and frozen water using the photograph.\n\n**Materials:**\n- Large photograph printed in color (or displayed on interactive board)\n- Chart paper and markers\n- Optional: real snow samples in a container (if available in your region)\n\n**Activity:**\n\n1. **Display and Direct Observation (5 minutes):**\n   - Show the photograph on the board. Say: \"Today we're going on a winter adventure! Look carefully at this picture. What do you notice?\"\n   - Allow students 30 seconds of silent looking before asking questions.\n\n2. **Guided Discussion (7 minutes):**\n   Ask these specific questions to prompt thinking:\n   - \"What white stuff do you see covering the trees and the ground?\" (Expected: snow, ice)\n   - \"Have you ever seen snow? What did it feel like? Was it cold or warm?\" (Activate prior experience)\n   - \"Look at the trees on the left side with all the snow on them, and the trees on the right with no snow. Why do you think some trees have more snow than others?\" (Prompt observation of evergreen vs. deciduous)\n   - \"This looks very different from summer! What might this land look like without all the snow?\" (Encourage predictions about change)\n\n3. **Wonder Prompt:**\n   - Say: \"I wonder... where does all this snow come from? Is it the same thing as water from our drinking fountain or a puddle?\" \n   - Invite students to share their wonderings on chart paper: \"Our Winter Wonders\"\n\n**Transition:** \"Great questions! Today we're going to explore snow and ice—and discover that they're actually water that froze! Let's investigate.\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate the properties of frozen and liquid water through hands-on exploration.\n\n**Materials:**\n- Ice cubes (prepared in advance, 2-3 per student)\n- Small plastic cups filled with liquid water at room temperature (1 per student)\n- Paper towels\n- Shallow trays or cookie sheets (to catch water)\n- Hand lenses (optional, 1 per pair)\n- Thermometers (optional, 1 per group)\n- Observation sheets (prepared template with labeled illustrations of ice and water)\n\n**Activity - Station-Based Investigation:**\n\n**Setup:** Arrange 4 stations around the room, each investigating one property. Divide class into 4 groups and rotate every 5-6 minutes.\n\n**Station 1: Touch and Observe Ice**\n- Student Directions: \n  - \"Pick up an ice cube carefully. Feel it. Is it cold?\"\n  - \"Look closely at it. Does it look like water? What color is it?\"\n  - \"Try to bend it. Can you break it? What happens?\"\n  - \"Use the hand lens. Can you see anything special about the ice?\"\n- Recording: Students draw ice on their observation sheet and write one word to describe how it feels (e.g., cold, hard, smooth)\n\n**Station 2: Compare Ice and Liquid Water**\n- Student Directions:\n  - \"Put your ice cube in the cup of water. What happens? Does the ice sink or float?\"\n  - \"Watch for 2 minutes. Is the ice changing? What do you observe?\"\n  - \"Feel the water around the ice. Is it cold?\"\n- Recording: Students draw what happened and circle whether the ice sank or floated\n\n**Station 3: Melting Ice Over Time**\n- Student Directions:\n  - \"Place your ice cube on the tray. What do you see?\"\n  - \"Wait 3 minutes. Look again. Has it changed?\"\n  - \"Touch the water that came from the ice. What is it? Is it the same as the ice?\"\n- Recording: Students draw the ice cube and then the puddle it made; write \"ice melted into water\"\n\n**Station 4: Ice Cube Inspection** (if thermometers available)\n- Student Directions:\n  - \"Put a thermometer in the cup with ice. Watch the number. Is it going up or down?\"\n  - \"Ice is very cold. Water from ice is colder than regular water.\"\n- Recording: Students record the temperature if able, or draw the thermometer\n\n**Teacher Role:**\n- Circulate to each station; ask open-ended questions rather than confirm answers: \"What are you noticing? What changed? Why do you think that happened?\"\n- Prompt deeper observation: \"Compare your ice cube to the ice cube at that table. Are they the same?\"\n- Ensure students handle materials safely and gently\n\n**Expected Student Outcomes:**\n- Students discover that ice is cold, hard, and solid\n- Students observe that ice can melt and turn into liquid water\n- Students begin connecting frozen water (ice/snow) to regular water\n- Completed observation sheets showing understanding of ice and water\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and connect discoveries to the winter photograph.\n\n**Materials:**\n- Anchor chart paper and markers\n- Printed vocabulary cards with images (ice, snow, freeze, melt, solid, liquid)\n- The winter photograph displayed prominently\n- Students' completed observation sheets from Explore\n\n**Activity:**\n\n**Group Share-Out (6 minutes):**\n- Ask 4-5 students to share one thing they discovered at their station\n- Record findings on anchor chart: \"What We Learned About Ice\"\n- Listen for student language and gently introduce scientific terms\n\n**Teacher-Led Vocabulary Instruction (8 minutes):**\n\nIntroduce these 5 terms using the photograph and students' discoveries:\n\n1. **Solid** — \"Something that has a hard shape and doesn't change easily. Ice and snow are solids. So is a rock or a pencil.\"\n   - Point to ice in the photograph: \"See? The snow keeps its shape on the trees and ground.\"\n\n2. **Liquid** — \"Something that flows and moves. Water that's not frozen is a liquid. Juice and milk are liquids too.\"\n   - Show a cup of water: \"Watch how it moves when I tilt the cup.\"\n\n3. **Freeze** — \"When liquid water gets very, very cold and turns into ice or snow. That's freezing!\"\n   - Connection: \"In winter, the air gets so cold that water in lakes and puddles freezes into ice.\"\n\n4. **Melt** — \"When ice or snow gets warm and turns back into liquid water.\"\n   - Reference Explore: \"Remember when your ice cube started dripping? That was melting!\"\n\n5. **Snow** — \"Frozen water crystals that fall from the sky when it's very cold.\"\n   - Point to the photograph: \"All this white stuff on the ground and trees is snow—it's frozen water!\"\n\n**Check for Understanding (4 minutes):**\n- Ask students to match vocabulary to objects/pictures: \"Is a snowflake a solid or a liquid?\" \"What happens when snow melts?\"\n- Use thumbs-up/middle/down: students show understanding level without pressure\n- Ask: \"Where do you see snow in the photograph?\" (Tap photo to guide attention)\n\n**Vocabulary Anchor Chart:**\nDisplay a visual anchor chart with:\n- Picture of ice = SOLID (hard, cold water)\n- Picture of water = LIQUID (flows, moves)\n- Arrow from liquid to solid = FREEZE (gets very cold)\n- Arrow from solid to liquid = MELT (gets warm)\n- Picture of snow = FROZEN WATER (falls from sky in winter)\n\n**Expected Student Outcomes:**\n- Students use vocabulary: solid, liquid, ice, snow, freeze, melt in context\n- Students can point to examples in the photograph and label them correctly\n- Students understand that snow and ice are frozen water\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Apply understanding of frozen water to a new scenario and deepen thinking about seasonal change.\n\n**Materials:**\n- Four photocopied cards showing the same landscape in different seasons (winter/spring/summer/fall) OR use drawings\n- Picture of the snow-covered wagon from the original photograph\n- \"Wagon Through the Seasons\" worksheet (teacher-prepared)\n- Colored pencils or markers\n\n**Activity - Seasonal Transformation:**\n\n**Part 1: Predict and Draw (10 minutes)**\n\n1. Show students the winter wagon photograph again: \"This wagon is covered in snow and ice right now. But what will happen to all that snow?\"\n\n2. Ask: \"What season comes after winter?\" (Spring) \"What happens to the snow in spring?\"\n\n3. Ask students to predict: \"What will this wagon look like when spring comes? Will it still have snow? What will be different?\"\n\n4. **Independent Activity:** \n   - Give each student a worksheet with:\n     - Drawing of the snow-covered wagon (from photograph)\n     - Empty box below labeled \"Spring\" with the same wagon outline\n   - Directions: \"Draw what the wagon might look like in spring. Remember: snow melts when it gets warm. What will change?\"\n   - Students draw the wagon without snow, and may add green grass, melted water, or bare ground\n\n5. **Optional Collaborative Extension:**\n   - Display four seasonal images of a landscape side-by-side (winter, spring, summer, fall)\n   - Have students arrange pictures in order and discuss: \"Where is the frozen water (snow and ice)?\" \n   - Chart observations: Winter = lots of snow/ice; Spring = some melting; Summer = no snow; Fall = preparing for winter\n\n**Part 2: Class Discussion (8 minutes)**\n\n- Display student drawings\n- Ask: \"Why does the snow disappear? What happens to it?\" (It melts; it turns into water; it goes into the ground/lake)\n- Extend thinking: \"This takes time! Does snow melt all at once or slowly?\" (Prompt discussion of fast vs. slow change—connecting to 2-ESS1-1)\n- Make connection to photograph: \"The photograph shows winter right now. But Earth is always changing!\"\n\n**Teacher Role:**\n- Validate all predictions; guide thinking without saying \"wrong\"\n- Prompt reasoning: \"Tell me why you drew it that way. What made you think of that?\"\n- Record student thinking about seasonal change on anchor chart\n\n**Expected Student Outcomes:**\n- Students draw reasonable predictions of how the scene changes when frozen water melts\n- Students explain (verbally or in writing) that snow melts when it gets warm\n- Students recognize that Earth's appearance changes with seasons\n- Evidence of understanding the water cycle at an introductory level (water moves and changes state)\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of frozen water, states of matter, and seasonal change.\n\n**Formative Assessment During Lesson:**\n- Observation checklists at Explore stations (noting who observes ice melting, who makes connections to water)\n- Listening to student language in Explain phase (do they use vocabulary correctly?)\n- Reviewing Elaborate drawings for understanding of melting and seasonal change\n\n**Exit Ticket Activity (8 minutes):**\n\nGive each student a simple exit ticket with 2-3 tasks (adjust based on your students' needs):\n\n**Version A (Below Grade Level):**\n1. Draw something that is frozen water\n2. Circle: Is ice a solid or a liquid?\n3. Point to the snow in the classroom window/photo and tell a partner what it is\n\n**Version B (On Grade Level):**\n1. Draw ice and label it. Write one sentence: \"Ice is frozen ___________.\"\n2. Circle the correct answer: Snow is ☐ liquid water ☐ frozen water ☐ hot water\n3. Draw what you think the wagon will look like in spring. Tell why.\n\n**Version C (Above Grade Level):**\n1. Explain to a friend: Where does snow come from? What happens to it when spring comes?\n2. Write or draw: Why is snow frozen water? What makes it freeze?\n3. Where else on Earth might you see ice and snow in winter?\n\n**Success Criteria for Meeting Learning Objectives:**\n\n✓ **Objective 1 (Identify solid water):** Student correctly identifies ice/snow in photograph and labels it; recognizes it as frozen water\n\n✓ **Objective 2 (Explain frozen water):** Student uses word \"frozen\" or \"solid\" when describing ice/snow; makes connection to temperature (cold)\n\n✓ **Objective 3 (Compare appearance):** Student notices and names differences between snow-covered trees and bare trees in photo; predicts seasonal changes\n\n✓ **Objective 4 (Describe change over time):** Student describes that snow melts, or that the landscape looks different in winter vs. spring\n\n**How to Determine Understanding:**\n- Review exit tickets for evidence of vocabulary use (solid, liquid, frozen, melt)\n- Observe student drawings for accurate representation of ice/water\n- Note responses to open-ended questions: Did student explain reasoning?\n- Use observation data to plan reteaching, small groups, or extensions\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Concrete Vocabulary Pairing:**\n   - Pair each term with a real object: hold up ice cube while saying \"solid\"; pour water while saying \"liquid\"\n   - Use photograph annotations: physically point to snow and write the word directly on the image\n   - Have student repeat vocabulary after teacher model before independent use\n\n2. **Simplified Explore Stations:**\n   - Reduce to 2 stations instead of 4; allow longer time at each\n   - Pre-draw observation sheets with labels and pictures; students only need to mark or circle\n   - Provide hand-over-hand guidance at the touch-and-feel station (ice); emphasize language: \"cold,\" \"hard,\" \"wet\"\n   - Pair student with a peer buddy who can model observation process\n\n3. **Scaffolded Exit Ticket:**\n   - Use Version A (above) with visual supports\n   - Offer yes/no or multiple-choice questions instead of open-ended\n   - Allow verbal response to an adult instead of drawing/writing\n   - Provide sentence stem: \"Snow is frozen __________\" (students fill in \"water\")\n\n### Challenge (For Advanced Learners)\n\n1. **Deeper Inquiry into the Water Cycle:**\n   - Ask: \"If snow melts into water, where does that water go? Does it disappear or does it go somewhere else?\"\n   - Introduce idea that melted water can evaporate, be absorbed by soil, or flow into rivers/lakes\n   - Have students draw or explain the journey of a snowflake from sky → ground → melting → evaporation\n\n2. **Multi-Seasonal Comparison & Data:**\n   - Provide images of the same location in all four seasons\n   - Ask: \"In which seasons do you see frozen water? Why?\"\n   - Challenge: \"Measure\" snow depth in winter vs. spring images; discuss rate of melting (fast vs. slow)\n   - Have students hypothesize: \"When does snow melt fastest—in early spring or late spring?\" (temperature relationship)\n\n3. **Written or Illustrated Explanation:**\n   - Ask students to write or illustrate a multi-step explanation: \"Tell the story of a snowflake: Where did it come from? What happened to it when it landed? What happens to it in spring?\"\n   - Encourage use of vocabulary: solid, liquid, freeze, melt, water\n   - Create a class book of snowflake stories\n\n---\n\n## Extension Activities\n\n1. **\"Snow Melt Races\" Experiment (Next Lesson):**\n   - Place identical ice cubes in different locations in the classroom (sunny window, cold corner, dark closet, warm table)\n   - Students predict which will melt fastest\n   - Check every 10 minutes and record observations with drawings/tallies\n   - Discuss: \"What makes ice melt faster?\" (warmth, sunlight, temperature) — connects to understanding Earth systems and heat\n   - **Time:** 30-40 minutes plus observation checks throughout the day\n\n2. **Winter Scavenger Hunt (Outdoor or Photo-Based):**\n   - If snow is present: Take students outdoors to observe frozen water in nature\n     - Find ice on a puddle, frost on grass, snow patterns, frozen objects\n     - Take photographs or draw what they see\n   - If no snow: Use collection of winter photographs from your region\n   - Students hunt for 3-4 examples of frozen water and describe each\n   - **Connection to NGSS:** Observes where water is found and in what form (2-ESS2-3)\n   - **Time:** 20-30 minutes\n\n3. **\"Build a Frozen Water Scene\" Model Activity (Art Integration):**\n   - Students use sugar cubes (for snow), blue paper (for ice), toy figures, and natural materials to create a winter landscape similar to the photograph\n   - They label parts: snow, ice, frozen lake, bare trees, evergreen trees\n   - Display models and discuss: \"How is your model like the photograph? What's different?\"\n   - **Connection to NGSS:** Develops model of land and water forms (2-ESS2-2)\n   - **Time:** 30-40 minutes (can be homework or center activity)\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing:** If you have access to real snow/ice in your region, this lesson is most impactful during winter. If not, ice cubes and photographs work equally well.\n- **Safety:** Supervise ice handling closely; ensure students wash hands after Explore stations if using ice cubes from the freezer.\n- **Engagement:** The wagon in the photograph is a strong visual hook—consider showing it first in Engage and returning to it throughout the lesson.\n- **Connection to Future Learning:** This lesson builds foundation for understanding the water cycle (K-2 thinking), weathering/erosion (Grade 3-4), and Earth's climate systems.\n- **Home Connection:** Send home a simple note asking families to observe snow/ice with their child and share observations or photos for a class display.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 2910,
  "outputTokens": 4600,
  "cost": 0.02591,
  "generatedAt": "2026-02-12T21:50:55.963Z"
}