{
  "title": "Seasons",
  "category": "earth-space-science",
  "imageFile": "100_1680.jpeg",
  "imagePath": "images/earth-space-science/100_1680.jpeg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Winter Weather and Weathering\n\n## Core Science Concepts from Image Analysis\n\n- **Weathering and Erosion by Ice:** Snow and ice accumulation on objects (the wagon, trees, fence) demonstrates how frozen water can physically break down and wear away surfaces over time through freeze-thaw cycles.\n- **Seasonal Changes and Weather Patterns:** The contrast between evergreen trees (still green) and deciduous trees (bare branches) shows how organisms and landscapes respond differently to winter conditions.\n- **Water's Multiple States:** Solid snow and ice visible throughout the image represent water in its solid form, connecting to the water cycle and Earth's climate systems.\n- **Human Interaction with Natural Environments:** The abandoned wagon demonstrates how human-made objects are affected by natural weathering processes, linking Earth science to real-world impacts.\n\n---\n\n## Lesson Title\n\n**The Freezing Force: How Ice and Snow Change Our World**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90 minutes (two 45-minute sessions, or flexible single-session delivery)\n- **NGSS Standards:** \n  - 4-ESS2-1 (effects of weathering by ice)\n  - 4-ESS2-2 (patterns in Earth's features during seasonal change)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** how ice and snow physically change and wear away objects and materials.\n2. **Explain** the freeze-thaw weathering process using evidence from the photograph and classroom investigations.\n3. **Compare** how different materials (metal, wood, plastic) respond to repeated freezing and thawing.\n4. **Predict** how ice and snow weathering might change landscapes over many years.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture curiosity about how winter weather changes objects and landscapes.\n\n**Materials:**\n- Printed color photograph (8.5\" × 11\" or projected on screen)\n- Chart paper and markers\n- Picture of the same location in summer (optional comparison image)\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see it clearly. Allow 30 seconds of silent observation.\n\n2. **Ask these discussion questions** (pause 5-10 seconds after each for think-pair-share):\n   - \"What do you notice about the wagon in this picture? Why does it look so different from a wagon you might see in summer?\"\n   - \"Look at the trees. Some are still green, but others are completely bare. What could be covering those branches?\"\n   - \"If you touched the snow and ice on that wagon, what would happen to it? What would happen to the wagon over the whole winter?\"\n   - \"Do you think this wagon looks the same now as it did last summer? What might have changed it?\"\n\n3. **Wonder Prompt:** Display this on chart paper: *\"I wonder... how many winters it would take for ice and snow to break apart this metal wagon completely?\"* Invite students to share their own wonderings.\n\n4. **Record student ideas** on chart paper (do not correct misconceptions yet).\n\n**Transition:** \"Today, we're going to become scientists and test how ice and snow can actually change and break down materials—just like what's happening to that wagon in the photograph.\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students discover how repeated freezing and thawing breaks down materials through a hands-on investigation.\n\n**Materials (per group of 3-4 students):**\n- Small clay or modeling compound (1 golf-ball-sized piece per group)\n- Paper cup (filled with water)\n- Sponge or porous rock sample (1 per group)\n- Plastic sealable bag (quart-size)\n- Access to freezer or refrigerator set to freezing temperature\n- Newspaper or tray to contain water\n- Observation sheet (provided below)\n- Hand lens (magnifying glass) if available\n\n**Activity:**\n\n**Day 1 (In-Class Setup — 12 minutes):**\n\n1. **Assign roles:** Designate a materials manager, recorder, and investigator in each group.\n\n2. **Distribute materials.** Show students the clay piece and sponge sample.\n\n3. **Give students this task:**\n   - \"Your job is to investigate how freezing water can change materials. You're going to predict what will happen, then test it.\"\n   - Demonstrate: Fill the cup with water and explain that ice takes up MORE space than water (water expands when it freezes).\n\n4. **Student steps:**\n   - **Step 1:** Observe and describe the clay and sponge using hand lens. Record appearance on observation sheet (color, texture, any cracks).\n   - **Step 2:** Fill the cup with water and place it, the clay, and the sponge in the plastic bag.\n   - **Step 3:** Predict: \"What will happen to the clay, sponge, and cup after freezing?\"\n   - **Step 4:** Seal the bag and place in freezer overnight (or arrange with administration for freezing time).\n\n5. **Document predictions** in writing and drawings on observation sheets.\n\n**Day 2 (Observation & Recording — 10 minutes):**\n\n1. **Retrieve frozen samples.** Show students the results.\n\n2. **Students observe:**\n   - Did the clay crack or change shape?\n   - Is the sponge broken or crumbly?\n   - What happened to the cup (did it crack)?\n   - Why did these changes happen?\n\n3. **Record observations** using drawings and words: \"What did freezing water do to our materials?\"\n\n4. **Make connections:** \"This is called weathering. The ice expanding pushed on the material, like a tiny hammer, until it broke or cracked. This happens on real rocks and objects outside during winter.\"\n\n**Teacher Role:**\n- Circulate and ask guiding questions: *\"What changed? Why do you think that happened? How is this like the wagon in the photo?\"*\n- Do NOT tell students the answer; guide them to observe and infer.\n- Support students in recording observations through drawing and simple labels.\n\n**Expected Student Outcomes:**\n- Students observe visible cracks, breakage, or crumbling in clay and sponge.\n- Students record that freezing water caused the damage.\n- Students connect the activity to the photograph without teacher prompting.\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Build vocabulary and formalize understanding of ice weathering using evidence from exploration.\n\n**Materials:**\n- Chart paper and markers\n- Photograph (displayed again)\n- Word cards with vocabulary terms\n- Pictures or diagrams of freeze-thaw cycle (teacher-created or found online)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2-3 groups to briefly share their observations: *\"What happened to your clay and sponge?\"*\n   - Record key observations on chart paper.\n\n2. **Introduce Vocabulary (8 minutes):** Explicitly teach these four terms using student-friendly language, the photograph, and the Explore activity as examples:\n\n   **Vocabulary:**\n   - **Weathering:** The slow process of rocks and materials being broken down into smaller pieces by ice, water, wind, or animals. (Show the wagon and ask: *\"The wagon is getting weathered by ice and snow.\"*)\n   - **Freeze-Thaw Cycle:** When water freezes into ice, it takes up more space. When it melts, it shrinks. This happens over and over in winter, and it can crack rocks and break materials. (Act this out: stand closely together as liquid water, spread arms wide as frozen ice, come together again as liquid.)\n   - **Erosion:** The wearing away and moving of rocks and soil by water, ice, wind, or other forces. (Connect: *\"Weathering breaks rocks into pieces. Erosion moves those pieces away.\"*)\n   - **Expansion:** When something gets bigger or takes up more space. (Use clay example: *\"When water froze in our cup, it expanded and cracked it.\"*)\n\n3. **Check for Understanding (3 minutes):**\n   - Hold up the photograph. Ask: *\"What is weathering the wagon in this picture?\"* (Answer: ice and snow)\n   - Ask: *\"Why does ice cause weathering?\"* (Answer: ice expands and pushes on things, breaking them.)\n   - Ask: *\"If this wagon sits outside for many, many winters, what will eventually happen to it?\"* (Answer: it will break apart into smaller pieces.)\n\n4. **Connect All Pieces:**\n   - \"You froze water in a bag with clay and a sponge, and it broke them. Real ice and snow do the same thing to rocks, mountains, buildings, and wagons—but it takes much longer because it happens slowly, year after year.\"\n\n**Expected Student Outcomes:**\n- Students use the vocabulary terms \"weathering,\" \"freeze-thaw cycle,\" and \"expansion\" accurately in sentences.\n- Students explain why ice causes weathering using evidence from the Explore activity.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Apply weathering concepts to a new context and deepen understanding of real-world impacts.\n\n**Materials:**\n- Pictures of various winter landscapes (mountains, cliffs, urban environments) — 1 per pair\n- Chart paper divided into three columns labeled: \"Summer,\" \"Winter,\" \"Many Years Later\"\n- Markers\n- Optional: YouTube clip (3 minutes) of dramatic erosion or weathering examples\n\n**Activity:**\n\n**Option A: Landscape Prediction Task (Recommended — 18 minutes)**\n\n1. **Pair students** and distribute landscape pictures (avoid using the lesson photograph; choose different scenes showing natural or built environments).\n\n2. **Introduce the task:**\n   - \"You're going to predict how weathering will change this place over time.\"\n\n3. **Students complete the three-column chart:**\n   - **Summer column:** Draw or write what the landscape/building/rock looks like in warm weather with no ice.\n   - **Winter column:** Add ice, snow, and freeze-thaw cracks based on what you learned.\n   - **Many Years Later column:** Predict what it will look like after 10-20 winters of weathering. Will rocks break apart? Will buildings crack? Will cliff faces change?\n\n4. **Pairs share their predictions** with another pair or the whole class (2-3 examples only to save time).\n\n5. **Teacher prompts:**\n   - *\"Where do you see weathering happening in your drawing?\"*\n   - *\"What would the next winter do to it?\"*\n   - *\"Why does this take so long in real life compared to our clay experiment?\"*\n\n**Option B: Real-World Weathering Hunt (If time allows or alternative)**\n\n- Display pictures of human-made objects damaged by winter weather (damaged roads, cracked sidewalks, broken fences).\n- Ask: *\"Where do you see evidence of freeze-thaw weathering?\"*\n- Create a list of places in your school or town where ice weathering might be happening right now.\n\n**Teacher Role:**\n- Validate students' predictions without judgment.\n- Ask questions that push thinking: *\"What do you think will happen in the next 5 winters? Will it change faster or slower?\"*\n- Encourage students to reference the freeze-thaw vocabulary.\n\n**Expected Student Outcomes:**\n- Students apply freeze-thaw weathering to new landscapes or objects.\n- Drawings/writing show understanding that weathering is a slow, ongoing process.\n- Students use vocabulary terms (weathering, freeze-thaw, expansion) when explaining predictions.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of ice weathering and freeze-thaw processes.\n\n**Formative Assessment During Lesson:**\n- **Observe and record** during Explore: Can students identify that frozen water caused cracks/changes in materials?\n- **Listen to explanations** during Explain and Elaborate: Are students using vocabulary correctly? Can they make connections to the photograph?\n- **Review observation sheets and drawings:** Do they show evidence of understanding the freeze-thaw process?\n\n**Exit Ticket (Summative Assessment) — 5 minutes:**\n\nDistribute a half-sheet with these prompts (students may draw or write):\n\n1. **\"In the picture, ice and snow are weathering the wagon. Explain: What does weathering mean? Use the word 'freeze-thaw' in your answer.\"**\n   - *Expected: Student writes/explains that weathering means breaking down materials, and that ice freezes, expands, and breaks the wagon.*\n\n2. **\"Why does ice cause weathering better than liquid water?\"**\n   - *Expected: Student identifies that ice takes up more space (expands) and pushes on things, causing cracks.*\n\n3. **\"Draw or write: What would happen to this wagon after 20 winters of freeze-thaw weathering?\"**\n   - *Expected: Student predicts increased breaking, cracking, rusting, or disintegration.*\n\n**Success Criteria for Meeting Learning Objectives:**\n- ✓ Student accurately defines weathering and freeze-thaw cycle.\n- ✓ Student explains that ice expansion causes weathering (using evidence from the activity or photograph).\n- ✓ Student applies the concept to predict how weathering changes objects over time.\n- ✓ Student uses at least 2 vocabulary terms correctly (weathering, freeze-thaw, expansion, erosion).\n\n**Determine Progress:**\n- **Proficient:** Meets all four criteria; clear understanding of freeze-thaw weathering.\n- **Developing:** Meets 2-3 criteria; understands weathering but may confuse details about ice expansion.\n- **Beginning:** Meets 1 criterion or fewer; needs reteaching of core concepts.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Sentence Frames for Explanations:**\n   - Provide: *\"Weathering means ___. Ice causes weathering because ___.\"*\n   - Students fill in the blanks during Explain and Elaborate phases.\n\n2. **Simplified Observation Sheet:**\n   - Use pictures + checkboxes instead of open-ended writing.\n   - *\"Did the clay crack? Yes / No. Did the sponge break? Yes / No. Why?\"* (provide 2-3 answer choices)\n\n3. **Pair with Strong Explainers:**\n   - During group work, assign struggling students to groups with articulate peers.\n   - Assign them the \"materials manager\" role so they stay engaged in hands-on tasks.\n\n### Challenge (for advanced learners):\n\n1. **Introduce the Rock Cycle Connection:**\n   - Advanced students research and present: *\"How does weathering fit into the rock cycle? What happens to weathered rock pieces?\"*\n   - Provide a simple rock cycle diagram and ask them to label where weathering occurs.\n\n2. **Compare Multiple Weathering Agents:**\n   - Expand the Explore activity: freeze-thaw + wind simulation (use a fan on wet material) or add salt (like road salt) to investigate faster weathering.\n   - Ask: *\"Which breaks down materials faster: ice alone, or ice + wind? Why?\"*\n\n3. **Investigate Real-World Solutions:**\n   - Challenge: *\"Cities use salt to prevent ice on roads, but salt also causes weathering. Design a better solution that prevents slipping without harming buildings and cars.\"*\n   - Have them sketch or explain their invention.\n\n---\n\n## Extension Activities\n\n1. **Winter Weathering Scavenger Hunt (Outdoors or Photo-Based):**\n   - Take students outside (or show photos of your school/neighborhood in winter).\n   - Challenge: Find 3 examples of freeze-thaw weathering (cracked sidewalk, damaged rock, broken fence rail, tree branch bent by ice).\n   - Document with drawings or photos and label the weathering evidence.\n   - Create a classroom poster: *\"Weathering in Our Community.\"*\n\n2. **Engineer a Weathering-Proof Container:**\n   - Give students a raw egg in a small container; they design and build a package to protect it from a \"freeze-thaw test\" (freeze-thaw cycle in freezer for 3 days, then drop test).\n   - Ask: *\"What materials work best? Why don't they crack like our clay did?\"*\n   - Connect to how engineers protect buildings and roads from winter damage.\n\n3. **Investigate Weathering Rates with Different Materials:**\n   - Extend the Explore activity: test clay, sponge, foam, and natural rock samples through multiple freeze-thaw cycles (freeze-thaw 3-5 times).\n   - Create a bar graph: *\"Which material broke apart fastest?\"*\n   - Discuss: *\"Why do some materials weather faster than others? What's special about rocks that makes them break apart?\"*\n\n4. **Create a Time-Lapse Drawing Series:**\n   - Students draw the wagon scene across four stages: Year 1, Year 5, Year 10, Year 50.\n   - Emphasize that weathering is slow but powerful over time.\n   - Display as a hallway exhibit titled: *\"The Slow Power of Ice.\"*\n\n---\n\n## Teacher Notes\n\n- **Pre-Lesson Prep:** Arrange freezer time with your administration 1-2 days before the lesson. If freezing is not possible, you may freeze materials at home the night before and bring them in thawed for the Observe step, demonstrating the cracks/damage. The learning is still valid.\n- **Safety:** Supervise freezer access. Use food-safe plastic bags and keep materials clearly labeled.\n- **Vocabulary Reinforcement:** Post the four vocabulary words on the wall for the remainder of the week. Use them in daily language.\n- **Photograph Connection:** Keep the photo displayed throughout the lesson and refer back to it in every phase. Students should connect every concept back to the wagon and landscape.\n- **Real-World Link:** If your region has significant winter weather, this lesson will resonate deeply. If not, emphasize that weathering happens everywhere—in mountains, deserts, and cities where winters include freezing.",
  "inputTokens": 2957,
  "outputTokens": 4226,
  "cost": 0.024087,
  "generatedAt": "2026-02-12T21:52:24.137Z"
}