{
  "title": "Beach",
  "category": "earth-space-science",
  "imageFile": "beach.jpeg",
  "imagePath": "images/earth-space-science/beach.jpeg",
  "content": "# NGSS Engineering Design Challenge: Ghost Crab Shelter\n\n### Visible Elements in Photo\n- A fiddler or ghost crab on wet sand with two prominent eye stalks and claws\n- Sandy beach substrate with visible burrow or hole nearby\n- Damp, compacted sand (darker areas indicating moisture)\n- Scattered loose sand and sediment\n- Bright sunlight creating shadows (implies heat and exposure)\n\n### Reasonable Inferences\n- **From the burrow visible in sand**: The crab digs and maintains underground shelter to escape predators, heat, and drying conditions.\n- **From eye stalks and raised posture**: The crab needs a shelter entrance that allows it to detect movement and threats while remaining partially protected.\n- **From wet/dry sand texture**: The crab's habitat experiences changing moisture levels, so shelter must manage water infiltration and drainage.\n\n### Engineering Task\n\n**K-2 Version:**\nYou are a ghost crab! Your home is getting washed away by waves. **Design and build a safe burrow** using sand, pebbles, and a small container. Your burrow must:\n- Have a door (opening) where you can peek out and see danger coming\n- Keep water from flooding your home\n- Be strong enough so it doesn't collapse when you move in and out\n\n**3-5 Version:**\nGhost crabs dig burrows to survive on the beach. Your task: **Design a crab burrow system** that meets these criteria:\n- Entrance diameter: 2–3 cm (large enough for the crab model to enter/exit)\n- Must withstand at least 5 \"wave washes\" (water poured gently over it) without collapsing\n- Must have a water-drainage feature so the crab doesn't drown during high tide\n- Burrow depth: minimum 10 cm below the surface\n\nTest your design by flooding your model burrow with water and observing how long it stays structurally sound. Redesign and test again to improve it.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real organism solving a survival problem (shelter in a dynamic beach environment). Students observe the crab's actual solution and are asked to define the *problem* the crab faces (heat, predators, flooding, exposure). The need is clear from the image; students don't need to imagine a hypothetical scenario.\n\n### Suggested Materials\n- Sand (wet and dry, if possible)\n- Small pebbles and shells\n- Clear plastic cups or containers (to model the burrow interior)\n- Drinking straws or PVC pipe sections (for entrance tunnel)\n- Water pitcher or spray bottle\n- Small plastic crab figurine (optional, for testing)\n- Ruler (for 3–5 task)\n\n### Estimated Time\n- **K-2**: 45–60 minutes (includes observation, building, and one water test)\n- **3-5**: Two 45-minute sessions (Session 1: design, build, initial testing; Session 2: observe results, modify, retest)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (define engineering problems by specifying criteria and constraints) and **K-2-ETS1-1** (ask questions and imagine solutions) by grounding the design challenge in a real animal's survival need visible in the photo, making the stakes tangible and the design decisions meaningful.",
  "inputTokens": 2332,
  "outputTokens": 782,
  "cost": 0.006242,
  "generatedAt": "2026-02-09T13:23:56.656Z"
}