{
  "title": "Beach",
  "category": "earth-space-science",
  "imageFile": "beach.jpeg",
  "imagePath": "images/earth-space-science/beach.jpeg",
  "content": "# Engineering Design Process Challenge\n\n## ### Visible Elements in Photo\n- A crab with two prominent eyestalks and brown/tan coloring on its shell\n- Sandy beach environment with fine, light-colored sand\n- Crab's claws/pincers visible at its sides\n- Burrow or depression in the sand near the crab\n- Uneven sand surface with scattered grains\n\n---\n\n## ### Reasonable Inferences\n1. **From the burrow near the crab** → The crab digs and maintains underground shelters for protection and survival in the sandy beach habitat.\n2. **From the eyestalks and claw placement** → The crab uses specialized body parts to sense its environment and interact with sand (digging, moving, catching food).\n3. **From the loose, granular sand** → Beach sand shifts and slides easily, making shelter construction and stability a real challenge for burrowing creatures.\n\n---\n\n## ### Engineering Task\n\n**K-2 Version:**\nDesign a safe hiding spot for a crab in the sand. Your crab needs a hole or tunnel where it can stay safe from bigger animals. Use sand, pebbles, and other materials to build a shelter that doesn't cave in. Test it by gently pouring water near it—does your shelter stay open so the crab can hide?\n\n**3-5 Version:**\nDesign and build a stable burrow system for a ghost crab that must meet these criteria:\n- **Structure**: Create a burrow at least 4 inches deep that remains open (does not collapse) for at least 2 minutes.\n- **Material constraint**: Use only sand, water, and one binding material (seaweed, small shells, or clay) to reinforce walls.\n- **Stability test**: Pour water slowly at the entrance; the burrow must not collapse entirely.\n- **Success measure**: The burrow holds its shape while remaining accessible for a crab-sized object (marble or small toy) to enter and exit.\nDocument which binding material worked best and why.\n\n---\n\n## ### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real organism solving a real environmental challenge (living safely in shifting sand). Students identify the *problem* the crab faces—finding stable shelter in an unstable material—before designing a solution. The need is clear from nature itself.\n\n---\n\n## ### Suggested Materials\n- Sand (beach, play sand, or sandbox sand)\n- Water (spray bottle or cup)\n- Seaweed pieces or dried grass\n- Small shells or pebbles\n- Clay or modeling putty\n- Shallow containers or trays to contain the sand\n- A marble or small toy to test accessibility\n\n---\n\n## ### Estimated Time\n**45–60 minutes** (One full class session or two 30-minute sessions: 15 min planning, 20 min building, 10 min testing, 5–10 min reflection and material comparison)\n\n---\n\n## ### Why This Works for Teachers\nThis task directly supports **NGSS ETS1.A** (*defining and delimiting engineering problems*) by asking students to understand and solve a real biological need—shelter stability in a granular environment—using observable evidence from the crab's actual habitat.",
  "inputTokens": 2199,
  "outputTokens": 727,
  "cost": 0.005834000000000001,
  "generatedAt": "2026-02-12T06:16:09.514Z"
}