{
  "title": "Dawn",
  "category": "earth-space-science",
  "imageFile": "dawn.jpg",
  "imagePath": "images/earth-space-science/dawn.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: \"Sunrise and the Sky's Story\"\n\n## Core Science Concepts from Image Analysis\n\n- **The Sun's Position Changes Throughout the Day:** The dawn lighting in the photograph shows the sun low on the horizon, demonstrating that the sun's location in the sky changes from sunrise to sunset.\n- **Daylight Patterns:** The pale, early-morning light indicates the beginning of the day—a time when we observe less sunlight than midday, connecting to how daylight amounts vary.\n- **Weather and Atmospheric Conditions:** The mist/fog visible over the landscape shows how water in the air creates visible weather conditions that we can observe and predict.\n- **Natural Patterns and Cycles:** The photograph captures a predictable daily event (sunrise) that occurs at the same general time each day, demonstrating observable patterns in nature.\n\n---\n\n## Lesson Title\n\n**Where Does the Sun Go? Watching the Sky Wake Up**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (or four 20-minute blocks spread across a week)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** the position of the sun at different times of day using simple directional words (up, down, morning, afternoon).\n2. **Identify patterns** in when the sun rises and sets by recording observations over multiple days.\n3. **Explain** in their own words why the sky looks different at sunrise versus other times of day.\n4. **Predict** what the sky will look like at sunrise based on patterns they have observed.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student curiosity about the sun's movement and daily patterns using the dawn photograph.\n\n**Materials:**\n- Printed color photograph of the sunrise/dawn field scene (one per student or display on screen/smartboard)\n- Chart paper and markers\n- Index cards with simple drawings (optional: pre-drawn sun at different heights)\n\n**Activity:**\n\n1. **Display the Photograph** (2 minutes)\n   - Show the photograph on a screen or print it for students to observe. Gather students in a circle or at a meeting area where everyone can see clearly.\n   - Say: *\"Look at this picture. Something important is happening in this photo. What do you notice?\"*\n\n2. **Guided Observation Questions** (6 minutes)\n   - Ask these questions one at a time, allowing 20-30 seconds for responses:\n     - *\"What color is the sky in this picture? Why do you think it looks that way?\"*\n     - *\"Where do you think the sun is in this picture? Is it high up or low down?\"*\n     - *\"What time of day do you think this is? How do you know?\"*\n     - *\"Have you ever seen the sky look like this? When?\"*\n\n3. **Wonder and Prediction Prompt** (4 minutes)\n   - Display the photo again and say: *\"This picture was taken early in the morning, right when the sun is waking up. The sun is not high in the sky yet—it's just starting to come up. Where was the sun before this picture was taken? Where will it go next?\"*\n   - Have students turn to a partner and share: *\"If you could follow the sun all day long, what do you think would happen to it?\"*\n   - Record 2-3 student predictions on chart paper (accept all ideas without judgment).\n\n**Transition:** *\"Let's do a special activity where we watch the sun and track where it goes during the day—just like the sun in our picture!\"*\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate the sun's movement and daily patterns through observation and documentation.\n\n**Materials:**\n- **Per student or pair:**\n  - Drawing paper (unlined, 8.5\" × 11\")\n  - Crayons or colored pencils\n  - Index cards (5\" × 7\") — 3 per student\n  - Pencils or markers for labeling\n  - **For tracking over multiple days:** Sun observation log (simple chart with spaces for drawings and times)\n- **For classroom:**\n  - Window with a clear view of the sky or outdoor access\n  - Clock visible to students (optional: pre-set clock faces printed on cards showing different times)\n\n**Activity:**\n\n**Day 1 of Exploration (Session 1):**\n\n1. **Introduction to the Activity** (2 minutes)\n   - Explain: *\"We are going to be sun detectives. Every time we look out the window at the sky, we will draw what we see and mark where the sun is. We're going to see if the sun moves during our school day.\"*\n\n2. **First Observation** (5 minutes)\n   - Take students to the window (or outside, weather permitting).\n   - Ask them to find the sun in the sky. **Safety reminder:** *\"We never look directly at the sun because it can hurt our eyes. We look at how bright the sky is and where the brightest spot is.\"*\n   - Have students point in the direction where they think the sun is located (without looking at it directly).\n   - Together, describe the sky color and light using simple words (bright, blue, light yellow, hazy).\n\n3. **Student Documentation** (8 minutes)\n   - Distribute index cards. Students draw what they see:\n     - **Top of card:** Draw the sky and show where the sun is (using a circle, a bright spot, or rays).\n     - **Bottom of card:** Write or dictate the time of day (teacher writes it). Example: *\"9:00 AM - Morning sun.\"*\n   - Circulate and ask each student: *\"Where is the sun? Is it high up or low down? What does it look like?\"*\n   - Collect cards and display them on a bulletin board labeled \"Our Sun Observations.\"\n\n4. **Transition Activity** (2 minutes)\n   - Say: *\"We observed the sun this morning. In a few hours, let's check on it again. I think it will have moved!\"*\n\n5. **Second Observation** (5 minutes) — *Do this later in the same day (e.g., 2-3 hours later)*\n   - Repeat the outdoor observation and drawing process.\n   - Have students compare their new drawing to their first one: *\"Is the sun in the same place? Did it move?\"*\n\n**Day 2 of Exploration (Session 2 — next day or end of lesson):**\n\n1. **Multiple-Day Tracking** (continuing activity, 5-7 minutes total across the week)\n   - Over the next few days, repeat the observation-and-drawing process at the same time each day.\n   - Create a simple Sun Observation Log on chart paper showing:\n     - **Time | Student Name | Sun Location (drawing) | Sky Color**\n   - Have 2-3 students observe and record each day.\n   - Display each day's observations next to the previous day's so patterns become visible.\n\n**Teacher Role:**\n- Facilitate observations without leading students to specific conclusions.\n- Ask guiding questions: *\"Where is the sun compared to yesterday? Is it higher or lower? Why do you think that is?\"*\n- Help students document by writing labels and times.\n- Create a safe, judgment-free environment where students feel comfortable sharing observations.\n- Validate all observations while nudging toward noticing patterns.\n\n**Expected Student Outcomes:**\n- Students produce 2-3 drawings showing the sun's location at different times.\n- Students begin to notice (or with prompting, recognize) that the sun appears to move across the sky.\n- Students use positional language: *\"The sun was here in the morning. Now it's there in the afternoon.\"*\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce vocabulary and explain the pattern of the sun's movement and its relationship to daylight.\n\n**Materials:**\n- Chart paper and markers\n- Student observation cards from Explore phase\n- Visual teaching aids:\n  - Simple diagram showing sun positions at sunrise, midday, and sunset\n  - Laminated or printed picture cards of sunrise, noon, and sunset skies\n- Vocabulary cards with images\n\n**Activity:**\n\n1. **Share-Out from Explore** (5 minutes)\n   - Gather students and display all the observation drawings they made.\n   - Ask: *\"Look at all these pictures of the sun. What do you notice? Did the sun move? How do we know?\"*\n   - Have 2-3 students share their observations aloud.\n   - Affirm: *\"You noticed that the sun was in different places! That's what scientists do—they observe and notice changes.\"*\n\n2. **Introduce Key Vocabulary** (8 minutes)\n   - Display pictures or draw simple diagrams showing the three times of day.\n   - **Vocabulary with definitions:**\n\n     | **Term** | **Student-Friendly Definition** |\n     |----------|--------------------------------|\n     | **Sunrise** | The time when the sun first comes up in the morning and the sky gets bright. |\n     | **Sunset** | The time when the sun goes down at the end of the day and the sky gets dark. |\n     | **Daylight** | The time when the sun is up and it is light outside so we can see. |\n     | **Pattern** | Something that happens the same way over and over again. |\n     | **Moon** | A bright object we see in the night sky that gives us light when the sun is gone. |\n\n   - For each term, show the picture or diagram and use simple language:\n     - *\"Sunrise is like the sun waking up. It comes up in the morning. Look at the picture we found—that's a sunrise!\"* (Point to the dawn photograph.)\n     - *\"Sunset is when the sun goes to sleep. It goes down in the evening. The sky turns orange and pink, like in our picture, but it's the end of the day instead of the beginning.\"*\n     - *\"Daylight is all the time when we can see because the sun is up. When the sun goes down, it gets dark.\"*\n     - *\"A pattern is something that happens over and over the same way. The sun rises every morning. That's a pattern!\"*\n     - *\"The moon comes out when the sun goes down. It helps light up the night sky.\"*\n\n3. **Connect Back to the Photograph** (3 minutes)\n   - Show the original photograph again.\n   - Say: *\"This picture is a sunrise. The sun is just coming up, so the sky is light, but not bright yet. The rest of the day, the sun will move across the sky, and it will get brighter. Then at sunset, it will go back down.\"*\n   - Ask: *\"What time of day were your drawings closest to the sunrise picture? What time was closest to sunset?\"*\n\n4. **Check for Understanding** (2 minutes)\n   - Ask quick-check questions:\n     - *\"Show me with your hands: Is the sun high or low at sunrise?\"* (Students hold hand low.)\n     - *\"When do we see the most daylight—sunrise, midday, or sunset?\"* (Students respond: midday or \"when the sun is highest.\")\n     - *\"Does the sun's position change during the day? How do you know?\"* (Reference their drawings.)\n\n**Vocabulary List:**\n- **Sunrise:** When the sun comes up in the morning.\n- **Sunset:** When the sun goes down in the evening.\n- **Daylight:** The time when the sun is up and it's light outside.\n- **Pattern:** Something that happens the same way again and again.\n- **Moon:** The bright object in the night sky that comes out when the sun goes down.\n\n**Expected Student Outcomes:**\n- Students use vocabulary terms (sunrise, sunset, daylight) in simple sentences.\n- Students explain that the sun's position changes during the day.\n- Students understand that sunrise and sunset happen at predictable times.\n- Students recognize the pattern: sunrise → daylight → sunset → night.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Students apply their understanding of sun patterns to a new context and make predictions.\n\n**Materials:**\n- Chart paper with a drawn timeline labeled \"Our Day\"\n- Picture cards of different times of day (sunrise, 9 AM, noon, 3 PM, sunset, night) — can be hand-drawn or printed\n- Index cards with times of day written on them (optional)\n- Drawing paper for sun movement diagrams\n- Crayons or colored pencils\n- Predictive observation tracker (printed sheet with dates)\n\n**Activity:**\n\n**Option A: Sun Path Prediction Activity** (10 minutes)\n\n1. **Introduce the Challenge** (2 minutes)\n   - Say: *\"You've been sun detectives and watched where the sun goes. Now, let's predict! Tomorrow, what will the sun do? Will it go the same place it went today?\"*\n\n2. **Create a Prediction Drawing** (6 minutes)\n   - Give each student a blank paper divided into four boxes labeled \"Morning,\" \"Noon,\" \"Afternoon,\" and \"Evening.\"\n   - Instruct: *\"Draw where you think the sun will be at each time. Use what you learned from your observations.\"*\n   - Circulate and ask: *\"Why did you put the sun there? What pattern did you notice that helps you predict?\"*\n\n3. **Share Predictions** (2 minutes)\n   - Invite 3-4 students to show their predictions and explain their thinking.\n   - Affirm correct reasoning: *\"You remembered that the sun moves from side to side during the day. That's exactly right!\"*\n\n**Option B: Real-Time Observation Challenge** (10 minutes) — *If done on Day 2 of lesson*\n\n1. **Reveal Tomorrow's Forecast** (2 minutes)\n   - Show a simple chart: *\"Tomorrow, we will observe the sun at the same times we did today. Let's predict what we'll see.\"*\n\n2. **Create a Prediction Sheet** (5 minutes)\n   - Students draw or write predictions:\n     - *\"At _____ o'clock, the sun will be _____.\"* (high up / low down / moving)\n   - Have students record predictions on individual sheets.\n\n3. **Set Up for Follow-Up Observations** (3 minutes)\n   - Explain: *\"Tomorrow, we'll look at the sun again at these times and see if our predictions match what really happens!\"*\n   - Mark the times on a classroom calendar.\n\n**Teacher Role:**\n- Facilitate prediction discussions with open-ended questions.\n- Encourage students to reference their Explore drawings as evidence.\n- Emphasize the scientific process: *\"Scientists make predictions based on what they observe. Then they test their ideas!\"*\n- Guide without providing answers; let students reason.\n\n**Expected Student Outcomes:**\n- Students create drawings or written predictions showing sun movement.\n- Students use phrases like: *\"The sun will move across the sky,\"* or *\"It will be higher at noon.\"*\n- Students justify predictions using observations from earlier activities.\n- Students recognize and articulate the daily sun pattern.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of sun movement patterns and daylight cycles.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation Checklist:** As students draw and discuss, note:\n  - ✓ Student correctly identifies the sun's position as high or low.\n  - ✓ Student uses vocabulary (sunrise, sunset, daylight) appropriately.\n  - ✓ Student references their own observations as evidence.\n  - ✓ Student makes logical predictions based on patterns observed.\n\n**Exit Ticket / Summative Assessment** (administer at end of Lesson 2):\n\n**Version A: Drawing-Based (for all students)**\n- **Prompt:** *\"Draw a picture showing where the sun is at sunrise and where it is at midday. Label them. Tell me: Did the sun move? How do you know?\"*\n- **Student Response:** Students produce a two-part drawing with labels and an explanation (oral or written with teacher scribing).\n\n**Version B: Verbal / Discussion-Based (for students who benefit from oral response)**\n- **Questions:**\n  1. *\"When do we see the sun start to come up? What do we call that time?\"* (Answer: Sunrise, morning, early.)\n  2. *\"Does the sun stay in the same place all day, or does it move? Tell me what you observed.\"* (Answer: It moves; shows evidence from drawings.)\n  3. *\"If today the sun was [low/high] in the sky at 10 AM, what do you predict it will do by 2 PM?\"* (Answer: It will move higher / move more across the sky.)\n  4. *\"Why is there less daylight in the winter than in the summer?\"* (Answer: This is advanced; acceptable response is *\"The sun comes up later and goes down earlier\"* or *\"The sun is not up as long.\"*)\n\n**Version C: Observation Recording** (for advanced learners)\n- **Prompt:** *\"For three days, draw where the sun is at the same time each day. Write or tell: Is the sun in the same place each day, or does it change? What pattern do you see?\"*\n- **Student Response:** Students produce a three-day tracking sheet with drawings and a written or verbal explanation of patterns.\n\n**Success Criteria:**\n\nA student demonstrates understanding if they can:\n- ✓ Identify the sun's position as high or low using directional language.\n- ✓ Recognize that the sun's position changes during the day.\n- ✓ Use the word \"sunrise\" or describe early-morning light correctly.\n- ✓ Predict sun position based on observed patterns (with 70% accuracy on prompts).\n- ✓ Provide evidence from their observations when explaining their thinking.\n\n**Expected Student Outcomes:**\n\n- **Developing:** Student identifies the sun in the sky but needs support describing its position or recognizing patterns. (Meets 2-3 criteria.)\n- **Proficient:** Student identifies sun position, recognizes it changes, uses some vocabulary, and makes basic predictions. (Meets 4-5 criteria.)\n- **Advanced:** Student consistently uses vocabulary, makes detailed predictions, provides evidence, and begins to consider seasonal changes. (Meets all criteria + extends thinking.)\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified Vocabulary & Picture Support:**\n   - Provide a visual reference sheet with pictures of sunrise, noon, and sunset labeled with simple words.\n   - Use consistent, repetitive language: *\"In the morning, the sun is low. At midday, the sun is high. In the evening, the sun goes down.\"*\n   - Pair students with a buddy who can help identify the sun's location.\n\n2. **Guided Observation Script:**\n   - Use a sentence frame for observations: *\"I see the sun _____ (up/down). The sky is _____ (bright/dark).\"*\n   - Sit with small groups during Explore activities and ask leading questions: *\"Where is the sun compared to yesterday? Higher or lower?\"*\n\n3. **Reduce Documentation Load:**\n   - Allow students to point and tell their observations to a partner or teacher rather than draw independently.\n   - Provide pre-drawn sun circles; students only need to place them in the correct position on a paper.\n   - Use a teacher-created tracking sheet with boxes where students place stickers or stamps instead of drawing.\n\n### Challenge (for advanced learners):\n\n1. **Extend to Seasonal Patterns:**\n   - Ask: *\"If we do this same activity in winter, will the sun be in the same place at the same time? Why or why not?\"*\n   - Have students hypothesize about how the amount of daylight changes throughout the year.\n   - Provide a simple year-round observation log where students predict and track sunrise/sunset times across seasons.\n\n2. **Introduce the Moon and Night Sky:**\n   - Challenge: *\"If the sun goes down at sunset, what lights up the night? How is the moon's light different from the sun's light?\"*\n   - Have advanced students sketch the moon at different phases and predict when they'll see it (evening, night, early morning).\n   - Provide a nighttime observation log for home observations.\n\n3. **Deeper Investigation of Direction:**\n   - Introduce compass directions (east = sunrise, west = sunset) in a simple way.\n   - Ask: *\"If the sun comes up in the east, where does it go down?\"*\n   - Have students create a directional diagram showing the sun's path across the sky from east to west.\n\n---\n\n## Extension Activities\n\n1. **Sunrise & Sunset Art Project** (30-40 minutes, can be homework or follow-up lesson)\n   - **Objective:** Apply understanding of light and color changes during sunrise/sunset to creative expression.\n   - **Activity:** Students create a three-part art piece showing the sky at sunrise, midday, and sunset using watercolors, pastels, or colored paper collage.\n   - **Discussion prompts:** *\"What colors do you see at sunrise? Why is the light different at different times of day?\"*\n   - **Connection:** Links visual observations to vocabulary and reinforces pattern recognition.\n\n2. **\"Where Is the Sun?\" Classroom Game** (15-20 minutes)\n   - **Objective:** Reinforce understanding of sun position and patterns through active, playful learning.\n   - **Activity:** \n     - Create large cards with images: sunrise, noon, sunset.\n     - Call out a time of day (e.g., *\"It's 9 AM!\"*).\n     - Students move to or point to the card showing where the sun is at that time.\n     - Increase difficulty: *\"It's 10 AM in winter. Where is the sun? Is it lower than in summer?\"*\n   - **Connection:** Kinesthetic reinforcement; builds fluency with vocabulary and concepts.\n\n3. **Sun Diary or Observation Journal (Ongoing, 5 minutes per day for 2 weeks)**\n   - **Objective:** Develop sustained observation skills and deepen understanding of daily and seasonal patterns.\n   - **Activity:** \n     - Students keep a simple journal where they draw or dictate daily observations about the sun.\n     - Entries include: date, time, sun position (high/low/medium), sky color, and one sentence about what they noticed.\n     - Every 5-7 days, students review their journal and write/dictate a pattern they notice: *\"The sun is always higher at noon than in the morning.\"*\n   - **Variation:** For families, send home a \"Home Sun Observations\" sheet where parents and students observe the sunset together and record the date, time, colors, and position.\n   - **Connection:** Bridges school and home learning; builds long-term pattern recognition aligned to 1-ESS1-2 (observations across time).\n\n---\n\n## Summary\n\nThis lesson leverages the dawn photograph to engage First Graders in direct observation of the sun—a phenomenon they experience daily but may not consciously notice. Through the 5E sequence, students progress from curiosity (the beautiful, mysterious dawn sky) to structured investigation (tracking the sun's movement), to conceptual understanding (sunrise/sunset patterns), to application (predictions), to demonstration of learning (drawings and explanations). \n\nThe lesson is grounded in NGSS 1-ESS1-1 and 1-ESS1-2, requires minimal materials, uses observable phenomena that students can investigate both at school and at home, and builds a foundation for future learning about Earth's rotation and solar energy. The lesson is also designed to be flexible: teachers can compress it into two focused 40-minute sessions or expand it over a week with daily observations, depending on their schedule and student readiness.",
  "inputTokens": 2842,
  "outputTokens": 5611,
  "cost": 0.030897,
  "generatedAt": "2026-02-13T01:08:42.668Z"
}