{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "e01.jpeg",
  "imagePath": "images/earth-space-science/e01.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Urban Skylines and the Sun's Movement\n\n## Core Science Concepts from Image Analysis\n\n- **The sun's position and light patterns change throughout the day** — Students observe the sun's bright light and shadows on the buildings, which demonstrates how the sun moves across the sky and creates changing light patterns.\n- **The sun appears at different heights in the sky at different times of day** — The low angle of sunlight in this photograph (creating long shadows on buildings) indicates a time of day when the sun is lower on the horizon (sunrise or sunset).\n- **Shadows are created by the sun's light** — The distinct shadows visible on the buildings and ground are directly caused by sunlight being blocked by structures.\n- **Humans build structures on Earth** — The photograph shows human-made buildings and bridges, which are built from Earth's natural materials (rocks, minerals, metals), connecting to natural resources.\n\n---\n\n## Lesson Title\n\n**Where Does the Sun Go? Following the Sun Throughout the Day**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe the position of the sun in the sky at different times of day.\n2. Explain how the sun creates shadows and light in their environment.\n3. Predict where the sun will be in the sky at different times of the day based on observed patterns.\n4. Record observations about the sun's movement using words and simple drawings.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about the sun, light, and shadows using the photograph.\n\n**Materials:**\n- Large printout or digital display of the photograph (e.g., projector, smartboard)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or screen. Allow students 30 seconds of silent looking time before any discussion.\n\n2. **Ask these discussion questions** (pausing to allow 5-10 seconds of think time after each):\n   - \"What do you see in this picture? What is very bright?\" (Guide them to notice the bright sun and the light it creates.)\n   - \"Do you see shadows in this picture? Where are they?\" (Point out the dark shadows on the buildings and ground.)\n   - \"Why do you think some parts of the buildings are bright and some parts are dark?\" (Accept all responses; listen for ideas about light and shadows.)\n   - \"What time of day do you think this picture was taken? How can you tell?\" (Guide them to notice the sun is low in the sky—either sunrise or sunset.)\n\n3. **Wonder prompt:** \"The sun is not always in the same place in the sky. I wonder where the sun was one hour BEFORE this picture was taken? Where will it be one hour AFTER?\" \n\n4. **Record student wonderings** on chart paper to revisit later.\n\n**Transition:** \"Let's explore what happens to shadows and light when the sun moves. We're going to become scientists and watch shadows change!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how the sun's position changes throughout the day and how it affects shadows and light.\n\n**Materials:**\n- A sunny window or outdoor space (or use a flashlight if indoors on a cloudy day)\n- Small objects: wooden blocks, toy buildings, plastic cups, small toys\n- Paper and crayons\n- Tape (painter's tape preferred)\n- Flashlight (if conducting indoors without natural sunlight)\n- Timer or clock\n\n**Activity:**\n\n**Setup (Teacher-directed, 3 minutes):**\n- If outdoors: Choose a safe area near a building, sidewalk, or fence. If indoors: Set up a table near a sunny window or use a flashlight as a \"sun substitute.\"\n- Arrange students in small groups (3-4 students per group).\n\n**Student Investigation (17-20 minutes):**\n\n1. **Station 1 – Shadow Observation (5 minutes per group):**\n   - Give each group 2-3 small objects (blocks, cups, toys).\n   - Have them place the objects in the sunlight (or flashlight beam).\n   - Ask: \"What do you see? Is there a shadow? Which direction is the shadow pointing?\"\n   - Students trace or draw the shadow on paper using crayons. **Label the shadow with an arrow showing which direction it points.**\n\n2. **Station 2 – Shadow Movement (10-12 minutes per group):**\n   - Have students place one object in the same spot.\n   - **Mark the shadow's outline on the ground with tape** (or draw on paper).\n   - **Wait 5-10 minutes** and check the shadow again.\n   - Ask: \"Did the shadow move? How is it different? Is it longer or shorter? Did it move to a different side?\"\n   - Students draw the NEW shadow position on the same paper, using a different color crayon.\n   - **Record observations:** \"The shadow moved to the _____\" or \"The shadow got _____ (longer/shorter).\"\n\n**Teacher Role:** \n- Circulate among groups with guiding questions: \"What happened to the shadow?\" \"Which direction did it move?\" \"Do you think the sun moved or the object moved?\"\n- Do NOT tell them the sun is moving; let them discover this pattern.\n- Help students record with drawings and simple words/labels.\n\n**Expected Student Outcomes:**\n- Students observe that shadows change position over time.\n- Students notice shadows can get longer or shorter.\n- Students create visual records (drawings) showing shadow changes.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and explain the pattern of the sun's movement and how it creates shadows.\n\n**Materials:**\n- Chart paper and markers\n- Student drawings from Explore phase\n- Photograph (displayed again)\n- Optional: Small ball or orange to represent Earth/sun (for simple demonstration)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 2-3 groups to show their shadow drawings and describe what changed.\n   - Display all drawings on a bulletin board or wall.\n   - Guide the class to notice: \"Every group saw their shadow move. That tells us something important!\"\n\n2. **Introduce Key Concepts (10 minutes):**\n   - **Point back to the photograph.** \"This picture shows a city when the sun is LOW in the sky. The shadows are very long. The sun was not always here. The sun moves across the sky during the day.\"\n   - **Create a simple visual on chart paper:**\n     - Draw a horizon line (Earth).\n     - Draw the sun in three positions: morning (left/low), middle of day (high up), afternoon (right/low).\n     - Draw how shadows would look at each time: long shadows in morning and afternoon, short shadows at midday.\n\n3. **Teach Vocabulary (use these exact child-friendly definitions):**\n\n| **Term** | **Definition** |\n|----------|---|\n| **Sun** | A big ball of hot light in the sky that gives us light and warmth during the day. |\n| **Shadow** | A dark place made when something blocks the sun's light. |\n| **Light** | The bright rays that come from the sun. |\n| **Pattern** | Something that happens the same way over and over again. |\n| **Movement** | When something changes position or moves from one place to another. |\n\n4. **Check for Understanding:**\n   - Ask: \"If the sun moves across the sky, what do you think happens to shadows?\"\n   - \"Can shadows help us know what time of day it is?\"\n   - Have students point to where they think the sun is RIGHT NOW (look out the window together if possible).\n\n**Expected Student Outcomes:**\n- Students understand that the sun moves across the sky throughout the day.\n- Students can explain that shadows are made when sunlight is blocked.\n- Students recognize that shadow length and direction change as the sun moves.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting shadow patterns and observing the sun's actual position in their environment.\n\n**Materials:**\n- Observation journals (simple paper booklets or sheets folded in half)\n- Crayons or colored pencils\n- Clock or watch (showing simple hour positions)\n- Access to a window or outdoor space\n- Optional: Stick or straight object to mark the sun's direction\n\n**Activity:**\n\n1. **Prediction Task (7 minutes):**\n   - Show students a simple drawing: A building with the sun in one position.\n   - Ask: \"If the sun moves to THIS new position (point), draw where you think the shadow will be now.\"\n   - Students draw their predictions on a paper.\n   - Discuss predictions as a class without judgement.\n\n2. **Real-World Observation (8 minutes):**\n   - **Take students to a window or outdoors (if possible and safe).**\n   - Have them locate the actual sun in the sky (safely—no looking directly at it).\n   - Ask: \"How does today's sun position compare to the sun position in the photograph?\" (Is it higher or lower? Same or different?)\n   - If outdoors, have students look at real shadows (their own shadows, building shadows, tree shadows).\n   - Ask: \"Which direction are the shadows pointing? Are they long or short?\"\n   - Record observations in their journals with a simple drawing and label.\n\n3. **Connection to Time:**\n   - Show students an analog clock or draw one on the board.\n   - Explain: \"Morning (point to 9:00) — sun is over HERE (point left). Afternoon (point to 3:00) — sun is over HERE (point right). Night (point to 9:00 on other side) — sun is gone from our sky.\"\n   - Have students predict: \"Where will the sun be in 2 hours?\"\n\n**Teacher Role:**\n- Facilitate safe observation (sun safety rules: no staring directly at sun).\n- Ask open-ended questions to push thinking: \"Why do you think shadows are different lengths at different times?\"\n- Accept emerging ideas without judgment.\n\n**Expected Student Outcomes:**\n- Students make reasonable predictions about shadow positions.\n- Students accurately observe the current position of the sun.\n- Students begin to understand that the sun's position changes predictably throughout the day.\n- Students record observations in their journals.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of the sun's movement and its relationship to shadows.\n\n**Activity:**\n\n**Formative Assessment (Ongoing Throughout Lesson):**\n- **Observe and listen** during Explore phase: Can students describe shadow changes they observe?\n- **Check Explain phase responses:** Can students point to where the sun is and describe how it creates shadows?\n- **Review drawings and journals:** Do illustrations show evidence of understanding sun movement and shadow changes?\n\n**Exit Ticket / Summative Assessment (5-7 minutes at end of Lesson 2):**\n\nProvide each student with a simple exit ticket (paper or digital) with these prompts:\n\n1. **\"Draw the sun's path across the sky during one day. Draw where it is in the morning, afternoon, and evening.\"**\n   - **Success Criteria:** Drawing shows sun in different positions (higher or lower at different times).\n\n2. **\"In the morning, shadows are long. Why do you think that is? Use words and/or drawings.\"**\n   - **Success Criteria:** Student response mentions the sun's position is low/different in the morning, creating long shadows. Accept emerging explanations (e.g., \"The sun is low,\" \"The sun is on the side\").\n\n3. **\"If you see a long shadow, what time of day might it be? Why?\"**\n   - **Success Criteria:** Student identifies morning or afternoon/sunset and makes a connection to sun position (e.g., \"Morning because the sun is not high up yet\").\n\n**Scoring Guide:**\n- **Meets Expectation:** Student answers show clear understanding that the sun's position changes throughout the day and that this affects shadow length and direction.\n- **Developing:** Student shows partial understanding (e.g., knows shadows change but not clearly why, or knows sun moves but not the pattern).\n- **Beginning:** Student shows minimal understanding; may need additional hands-on exploration and direct instruction.\n\n**Expected Student Outcomes:**\n- 80% of students can accurately draw or describe the sun's movement across the sky.\n- 75% of students can explain a connection between sun position and shadow length.\n- All students have observed and documented shadows in their environment.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Vocabulary:** Use only \"sun,\" \"shadow,\" and \"light\" during instruction. Introduce \"pattern\" and \"movement\" in later lessons.\n\n2. **Guided Shadow Tracing:** Provide pre-drawn shadow outlines on paper, and have students trace them with markers instead of creating original drawings. This reduces the drawing demand while keeping the observation intact.\n\n3. **Concrete Sun Position Model:** Use a ball or orange on a stick to physically show how the sun appears in different sky positions. Move it slowly while students watch their own shadows change. Many kinesthetic learners will understand better with this multi-sensory approach.\n\n4. **Picture Cards:** Create simple picture cards showing sun positions (low sun = morning/evening; high sun = noon). Have students match current observations to cards rather than create independent drawings.\n\n### Challenge (For Advanced Learners)\n\n1. **Time Prediction:** Challenge students to predict the exact time of day based on a shadow photograph. Ask: \"If we know shadows point east in the morning, which direction will this shadow point at 3 PM?\" Introduce compass directions carefully if students are ready.\n\n2. **Shadow Length Measurement:** Provide non-standard measurement tools (blocks, craft sticks, hand spans) and have students measure shadows at different times. Graph results: \"Does the shadow get longer or shorter as time passes?\" This introduces data collection and graphing.\n\n3. **Design a Sundial:** Show students a picture of a simple sundial. Discuss: \"Can we use the sun to tell time? How?\" Provide materials (paper plate, straw, markers) and have them create a simple shadow clock, testing it throughout the day.\n\n4. **Nighttime Observations:** Extend to moon observations (NGSS 1-ESS1-1). Ask: \"We learned the sun moves during the day. What happens at night? Does the moon move too?\" Assign homework to observe and sketch the moon's position on multiple nights.\n\n---\n\n## Extension Activities\n\n1. **\"Sun Journal\" Homework Project (1-2 weeks):**\n   - Send home a simple packet with one observation sheet per day.\n   - Each day, students draw the sun's position in the sky and describe the shadows they see (at home, playground, walking to school).\n   - Students return sheets and create a class display showing the pattern of sun movement over time.\n   - This reinforces NGSS 1-ESS1-2 (observations at different times relate to daylight).\n\n2. **Shadow Art Activity:**\n   - Students use shadows and the sun to create art by tracing shadows of hand shapes, leaves, or toys on dark paper.\n   - Display with labels: \"Morning shadows,\" \"Noon shadows,\" \"Afternoon shadows.\"\n   - Discuss: \"Why do different times make different-looking shadows?\"\n\n3. **Sun Safety & Daylight Hours Exploration:**\n   - Connect to real-world application: Discuss why we need sunscreen and wear hats during summer (when sun is high and strong).\n   - Simple graph: \"How many hours of daylight do we have now vs. in winter?\" (Connect to NGSS 1-ESS1-2 about relating daylight to time of year—scaffolds for later understanding).\n   - Read aloud: Simple books like *The Sun* by Seymour Simon or *Sun Up, Sun Down* by Gail Gibbons.\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety First:** If observing the sun outdoors, never allow students to look directly at it. Use a \"shadow method\" (watch shadows on the ground) instead of viewing the sun itself.\n- **Weather Contingency:** If the day is cloudy, use a bright flashlight indoors as a substitute \"sun.\" The physics of shadows works the same way.\n- **Timing:** This lesson is most effective when taught over TWO days so students can observe actual shadow changes. If time-pressed, the flashlight activity can demonstrate the concept in one 45-minute session.\n- **Pacing:** First graders learn best with concrete, repeated observations. Plan to revisit this concept throughout the year (different seasons, different times of day).\n- **Real-World Connection:** Many first graders are curious about their own shadows. Leverage this natural interest by making shadow play a regular outdoor activity during recess.\n\n---\n\nThis lesson directly uses the photograph's visual evidence of sun position and shadow creation to build NGSS-aligned earth and space science understanding appropriate for First Grade. Every activity flows from observation to explanation to application, honoring the 5E model and ensuring students construct their own understanding of the sun's apparent movement.",
  "inputTokens": 2319,
  "outputTokens": 4047,
  "cost": 0.022553999999999998,
  "generatedAt": "2026-02-12T22:13:31.777Z"
}