{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "e01.jpeg",
  "imagePath": "images/earth-space-science/e01.jpeg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Landforms and Built Structures\n\n## Core Science Concepts from Image Analysis\n\n- **Landforms and Human Structures:** The photograph shows tall buildings constructed on land near water, demonstrating how humans use and shape the land and how buildings are built on natural landforms (earth surface).\n- **Water Bodies:** A river or waterway is visible in the foreground, showing that water is found on Earth and is a liquid that flows through communities.\n- **Natural vs. Human-Made Shapes:** The contrast between the natural landscape (trees, water, grass) and the geometric shapes of buildings illustrates how land can be changed or built upon.\n- **Erosion and Water Interaction:** The water's presence near buildings and natural vegetation suggests how water and land interact, connecting to concepts of erosion and land change over time.\n\n---\n\n## Lesson Title\n\n**Our Land, Our Waterways: How Humans Build on Earth**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (80 minutes total)\n- **NGSS Standards:** \n  - 2-ESS2-2: Develop a model to represent the shapes and kinds of land and bodies of water in an area.\n  - 2-ESS2-3: Obtain information to identify where water is found on Earth and that it can be solid or liquid.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n- Identify and name different types of landforms (land, water, hills, flat areas) visible in a photograph of a city landscape.\n- Describe where water is found in their community and explain that water is a liquid.\n- Create a model or drawing showing both natural landforms (water, trees, grass) and human-made structures (buildings) in their area.\n- Explain in simple terms how buildings are built on the land and why water is important to communities.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about land, water, and buildings in their communities.\n\n**Materials:**\n- Large color printout of the photograph (or display on interactive board)\n- Chart paper and markers\n- Student journals or paper\n\n**Activity:**\n\n1. **Display the Photograph:** Show the image without explanation. Tell students: \"Look at this picture carefully. What do you see?\"\n\n2. **Discussion Questions (Ask one at a time, allow 1-2 minutes per question):**\n   - \"What do you see in this picture? Tell me everything you notice.\" (Listen for: buildings, water, trees, sky, bridge)\n   - \"Where do you think this place is? Is it a city, a farm, or somewhere else? How do you know?\" (Guide them to notice many buildings = city)\n   - \"I see water in this picture. Can you find the water? What shape is it?\" (Help students locate the river/waterway)\n   - \"Do you see tall buildings and short trees? Why do you think the buildings are so tall?\" (Elicit: people built them, lots of people live there)\n\n3. **Wonder Prompt:** \"I wonder... if we could build something right where that water is, what would happen? Who has an idea?\" (Do NOT answer—just collect wonderings on chart paper.)\n\n4. **Student Think-Pair-Share:** Have students turn to a partner and finish this sentence: \"In my town/city, I see ___ (land/water/buildings).\"\n\n**Transition:** \"Today we're going to explore the land and water near where people build, just like in this picture!\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate landforms and water in their community through observation and model-building.\n\n**Materials:**\n- Shallow plastic trays or disposable aluminum pans (1 per pair/group of 3)\n- Sand or soil (2-3 cups per tray)\n- Blue water or blue-colored water (1 cup per tray)\n- Small toy buildings or blocks\n- Small plastic trees or twigs\n- Spoons for shaping\n- Paper towels\n- Observation sheets (provided below) or student journals\n\n**Activity - Hands-On Model Building:**\n\n1. **Setup (5 minutes):** Divide students into pairs or small groups. Give each group a tray, sand/soil, and materials. Demonstrate BEFORE students begin:\n   - \"Watch me make a model of land and water. First, I'll spread sand in my tray. This is the land.\"\n   - Mound some sand. \"I can make hills on the land!\"\n   - Pour water slowly. \"Now I'll add water. See how it flows to the low spots? This is like a river!\"\n   - Place a small block. \"Here's a building on the land.\"\n\n2. **Student Directions (Deliver clearly and simply):**\n   - \"Spread your sand to cover the bottom of your tray.\"\n   - \"Make at least one hill and one flat area with your sand.\"\n   - \"Carefully pour your water. Watch where it goes! The water will flow to the lower spots.\"\n   - \"Once your water settles, place your buildings and trees on the land areas—NOT in the water!\"\n   - \"You have 10 minutes to build and explore your model.\"\n\n3. **Guided Exploration (7 minutes):**\n   - Circulate with guiding questions (do NOT tell students answers):\n     - \"Where did your water flow? Why do you think it went there?\"\n     - \"Did your buildings stay dry? Where did you place them?\"\n     - \"What happens if you pour more water? Show me and tell me what you observe.\"\n     - \"Can you point to the high land and the low land?\"\n\n4. **Documentation (5 minutes):**\n   - Have students draw or write in their journals: \"Draw your land and water model. Show where the water went and where you put the buildings.\"\n   - Alternatively, provide a simple observation sheet:\n     - *Draw your model.*\n     - *Where is the water?*\n     - *Where are the buildings?*\n     - *Is the land high or low where the buildings are?*\n\n5. **Clean-Up (5 minutes):** Students carefully drain water (provide paper towels), return materials to bins.\n\n**Teacher Role:**\n- Observe without immediately correcting or helping.\n- Ask questions that prompt thinking: \"What do you notice?\" \"Why do you think that happened?\" \"What would happen if...?\"\n- Encourage risk-taking: \"Try it and see what happens!\"\n- Ensure safety: monitor water handling and trays to prevent spills.\n\n**Expected Student Outcomes:**\n- Students discover that water flows downhill and settles in low areas.\n- Students realize that buildings should be on higher, drier land.\n- Students create a 3D representation of landscape features (hills, flat areas, water, buildings).\n- Students produce drawings/notes showing their observations.\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to Earth science concepts.\n\n**Materials:**\n- Chart paper with vocabulary words and pictures\n- The original photograph (displayed again)\n- Student journals\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3-4 volunteers to share their model with the class in 30 seconds each.\n   - After each share, ask the class: \"What do you notice about where the water went in their model?\" \"Where did they put buildings?\"\n   - Listen for student language (e.g., \"water went down,\" \"buildings on the dry part\").\n\n2. **Introduce Vocabulary (7 minutes):**\n   Present each term with a picture/example. Write on chart paper and display for the week.\n\n   **Vocabulary:**\n   - **Landform:** The shape of the land. Examples: hills, mountains, flat land, valleys. (Point to hills in the tray models and the photograph.)\n   - **Water/Waterway:** A body of water where water is found on Earth. Examples: rivers, lakes, streams. Water is a **liquid** (it flows and can be poured). (Show water in models and the river in the photograph.)\n   - **Community:** A place where people live and work together. (Show the city in the photograph: \"This is a community with many buildings and a waterway.\")\n   - **Model:** A small copy of something real that helps us learn. (Point to their sand trays: \"Your tray is a model of a real place!\")\n\n3. **Connect Back to the Photograph (4 minutes):**\n   - Redisplay the city photo. Point and narrate:\n     - \"In this photograph, we see a **community** with many buildings. The land is different shapes—some higher, some lower. See the **waterway** flowing through? It's a **liquid** (flowing water). The people who built this city knew to build their buildings on the land, not in the water!\"\n     - \"This **landform** has flat areas for buildings and a river for water. Just like your models!\"\n\n4. **Check for Understanding (2 minutes):**\n   - Ask (whole group, thumbs up/down responses):\n     - \"Is water a liquid? Show me thumbs up!\"\n     - \"Can you point to a waterway in this picture?\" (Have students point to the river)\n     - \"Where would you build a house—on the high land or in the water?\" (Expect: on high land, it's dry, safer)\n\n**Expected Student Outcomes:**\n- Students use vocabulary: landform, water, waterway, liquid, community, model.\n- Students can identify a waterway and describe it as liquid water.\n- Students understand why communities are built on land (not in water) and recognize that water flows and collects in low areas.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Students apply concepts by investigating water movement and predicting landform changes.\n\n**Materials:**\n- Same sand/water tray models from Explore (or rebuild if needed)\n- Spray bottles filled with water\n- Small cups of water\n- Spoons\n- Paper towels\n- Chart paper titled \"What Happens to Land and Water?\"\n- Observation sheets or journals\n\n**Activity - Water Movement Investigation:**\n\n1. **Scenario Introduction (2 minutes):**\n   - Show the photograph again. Say: \"In a real city with a river, sometimes it rains a lot. Water comes down from the sky. What do you think happens to the land when there's lots of water? Let's investigate!\"\n\n2. **Guided Investigation (10 minutes):**\n   - **Step 1:** Have students look at their model. Ask: \"Where is the water now?\"\n   - **Step 2:** \"Now we're going to simulate rain. I'll spray water on the land. Watch what happens to the sand, the buildings, and the water.\"\n   - Demonstrate with your own tray first: Lightly spray water on the high areas and let students observe it flowing downward.\n   - **Step 3:** Ask: \"What did the water do? Did it change the land? Did the buildings move?\"\n   - **Step 4:** Students try with a spray bottle on their own models (light spray, 5-10 seconds). They observe and discuss with a partner.\n   - **Step 5:** Record observations on a class chart:\n     - \"Water from rain flows downhill.\" ✓\n     - \"Water can wash away small bits of sand.\" ✓\n     - \"Buildings on high land stay safer.\" ✓\n\n3. **Real-World Connection (4 minutes):**\n   - Discuss: \"In real cities, when it rains, water runs down streets toward rivers and storm drains. The city is built with this in mind. Buildings are not in the water path!\"\n   - Ask: \"Have you ever seen water flow down a street after rain? Where did it go?\"\n\n4. **Extension Discussion (2 minutes):**\n   - \"The river in this photograph is real water, not like our model. It flows all the time! People in the city use this water and protect it. Why is water important to a community?\" (Elicit: drinking, food, transportation, beauty)\n\n**Teacher Role:**\n- Model careful observation.\n- Ask: \"What changed?\" \"What stayed the same?\" \"Why do you think that happened?\"\n- Validate student discoveries: \"You noticed the water flows to low spots, just like real water!\"\n- Encourage predictions: \"What do you think will happen if...?\"\n\n**Expected Student Outcomes:**\n- Students observe that water moves downhill and can reshape land over time.\n- Students understand that buildings are built on higher, safer land.\n- Students deepen understanding of the relationship between landforms, water, and human communities.\n- Students produce written or drawn observations of water movement.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of landforms, water, and how communities are built.\n\n**Activity - Three-Part Assessment:**\n\n#### Formative Assessment (Ongoing—Documented During Lesson):\n- **Observation Checklist** (Teacher uses during Explore and Elaborate):\n  - ☐ Student identifies water in the model/photograph\n  - ☐ Student names or points to a landform (hill, flat area, etc.)\n  - ☐ Student explains where water flows (to low areas)\n  - ☐ Student describes why buildings are not built in water\n  \n- **Student Responses to Guiding Questions:**\n  - Listen to how students answer: \"Where did your water go?\" \"Why do buildings go on high land?\"\n  - Record 1-2 student quotes as evidence.\n\n#### Exit Ticket / Summative Assessment (5-10 minutes):\nProvide one of the following (or both, depending on student abilities):\n\n**Option A - Drawing + Labeling (Visual Learners):**\nStudents receive a large piece of paper with the prompt:\n- \"Draw a community with land, water, and buildings. Label: LAND, WATER, BUILDING. Show where water flows.\"\n\n**Option B - Spoken Responses (Verbal Learners):**\nConduct brief 1-on-1 check-ins with 5-6 students using these prompts:\n1. \"Point to the water in this picture. Is water a liquid or a solid?\"\n2. \"Where would you build a house—on a hill or in a river? Why?\"\n3. \"What is a landform? Can you give me an example?\"\n\n**Option C - Simple Written Responses (Emerging Writers):**\nStudents fill in sentences in their journals:\n- \"A landform is ___.\"\n- \"Water is a ___ (liquid or solid).\"\n- \"I would build a building on ___ (high land or low land) because ___.\"\n\n#### Success Criteria:\n**Students demonstrate understanding if they:**\n- Accurately identify water as a liquid in at least one context (model, photograph, or discussion).\n- Point to or name at least two landforms (hill, flat area, river, etc.).\n- Explain that water flows to low areas and that buildings should be on high, dry land (may be in words or shown through their model).\n- Use or understand vocabulary: landform, water, waterway, liquid, community.\n\n**How to Determine if Students Met Objectives:**\n- 80%+ of students correctly label or identify landforms and water in their drawings/exit tickets.\n- In class discussions, students can answer: \"Is water a liquid?\" and \"Why are buildings not built in rivers?\"\n- Students' models show water in low areas and buildings on high land, indicating conceptual understanding.\n- Observation notes show students asked questions and made connections (e.g., \"The water goes down just like rain!\").\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners):\n\n1. **Simplified Vocabulary:** Use only **land, water, and building** if full vocabulary list is overwhelming. Introduce landform and waterway after mastery of basics.\n\n2. **Guided Model-Building:** Pair struggling students with a peer partner or provide step-by-step photo cards showing how to build the model (mound sand → pour water → place buildings).\n\n3. **Sentence Stems for Responses:** Provide sentence starters for exit tickets:\n   - \"The water went to ___ (high/low) places.\"\n   - \"Buildings should be on ___ land because it is ___.\"\n   - (Teacher writes on board; students point or fill in)\n\n4. **One-on-One Check-In:** Conduct individual verbal assessments instead of written exit tickets, with yes/no or pointing-based questions.\n\n### Challenge (For Advanced Learners):\n\n1. **Extended Investigation:** \"What if it rained for a long time? Use a spray bottle to gently spray your model several times. What happens to the hills? Can water change the shape of land over time?\" (Introduces concept of erosion for acceleration into Grade 3-4 standards.)\n\n2. **Real-World Research:** Provide picture cards of different communities (mountain town, desert town, coastal city, etc.). Ask: \"How is the land different in each place? Where is the water? How would buildings be different?\" Students match communities to landform types.\n\n3. **Model Expansion:** \"Add more buildings, bridges, or roads to your model. Where would you put them to keep them safe from water? Draw a city plan on paper showing your ideas.\"\n\n4. **Question Exploration:** \"Why do you think people build cities near rivers?\" (Elicit: water for drinking, transportation, food, power.) Have students brainstorm other reasons.\n\n---\n\n## Extension Activities\n\n1. **Community Walk & Observation (Homework or Field Trip):**\n   - Take students on a walk around the school or neighborhood (if safe and feasible).\n   - Point out real landforms: hills, flat areas, trees, buildings.\n   - If there's a creek, pond, or water feature, observe it safely from a distance.\n   - Have students collect pictures or draw what they see and bring back to class.\n   - Create a class book: *\"Landforms in Our Community.\"*\n\n2. **Water Cycle Mini-Lesson (Follow-Up Session):**\n   - Extend to 2-ESS2-3 (water on Earth can be solid or liquid).\n   - Ask: \"Where does water go when it rains? Does it disappear?\" \n   - Simple demo: Leave a cup of water on the windowsill; observe daily and discuss evaporation in student-friendly terms (\"The sun's heat makes water go up into the air\").\n   - Connect to the river in the photograph: \"Rivers have water, but some water goes back into the sky!\"\n\n3. **Building Design Challenge (STEM Integration):**\n   - Provide blocks, craft materials, or clay.\n   - Prompt: \"Design a building that would NOT get wet if there was a flood. What would you do? Build it or draw it!\"\n   - Students design elevated structures, sloped roofs, or flood barriers (introduces engineering and problem-solving).\n   - Discuss: \"Real cities have drainage systems and flood walls to protect buildings and people, just like your designs!\"\n\n---\n\n## Teacher Notes & Tips\n\n- **Photograph Connection:** Revisit the city photograph multiple times throughout the lesson. Students benefit from repeated exposure to anchor their learning to a real-world example.\n  \n- **Safety:** Supervise water and sand activities closely. Have paper towels on hand for spills. Consider using washable materials and designate a cleanup station.\n\n- **Vocabulary Anchor Chart:** Create and display the vocabulary chart for the entire week. Point to it daily. Take a photo of it for your classroom documentation.\n\n- **Inclusive Language:** Acknowledge that not all students live in cities or near rivers. Use the word \"community\" broadly: \"Whether you live near a river or in a dry place, there's water somewhere in your community—maybe a well, a lake, or pipes bringing water from far away!\"\n\n- **Assessment Flexibility:** If students cannot write, accept drawings, pointing, or verbal responses. Second-graders are developing writing skills; prioritize conceptual understanding and verbal explanation.\n\n---\n\nThis lesson honors the photograph's central themes—the interplay between natural landforms (water, vegetation, hills) and human-built structures in a community—while maintaining rigorous, grade-appropriate NGSS alignment. Students move from concrete exploration to abstract vocabulary and back to application, embodying the full 5E cycle.",
  "inputTokens": 2379,
  "outputTokens": 4711,
  "cost": 0.025934,
  "generatedAt": "2026-02-12T22:14:24.420Z"
}