{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "e01.jpeg",
  "imagePath": "images/earth-space-science/e01.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: How Do Cities Grow? Buildings, Weather, and Seasons\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Urban landscapes as human-made features:** Cities contain many tall buildings and structures that show how people shape the land and environment.\n- **Weather observation and seasonal changes:** The photograph shows clear skies, trees with visible foliage, and natural lighting patterns that indicate a specific season and typical weather conditions.\n- **Natural resources and materials:** The buildings visible in the photograph are constructed from materials (metal, glass, concrete) that come from natural resources found in Earth.\n- **Interaction between natural and built environments:** The trees and river visible in the foreground show how natural features exist alongside human-made structures in urban areas.\n\n---\n\n## Lesson Title\n\n**Skyline Science: How Weather Shapes Our Cities**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions or one 90-minute block\n- **NGSS Standards:** \n  - 3-ESS2-1: Represent data in tables and graphical displays to describe typical weather conditions expected during a particular season.\n  - 3-ESS3-1: Make a claim about the design solution that reduces the impacts of a weather-related hazard.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe typical weather conditions shown in an urban photograph and identify which season it might be.\n2. Explain how weather can affect tall buildings and the people who live and work in cities.\n3. Design and sketch a building feature that would protect a city from extreme weather.\n4. Collect and organize weather data in a simple table to compare different seasons.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about cities, weather, and buildings using the photograph.\n\n**Materials:**\n- Large printed photograph (or projected on screen)\n- Chart paper and markers\n- Chart titled \"What I Notice, What I Wonder\"\n\n**Activity:**\n\n1. **Display and Introduce:** Project or display the photograph large enough for all students to see clearly. Say: \"Today we're looking at a real city. I want you to look carefully for a few minutes and think about what you see.\"\n\n2. **Specific Discussion Questions:**\n   - \"What do you see in this picture? Can you name some things?\" *(Accept: buildings, trees, sky, river/water, bridge, roads)*\n   - \"How do you think the weather looks on this day? What makes you think that?\" *(Guide them to notice: blue sky, clear visibility, good lighting)*\n   - \"Do you see any plants or nature? Where?\" *(Trees in the foreground, river)*\n   - \"What season do you think this photograph was taken in? What clues help you decide?\" *(Sunlight angle, tree appearance, color of light)*\n\n3. **Wonder Prompt:** Hold up the photograph and ask: \"If a big storm came to this city—with heavy rain and strong wind—what might happen to all these tall buildings? How do you think the buildings stay safe?\"\n\n4. **Record Thinking:** Create a two-column chart on paper titled \"What I Know About Cities\" and \"What I Want to Learn.\" Write 2–3 student responses in each column.\n\n**Transition:** \"You've asked great questions about cities and weather. Now let's explore how weather affects buildings and cities. We're going to do an experiment with towers!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate how weather conditions (wind and rain) affect structures through hands-on model building and testing.\n\n**Materials:**\n- Per group (4 students): \n  - 10–12 plastic cups (same size)\n  - Masking tape\n  - One small paper cup or container\n  - Water in a spray bottle\n  - Markers\n  - Ruler\n  - Straw or stick to simulate wind\n  - Newspaper (to protect table)\n  - Recording sheet (see below)\n\n**Activity:**\n\n1. **Build Phase (5 minutes):**\n   - Divide class into groups of 4. Hand each group a stack of plastic cups.\n   - Give clear instructions: \"Stack your cups on top of each other, one by one. Use masking tape to hold them together. Make a tower that is as tall as you can make it. This is your 'city building.'\"\n   - Circulate to ensure all groups create a tower at least 8–10 cups high.\n   - Have groups draw windows on their cups with markers to make them look like buildings.\n\n2. **Test Phase (10 minutes):**\n   - Once towers are built, say: \"Now we're going to test how weather affects our buildings.\"\n   - **Rain Test:** Lightly spray water at the towers with a spray bottle. Ask: \"What happens? Does water damage our building?\"\n   - **Wind Test:** Use a straw or stick to gently \"blow wind\" at the tower by pushing against it. Ask: \"What happens when wind hits the building? Does it fall over? Can it sway?\"\n   - Have groups test their towers and observe what happens.\n\n3. **Redesign Phase (7 minutes):**\n   - Say: \"Now you know what happens in weather. Let's make our buildings stronger!\"\n   - Ask: \"What can we add to make it stand better in wind? What could protect it from rain?\"\n   - Students may suggest: tape more cups together, build a wider base, add supports, create a slanted roof, etc.\n   - Give groups 5–7 minutes to redesign and rebuild ONE feature of their tower.\n   - Retest with \"wind\" and \"rain.\"\n\n4. **Recording:**\n   Provide a simple observation sheet:\n   ```\n   Our Building Test Results\n   \n   Before we fixed it:\n   Wind test: Did it fall over? Yes / No / A little\n   Rain test: Did water hurt it? Yes / No / A little\n   \n   After we fixed it:\n   Wind test: Did it fall over? Yes / No / A little\n   Rain test: Did water hurt it? Yes / No / A little\n   \n   What did we change? _________________________\n   ```\n\n**Teacher Role:**\n- Circulate to each group and ask guiding questions: \"What do you notice happening? Why do you think that happened? What could make it stronger?\"\n- Do NOT tell students what to do; instead, ask them to predict and observe.\n- Help groups record their observations by asking them to tell you what they see (you write it down if needed).\n\n**Expected Student Outcomes:**\n- Students discover that tall, narrow towers fall more easily in \"wind.\"\n- Students observe that water can seep through gaps.\n- Students generate at least one design idea to improve their building (wider base, more tape, etc.).\n- Each group completes a simple observation chart showing \"before and after\" their redesign.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect exploration to the photograph and real-world building design.\n\n**Materials:**\n- Original photograph (displayed large)\n- Chart paper\n- Vocabulary cards with images (see below)\n- Picture cards of real buildings with design features (optional)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask each group: \"What did you change to make your building stronger? Show us!\" \n   - Have 2–3 groups demonstrate or explain their changes.\n   - List their ideas on chart paper (e.g., \"wider base,\" \"more tape,\" \"diagonal supports\").\n\n2. **Connect to the Photograph (3 minutes):**\n   - Point to the original photograph and say: \"Look at the real buildings in this city. Do you notice anything about how they're built?\"\n   - Guide students to observe: tall buildings have wide bases, they have many windows (which are strong), they stand next to other buildings (for support).\n   - Say: \"Engineers and architects design buildings to be strong so they don't get damaged by storms, wind, and rain—just like you did in your experiment!\"\n\n3. **Introduce Key Vocabulary (5 minutes):**\n   - Teach vocabulary with student-friendly definitions using images or gestures:\n\n   | **Term** | **Student-Friendly Definition** |\n   |----------|--------------------------------|\n   | **Weather** | The conditions outside—like if it's sunny, rainy, windy, or cold. |\n   | **Structure** | Something that is built or constructed, like a building. |\n   | **Design** | A plan for how something will be made and how it will look. |\n   | **Foundation** | The bottom part of a building that holds it up and keeps it strong. |\n   | **Season** | A time of year with typical weather—spring, summer, fall, and winter. |\n\n   - Use the photograph to point out each term: \"This photograph shows buildings [structures] on a day with clear, sunny weather. The buildings were designed to stay up even in strong storms.\"\n\n4. **Check for Understanding (2 minutes):**\n   - Ask individual students: \n     - \"What is a structure?\" (Call on 1–2 students)\n     - \"Why do we design buildings with strong foundations?\" (Accept: to keep them from falling, to handle wind and rain, to be safe)\n     - Point to trees in photo: \"What season does the weather look like? What clue tells you?\"\n\n**Vocabulary:**\n- **Weather:** The conditions outside—sunny, rainy, windy, hot, cold, etc.\n- **Structure:** Something that is built to stand up, like a building, bridge, or tower.\n- **Design:** A plan that shows how something will be made.\n- **Foundation:** The base or bottom of a building that keeps it strong and standing.\n- **Season:** A time of year with certain kinds of weather—spring, summer, fall, winter.\n\n**Expected Student Outcomes:**\n- Students understand that buildings are designed on purpose to handle weather.\n- Students can name at least two ways buildings are made stronger (wide base, strong materials, etc.).\n- Students understand the connection between their experiment and real-world building design.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply design thinking to create a solution that protects a city from weather hazards.\n\n**Materials:**\n- Blank paper (8.5\" × 11\")\n- Colored pencils, markers, crayons\n- Rulers\n- Optional: pictures of different building designs (skyscrapers, houses, bridges with different features)\n- Chart: \"Building Features That Help in Weather\"\n\n**Activity:**\n\n1. **Present a Design Challenge (2 minutes):**\n   - Say: \"A city is getting ready for a very bad storm. Heavy rain and strong wind are coming. City leaders are asking engineers to design a NEW building that will be extra safe. Your job is to design a building that will NOT get damaged by the storm.\"\n\n2. **Brainstorm Features (3 minutes):**\n   - Ask: \"What does a building need to handle a bad storm? Think about what you learned from your cup tower.\"\n   - Record ideas on a chart:\n     - Strong, wide foundation (so it doesn't tip over in wind)\n     - Slanted roof (so water slides off)\n     - Strong walls (thick, good materials)\n     - Wide base (to stay stable)\n     - Windows that are protected\n     - Located away from water (like rivers)\n\n3. **Individual Design (8 minutes):**\n   - Give each student a blank paper.\n   - Say: \"Draw a building that you think would stay safe in a big storm. You can use colors. Write or label one thing that makes it safe.\"\n   - Students sketch a building and label one safety feature (e.g., \"wide base,\" \"slanted roof to keep water out,\" \"strong walls\").\n\n4. **Share and Explain (2 minutes):**\n   - Invite 3–4 volunteers to show their design and explain: \"What makes your building safe? Why did you choose that design?\"\n   - Affirm student thinking: \"That's a great design choice because...\"\n\n**Teacher Role:**\n- Circulate while students draw and ask: \"Tell me about your building. What does it do to stay safe in storms?\"\n- Use a clipboard to note students who can articulate a design reason vs. those who may need more support.\n- Encourage all students—all designs are learning opportunities.\n\n**Expected Student Outcomes:**\n- Each student creates a sketch of a weather-resistant building.\n- Each student can explain at least one design feature and why it helps (e.g., \"The slanted roof lets water slide off so it doesn't get inside\").\n- Students demonstrate application of learning from the Explore and Explain phases.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of weather, building design, and real-world application.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- Observation checklist during Explore phase: Did students observe and test their towers? Did they redesign based on observations?\n- Listen for vocabulary use during group discussions: Can students use \"weather,\" \"structure,\" \"design,\" \"foundation\" appropriately?\n- Review observation sheets from Explore: Are comparisons clear? Do descriptions make sense?\n\n**Summative Assessment — Exit Ticket (5–7 minutes):**\n\nProvide each student with a simple exit ticket (written or oral). Read questions aloud; students can draw or write responses.\n\n**Exit Ticket Questions:**\n\n1. **Look at this photograph of a city. What does the weather look like today?** (Circle or draw: sunny / rainy / windy / snowy)\n\n2. **Why do you think tall buildings have wide, strong bases?** (Student response should reference: to stay up in wind, to be safe, to be strong)\n\n3. **If you could design ONE thing to make a building safer in storms, what would it be?** (Student draws or writes: slanted roof, wide base, strong walls, etc., and why)\n\n**Success Criteria — Students show understanding if they:**\n- Can describe the weather in a photograph using words like sunny, rainy, windy, or identify a season.\n- Can explain at least one reason buildings are designed a certain way (to handle wind, rain, safety).\n- Can generate and describe one design feature that protects a building from weather.\n\n**How to Determine if Learning Objectives Were Met:**\n\n| **Learning Objective** | **Evidence of Success** |\n|------------------------|------------------------|\n| Observe and describe typical weather and identify season | Student identifies weather condition and gives at least one clue (e.g., \"It's sunny because the sky is blue,\" \"It looks like fall because trees have leaves\") |\n| Explain how weather affects buildings | Student states that wind can knock buildings over, rain can seep in, or storms can damage buildings; mentions that buildings are designed to handle this |\n| Design a building feature that protects from weather | Student sketches or describes a feature (roof, base, walls) and explains its purpose in simple language |\n| Collect and organize weather data in a table | Student completes a before/after table from Explore phase with observations about their tower |\n\n---\n\n## Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Vocabulary Cards with Pictures:** Provide printed cards with drawings of each vocabulary term (weather, structure, foundation, season, design). Students can point to or use cards during discussions rather than always retrieving from memory.\n\n2. **Guided Redesign:** During Explore, sit with this group and ask focused questions: \"What happened to the building when we blew wind? What's one way we could make it NOT fall over?\" Write or draw their idea together, then have them attempt the change.\n\n3. **Simplified Exit Ticket:** Offer a picture-based exit ticket where students circle or point to answers instead of writing (e.g., \"Is the weather sunny or rainy?\" with two picture choices).\n\n**Challenge (For Advanced Learners):**\n\n1. **Engineering Constraints:** Give advanced students a more complex design challenge: \"Design a building that is tall AND stays safe in wind AND has room for 100 people inside. What's tricky about this?\" Encourage them to sketch and label multiple design features (foundation, height limits, shape, placement).\n\n2. **Weather Data Collection:** Provide a simple weather table for the week and have students record daily conditions (sunny, cloudy, rainy, temperature). They can graph the data and predict: \"What kind of buildings would work best for this city's typical weather?\"\n\n3. **Presentation:** Invite advanced students to explain their design to a partner using technical language: \"I designed a structure with a strong foundation and a sloped roof because wind and precipitation are weather hazards in cities.\"\n\n---\n\n## Extension Activities\n\n**Extension 1: Seasonal Weather Chart**\n- Over the next week, have students record the weather each day (sunny, cloudy, rainy, temperature) on a classroom chart. At the end of the week, create a simple bar graph showing which type of weather happened most often. Discuss: \"This is the typical weather for [fall/winter/spring/summer]. How might buildings be designed differently for different seasons?\"\n\n**Extension 2: Architect's Portfolio**\n- Have students create a \"building design portfolio\" folder where they sketch 2–3 different buildings for different purposes (a school, a library, a home) and explain how each one is designed for the weather in your city. Display portfolios in the hallway with the prompt: \"What makes a good building design?\"\n\n**Extension 3: Interview an Expert**\n- Invite a local architect, engineer, or contractor to visit the classroom (virtually or in person) to talk about how they design buildings to stay safe in storms. Students prepare one question each in advance (e.g., \"Why do some roofs have a certain shape?\"). Create a thank-you card with drawings from the class.\n\n---\n\n## Teacher Notes\n\nThis lesson uses the photograph as an anchor to real-world understanding: students see a real city and recognize that the buildings they observe were designed intentionally. The Explore phase lets them *experience* why design matters through direct testing of their own structures—a powerful way for Third Graders to understand cause and effect. The photograph is revisited in the Explain phase to deepen connections between their experiment and actual engineering.\n\nThe lesson aligns with 3-ESS2-1 by having students observe and describe weather conditions in the photograph, and with 3-ESS3-1 by having students propose and sketch design solutions that reduce weather hazards. The vocabulary is intentionally simple and reinforced through images, gestures, and repeated use.",
  "inputTokens": 2350,
  "outputTokens": 4291,
  "cost": 0.023805000000000003,
  "generatedAt": "2026-02-12T22:15:09.147Z"
}