{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "e01.jpeg",
  "imagePath": "images/earth-space-science/e01.jpeg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Urban Buildings and the Land They Live On\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Human-made structures and land use:** Buildings are constructed on Earth's land to meet human needs for shelter and work spaces.\n- **Natural resources in the environment:** The photograph shows a city landscape where humans have used and transformed the natural environment (clearing land, mining materials for construction).\n- **Weather and the sky:** The clear sky and sunlight visible in the image connect to daily weather observations and how weather affects our world.\n- **Living things in urban environments:** Plants and trees are visible alongside buildings, showing how plants and animals adapt to human-changed environments.\n\n---\n\n## Lesson Title\n\n**Where Do Our Buildings Come From? Exploring the Land Beneath the City**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (or two days of flexible scheduling)\n- **NGSS Standards:** \n  - K-ESS2-2 (Construct an argument for how plants and animals, including humans, can change the environment to meet their needs)\n  - K-ESS3-1 (Use a model to represent the relationship between the needs of different plants and animals and the places they live)\n  - K-ESS3-3 (Communicate solutions that will reduce the impact of humans on the land)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Identify** that buildings are made by people and take up space on the land where plants and animals live.\n2. **Explain** that humans change the environment by building structures to meet their needs (like homes and places to work).\n3. **Observe and describe** how the natural environment (plants, trees, water) exists alongside human-made structures.\n4. **Suggest** simple ways that people can protect the land and plants when building or living in cities.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about buildings and the land using the photograph.\n\n**Materials:**\n- Large printed color copy of the photograph (or display via projector)\n- Chart paper and markers\n- Pointer or stick for directing attention\n\n**Activity:**\n\n**Display & Introduction:**\nProject or display the photograph large enough for all students to see clearly. Say: \"Look at this picture! I'm going to show you something that is very tall and made by people. What do you see?\"\n\nGive students 10-15 seconds of quiet looking time, then invite them to turn and talk to a partner about what they notice.\n\n**Discussion Questions (calibrated for Kindergarten):**\n1. \"What are these big, tall things in the picture?\" (Buildings/skyscrapers)\n2. \"Do you see any green things? What do you think they are?\" (Trees, plants)\n3. \"Do you think there was a big empty space here before people built these buildings? What might have been here before?\"\n4. \"Where do you think the dirt and rocks came from to build these buildings?\"\n\n**Wonder & Prediction Prompt:**\n\"I wonder: Before this city was built, what do you think the land looked like? Was it all flat? Were there plants? Let's explore and find out!\"\n\nRecord student wonderings on chart paper. Validate all responses.\n\n**Transition:** \n\"Let's build our own little city and see what happens to the land underneath!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate what happens to land when humans build on it by constructing miniature environments.\n\n**Materials:**\n- Shallow trays or baking sheets (1 per pair or small group)\n- Potting soil or sand (enough to fill trays 2-3 inches deep)\n- Small plants or grass clippings (prestarted seedlings or fresh turf pieces)\n- Small wooden blocks, plastic building blocks, or cardboard rectangles (to represent buildings)\n- Small pebbles or rocks\n- Water in spray bottles\n- Images of city skylines and natural landscapes (optional reference)\n- Observation sheets (simple drawings of trays with space to draw what students notice)\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. **Prepare your land:** \"Pour your soil or sand into your tray. This is your land. Smooth it out with your hands. What do you notice about the texture?\"\n\n2. **Add plants:** \"Now, plant your grass or seedlings in your soil. This is the natural environment. Can you predict: will plants grow better in some spots than others?\"\n\n3. **Build your city:** \"One at a time, place your building blocks on different parts of your land. Notice: what happens to the soil and plants underneath? Is there still room for the plants to grow?\"\n\n4. **Observe changes:** \"Look carefully at your model. Where can the plants still live? Where did the buildings cover up the land? Draw what you see on your observation sheet.\"\n\n5. **Add water:** \"Use the spray bottle to water your land gently, like rain. Does the water run off the buildings? Does it soak into the soil where the plants are?\"\n\n6. **Compare:** \"Look at a partner's city model. Is it the same or different from yours? What did they build?\"\n\n**How This Connects to the Photograph:**\nPoint back to the photograph: \"Just like in this real city, your model shows buildings taking up space where plants and animals used to live. In the real city, see those green trees? People had to make special spaces for them, even after building.\"\n\n**What Students Should Record:**\n- Simple drawings on observation sheets showing where buildings are and where plants remain\n- Answers to: \"Did the plants have less space to grow when you added buildings?\"\n- Observations about water behavior (e.g., \"Water soaked in the dirt part\" or \"Water went off the hard blocks\")\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What do you notice happening to the soil?\" \"Where is there still space for plants?\" \"What do you think happens to real plants when people build?\"\n- Resist the urge to explain; instead, guide observation: \"Tell me what you see. What changed?\"\n- Scaffold as needed: \"Let's count how many plants you have now compared to when you started.\"\n\n**Expected Student Outcomes:**\n- Students discover that buildings take up space where plants could grow.\n- Students observe that some plants survive/thrive even with buildings nearby.\n- Students recognize that water behaves differently on hard building materials vs. soil.\n- Students physically manipulate the environment and see cause-and-effect relationships.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to Earth and space science concepts.\n\n**Materials:**\n- Chart paper with vocabulary words and simple illustrations\n- Completed student models from Explore phase (keep displayed)\n- Photograph from Engage phase\n- Colored markers\n\n**Activity:**\n\n**Group Share-Out:**\nGather students in a circle with their models visible. Ask:\n- \"What did you discover about buildings and the land?\" \n- \"What happened to the plants?\"\n- \"Did you notice anything about water?\"\n\nInvite 3-4 students to share one discovery. Affirm all observations.\n\n**Introduce Key Vocabulary** (with Kindergarten-friendly definitions):\n\n1. **\"Building\"** — A structure made by people with walls, a roof, and rooms inside where people can live or work. *Show the photograph: \"These tall buildings are where people work and live.\"*\n\n2. **\"Environment\"** — All the natural things around us: soil, water, plants, animals, and rocks. *Gesture around the room and outside: \"Our classroom environment and the park outside are different environments.\"*\n\n3. **\"Land\"** — The solid ground made of soil and rocks under our feet. *Have students touch the soil in their models: \"This is land.\"*\n\n4. **\"Change the environment\"** — When people do something that makes the natural world look or work differently. *Point to the photo: \"People changed the environment by building these buildings instead of leaving it as grass and plants.\"*\n\n5. **\"Habitat\"** — The place where plants and animals live and find food and water. *Show the photo: \"Before the buildings, plants and small animals had a habitat here.\"*\n\n**Connections Back to the Photograph and Explore Activity:**\n\nDisplay the photograph again and point: \"See these buildings? People built them by changing the land. Before, maybe trees and grass and small animals lived there — like in your models before you added buildings. But people needed places to work and live, so they changed the environment. See the green trees still there? People saved some natural spaces in the city, even with all these buildings!\"\n\n**Check for Understanding:**\n\nAsk individual students:\n- \"Point to a building in the picture.\"\n- \"What lives in a habitat?\"\n- \"What happened to the plants when you built your buildings?\"\n\nObserve students' responses. Rephrase or provide scaffolding if needed.\n\n**Vocabulary Chart:**\nCreate a visual anchor chart with simple drawings or icons alongside each vocabulary word. Post it in the classroom for reference.\n\n**Expected Student Outcomes:**\n- Students use the word \"building,\" \"environment,\" and \"change\" with emerging accuracy.\n- Students understand that buildings take space from the natural environment.\n- Students recognize that people have a need (shelter, work) that requires changing the environment.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply concepts to a real-world scenario and think about protecting the environment.\n\n**Materials:**\n- Chart paper titled \"How Can We Share the Land?\"\n- Photograph of the city (displayed again)\n- Drawing paper and colored pencils\n- Images of green roofs, parks, or planted areas in cities (3-4 simple photos)\n- Real plant (small potted plant to place in classroom as model)\n\n**Activity:**\n\n**Scenario Presentation:**\nSay: \"In this real city, people needed to build many buildings. But they also wanted plants and trees to grow. Let's think: how could they do both?\"\n\n**Guided Brainstorm:**\nShow students images of:\n- A rooftop garden or green roof\n- A city park with trees between buildings\n- A window box with flowers\n- A tree growing on a city street\n\nAsk: \"How did people make room for plants even with buildings?\" \n\nAccept all suggestions:\n- \"They put plants on top of buildings!\"\n- \"They made a park for trees.\"\n- \"They planted flowers in pots.\"\n\n**Students Create Solutions:**\nGive each student a piece of drawing paper with a simple outline of a building or city block. Ask: \"Draw your idea for how to keep plants growing in a city with buildings. Where would you put trees or flowers?\"\n\nStudents draw and explain their ideas to a partner or small group.\n\n**Real-World Application:**\nPlace a small potted plant in a visible classroom location. Say: \"This is like a green space in a city. We can take care of it, just like people take care of parks and gardens in real cities.\"\n\n**Teacher Role:**\n- Celebrate creative thinking: \"You invented a way to have both buildings and plants!\"\n- Ask follow-up questions: \"Why is it important to keep plants in cities?\"\n- Gently guide if students are stuck: \"What if we put plants on the top of this building? Would that work?\"\n\n**Expected Student Outcomes:**\n- Students propose at least one way to protect or include plants in developed areas.\n- Students recognize that protecting the environment is possible even when people build.\n- Students understand that plants and humans can share space.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of how humans change the environment and the importance of preserving natural spaces.\n\n**Assessment Activities:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation during Explore:** Do students notice changes in their models? Can they describe what happened to plants?\n- **Discussion responses in Explain:** Do students use vocabulary words? Can they point out buildings and plants in the photograph?\n- **Drawing and ideas in Elaborate:** Can students propose realistic or creative solutions for including plants in developed areas?\n\n**Exit Ticket (Summative Assessment):**\n\nUse one of the following formats:\n\n**Option A: Thumbs Up/Sideways/Down**\nAsk three yes/no or true/false statements. Students show thumbs up (yes/agree), thumbs sideways (unsure), or thumbs down (no/disagree):\n1. \"Buildings are made by people.\" (Thumbs up expected)\n2. \"When people build a building, the land underneath still looks the same.\" (Thumbs down expected)\n3. \"We can protect plants even in cities with many buildings.\" (Thumbs up expected)\n\n**Option B: Simple Drawing Check**\nDisplay the photograph and ask: \"Draw one building and one plant from this picture. Where are they?\" \nLook for: Can the student identify and represent both elements?\n\n**Option C: Question & Response**\nAsk one student at a time:\n- \"What do buildings need from the land?\" (Expected: Space/ground to stand on)\n- \"What do plants need from the land?\" (Expected: Soil, water)\n- \"How can both live in a city?\" (Expected: Any reasonable answer: parks, pots, rooftops, green spaces)\n\n**Success Criteria for Student Understanding:**\n\n✓ **Proficient:** Student can identify buildings and plants in the photograph, explain that buildings take space from the natural environment, and suggest one way to protect plants in cities.\n\n✓ **Developing:** Student can identify buildings and plants but needs support explaining the relationship between buildings and land use or suggesting solutions.\n\n✓ **Beginning:** Student can identify buildings and plants in the photograph with prompting.\n\n**Expected Student Outcomes:**\n- Most students will demonstrate understanding that humans build structures that change the land.\n- Students will show awareness that plants need space and care.\n- Students will propose at least one way to balance building with protecting nature.\n\n---\n\n## Differentiation\n\n### Support (Scaffolding for Struggling Learners)\n\n1. **Simplify the Model Activity:**\n   - Provide pre-planted small pots instead of asking students to plant themselves; students only add buildings.\n   - Use 2-3 large, easy-to-manipulate blocks instead of many small ones.\n   - Pair struggling students with strong partners to co-construct and observe together.\n\n2. **Vocabulary Support:**\n   - Create a classroom word wall with photos/icons alongside words (building, plant, land, change).\n   - Use repetitive sentence frames: \"This is a ___. It is a building/plant.\"\n   - Provide visual reference cards during activities.\n\n3. **Reduce Cognitive Load:**\n   - Focus on two vocabulary words (building, plant) instead of all five initially.\n   - Ask simpler yes/no questions: \"Did your plants have less room?\"\n   - Provide drawing templates with an outline of a building; students only add plants.\n\n### Challenge (Extensions for Advanced Learners)\n\n1. **Deeper Investigation:**\n   - Ask students to predict and test: \"Will plants grow better with more water in the shaded area under a building, or in the sunny area?\" Have them observe their models over several days and record observations.\n   - Challenge: \"What if we added a small container of water (stream) to your model? How would the building affect where water goes?\"\n\n2. **Real-World Research:**\n   - Show photos of different city skylines (New York, your local city, a rural area). Ask: \"Which one has more plants? Why?\"\n   - Bring in a local map or Google Earth image of your town. Ask: \"Where are the green spaces? Where are the buildings? Can you see both?\"\n\n3. **Creative Problem-Solving:**\n   - \"Design a city that has as many buildings as skyscrapers but also keeps lots of plants. What would you do?\" (Students draw or build with blocks.)\n   - Introduce the concept: \"Some cities have special buildings with plants on top called 'green roofs.' Can you design one?\"\n\n---\n\n## Extension Activities\n\n1. **Nature Walk & Observation:**\n   Conduct a short walk around the school grounds or neighborhood. Have students look for:\n   - Buildings (point them out)\n   - Plants and trees (count or sketch)\n   - Places where both exist together\n   Back in class, create a chart: \"What did we find on our walk?\" Discuss how buildings and nature share space in your real community.\n\n2. **Care for a Classroom Plant:**\n   Place a small potted plant in the classroom (e.g., a bean plant, pothos, or spider plant). Over 2-4 weeks, assign daily student \"plant caretakers\" to water it and observe its growth. Journal observations with simple drawings: \"Our plant grew a new leaf!\" This connects to environmental care and the growth needs of plants.\n\n3. **Build a Bigger City Model:**\n   Over several days, challenge students to work as a group to create a large collaborative city model using a large shallow tray, blocks, and soil. Include elements:\n   - Buildings (blocks)\n   - Parks (soil with grass)\n   - A \"water source\" (a small dish of water)\n   - Different colored paper zones (residential, business, nature)\n   Discuss and refine: \"Is this a good city for plants and people?\"\n\n---\n\n## Notes for the Teacher\n\n- **Photograph Connection:** Return to the photograph multiple times throughout the lesson. It anchors student thinking and provides a real-world context that makes the lesson meaningful.\n- **Vocabulary Spiraling:** Kindergarteners need repeated exposure to vocabulary. Use the same words and phrases consistently across all phases.\n- **Hands-On Priority:** This age group learns best through manipulation and sensory experience. Prioritize the Explore phase and let students spend time observing their models.\n- **Equity & Inclusion:** Some students may have limited exposure to cities or natural environments. The photograph and models provide a shared reference point. Invite students to share their own experiences with buildings, plants, or cities they know.\n- **Safety Reminder:** Supervise soil/sand handling to prevent ingestion. Use commercially prepared potting soil (safer than garden soil). Wash hands after the activity.\n\n---\n\nThis lesson honors the photograph as a springboard for deep thinking about human impact on Earth systems while keeping Kindergarten developmental and engagement levels at the forefront. Students leave understanding that people and nature can coexist — a foundational concept for environmental stewardship.",
  "inputTokens": 2433,
  "outputTokens": 4251,
  "cost": 0.023688,
  "generatedAt": "2026-02-12T22:12:48.803Z"
}