{
  "title": "Hill",
  "category": "earth-space-science",
  "imageFile": "e02.jpeg",
  "imagePath": "images/earth-space-science/e02.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Understanding Landscapes, Weather, and Where We Live\n\n## Core Science Concepts from Image Analysis\n\n- **Landforms and Topography:** Mountains, valleys, and hills shape the landscape where people build homes and communities; elevation affects the environment.\n- **Weather and Atmosphere Visibility:** Hazy, cloudy conditions in the distance show how weather and air quality vary across regions; this connects to seasonal weather patterns and climate.\n- **Human-Environment Interaction:** People construct buildings on hillsides, which requires understanding the natural landscape and its features.\n- **Regional Climate Patterns:** The lush green vegetation and building style suggest a specific climate region; different regions have different weather conditions, seasons, and vegetation.\n\n---\n\n## Lesson Title\n\n**Hillside Homes: Learning About Landforms, Weather, and Where People Live**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or one 90-minute block)\n- **NGSS Standards:** \n  - 3-ESS2-1 (Represent data in tables and graphical displays to describe typical weather conditions expected during a particular season)\n  - 3-ESS2-2 (Obtain and combine information to describe climates in different regions of the world)\n\n---\n\n## Learning Objectives\n\nStudents will be able to...\n\n1. **Identify and describe landforms** (hills, mountains, valleys) visible in a landscape photograph and explain how elevation changes across the land.\n2. **Observe and discuss weather and atmospheric conditions** (clouds, haze, visibility) shown in a photograph and connect these to seasonal weather patterns.\n3. **Explain why people build homes in different locations** based on the natural features and climate of a region.\n4. **Collect and organize weather data** in tables or charts to compare typical weather in their region versus another region shown in a photograph.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Large color printout or digital projection of the photograph (photo e02.jpeg)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** prominently. Do not explain it yet. Ask students to simply observe for 30 seconds in silence, taking in what they see.\n\n2. **Facilitate a \"Notice and Wonder\" conversation** using these specific questions:\n   - *\"What landforms do you notice in this picture? Can you point to the hills, mountains, or valleys?\"*\n   - *\"Why do you think someone built a big house on a hillside instead of on flat ground?\"*\n   - *\"Look at the sky and the distance. What do you see? Why does the far-away view look different from the close-up view?\"*\n   - *\"What kind of weather do you think happens in this place? How do you know?\"*\n\n3. **Record student observations** on chart paper. Write down their ideas about landforms, weather, and the house location without correcting them yet.\n\n4. **Prediction Prompt:** *\"I'm wondering: If this picture was taken on a cloudy day, what might this view look like on a sunny, clear day? What would we be able to see?\"* Have students turn and talk to a partner, then collect 2–3 responses.\n\n**Transition:** *\"Today we're going to explore how the shape of the land and the weather of a region help us understand why people live where they do. Let's investigate!\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- 3–4 different landscape photographs or image printouts (one with clear weather, one with haze, one showing different elevations, one showing different vegetation)\n- Chart paper or large paper for each group\n- Markers, colored pencils\n- Copies of a simple \"Landscape Observation Sheet\" (see template below)\n- Small model or blocks to represent hills and valleys (optional: clay, blocks, or molded paper)\n\n**Activity:**\n\n**Part A: Landscape Observation Investigation (12 minutes)**\n\n1. **Organize students into groups of 3–4.** Assign each group one landscape photograph (different from the main image used in Engage, but similar in showing landforms, weather, or regional features).\n\n2. **Provide each group with a Landscape Observation Sheet** that includes these prompts:\n   - Draw or label the landforms you see (hills, mountains, valleys, flat areas).\n   - What do the clouds and sky tell you about the weather?\n   - Where could people build homes? Why did you choose that spot?\n   - Is this place similar to or different from the photograph we saw at the beginning?\n\n3. **Give clear directions:** *\"Look carefully at your photograph. Sketch what you see and answer the questions. You have 10 minutes. I'll come around to listen to your thinking, but don't ask me if you're right—observe and make your best guesses!\"*\n\n4. **Teacher Role:** Circulate and ask clarifying questions:\n   - *\"Tell me what you see in the landforms. What would it feel like to stand there?\"*\n   - *\"Why do you think the distance looks fuzzy?\"*\n   - *\"How is this place's weather similar to or different from where we live?\"*\n   - Do NOT provide answers; guide observations only.\n\n5. **Documentation:** Students complete their Observation Sheet with drawings and written or dictated responses.\n\n**Part A Expected Outcomes:** \n- Students identify hills/mountains/valleys.\n- Students notice and describe weather/atmospheric conditions (clouds, haze, clarity).\n- Students make predictions about suitable locations for building and climate characteristics.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with key vocabulary pre-written\n- The original e02.jpeg photograph\n- Simple world map or globe\n- Whiteboard or document camera to display student work from Explore phase\n\n**Activity:**\n\n1. **Group Share-Out (7 minutes):** Ask 2–3 groups to share their Observation Sheets. Display their work using a document camera or hold them up. Ask follow-up questions:\n   - *\"What landforms did you find? How are they the same as or different from the ones in our first picture?\"*\n   - *\"What did you notice about the weather and sky?\"*\n\n2. **Introduce Vocabulary (8 minutes):** Display and explain these terms using the photograph and student observations as examples:\n\n   - **Landform:** The natural shape of the land, like a mountain, hill, or valley.\n   - **Elevation:** How high or low a place is above sea level.\n   - **Climate:** The usual weather in a place over a long time (many months and years).\n   - **Weather:** What it's like outside right now—sunny, rainy, cloudy, hot, or cold.\n   - **Region:** An area of land with similar features and climate.\n\n3. **Connect Back to the Photograph:**\n   - *\"In this picture, we can see HIGH elevation in the mountains and hills, and LOWER elevation where the house sits and where the city is far away. This affects the climate.\"*\n   - *\"The hazy sky tells us about the weather and air conditions in this region.\"*\n   - *\"People live in different regions because each region has different landforms and weather.\"*\n\n4. **Check for Understanding Strategy:** Use a quick \"Thumbs Up/Sideways/Down\":\n   - *\"Show me your thumb: Can you name one landform you see in the photograph?\" (Thumbs up = yes, thumbs down = needs help)*\n   - Provide a quick mini-lesson for anyone showing thumbs down.\n\n**Vocabulary Reference:**\n\n| Term | Student-Friendly Definition |\n|------|---|\n| **Landform** | A natural shape of the land, like a mountain, hill, valley, or flat plain |\n| **Elevation** | How high or low a place is; mountains have high elevation |\n| **Climate** | The kind of weather a place usually has over many years |\n| **Weather** | What it's like outside right now—if it's sunny, cloudy, rainy, or windy |\n| **Region** | An area of land where the landforms, weather, and plants are similar |\n\n**Expected Student Outcomes:** \n- Students can define landform, elevation, climate, weather, and region.\n- Students recognize these terms in the photograph and their observations.\n- Students understand that landforms and weather vary by region.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Printouts of 2–3 different regional weather charts or seasonal weather data (e.g., \"Winter Weather in the Mountains\" vs. \"Summer Weather in the Flat Desert\")\n- Large paper or poster board for each group\n- Markers, crayons\n- Simple data table template (see below)\n- Optional: globe or world map\n\n**Activity:**\n\n**Comparing Climates Across Regions (Connects to 3-ESS2-2)**\n\n1. **Introduce the Task:** *\"We know that different regions have different landforms and weather. Now we're going to compare the climate of two different regions.\"*\n\n2. **Provide each group with:**\n   - Data about typical weather conditions in two regions (e.g., mountainous region vs. coastal region, or a region with four seasons vs. a tropical region)\n   - A simple table to fill in with this data\n\n3. **Sample Data Table:**\n\n| Region | Typical Season | Temperature | Rainfall | Landforms |\n|--------|---|---|---|---|\n| Mountain Region | Winter | Very Cold | Lots of Snow | High hills and mountains |\n| Coastal Region | Winter | Cool | Some Rain | Flat and beaches |\n\n4. **Student Task:** *\"Work together to complete the table. Then, draw a picture of each region and label the landforms and weather. Finally, answer this question: 'Why would someone choose to live in one region instead of the other?'\"*\n\n5. **Teacher Role:** \n   - Provide the data (don't ask students to research; that's too advanced for Grade 3).\n   - Circulate and ask: *\"What does this data tell you about the weather in this region?\" \"How would living here be different from living in the other region?\"*\n   - Help students make connections to the elevation and landforms they learned about.\n\n6. **Real-World Connection:** *\"In the picture we started with, the house is built on a hillside in a region with lots of green plants. This tells us it has rain and a climate that lets plants grow.\"*\n\n**Expected Student Outcomes:** \n- Students complete a data table comparing two regions.\n- Students create drawings of different regions with labeled landforms.\n- Students explain (orally or in writing) why climate and landforms affect where people choose to live.\n- Students recognize that different regions have different typical weather and seasons.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of landforms, weather, climate, and how regions differ.\n\n**Activity:**\n\n**Formative Assessment (Ongoing):**\n- Observation during Explore: Were students able to identify landforms and describe weather conditions?\n- Thumbs Up/Sideways/Down check during Explain phase\n- Listening to student conversations during group work in Elaborate phase\n\n**Exit Ticket / Summative Assessment (Choose one format):**\n\n**Option A: Oral Response (3–4 minutes per student, whole group at end)**\nAsk each student one of these questions:\n- *\"Look at this photograph. Point to a hill and a valley. How are they different?\"*\n- *\"What is the weather like in this picture? How do you know?\"*\n- *\"Why might someone build a house in this region instead of somewhere else?\"*\n\n**Option B: Drawing with Labels (5 minutes)**\nStudents draw a landscape with at least two different landforms and label them. They also draw weather symbols (clouds, sun, rain) to show what weather they think happens there.\n\n**Option C: Simple Written/Dictated Response (5 minutes)**\nProvide this sentence starter and ask students to complete it:\n- *\"The landforms in the photograph are ________. The weather looks ________ because ________.\"*\n- *\"People might want to live here because ________.\"*\n\n**Success Criteria for Student Understanding:**\n✓ Students can identify at least two landforms (e.g., hill, mountain, valley)\n✓ Students can observe and describe weather/sky conditions from a photograph\n✓ Students can explain one reason why location and climate matter for where people live\n✓ Students use vocabulary (landform, elevation, weather, climate, region) in their explanations\n\n**How to Determine if Students Met Objectives:**\n- **Objective 1:** Students correctly identify and label landforms in drawings or point them out in photographs.\n- **Objective 2:** Students observe and describe weather conditions and make connections to the photograph.\n- **Objective 3:** Students explain at least one reason people choose a location (e.g., \"flat land is easier to build on,\" \"rain helps plants grow\").\n- **Objective 4:** Students complete a data table or chart comparing weather/climate in two regions and make observations about the differences.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Scaffold the Observation Sheet:** Provide a simplified version with pictures to circle instead of blank spaces to fill in. For example:\n   - *\"Circle the landforms you see: hill / mountain / valley / flat\"*\n   - *\"What is the weather? Circle one: sunny / cloudy / rainy\"*\n\n2. **Pair with a Stronger Reader:** During Explore and Elaborate, pair a student who struggles with reading/writing with a peer who can read the prompts aloud and help record ideas.\n\n3. **Use Concrete Models:** Provide clay or blocks to build a model of the landforms shown in the photograph. This tactile, hands-on approach helps students who struggle with abstract visualization.\n\n4. **Simplify Vocabulary:** Use only 2–3 key terms (landform, weather, elevation) instead of all five. Check understanding frequently.\n\n### Challenge (for advanced learners):\n\n1. **Investigate Weather Patterns Over Time:** Provide weather data (temperature, rainfall, snowfall) for the mountain region over four seasons. Ask students to create a bar graph or table showing how weather changes each season. Connect to 3-ESS2-1.\n   - *\"Why do you think this region gets more rain in spring than in winter? What does this tell you about the climate?\"*\n\n2. **Design a Hillside Home:** Challenge students to sketch a house design that fits the landforms and weather of the region in the photograph. Ask them to explain their design choices:\n   - *\"Why did you put the windows on this side of the house? How does the hill affect your design?\"*\n   - *\"What weather does this region have, and how does your house keep people safe and comfortable?\"*\n\n3. **Research and Compare a Second Region:** Provide a different photograph of a contrasting region (e.g., flat desert, coastal area, tropical forest). Have advanced students create a Venn diagram or comparison chart showing how the two regions are the same and different in terms of landforms, weather, and where people might live.\n\n---\n\n## Extension Activities\n\n1. **Weather Journal Over Two Weeks:**\n   - Students keep a simple daily weather log for 7–10 days, recording the date, sky condition (sunny/cloudy/rainy), and approximate temperature.\n   - At the end, they create a bar graph or table showing typical weather patterns for their region.\n   - **Connection:** This reinforces 3-ESS2-1 and helps students see that weather varies day-to-day but climate is the pattern over time.\n\n2. **Regional Climate Poster Project:**\n   - Assign each student or pair a different region of the world (e.g., tropical rainforest, desert, mountain, tundra, temperate forest).\n   - Students use provided images, facts, and drawings to create a poster showing:\n     - Landforms in that region\n     - Typical weather and seasonal changes\n     - Plants and animals that live there\n     - How people adapt their homes and lifestyles to the climate\n   - **Connection:** Extends 3-ESS2-2 (describing climates in different regions).\n   - **Presentation:** Gallery walk where students view each other's posters.\n\n3. **\"Build a Community on the Hillside\" Design Challenge:**\n   - Provide a topographic map or contour map showing elevation (simplified for Grade 3).\n   - Students decide where to place 3–4 buildings (home, school, store) based on:\n     - How steep the land is\n     - Where weather is safest (avoiding flood zones, steep slopes)\n     - Where it's easiest to build\n   - Students label their map and write or dictate explanations for their choices.\n   - **Connection:** Combines understanding of landforms, weather hazards, and human decision-making; could extend to 3-ESS3-1 (design solutions to reduce weather-related hazards).\n\n---\n\n## Teacher Notes\n\n- **Pacing:** This lesson works well as a two-day unit or one extended block. Adjust timing based on your students' discussion engagement and reading level.\n- **Accessibility:** Use the photograph digitally so students with vision difficulties can zoom in. Provide physical manipulatives (blocks, clay) for kinesthetic learners.\n- **Prior Knowledge:** This lesson assumes students have basic observation skills and can identify colors, shapes, and simple weather conditions. If not, spend extra time in the Engage phase.\n- **Connection to Student Lives:** Encourage students to notice and discuss the landforms and weather in their own community. *\"Do we live on flat land or hillsides? What is our typical weather?\"*\n\n---\n\n**Lesson created in alignment with NGSS 3-ESS2-1 and 3-ESS2-2 for Third Grade Earth and Space Science.**",
  "inputTokens": 2350,
  "outputTokens": 4220,
  "cost": 0.023450000000000002,
  "generatedAt": "2026-02-12T22:19:51.138Z"
}