{
  "title": "Hill",
  "category": "earth-space-science",
  "imageFile": "e02.jpeg",
  "imagePath": "images/earth-space-science/e02.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: \"Where Does the Sun Go? Light and Shadows in Our World\"\n\n## Core Science Concepts from Image Analysis\n\n- **Sunlight and shadows:** The hazy, overcast sky and visible shadows cast by the building and trees demonstrate how sunlight creates shadows and changes throughout the day.\n- **Time of day and daylight:** The hazy atmospheric conditions suggest different times of day affect how much sunlight reaches Earth and how clear the sky appears.\n- **Landforms and elevation:** The hills, valleys, and varying terrain show that Earth's surface has different heights and shapes that affect how we see the sky and sun.\n- **Weather patterns:** The misty, hazy air suggests moisture and weather conditions that change what we can see in the sky.\n\n---\n\n## Lesson Title\n\n**\"Sun, Shadows, and Hazy Skies: What Changes Our View?\"**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (total 80 minutes)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how the sun creates shadows at different times of day.\n2. Identify patterns in how sunlight makes the sky look different (bright, hazy, or dim).\n3. Predict how shadows will change when the sun moves across the sky.\n4. Record simple observations about daylight in their classroom or outdoor space.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Spark curiosity about the sun, shadows, and why the sky looks different at different times.\n\n**Materials:**\n- Large printed color photograph (8.5\" × 11\" or larger, or displayed on smartboard/projector)\n- Chart paper and marker\n- Optional: flashlight and small toy building or tree\n\n**Activity:**\n\n1. **Display the photograph** on the board or screen. Give students 30 seconds to observe silently before speaking.\n\n2. **Ask these guiding questions** (one at a time, allowing think-time and responses):\n   - \"What do you see in this picture? Point to something you notice.\" *(Students identify the building, trees, sky, or haze.)*\n   - \"Why do you think the sky looks a little cloudy or foggy in this picture? What could be blocking the sunlight?\" *(Guide them to think about clouds, mist, or time of day.)*\n   - \"Do you see any dark areas or shadows? Where are they?\" *(Point out shadows near the building and trees.)*\n   - \"When do YOU see shadows around our school? When does the sun make the biggest shadows?\" *(Connect to their daily experience.)*\n\n3. **Wonder prompt:** \"I wonder... if we watch the shadows outside our classroom during the day, will they stay in the same place or will they move? Let's find out!\"\n\n4. **Record student predictions** on chart paper: \"We think shadows will... [move/stay the same/grow longer/etc.]\"\n\n**Transition:** \"To test our ideas, we're going to do some shadow investigations outside and with a light. Let's explore!\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students discover how sunlight creates shadows and how shadows change position and size.\n\n**Materials:**\n- Small flashlight or desk lamp (1 per pair/small group)\n- Toy building blocks, plastic figures, or small objects (1 set per pair)\n- Large white paper or poster board\n- Pencils or markers\n- Clipboard or hard writing surface\n- Access to sunny outdoor space OR a well-lit corner of classroom\n- Optional: outdoor chalk for tracing\n\n**Activity:**\n\n**Part A: Indoor Shadow Investigation (12 minutes)**\n\n1. **Pair students** and give each pair a flashlight, small objects (building blocks, plastic animals), and paper.\n\n2. **Student directions:**\n   - \"Shine your flashlight on your objects from different directions. Watch the shadows!\"\n   - \"Make a shadow. Now move your light to a different spot. What happened to the shadow?\"\n   - \"Draw or trace one shadow with a pencil. Then move your light and draw the shadow again in a different place.\"\n   - \"Talk with your partner: Did the shadow change? How?\"\n\n3. **Teacher role:** Circulate and ask clarifying questions without giving answers:\n   - \"What do you notice when you move the light?\"\n   - \"Is the shadow always the same size? What makes it bigger or smaller?\"\n   - \"Why do you think the shadow moved?\"\n\n4. **Recording:** Students sketch 2–3 shadows on their paper, labeling or pointing to where the light was.\n\n**Part B: Outdoor Shadow Observation (10 minutes, if weather permits)**\n\n1. **Take students outdoors** to a sunny area (or use classroom windows with sunlight).\n\n2. **Student directions:**\n   - \"Look at the shadows made by trees, the building, or yourselves. Point to them.\"\n   - \"Are the shadows long or short? What do you notice about their direction?\"\n   - \"If we came back out at recess/lunchtime, do you think the shadows will be in the same spot?\"\n   - Optional: Use chalk to trace a shadow on the ground. Label it with the time of day.\n\n3. **Teacher role:** Guide observation with questions; don't reveal answers yet.\n\n4. **Recording:** Students draw or dictate what they observed about shadows outside.\n\n**Expected Student Outcomes:** \n- Students discover that shadows change position when light moves.\n- Students observe that sunlight is not always equally bright (connected to hazy sky in photo).\n- Students produce labeled shadow drawings.\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Build vocabulary and formalize understanding of sun-shadow relationships and daylight patterns.\n\n**Materials:**\n- Chart paper with vocabulary words\n- Photograph displayed on board\n- Student drawings from Explore phase\n- Interactive diagram or simple model (optional: globe with flashlight to show day/night)\n\n**Activity:**\n\n1. **Group share-out (6 minutes):**\n   - Ask pairs to share their findings: \"What did you discover about shadows?\"\n   - Record key observations on chart paper:\n     - \"Shadows moved when the light moved.\"\n     - \"Shadows look different at different times.\"\n     - \"The sun makes shadows.\"\n\n2. **Introduce vocabulary (7 minutes)** using student-friendly language:\n\n   - **Shadow:** A dark area on the ground (or a surface) made when something blocks sunlight. *(Point to shadows in the photograph.)*\n   - **Sunlight:** The light and heat that comes from the sun. *(Point to the hazy sun in the photo.)*\n   - **Sun:** A big star that gives us light during the day. *(Discuss safely; never look directly at the sun.)*\n   - **Daylight:** The time when the sun is up and the sky is bright. *(Ask: \"Is it daylight right now?\")*\n   - **Pattern:** Something that repeats the same way over and over. *(Example: \"The sun always comes up in the morning and goes down at night. That's a pattern!\")*\n\n3. **Connect back to the photograph (3 minutes):**\n   - \"Look at this picture again. Do you see how the sky is a little hazy? Why might that be?\"\n   - \"The sun was shining, but you can see shadows. That tells us when this picture was taken, the sun was still pretty bright!\"\n   - \"If we took a picture early in the morning or late in the evening, the shadows would be even longer, and the sky might be different colors. Can you imagine that?\"\n\n4. **Check for understanding:**\n   - Quick thumbs up/middle/down: \"Thumbs up if you know what a shadow is. Thumbs middle if you're not sure. Thumbs down if you have a question.\"\n   - Ask 2–3 students to show a shadow in the room using their body and a light source.\n\n**Vocabulary List:**\n- **Shadow:** The dark shape made when light is blocked.\n- **Sunlight:** Light that comes from the sun.\n- **Sun:** The bright star that lights our day.\n- **Daylight:** The bright time of day when the sun is in the sky.\n- **Pattern:** Something that happens the same way again and again.\n\n**Expected Student Outcomes:** \n- Students use vocabulary to describe their shadow observations.\n- Students understand that sunlight creates shadows.\n- Students recognize that the sun's position changes during the day, affecting shadows.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Apply shadow and sunlight concepts to predict and document patterns over time.\n\n**Materials:**\n- \"Shadow Watch\" observation sheet (simple template with boxes for drawing)\n- Crayons, colored pencils, or markers\n- Outdoor space or classroom windows with sunlight\n- Optional: sundial or clock face\n- Chart paper for class predictions\n\n**Activity:**\n\n1. **Set up a \"shadow observation routine\" (10 minutes):**\n   - Designate a sunny spot in your classroom or outdoors (e.g., a window, outdoor corner).\n   - Mark the spot with tape or chalk.\n   - Tell students: \"We're going to watch the same shadow at different times today. Let's predict what will happen.\"\n\n2. **Make predictions together (3 minutes):**\n   - Ask: \"If we look at this shadow right now, and then we look again at recess, what will be different?\"\n   - Record predictions: \"The shadow will be [longer/shorter/in a different spot].\"\n\n3. **Observation (5 minutes at multiple times during the day):**\n   - At 2–3 different times (e.g., 10:00 AM, lunch, 2:00 PM), return to the shadow spot.\n   - Students draw the shadow's position and length on the observation sheet.\n   - Label each drawing with the time of day.\n   - Ask: \"Did the shadow move? Did it change size?\"\n\n4. **Review findings:**\n   - At the end of the day, compare drawings.\n   - Ask: \"Did our prediction come true? How did the shadow move?\"\n   - Discuss: \"Why do you think this happened? What was moving—the sun or the shadow?\"\n\n**Teacher Role:** \n- Facilitate predictions without confirming or denying them.\n- Prompt observation: \"What do you notice right now?\"\n- Guide discussion toward the pattern: sun moves → shadows move.\n\n**Expected Student Outcomes:**\n- Students create a visual record of shadow position and length over time.\n- Students recognize that shadows move and change in a predictable pattern.\n- Students begin to infer that the sun's position changes during the day.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of sunlight, shadows, and daylight patterns.\n\n**Activity:**\n\n**Formative Assessment (ongoing during lesson):**\n- Observe student drawings during Explore and Elaborate phases.\n- Listen to student explanations of how shadows move.\n- Use thumbs up/middle/down checks during Explain phase.\n- Ask students to explain a shadow they see: \"Tell me why you think that shadow is there.\"\n\n**Exit Ticket (summative assessment, administered at end of Lesson 2):**\n\nProvide each student with a simple exit ticket (paper or digital) with 2–3 questions:\n\n1. **Draw or point:** \"Show me where a shadow is in our classroom right now. Why is it there?\"\n2. **Multiple choice or yes/no:** \"Does the sun make shadows?\" (Yes/No) \"Do shadows stay in the same place all day?\" (Yes/No)\n3. **Sentence stem:** \"The sun makes shadows by ____________.\" *(Accept: blocking light, shining on things, making dark spots, etc.)*\n\n**Success Criteria for Meeting Learning Objectives:**\n- ✓ Students can identify and locate shadows in their environment.\n- ✓ Students understand that the sun creates shadows.\n- ✓ Students can observe and describe changes in shadow position or size over time.\n- ✓ Students recognize that daylight is related to the position of the sun (even if they don't fully grasp the Earth's rotation yet).\n\n**Expected Student Outcomes:**\n- Most first graders will correctly identify shadows and explain that the sun makes them.\n- Students will demonstrate understanding through drawings, verbal explanations, and physical demonstrations.\n- Exit ticket responses will show understanding of sun-shadow connections (answers need not be scientifically precise—accept intuitive, observable explanations).\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n1. **Simplified vocabulary:** Use only \"sun,\" \"shadow,\" and \"light\" without introducing \"pattern\" or \"daylight\" initially. Reinforce with repetition and visual aids (point, don't just explain).\n2. **Concrete manipulation:** Provide extra time with the flashlight and blocks during Explore. Allow students to move the light themselves and trace shadows on paper, which is more concrete than abstract prediction.\n3. **Guided partner work:** Pair struggling students with a stronger student during Explore and Elaborate. Provide sentence frames for sharing: \"I see a shadow. The light is [here]. The shadow is [here].\"\n\n### Challenge (for advanced learners):\n1. **Predict shadow angles:** Ask advanced students to predict where a shadow will move next and why. Introduce the idea that \"the sun moves across the sky\" and ask them to draw the path the sun takes.\n2. **Document time:** Have advanced students record the time on each observation sheet and compare the sequence. Ask: \"Which shadow was earliest? Which was latest? Why?\"\n3. **Investigate variable factors:** Ask: \"What if we use a brighter light? A dimmer light? Does it change the shadow?\" Let them experiment and report findings.\n\n---\n\n## Extension Activities\n\n1. **Shadow Puppet Theater:** Students create shadow puppets (hands, cutouts, objects) and manipulate them with a light source. Have them tell a short story using only shadows. This reinforces that shadows are made by blocking light while adding creativity and engagement.\n\n2. **Sunrise and Sunset Observation Chart:** Over a week, have students draw or photograph the sunrise/sunset from the classroom window (or a designated view) at the same time each day. Create a class chart showing how the sky color and brightness change. Connect to \"daylight getting longer\" or shorter depending on the season.\n\n3. **My Shadow Book:** Students create a simple booklet with pages labeled \"Morning Shadow,\" \"Noon Shadow,\" \"Afternoon Shadow,\" and \"Evening Shadow.\" They draw or describe what they think each looks like based on the sun's position. Discuss: When are shadows longest? When are they shortest? Why?\n\n---\n\n## Teacher Notes\n\n- **Safety reminder:** Stress that students should never look directly at the sun. Teach sun safety during discussions.\n- **Weather contingency:** If outdoor observation isn't possible, use the indoor flashlight-and-blocks activity as the primary investigation and supplement with photo analysis.\n- **Connection to photo:** Return to the photograph multiple times throughout the lesson. Ask: \"How do you know the sun was shining when this picture was taken?\" (Students should recognize the shadows and the hazy sky.)\n- **Pacing:** First graders benefit from hands-on, concrete learning. Don't rush Explore; let them play with shadows for a full 12 minutes.\n- **Real-world link:** Many students will recognize shadows on playgrounds, building walls, and their own bodies. Normalize this observation as science!",
  "inputTokens": 2319,
  "outputTokens": 3652,
  "cost": 0.020579,
  "generatedAt": "2026-02-12T22:18:22.610Z"
}