{
  "title": "Hill",
  "category": "earth-space-science",
  "imageFile": "e02.jpeg",
  "imagePath": "images/earth-space-science/e02.jpeg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Landforms and the Landscape Around Us\n\n## Core Science Concepts from Image Analysis\n\n- **Landforms and Terrain:** The photograph shows varied landforms including hills, valleys, and elevated terrain that are shaped by natural processes over time.\n- **Weathering and Erosion:** The sloped landscape demonstrates how water and wind gradually change the shape of land, creating valleys and ridges.\n- **Natural Resources and Building:** Humans interact with landforms by building structures (the villa) on elevated areas, showing how people use natural features.\n- **Weather and Atmosphere:** The hazy, cloudy appearance suggests atmospheric conditions and visibility changes related to weather and elevation.\n\n---\n\n## Lesson Title\n\n**Building on the Land: How Shapes Around Us Tell Earth's Story**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 2-ESS2-1: Compare multiple solutions designed to slow or prevent wind or water from changing the shape of the land.\n  - 2-ESS2-2: Develop a model to represent the shapes and kinds of land and bodies of water in an area.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify and describe different landforms (hills, valleys, and flat areas) visible in a landscape photograph.\n2. Explain how water and wind can change the shape of land over time.\n3. Design and build a model landscape showing hills, valleys, and flat areas.\n4. Predict how water moving across land might change its shape.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Projected or printed copy of the photograph (e-02.jpeg) — large enough for all students to see clearly\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the Photograph:** Project the image on a screen or display it as a large poster. Allow students 30 seconds of silent looking time.\n\n2. **Direct Students' Attention:** Point to different areas and ask:\n   - \"What do you notice about the ground in this picture? Does it look flat or bumpy?\"\n   - \"I see a tall building sitting on the side of a mountain. Why do you think someone built a house *there* instead of on a flat space?\"\n   - \"Look at all those trees covering the hills. What do you think would happen to this hillside if all the trees were cut down and rain fell hard?\"\n   - \"These cloudy, hazy mountains in the far distance look different from the green forests close by. What might make them look that way?\"\n\n3. **Wonder Prompt:** Display the sentence frame on a chart:\n   - \"I wonder... what made these hills and valleys in the first place?\"\n   - \"I wonder... how does water change the land?\"\n\n   Invite 3-4 volunteers to share their wonderings aloud.\n\n4. **Prediction:** \"Today, we're going to become land scientists. We're going to build our own landscape and discover how water and wind change the land. Before we start, draw what you think will happen when water flows across a hillside. You'll check your prediction later.\"\n\n**Transition:** \"Now let's get our hands dirty—well, our materials dirty—and explore how landscapes change!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials (per pair of students):**\n- 1 shallow rectangular pan or aluminum cake pan (9x13 inches)\n- Sand (approximately 2-3 cups per pair)\n- Pebbles and small rocks\n- Water in a cup or spray bottle with measuring marks\n- Small toy houses or natural materials (twigs, leaves) to place on the landscape\n- Paper towels or newspaper to contain spills\n- Pencil and observation sheet (provided below)\n\n**Activity:**\n\n1. **Setup (Teacher-Directed):** Place newspapers under each pan. Fill each pan halfway with sand. Students help spread and shape the sand into two hills with a valley in between.\n\n2. **Student Directions:**\n   - \"Build a landscape with your partner. Make two hills and a valley between them. Use some rocks to mark different areas.\"\n   - \"Place your toy house on one of the hills.\"\n   - \"Now predict: What will happen when I pour water down the side of the hill? Draw your prediction on your observation sheet.\"\n   - \"Slowly pour water from the top of one hill. Watch what happens to the sand, rocks, and house.\"\n   - \"Stop and observe. Has the shape of your land changed? How?\"\n   - \"Now pour more water and watch again. What happens to the valley? Where does the water go?\"\n   - \"Finally, use your finger to make a shallow channel down the hill like a path. Pour water again. Does water follow the path?\"\n\n3. **Connection to Photograph:**\n   - \"The water just changed the shape of your land, just like real wind and water change the mountains and valleys in that big photograph we saw. Those changes happen very slowly over many, many years, but your water made changes happen fast!\"\n\n4. **Recording:**\n   - Students should sketch or write (with teacher support) answers to:\n     - \"What changed about our land?\"\n     - \"Where did the water go?\"\n     - \"How is your sand landscape like the hills in the photograph?\"\n\n**Teacher Role:**\n- Circulate between pairs with guiding questions: \"What do you notice happening? Where is the water moving fastest? What is it carrying away?\"\n- Avoid giving answers; instead, ask students to observe and describe.\n- Encourage all students to touch and feel the sand, to see texture changes.\n- If a student's prediction was different, ask: \"What did you think would happen? What actually happened? Can you tell me why it might be different?\"\n\n**Expected Student Outcomes:**\n- Students observe that water flows downhill and carries sand with it.\n- Students notice that hills lose sand and valleys fill with sand.\n- Students recognize that the shape of land changes when water moves across it.\n- Students record observations (drawings, words, or dictation) about changes they see.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Original photograph (projected or printed)\n- Chart paper with vocabulary words written large\n- Pictures of hills and valleys (can be printed or drawn)\n- The \"before and after\" sketches from Explore phase (displayed)\n\n**Activity:**\n\n1. **Group Share-Out:**\n   - Ask 4-5 pairs: \"What changed on your landscape? Show us what happened to your sand and rocks.\"\n   - Display student observation sheets so all can see.\n   - Celebrate what students discovered: \"You all discovered that water changes land!\"\n\n2. **Introduce Vocabulary with Visual Anchor Chart:**\n\n   Create and display a chart with student-friendly language:\n\n   | **Word** | **What It Means** | **Picture/Example** |\n   |----------|------------------|-------------------|\n   | **Hill** | A piece of land that goes up high. It is higher than the land around it. | Draw a tall triangle. Point to the hill in the photograph. |\n   | **Valley** | A low place between hills. Water often flows through valleys. | Draw a V-shape. Point to the valley between hills in the photo. |\n   | **Erosion** | When water, wind, or ice moves earth and rocks away. It slowly changes the shape of land. | Show before-and-after sketches from Explore. |\n   | **Landform** | Any natural shape of land, like a hill, valley, mountain, or plain. | Point out multiple landforms in the photograph. |\n\n3. **Connections Back to Photograph:**\n   - \"Look at the photograph again. Can you point to a hill? A valley?\"\n   - \"The real hills in this picture were shaped by water and wind for thousands of years—much, much longer than our 5-minute experiment! But the same thing happened: water flowed downhill and changed the land.\"\n   - \"That building was built on a hill. Maybe the builders chose that spot because it's higher and stays drier when it rains!\"\n\n4. **Check for Understanding:**\n   - \"If it rains a lot on a hill, what might happen to the soil?\" (Students respond: erosion, water flows down.)\n   - \"Why might a valley be a wet place?\" (Students respond: water flows there.)\n   - Show a simple picture of a landscape. Point and ask: \"Is this a hill or a valley? How do you know?\"\n\n**Vocabulary:**\n- **Hill:** A raised piece of land that is higher than the ground around it.\n- **Valley:** A low place between hills where water often collects and flows.\n- **Erosion:** The slow wearing away of land and rocks by water, wind, or ice.\n- **Landform:** The natural shape of the ground, such as a hill, valley, mountain, or flat plain.\n- **Weather:** What the air is like outside (sunny, rainy, cloudy, windy).\n\n**Expected Student Outcomes:**\n- Students use the vocabulary terms to describe the photograph and their model landscapes.\n- Students explain that water and wind slowly change the shape of land (erosion).\n- Students can point to and name a hill and valley in a landscape.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials (per pair):**\n- Same pans and landscapes from Explore (or rebuild if needed)\n- Small pieces of grass, seeds, or craft moss\n- Water\n- Observation sheet\n- Optional: small plastic fences or barriers (straws, popsicle sticks)\n\n**Activity:**\n\n1. **Problem Scenario:**\n   - \"Imagine there's a problem. Water is washing away all the soil on a hillside, and a farmer is losing their land. Plants are being washed away. How can we stop or slow down erosion?\"\n\n2. **Student Investigation — Part A (Planting Solution):**\n   - \"Add grass, moss, or seeds to the top of your landscape. This is like planting trees and grass on a real hillside.\"\n   - \"Now pour water down the hill again. Does it still change the shape as much?\"\n   - Students compare: \"With plants\" vs. \"Without plants.\"\n   - Record: \"Did the plants help? How?\"\n\n3. **Student Investigation — Part B (Barrier Solution):**\n   - \"Now try a different solution. Use straws or sticks to make a small barrier or fence partway down the hill, like a wall.\"\n   - \"Pour water again. What happens when water hits the barrier?\"\n   - Record: \"Did the barrier help slow the erosion?\"\n\n4. **Connection to Real World:**\n   - \"Scientists and builders use these same ideas! Farmers plant trees on hills to stop erosion. Cities build walls and dams to slow water. Your ideas work in the real world too!\"\n\n5. **Discussion:**\n   - \"Which solution worked better—plants or barriers? Why?\"\n   - \"In the photograph, the green trees and plants cover the hills. Maybe they are helping slow erosion, just like your plants did!\"\n\n**Teacher Role:**\n- Ask: \"What do you observe? Is the water moving faster or slower than before?\"\n- Encourage comparison: \"Remember when we poured water with no plants? How is this different?\"\n- Celebrate creative solutions, even if they don't work perfectly.\n\n**Expected Student Outcomes:**\n- Students recognize that plants help slow erosion.\n- Students discover that barriers can slow water movement.\n- Students apply the concept of erosion to new scenarios.\n- Students demonstrate critical thinking about solutions to environmental problems.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment Throughout Lesson:**\n- Observe students during Explore phase. Can they describe what they see happening? Do they use words like \"water,\" \"flow,\" \"downhill,\" \"change\"?\n- During Explain, listen as students answer check-for-understanding questions. Can they identify hills and valleys?\n- During Elaborate, assess whether students recognize that plants slow erosion through their explanations and drawings.\n\n**Exit Ticket / Summative Assessment:**\n\nGive each student or pair a **Landscape Picture Card** (simple drawn landscape with labeled hills and valleys) and ask them to:\n\n1. **Draw one thing that water might do to this landscape.** (Expected: Show water flowing downhill, eroding sand, or carving a path.)\n\n2. **Complete these sentences:**\n   - \"A hill is _______________________.\"\n   - \"Erosion happens when ____________________.\"\n   - \"Plants help the land because _________________.\"\n\n3. **Picture Response:** Show a photo of real hillside erosion. Ask: \"What do you think caused these changes? How is this like what happened in our sand pans?\"\n\n**Success Criteria for Understanding:**\n- ✓ Student correctly identifies a hill or valley in a landscape.\n- ✓ Student explains that water or wind can change the shape of land.\n- ✓ Student recognizes that plants or barriers can slow erosion.\n- ✓ Student makes connections between model landscape and real photograph.\n\n**How to Determine If Students Met Objectives:**\n- All students should be able to label hills and valleys on a landscape sketch.\n- Most students (80%+) should explain that water moves downhill and changes the land.\n- Most students should recognize that plants help protect land from erosion.\n- Some students may predict or explain more complex ideas (e.g., \"The building is on a hill so water doesn't wash it away\").\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Pair with a Buddy:** Pair students who struggle with more confident peers during Explore. The buddy can help guide observations and documentation.\n\n2. **Pre-Teach Vocabulary with Tactile Objects:** Before the lesson, show real-world examples: a bowl of sand to represent a valley, a mound to represent a hill. Let students feel and manipulate these to build understanding before abstract thinking.\n\n3. **Sentence Frames for Recording:** Instead of open-ended questions, provide sentence frames:\n   - \"The water moved _____________________.\"\n   - \"The sand changed because ________________.\"\n   - Students fill in blanks rather than writing from scratch.\n\n4. **Simplified Exit Ticket:** Offer picture-only or single-sentence responses. For example:\n   - \"Point to the hill. Point to the valley.\" (No writing required.)\n   - Read exit ticket questions aloud. Accept verbal responses recorded by a scribe.\n\n### Challenge (for advanced learners):\n\n1. **Extended Erosion Investigation:** Ask: \"What happens if we tilt the pan to make the hill steeper? Do you think water will erode faster or slower?\" Have students test predictions and explain why angle matters.\n\n2. **Real-World Research:** Provide pictures of actual erosion (mudslides, river valleys, coastal cliffs). Ask: \"How long do you think it took water to make this? What helped create this landform?\" Encourage students to hypothesize about time scales.\n\n3. **Design Challenge:** \"If you were the builder of that house in the photograph, how would you protect it from erosion and flooding? Draw and label your design.\" (May include: drainage systems, barriers, vegetation, terracing.)\n\n4. **Vocabulary Extension:** Introduce related terms: **watershed** (all the land where water flows to one place), **tributary** (a smaller stream flowing into a larger one). Have students trace where water would flow in the photograph.\n\n---\n\n## Extension Activities\n\n1. **Walk the School Grounds (or Neighborhood) to Spot Erosion:**\n   - Take students outside to find real examples of erosion: water channels in dirt, worn paths, areas where soil is missing.\n   - Take photos or sketch what you find.\n   - Back in class, create a bulletin board: \"Erosion in Our Community—What We Found!\"\n   - Discuss: \"How is this like what happened in our pans?\"\n\n2. **Create a Landform Museum:**\n   - Have each student build a small model landform out of clay, sand, or salt dough.\n   - Students label their model with hill, valley, and water path.\n   - Create a classroom \"museum\" display with student models and cards explaining each landform.\n   - Invite another class to view and learn from student experts.\n\n3. **Read-Aloud and Discussion: Landform Picture Books**\n   - Read aloud a Second Grade-appropriate book about landforms or erosion (e.g., *Hill of Fire* by Thomas P. Lewis, or *Who Shaped This Land?* by Sheila Keenan).\n   - After reading, discuss: \"How does this story show how land changes? Have you seen erosion like this?\"\n   - Students draw their favorite landform from the book and label it.\n\n4. **Homework Connection: Family Landscape Walk**\n   - Send home a simple sheet: \"Look for Hills and Valleys Near Your Home!\"\n   - Students sketch or photograph a hill, valley, or landform with a family member.\n   - Students bring back observations: \"Where did we find it? How is it like the ones in our lesson?\"\n   - Share findings in a class discussion circle the next day.\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing:** If time is limited, combine Engage and Explore into one session, then do Explain, Elaborate, and Evaluate in the second session.\n- **Classroom Preparation:** Do a trial run of the water-and-sand activity yourself beforehand to anticipate student questions and mess management. Have extra paper towels nearby!\n- **Accessibility:** Ensure all students can see the photograph clearly. Consider providing a printed version at student desks, not just the projection.\n- **Real-World Tie-In:** If your region has visible examples of erosion (hillsides, river valleys, construction sites), reference them. Students connect better when they see local examples.\n- **Vocabulary Anchors:** Keep the vocabulary chart posted throughout the unit so students can reference it during later lessons.\n\n---\n\nThis lesson directly engages Second Grade students with concrete, observable phenomena. By moving from the photograph to hands-on investigation to formal vocabulary and real-world application, students develop a deep, meaningful understanding of landforms and erosion aligned with NGSS 2-ESS2-1 and 2-ESS2-2.",
  "inputTokens": 2379,
  "outputTokens": 4296,
  "cost": 0.023858999999999998,
  "generatedAt": "2026-02-12T22:19:08.863Z"
}