{
  "title": "Clouds",
  "category": "earth-space-science",
  "imageFile": "e03.jpeg",
  "imagePath": "images/earth-space-science/e03.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Clouds and Weather\n\n## Core Science Concepts from Image Analysis\n\n- **Cloud Formation and Types:** The photograph shows a large cumulus cloud with puffy, white appearance—a visible example of water vapor condensing in Earth's atmosphere as part of the water cycle.\n- **Weather Observation and Prediction:** The bright, towering cloud indicates atmospheric conditions that can be used to predict weather patterns and seasonal changes.\n- **Water Cycle Processes:** Clouds represent the condensation stage of the water cycle, where water vapor cools and forms visible water droplets in the sky.\n- **Seasonal Weather Patterns:** Large cumulus clouds like this are typical of fair-weather conditions and are often observed during specific seasons, connecting to predictable seasonal weather.\n\n---\n\n## Lesson Title\n\n**Clouds Up Close: What Do They Tell Us About Weather?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes in flexible scheduling)\n- **NGSS Standards:** \n  - 3-ESS2-1 (Represent data about typical weather conditions by season)\n  - 3-ESS2-2 (Obtain and combine information about climates in different regions)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify and describe what clouds look like and how they form in the sky.\n2. Observe and record cloud types and predict what weather might come with different clouds.\n3. Explain the connection between clouds and the water cycle (evaporation and condensation).\n4. Use cloud observations to predict weather conditions over time and compare weather in different seasons.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about clouds and activate prior weather knowledge.\n\n**Materials:**\n- Photograph of cumulus cloud with crane (displayed via projector, interactive board, or printed copy)\n- Chart paper and markers\n- Small toys or construction items (optional, for later reference)\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or printed format where all students can see clearly. Ask students to look carefully for 30 seconds without talking.\n\n2. **Pose these discussion questions** (pause for think-time after each):\n   - *\"What do you see in this picture? Describe the cloud to a friend.\"* (Students describe the big, puffy, white cloud.)\n   - *\"What is that tall structure? Why might someone build something so tall? What might it be used for?\"* (Discuss the construction crane; students may mention building tall buildings.)\n   - *\"Have you ever seen a cloud this big and fluffy in the sky? When do you remember seeing clouds like this?\"* (Personal weather experiences.)\n   - *\"What do you think might happen to this cloud? Will it stay the same, get bigger, disappear, or turn into rain?\"* (Predictions about weather change.)\n\n3. **Wonder Prompt:** \"I wonder why the cloud in this picture is so white and puffy. I wonder what's inside a cloud. Let's figure it out today!\"\n\n**Transition:** \"Today we're going to become cloud scientists. We'll explore how clouds form and discover what they can tell us about the weather.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate cloud formation through a hands-on water cycle model.\n\n**Materials (per small group of 3-4 students):**\n- One clear plastic cup or small jar\n- Hot water (teacher-prepared; approximately 1 inch in cup)\n- Ice cubes in a small plastic bag or on a cold pack\n- White paper or dark paper (for background contrast)\n- Observation recording sheet (simple sheet with cloud drawings and weather prediction prompts)\n- Pencils or crayons\n\n**Activity:**\n\n1. **Prepare the setup:** Before the lesson, prepare cups with 1 inch of hot water and place ice bags on each table.\n\n2. **Student directions (read aloud and post visually):**\n   - \"Look at your cup with hot water. What do you see coming from the top? Draw it on your paper.\"\n   - \"Now, hold the bag of ice above the cup (don't touch the water). Watch what happens for 1 minute.\"\n   - \"Do you see a cloud forming inside or above the cup? Describe what it looks like.\"\n   - \"Draw what you see on your observation sheet. Use words like: white, fluffy, thick, thin, foggy.\"\n\n3. **Recording:** Students sketch the \"cloud\" they created and write or dictate 2-3 words describing it. Provide sentence frames:\n   - \"Our cloud looked ___________.\"\n   - \"The cloud formed when ___________.\"\n\n4. **Connection to Photograph:** \"The cloud in our cup formed the same way the big cloud in the sky formed. The hot water made invisible water vapor, and the cold ice made it condense into a visible cloud.\"\n\n**Teacher Role:**\n- Circulate with a clipboard, asking open-ended questions: *\"What's happening? Why do you think the cloud appeared? Where did the water go?\"*\n- Avoid explaining; instead, prompt observation: *\"What do you notice? Tell me more about that.\"*\n- Ensure safety with hot water; handle setup yourself.\n\n**Expected Student Outcomes:**\n- Students observe visible water vapor condensing into a cloud-like formation.\n- Students record observations and begin connecting the model to the photograph.\n- Students generate questions about how real clouds form.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to the water cycle and weather prediction.\n\n**Materials:**\n- Chart paper with water cycle diagram (simple: sun → evaporation → condensation → cloud → precipitation)\n- Vocabulary cards with pictures (one per key term)\n- Photograph of the cloud displayed again\n- Whiteboard or chart for recording student responses\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3-4 groups to share their observations: \"What did your cloud look like? How did it form?\"\n   - Record shared words on chart paper: fluffy, white, thick, wet, foggy, etc.\n\n2. **Introduce Key Vocabulary (8 minutes):**\n   \n   Display each term with a picture or simple diagram:\n\n   - **Cloud:** Billions of tiny water droplets floating together in the sky. (Show a magnified diagram if possible.)\n   - **Condensation:** When water vapor cools down and turns into tiny water droplets. (Connect to the ice cubes in their experiment.)\n   - **Evaporation:** When water from oceans, lakes, and rivers warms up and turns into invisible water vapor. (Explain: \"The sun heats water, and it goes up into the air as an invisible gas.\")\n   - **Water Cycle:** The way water moves from Earth to the sky and back again (show simple circular diagram).\n   - **Cumulus Cloud:** A puffy, white cloud with a flat bottom that usually means fair weather (point to the photograph).\n\n3. **Make Connections (5 minutes):**\n   - \"In our experiment, the hot water was like the sun heating water on Earth.\"\n   - \"The invisible steam was like evaporation—water turning into a gas we can't see.\"\n   - \"The ice made the water vapor cool down (condensation), and we saw a cloud form—just like in the sky!\"\n   - Point to the photograph: \"This is a cumulus cloud. See how puffy and white it is? This tells us the weather is probably nice right now.\"\n\n4. **Check for Understanding:**\n   - \"Turn and talk: What has to happen for a cloud to form?\"\n   - \"Thumbs up, thumbs sideways, or thumbs down: Do you understand that clouds are made of tiny water droplets?\"\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Cloud** | Billions of teeny, tiny water droplets floating together in the sky. |\n| **Condensation** | When warm water vapor cools down and turns into water droplets we can see. |\n| **Evaporation** | When water from lakes, oceans, and rivers gets warm and turns into invisible water vapor that floats up into the air. |\n| **Water Cycle** | The never-ending path that water takes from Earth to the sky and back to Earth again. |\n| **Cumulus Cloud** | A big, puffy, white cloud with a flat bottom that often means fair weather is coming. |\n\n**Expected Student Outcomes:**\n- Students understand that clouds are made of water droplets.\n- Students can explain that condensation is when water vapor cools and forms clouds.\n- Students see the connection between their experiment and real clouds in the sky.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting weather based on cloud observations.\n\n**Materials:**\n- Printed cloud type cards (cumulus, stratus, cirrus) with pictures and brief descriptions\n- Weather prediction worksheet with columns for \"Cloud Type,\" \"What I See,\" and \"Weather Prediction\"\n- Pictures of different cloud types (printed or displayed digitally)\n- Daily weather chart or calendar\n\n**Activity:**\n\n1. **Introduce Cloud Types and Weather (5 minutes):**\n   - Show 3 cloud pictures: fluffy cumulus, flat stratus, and thin cirrus.\n   - Explain simply: \"Different clouds look different and tell us different things about weather.\"\n   - Cumulus = fair weather, sunny, nice day.\n   - Stratus = gray, cloudy, might rain soon.\n   - Cirrus = wispy, high up, might be windy.\n\n2. **Weather Prediction Activity (10 minutes):**\n   - Provide each student with a weather prediction worksheet.\n   - Show pictures of clouds one at a time.\n   - Students record: the cloud type, what they observe (color, shape, size), and their weather prediction.\n   - **Example:**\n     - Cloud: Cumulus\n     - What I see: Big, puffy, white, flat bottom\n     - Weather prediction: Fair weather! Good day to play outside.\n\n3. **Connect to Seasons:**\n   - \"Cumulus clouds like in our photograph are very common in summer. In winter, we see more stratus clouds and gray skies.\"\n   - Show or discuss: \"When is it normal to see puffy clouds? What season are we in now?\"\n\n**Teacher Role:**\n- Facilitate discussions without judgment.\n- Ask: *\"Why do you think that cloud might bring rain?\"* or *\"What does the color tell you?\"*\n- Guide students to use their observations, not memorization.\n\n**Expected Student Outcomes:**\n- Students practice observing cloud characteristics.\n- Students make predictions about weather based on cloud type.\n- Students begin understanding seasonal weather patterns.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of cloud formation, the water cycle, and weather prediction.\n\n**Formative Assessment (Throughout Lesson):**\n- Observe student responses during Engage discussion.\n- Review observation sketches and descriptions from Explore phase.\n- Listen to student explanations during group share-outs.\n- Monitor \"turn and talk\" responses and thumbs-up/sideways/down indicators.\n\n**Summative Assessment—Exit Ticket (5-10 minutes):**\n\nProvide each student with an exit ticket (printed or on whiteboard). Students respond orally or in writing, depending on capability:\n\n**Question 1:** \"Where did the water go when the hot water in our cup evaporated?\"\n- ☐ Up into the air as invisible water vapor\n- ☐ Into the ice cubes\n- ☐ Down into the table\n\n**Question 2:** \"What happened when the cold ice cooled down the water vapor?\"\n- ☐ It turned into a cloud (condensation)\n- ☐ It turned into rain\n- ☐ It disappeared\n\n**Question 3 (Open Response):** \"Look at this picture of a puffy white cloud. What do you think the weather will be like? Why?\"\n\n**Success Criteria:**\n\n✓ Students correctly identify evaporation and condensation in context (80% accuracy on exit ticket).\n\n✓ Students can make a reasonable weather prediction based on cloud observation (cloud type and description match prediction).\n\n✓ Students use learned vocabulary (cloud, evaporation, condensation, water cycle) in explanations (at least 2 terms used correctly).\n\n✓ Students connect the classroom experiment to real clouds in the photograph.\n\n**How to Determine if Students Met Learning Objectives:**\n- Exit tickets show understanding of evaporation/condensation.\n- Observation sheets from Explore show accurate descriptions and drawings.\n- Weather predictions are based on cloud characteristics, not random guessing.\n- Student language includes vocabulary from the lesson.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified Vocabulary:** Use only \"cloud,\" \"water,\" and \"weather\" in initial instruction. Introduce evaporation and condensation with heavy visual support and repeated exposure over multiple days.\n\n2. **Sentence Frames for Recording:** Provide pre-written sentence stems:\n   - \"Our cloud looked ___________ and ___________.\"\n   - \"The cloud formed when the ___________ got cold.\"\n   - \"When I see a puffy cloud, the weather will be ___________.\"\n\n3. **Partner Pairing:** Assign students to work with a stronger peer during Explore and Elaborate phases. The partner can help with recording and discussion.\n\n### Challenge (for advanced learners):\n\n1. **Predict Weather Changes Over Time:** Have students track clouds for 3-5 consecutive days, recording cloud type and weather daily. Create a graph showing which cloud types most often lead to rain or sun.\n\n2. **Research Additional Cloud Types:** Provide pictures and descriptions of lenticular, cumulonimbus, and mammatus clouds. Ask: \"What makes these clouds unique? What weather would they bring?\" Students create an illustrated cloud field guide.\n\n3. **Water Cycle Extension:** Have students research and explain the complete water cycle (evaporation, condensation, precipitation, collection). Create a labeled diagram or written explanation of each step with examples from their environment (puddles, rain, rivers, oceans).\n\n---\n\n## Extension Activities\n\n1. **Cloud Watching Journal:** Over 2 weeks, students observe and sketch clouds on the same day/time each day. They record the cloud type, weather, and season. Discussion: \"Do you notice patterns? Do the same clouds appear at the same time of year?\"\n\n2. **Design a Rain Gauge:** Students use a clear cylinder or cup to measure rainfall over 1-2 weeks. Record data on a chart. Compare measurements to cloud observations: \"Did cumulus days have less rain than stratus days?\"\n\n3. **Create a Water Cycle Model in a Bag:** Students place a plant cutting and water in a ziplock bag, seal it, and tape it to a sunny window. Over days/weeks, they observe condensation forming on the bag and water droplets falling back to soil. Label the processes: evaporation, condensation, precipitation. Discuss: \"How is this like the real water cycle?\"\n\n---\n\n## Notes for Implementation\n\n- **Safety:** Handle all hot water yourself. Ensure students do not touch hot cups directly.\n- **Timing:** This lesson works best split across two days (Day 1: Engage + Explore; Day 2: Explain + Elaborate + Evaluate) or as back-to-back 45-minute sessions.\n- **Weather Integration:** Schedule the lesson on a day when cumulus clouds are visible in your local sky. If possible, take students outside at the end of the Elaborate phase to observe real clouds and make predictions.\n- **Connection to Other Standards:** This lesson lays groundwork for future lessons on precipitation, severe weather, and climate differences between regions.",
  "inputTokens": 2350,
  "outputTokens": 3678,
  "cost": 0.02074,
  "generatedAt": "2026-02-12T22:24:07.305Z"
}