{
  "title": "Clouds",
  "category": "earth-space-science",
  "imageFile": "e03.jpeg",
  "imagePath": "images/earth-space-science/e03.jpeg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Clouds, Water, and Weather\n\n## Core Science Concepts from Image Analysis\n\n- **Water in the Atmosphere:** Clouds are visible water vapor condensed into observable form; they demonstrate that water exists in the air above us as part of Earth's water cycle.\n- **Weather Observation:** The bright, puffy cumulus clouds indicate fair weather conditions; observing clouds helps us understand and predict weather patterns.\n- **Water States:** Clouds represent water in its gaseous (vapor) and liquid (droplet) states, showing that water can change form in nature.\n- **Scale and Perspective:** The construction crane against the massive cloud emphasizes the enormous size of clouds and the dynamic nature of Earth's atmosphere.\n\n---\n\n## Lesson Title\n\n**Where Do Clouds Come From? Exploring Water in the Sky**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (or can be condensed into one 75-minute block)\n- **NGSS Standards:** \n  - 2-ESS2-3: Obtain information to identify where water is found on Earth and that it can be solid or liquid.\n  - 2-ESS1-1: Use information from several sources to provide evidence that Earth events can occur quickly or slowly.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Identify clouds** as a form of water found in Earth's atmosphere and describe what they observe in cloud photographs.\n2. **Explain that water can exist in different forms** (liquid, solid, gas) and give examples of each state in nature.\n3. **Describe how clouds form** using simple cause-and-effect language (warm water → water vapor → clouds).\n4. **Predict weather conditions** based on cloud observations using prior knowledge and evidence from photographs.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Spark curiosity about clouds and water in the sky using the photograph.\n\n**Materials:**\n- Printed or projected photograph (e.g., on interactive board or document camera)\n- Chart paper and markers\n- Student observation journals (half-sheets of paper)\n\n**Activity:**\n\n1. **Display the photograph** large enough for all students to see clearly. Do NOT explain it yet.\n\n2. **Ask these specific discussion questions** (pause after each to allow thinking time):\n   - \"What do you see in this picture? Tell me about the white, puffy things.\"\n   - \"Have you ever seen clouds like these before? Where were you?\"\n   - \"What is a cloud made of? What do you think is inside it?\"\n   - \"Why do you think this giant machine is in the sky with the clouds? What could it be doing?\"\n\n3. **Activate prior knowledge** with this prompt:\n   - \"Where does water live on Earth? Raise your hand if you've seen water in a puddle, a lake, or the ocean. Have you ever thought about water floating in the air?\"\n\n4. **Record student ideas** on chart paper under the heading \"What We Wonder About Clouds.\" Accept all responses without judgment—this activates curiosity and provides baseline assessment data.\n\n5. **Make a prediction prompt:**\n   - \"I'm going to show you how clouds form. Before we do that experiment, turn to a friend and guess: Do you think clouds are made of the same water that's in the ocean?\"\n\n**Transition:** \"Today we're going to be scientists and discover where clouds come from and what they're made of!\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate cloud formation and water states through hands-on simulation.\n\n**Materials (per pair or small group of 3):**\n- Clear plastic cup or glass jar\n- Warm water (teacher provides; approximately 1 inch deep)\n- Ice cubes (in a small container or sandwich bag)\n- Plastic wrap\n- Rubber band\n- Food coloring (optional, for visibility)\n- Small observation worksheet (provided below)\n- Pencil\n\n**Activity:**\n\n**Part A: Cloud Formation Simulation (15 minutes)**\n\n1. **Pair students and distribute materials.** Give each pair/group a cup with warm water.\n\n2. **Provide these step-by-step student directions:**\n   - \"Step 1: Look at the warm water in your cup. This water is like the ocean or a lake. What do you notice about it?\" (Students observe; teacher notes: water is liquid)\n   - \"Step 2: Place plastic wrap loosely over the top of your cup. Secure it gently with a rubber band—don't make it too tight.\"\n   - \"Step 3: Quickly place 3-4 ice cubes ON TOP of the plastic wrap (not in the water).\"\n   - \"Step 4: Watch carefully for 1-2 minutes. Describe what you see happening inside the cup.\"\n   - \"Step 5: Carefully peek under the plastic wrap. Is there water droplets? Where did they come from?\"\n\n3. **Students record observations** on their worksheet by:\n   - Drawing what they see (water in cup, ice on top, droplets forming)\n   - Writing or dictating 2-3 words describing the droplets (\"wet,\" \"tiny,\" \"cloud-like\")\n\n4. **Teacher circulates and asks guiding questions:**\n   - \"Where is the water now? Did the water in the cup disappear?\"\n   - \"How did those droplets get up there under the plastic wrap?\"\n   - \"Does this remind you of anything? Could this be like how clouds form?\"\n\n**Part B: Water State Sorting (7 minutes)**\n\n5. **Transition students** to a whole-group activity. Display three pictures/samples:\n   - A cup of liquid water\n   - An ice cube\n   - A cloud (from photograph or printed image)\n\n6. **Ask:** \"Which of these are water? Yes! They're all water, but in different forms.\"\n\n7. **Label each state simply:**\n   - Ice cube = \"Solid water\"\n   - Liquid water = \"Liquid water\"\n   - Cloud = \"Water in the air (gas/vapor that turned into water droplets)\"\n\n**Teacher Role:** Facilitate without explaining the full process yet. Use think-aloud: \"I notice the warm water is gone from the cup... where did it go? Let's think about that tomorrow when we learn the science words.\"\n\n**Expected Student Outcomes:**\n- Students observe water droplets forming inside the cup under plastic wrap\n- Students connect this to cloud formation\n- Students recognize that water appears in the cup, under the wrap, and in clouds\n- Students begin to understand water changes form (without using technical vocabulary yet)\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce vocabulary and formalize the water cycle and cloud formation concept.\n\n**Materials:**\n- Chart paper with vocabulary words written in large letters\n- Photograph (displayed again)\n- Diagram: Simple 3-step cloud formation process (provided at end of lesson)\n- Student vocabulary cards (one set per pair)\n\n**Activity:**\n\n1. **Share-out from Explore (5 minutes):**\n   - Ask 3-4 pairs: \"What did you see happening in your cup?\"\n   - Record key observations on chart paper: \"Water disappeared,\" \"Droplets appeared,\" \"It looked like a cloud.\"\n\n2. **Introduce Vocabulary (8 minutes):**\n\n   Use the chart paper to write and define these terms in student-friendly language:\n\n   **Vocabulary:**\n   - **Cloud:** A group of tiny water droplets floating together in the air, high up in the sky.\n   - **Water Vapor:** Water that floats in the air; we can't see it, but it's there (like the warm water that \"disappeared\" from your cup).\n   - **Evaporation:** When liquid water turns into water vapor and floats up into the air. (Show action: water going up = evaporation)\n   - **Condensation:** When water vapor cools down and turns back into tiny water droplets. (Show action: cooling down = droplets form = condensation)\n   - **Atmosphere:** All the air around Earth; it's where clouds live.\n\n3. **Connect Back to the Photograph (3 minutes):**\n   - Point to the photograph: \"Look at this big, beautiful cloud. How did it get there?\"\n   - Explain using simple cause-and-effect: \"Water from the ocean or lakes warmed up, became invisible water vapor, floated up into the sky, got cold, and turned into those droplets you see. That's a cloud!\"\n   - Point to the crane: \"This construction is happening on Earth, and look how big these clouds are—they're HUGE! Clouds are part of our weather.\"\n\n4. **Check for Understanding:**\n   - Ask students to match vocabulary cards to pictures/actions:\n     - Show water evaporating from a puddle → \"Evaporation!\"\n     - Show ice or cold surface creating droplets → \"Condensation!\"\n     - Show a cloud → \"That's water vapor that turned into water droplets!\"\n   - Use thumbs up/sideways/down: \"Do you understand what a cloud is?\" (Informal gauge)\n\n**Expected Student Outcomes:**\n- Students can name and describe a cloud in their own words\n- Students understand that water can be invisible (vapor) and visible (droplets/clouds)\n- Students can explain that cold causes water vapor to turn into water droplets\n- Students connect the warm water in their cup to real clouds in the sky\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Apply cloud and water concepts to real-world weather observation and prediction.\n\n**Materials:**\n- Printed pictures of different cloud types (4-5 images: cumulus like in photo, stratus, wispy clouds, dark clouds, no clouds/clear sky)\n- Weather observation chart (template provided)\n- Picture of the photograph again\n- Student worksheet: \"Predict the Weather\" (provided below)\n\n**Activity:**\n\n**Part A: Cloud Detective (10 minutes)**\n\n1. **Display different cloud pictures** one at a time (without labels). Ask:\n   - \"What do these clouds look like?\"\n   - \"Do you think it will rain soon with this cloud?\"\n   - \"How does this cloud make you feel?\"\n\n2. **Introduce the concept simply:**\n   - \"Different clouds tell us different things about weather. Some clouds mean sunshine is coming. Some mean rain!\"\n   - Point back to the photograph: \"These big, puffy clouds are the kind that often mean fair (good) weather!\"\n\n3. **Practice prediction:**\n   - Show the photograph again: \"If you saw clouds like these today, would you play outside? Why?\"\n   - Students discuss with a partner, then share out.\n\n**Part B: Weather Journal Entry (8 minutes)**\n\n4. **Students complete a simple worksheet:**\n\n   **\"I See Clouds\" Observation Sheet**\n   - Draw or describe: What clouds do you see outside our window today?\n   - Write or say: Is it sunny, cloudy, or rainy?\n   - Circle: Do you think rain is coming? Yes / No / Maybe\n   - Explain why (teacher scribes if needed): \"The clouds look _____, so I think _____.\"\n\n5. **Optional extension:** If weather permits, take the class outside for 5 minutes to observe real clouds. Have them sketch or describe what they see and compare to the photograph.\n\n**Teacher Role:** Facilitate discussion without correcting predictions (wrong predictions are teachable moments). Ask: \"What makes you think that?\" to deepen reasoning.\n\n**Expected Student Outcomes:**\n- Students can observe and describe different cloud types\n- Students make predictions about weather based on cloud observations\n- Students understand that clouds are evidence of water in the atmosphere\n- Students connect classroom learning to real-world weather they observe\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of water states, clouds, and basic water cycle processes.\n\n**Formative Assessment (throughout lesson):**\n- **Observe during Explore:** Do students notice water droplets forming? Do they connect this to clouds?\n- **Listen during Explain:** Can students use vocabulary correctly when discussing the photograph?\n- **Monitor Elaborate:** Do predictions show cause-and-effect thinking?\n\n**Exit Ticket / Summative Assessment (5-7 minutes):**\n\nProvide each student with this simple assessment (can be verbal or written with teacher scribing):\n\n**\"What I Know About Clouds\" Assessment**\n\n1. **Show a picture of a cloud.** Ask: \"What is this? What is it made of?\"\n   - **Success:** Student says \"cloud\" and mentions \"water\" or \"water droplets\"\n\n2. **Ask:** \"Where does the water in a cloud come from? How does water get up in the sky?\"\n   - **Success:** Student mentions warmth/heat, sun, water rising from ground/ocean/lake, or uses words like \"evaporation\" (if taught)\n\n3. **Show the original photograph.** Ask: \"Do you think it will rain soon with clouds like these? Why or why not?\"\n   - **Success:** Student makes a prediction and gives a reason (can be simple: \"because the clouds are white\" or \"because the clouds are big\")\n\n4. **Ask:** \"Can you name the three forms of water we learned about?\"\n   - **Success:** Student identifies solid (ice), liquid (water), and gas/vapor (clouds or air), though names don't need to be perfect.\n\n**Success Criteria:**\n- ✓ Student correctly identifies a cloud and what it's made of\n- ✓ Student demonstrates understanding that water rises from Earth (vague explanation acceptable)\n- ✓ Student makes a weather prediction with some reasoning\n- ✓ Student identifies at least two states of water\n\n**Expected Student Outcomes:**\n- Most students will be able to explain that clouds are water and that water comes from below (ocean/lakes/ground)\n- Students will make reasonable weather predictions based on cloud appearance\n- Students will demonstrate understanding that water exists in multiple forms\n- A few advanced students may use vocabulary like \"evaporation\" or \"condensation\" independently\n\n---\n\n## Differentiation\n\n### Support (Scaffolding for Struggling Learners)\n\n1. **Simplified Vocabulary:** Use only \"water vapor,\" \"condensation,\" and \"cloud\" (skip \"evaporation\" and \"atmosphere\"). Pair these with consistent hand motions (water rising = evaporation, fingers coming together = condensation).\n\n2. **Guided Observation During Explore:** Assign a classroom helper or paraprofessional to sit with this group during the cup experiment. Prompt: \"What do you see? Where is the water? Is it wet under the plastic?\" rather than expecting independent discovery.\n\n3. **Sentence Stems for Communication:** Provide sentence starters for exit ticket:\n   - \"A cloud is made of _____.\"\n   - \"Water comes up from the _____ into the sky.\"\n   - \"When I see clouds like this, I think it will _____ because _____.\"\n\n### Challenge (Extensions for Advanced Learners)\n\n1. **Water Cycle Diagram:** Ask advanced students to draw or label a simple water cycle (sun warming water → water rises → clouds form → water falls as rain → back to ocean). Provide a template with arrows already drawn; students add labels and illustrations.\n\n2. **Cloud Type Investigation:** Have students research two cloud types (cumulus, stratus, cirrus) using picture books or tablets. They create a simple poster: \"This cloud looks like _____. When I see it, the weather is _____.\"\n\n3. **Prediction Tracking:** Have advanced students keep a 3-day \"Cloud Journal\" where they sketch clouds and predict weather, then check if their prediction was correct. Chart accuracy: \"My predictions were correct _____ out of 3 times.\"\n\n---\n\n## Extension Activities\n\n1. **Classroom Cloud in a Jar (Take-Home):** Send families a simple instruction sheet to create the warm water + ice experiment at home. Students return with a drawing/photo and a sentence about what they discovered. This extends learning and builds family engagement.\n\n2. **\"Water Detective\" Walk:** Take students on a 10-minute outdoor walk to find evidence of water in different forms (puddles = liquid, grass with frost = solid water, steam from vent = vapor). Document with photos or sketches. Discuss: \"Where was the water? What form was it?\"\n\n3. **Cumulus Cloud Craft:** Students use cotton balls glued to blue paper to create clouds like those in the photograph. Label their creation with: \"This is a cumulus cloud. It means fair weather!\" Hang in classroom or hallway with the original photograph for comparison.\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing:** If you have limited time, condense Engage and Explore into one 30-minute session by doing the cup experiment as a teacher-led whole-group demo instead of individual pairs.\n- **Safety:** Warm water should be hot enough to produce visible water vapor (~40-50°C / 104-122°F) but safe to handle. Test temperature before the lesson. Handle all hot water; students only handle ice and plastic wrap.\n- **Photography Connection:** The crane in the photograph provides a relatable scale reference. Students understand that clouds are enormous compared to human-made structures—this reinforces the grandeur of Earth's water cycle.\n- **Follow-Up Lessons:** This lesson naturally leads to next lessons on rain, the water cycle (full version), or weather patterns.\n\n---\n\n## Lesson Materials Template\n\n### Part A: Student Observation Worksheet (Explore Phase)\n\n---\n\n**My Cloud Experiment**\n\n**Draw what you see inside the cup:**\n\n[Space for drawing]\n\n**Describe the droplets:** (Circle or write)\n- Wet  /  Cold  /  Tiny  /  Clear  /  Other: _______\n\n**Where did they come from?** (Draw arrows or write)\n\n[Space for response]\n\n---\n\n### Part B: Weather Prediction Worksheet (Elaborate Phase)\n\n---\n\n**I See Clouds**\n\n**Draw or describe the clouds outside our window:**\n\n[Space for drawing/writing]\n\n**Is it sunny, cloudy, or rainy today?** (Circle one)\n☀️ Sunny     ☁️ Cloudy     🌧️ Rainy\n\n**Do you think rain is coming?** (Circle)\nYes  /  No  /  Maybe\n\n**Why do you think that?**\n\nThe clouds look _________________, so I think _________________________.\n\n---\n\n### Part C: Exit Ticket Assessment (Evaluate Phase)\n\n---\n\n**\"What I Know About Clouds\"**\n\n**Teacher reads aloud; student responds verbally or with drawing/writing**\n\n1. **Show a cloud picture:** \"What is this? What is it made of?\"\n\n2. **Ask:** \"Where does the water in a cloud come from?\"\n\n3. **Show the original photograph:** \"Do you think it will rain soon? Why?\"\n\n4. **Ask:** \"Can you name the three forms of water we learned about?\"\n\n---\n\nThis lesson plan is ready to implement. All materials are common classroom items, timing is realistic, and vocabulary is appropriate for Second Grade. The 5E flow supports constructivist learning—students discover first, then apply scientific language. Good luck with your lesson!",
  "inputTokens": 2379,
  "outputTokens": 4427,
  "cost": 0.024514,
  "generatedAt": "2026-02-12T22:23:29.861Z"
}