{
  "title": "Clouds",
  "category": "earth-space-science",
  "imageFile": "e03.jpeg",
  "imagePath": "images/earth-space-science/e03.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Clouds in the Sky\n\n## Core Science Concepts from Image Analysis\n\n- **Clouds are visible evidence of water in Earth's atmosphere** – The large, puffy cumulus clouds in the photograph show water vapor that has condensed into visible droplets high in the sky.\n- **Clouds change shape and size over time** – The various cloud formations visible demonstrate that clouds are not permanent; they form, grow, and transform.\n- **The sun provides light and heat that affects the sky** – The bright, clear blue sky and the sun's strong illumination (creating sharp shadows and bright cloud highlights) illustrate how the sun's energy influences Earth's atmosphere.\n- **Daylight varies and can be observed** – The clear daytime conditions visible in this photograph represent strong daylight, which changes throughout the year and the day.\n\n---\n\n## Lesson Title\n\n**Watching Clouds: Sky Observers**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90-120 minutes (can be split into two 45-60 minute sessions)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe the characteristics of clouds** (color, shape, size) using simple language.\n2. **Record observations of the sky** using drawings and/or words to document what they see.\n3. **Predict how clouds might change over time** based on careful observation.\n4. **Recognize that the sun and clouds are visible during daytime** and connect this to patterns in the sky.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about clouds and the sky using the photograph.\n\n**Materials:**\n- Large printed photograph (at least 11\" x 14\") or digital display (projector/smart board)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see it clearly. Ask them to look carefully for 30 seconds without talking.\n\n2. **Pose these discussion questions** (one at a time, pausing for responses):\n   - \"What do you see in the middle of this picture?\" (Expect: clouds, the building, the sky)\n   - \"What color is the sky? What does the cloud look like to you?\" (Open-ended; accept creative responses like \"cotton candy,\" \"fluffy,\" \"white,\" etc.)\n   - \"Have you ever seen clouds like this? When do we see clouds?\" (Daytime; on sunny days)\n   - \"Do you think clouds stay the same shape, or do they change?\" (Elicit ideas about movement and change)\n\n3. **Wonder prompt:** Say, \"Today, we're going to become *cloud watchers*. We're going to look at real clouds outside and draw what we see. I wonder what shapes you'll find in the clouds?\"\n\n4. **Record student predictions** on chart paper: \"What do you think we might see when we look at clouds today?\" Accept all responses.\n\n**Transition:** \"Let's go outside (or look out the window) and be cloud detectives. We'll draw what we see so we remember it.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate clouds through direct observation and begin to notice patterns in cloud characteristics.\n\n**Materials:**\n- **Per student or pair:**\n  - Clipboard or hard writing surface\n  - White paper (8.5\" x 11\")\n  - Colored pencils or crayons (blue, white, gray, yellow)\n  - Pencil for writing/labeling\n- **Teacher:**\n  - Timer (optional, for timed observations)\n  - Camera or smartphone (to document observations)\n\n**Activity:**\n\n1. **Take students outside** to an open area with a good view of the sky (or position them at a window if outdoor access is limited).\n\n2. **Give clear directions:**\n   - \"Look up at the sky. Find the biggest, most interesting cloud you can see.\"\n   - \"Draw that cloud on your paper using colored pencils. You can make it any color you see—white, gray, or light blue.\"\n   - \"Look at the shape. Does it look like an animal, a food, a toy, or something else? You can label your drawing with that word.\"\n   - \"Color the rest of the sky around your cloud.\"\n\n3. **Allow 10-12 minutes for drawing** while students remain focused on the sky.\n\n4. **Ask students to look again:** \"Now find a *different* cloud. Is this one the same shape as your first cloud, or is it different? Draw it on the back of your paper.\"\n\n5. **Guide observation:**\n   - Circulate and ask: \"Tell me about your cloud. What do you see?\" (rather than \"Is this right?\")\n   - Point out without telling: \"I notice some clouds are fluffy and some look thinner. What do you see?\"\n\n**Teacher Role:**\n- Facilitate observation without directing what students \"should\" see.\n- Ask open-ended questions that encourage looking more carefully.\n- Ensure all students have time to observe and draw.\n- Take photos of student clouds and the actual sky for later discussion.\n\n**Expected Student Outcomes:**\n- Students produce drawings of at least two clouds with some detail (shape, color).\n- Students identify shapes or characteristics of clouds (fluffy, big, white, etc.).\n- Students notice that clouds can look different from one another.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to earth and space science concepts.\n\n**Materials:**\n- Chart paper and markers\n- Student drawings from Explore phase\n- Photograph from the lesson opener\n- **Optional:** Picture cards showing different cloud types (cumulus, stratus) in simple terms\n\n**Activity:**\n\n1. **Gather students back indoors** in a circle or on a carpet where everyone can see.\n\n2. **Revisit the opening photograph:**\n   - Display the photograph again and compare to student observations outside.\n   - \"When we looked outside, did we see clouds like these? Did they look different? Same?\"\n\n3. **Share student drawings:**\n   - Invite 4-5 volunteers to show their drawings and describe their clouds.\n   - \"Tell us what you drew. What color was it? What did it look like?\"\n\n4. **Introduce vocabulary** with simple, concrete definitions:\n\n   | **Term** | **First Grade-Friendly Definition** |\n   |----------|-------------------------------------|\n   | **Cloud** | A puffy or wispy white thing in the sky made of tiny water drops stuck together. |\n   | **Sky** | The big blue space above us during the day where we see clouds and the sun. |\n   | **Observe** | Looking very carefully at something and noticing what you see. |\n   | **Daytime** | The part of the day when the sun is shining and the sky is bright. |\n   | **Water** | The clear liquid that falls as rain and makes up clouds. |\n\n5. **Make connections:**\n   - \"Clouds are made of water. When the sun is very hot during the day, water goes up into the air and makes clouds.\"\n   - \"Clouds can change shape. They can move. They don't stay the same.\"\n   - \"We can see clouds in the daytime when the sun is out.\"\n\n6. **Check for understanding** using a show-of-hands strategy:\n   - \"Raise your hand if you saw a cloud today.\"\n   - \"Thumbs up if clouds are in the sky during daytime. Thumbs sideways if you're not sure.\"\n   - Ask 2-3 students: \"What does a cloud feel like if you could touch it?\" (Accept \"soft,\" \"fluffy,\" \"wet,\" etc., and validate creative thinking.)\n\n**Expected Student Outcomes:**\n- Students use the word \"cloud\" and \"observe\" in simple sentences.\n- Students understand that clouds are visible during daytime.\n- Students recognize that clouds can be different shapes and sizes.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding by tracking cloud changes over time.\n\n**Materials:**\n- Same clipboards and paper from Explore phase\n- New blank paper (8.5\" x 11\") per student\n- Colored pencils\n- **Optional:** Chart labeled \"Our Cloud Observations\" with three columns: \"First Drawing,\" \"Second Drawing,\" \"Did the cloud change?\"\n\n**Activity:**\n\n1. **Return outdoors (or to the window) for a second observation period** (this can happen 15-20 minutes after the first observation, or on a different day if time is limited).\n\n2. **Give directions:**\n   - \"Look at the same area of sky where you saw clouds before. Are the clouds still there?\"\n   - \"Draw what you see now. Is it the same as before, or did it change?\"\n   - \"You can draw on a new paper, or make marks on the back of your first drawing.\"\n\n3. **Guide thinking:**\n   - \"Some clouds move. Some clouds get bigger or smaller. Some go away. What do *you* notice?\"\n   - \"Pick one cloud and watch it for one whole minute. What happens?\"\n\n4. **Return indoors and compare:**\n   - Display both drawings side by side for a few volunteers.\n   - \"What changed? What stayed the same?\"\n   - Record observations on the chart or on chart paper: \"Our clouds changed by becoming smaller/bigger/moving away/changing shape.\"\n\n5. **Real-world connection:**\n   - \"When we watch the sky, we're doing what *meteorologists* do. Meteorologists study weather and sky. You're all sky scientists now!\"\n\n**Teacher Role:**\n- Facilitate outdoor time and ensure student safety.\n- Ask questions that prompt comparison: \"Is this cloud the same as before, or different?\"\n- Validate all observations, even if some students don't observe obvious changes.\n\n**Expected Student Outcomes:**\n- Students produce a second set of cloud drawings.\n- Students articulate at least one way clouds changed (moved, grew bigger/smaller, disappeared).\n- Students understand that observation over time shows patterns.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of cloud observation and the connection to daytime sky patterns.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- **Observation checklist** while students draw and discuss:\n  - ☐ Student looks at the sky carefully\n  - ☐ Student draws a recognizable cloud\n  - ☐ Student uses color appropriately\n  - ☐ Student describes a cloud using at least one descriptive word (big, fluffy, white, etc.)\n  - ☐ Student compares two observations (\"different,\" \"moved,\" \"changed,\" etc.)\n\n**Summative Assessment—Exit Ticket (5 minutes):**\nUse a simple, non-written exit strategy appropriate for First Grade:\n\n**Option A: Verbal Exit Ticket (1-on-1 or small group)**\nAsk each student:\n1. \"Show me your cloud drawing. Tell me what you drew.\"\n2. \"What color was your cloud?\"\n3. \"Did the cloud change when we looked again? How?\"\n\n**Option B: Picture-Based Exit Ticket**\nProvide a simple sheet with two boxes:\n- Box 1: Picture of daytime sky with clouds (pre-printed)\n- Box 2: Picture of nighttime sky with moon/stars (pre-printed)\n- Ask: \"Circle the picture that shows when we see clouds.\" (Students circle the daytime image.)\n- Ask: \"Draw a cloud in the circle you picked.\"\n\n**Option C: Turn-and-Talk**\nPartners answer: \"What did you observe about clouds today?\"\n\n**Success Criteria for Meeting Learning Objectives:**\n\n| **Learning Objective** | **Student Evidence** |\n|------------------------|---------------------|\n| Observe and describe clouds | Student draws a cloud and uses at least 1-2 descriptive words (white, fluffy, big, small, etc.) |\n| Record observations | Student produces 2 drawings documenting clouds on two occasions |\n| Predict changes | Student identifies at least 1 change in clouds between observations (shape, size, location) |\n| Connect to daytime | Student correctly identifies that clouds are seen during daytime when the sun is out |\n\n**Expected Student Outcomes:**\n- All students will complete at least one cloud drawing.\n- 80% of students will describe their cloud using descriptive language.\n- 70% of students will notice and articulate at least one change between observations.\n- 90% of students will demonstrate understanding that clouds appear in the daytime sky.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified observation guide:** Provide a pre-drawn outline of a cloud shape on paper. Students color it and add details, reducing the demand for drawing skills. This allows them to focus on observation and description.\n\n2. **Sentence stems for discussion:** Offer frames like:\n   - \"My cloud is _____.\" (color)\n   - \"My cloud looks like a _____.\" (shape/object)\n   - \"The cloud is/was _____.\" (big, small, fluffy, etc.)\n\n3. **Paired observation:** Pair with a peer mentor or the teacher during outdoor time so they receive adult guidance while observing.\n\n### Challenge (for advanced learners):\n\n1. **Sequence observation:** Ask advanced students to observe clouds 3 times (morning, midday, late afternoon if possible) and create a \"cloud story\" showing how the same cloud area changed throughout the day.\n\n2. **Deeper vocabulary:** Introduce the term \"cumulus cloud\" (fluffy, puffy clouds) and \"stratus cloud\" (flat, thin clouds). Have them categorize their drawings or outdoor observations into these types.\n\n3. **Pattern prediction:** Ask, \"If we watch this cloud again tomorrow, what do you think it will look like? Why?\" Encourage prediction based on past observations.\n\n---\n\n## Extension Activities\n\n1. **Cloud Sensory Discovery:** In a follow-up lesson, explore what clouds are made of by creating a \"cloud in a jar\" demonstration. Fill a clear jar with warm water, place a ice cube on top, and cover it. As students observe, water vapor condenses on the underside of the ice, mimicking cloud formation. Students draw and label their observations.\n\n2. **Daily Sky Journal (Ongoing):** Create a class \"Sky Observer's Calendar\" where one student per day draws or describes the sky's appearance (sunny, cloudy, rainy, etc.). Over weeks or months, students notice patterns in weather and daylight changes—directly supporting NGSS 1-ESS1-2.\n\n3. **Daytime and Nighttime Sorting:** Provide picture cards of daytime sky (with sun and clouds) and nighttime sky (with moon and stars). Students sort, discuss, and record: \"We see clouds during _____.\" and \"We see the moon and stars during _____.\" This reinforces observation patterns related to time of day.\n\n---\n\n**Teacher Notes:**\n\n- This lesson is designed to be flexible. If outdoor time is limited, use a large window or the opening photograph as the primary observation tool.\n- Repeat this lesson on different days or seasons to help students notice that cloud types and patterns change over time—building toward NGSS 1-ESS1-2 (relating daylight changes to time of year).\n- Celebrate all student observations as valid science. First graders are developing observational skills; creativity in describing clouds (e.g., \"It looks like a dinosaur!\") is developmentally appropriate and strengthens careful looking.\n- Save student drawings in a class portfolio to document growth in observation and descriptive language over the school year.",
  "inputTokens": 2319,
  "outputTokens": 3688,
  "cost": 0.020759,
  "generatedAt": "2026-02-12T22:22:42.561Z"
}