{
  "title": "Rock covered with Moss and Lichen",
  "category": "earth-space-science",
  "imageFile": "e05.jpeg",
  "imagePath": "images/earth-space-science/e05.jpeg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Rocks and the Living Things That Grow on Them\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Weathering and erosion:** The rock's surface is being broken down and changed over time by water, wind, and living organisms, demonstrating slow Earth changes.\n- **Lichen and moss growth:** Green and white organisms (lichen and moss) grow on rocks in moist environments, showing that rocks are part of Earth systems where life and non-living things interact.\n- **Rock composition and surfaces:** Rocks have different textures and colors; their surfaces can change and become covered with other materials over time.\n- **Environmental conditions supporting life:** Damp, shaded forest environments with organic matter (leaf litter) create conditions where organisms grow on rock surfaces.\n\n---\n\n### Lesson Title\n\n**Rocks Come Alive: Exploring Lichen, Moss, and How Rocks Change**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 2-ESS1-1: Use information from several sources to provide evidence that Earth events can occur quickly or slowly.\n  - 2-ESS2-1: Compare multiple solutions designed to slow or prevent wind or water from changing the shape of the land.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how rocks can change over time and identify what grows on them.\n2. Explain that lichen and moss are living things that grow on rocks and can show us that rocks are changing slowly.\n3. Identify that moisture and shade help lichen and moss grow on rocks.\n4. Predict and suggest ways that rocks might change faster or slower depending on their environment.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about rocks and living things using the photograph.\n\n**Materials:**\n- Projected or printed photograph of the lichen and moss-covered rock (e.g., on a screen or large poster)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** large and visible. Ask students to sit where they can all see clearly.\n\n2. **Pose an intriguing opening question:** \"Look at this rock. Do you see something growing on it? What do you think it is?\"\n\n3. **Ask these specific discussion questions** (pause after each for 10-15 seconds of thinking time):\n   - \"What colors do you see on this rock? Where do those colors come from?\"\n   - \"Do you think this rock looked the same when it was brand new? Why or why not?\"\n   - \"Have you ever seen rocks outside that look like this? Where were they?\"\n   - \"What do you think helps these living things grow on the rock—sunshine, shade, or water?\"\n\n4. **Prediction prompt:** \"I'm going to show you something that grows on rocks. It's alive, but it's not a plant or an animal. Can you guess what it might be? Write or draw your prediction on a sticky note.\"\n\n5. **Collect predictions** and display them on the board. Affirm all ideas as \"good thinking.\"\n\n**Transition:** \"Today we're going to be rock explorers and discover what really grows on rocks and how rocks change over time.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate rocks in their outdoor environment or through a provided rock collection to discover lichen, moss, and rock texture changes.\n\n**Materials:**\n- 1 rock per student (or small group) — collect rocks beforehand from outdoors that have visible lichen and/or moss, OR use rocks from a classroom collection and point students toward rocks with visible growth\n- Hand magnifiers or simple magnifying glasses (1 per student or pair)\n- Moist paper towels or spray bottles with water (optional, for demonstration)\n- Observation recording sheets (see template below)\n- Pencils or crayons\n- Outdoor access OR indoor rock display station\n\n**Activity:**\n\n**Student Directions (teacher reads aloud; post visually as well):**\n\n1. **\"Take your rock and look at it carefully. Is the rock smooth or bumpy? Is it all one color or many colors? Tell a partner what you see.\"**\n\n2. **\"Use your magnifier to look very closely. Can you see anything growing on the rock—something that looks fuzzy, bumpy, or colored? What does it feel like when you touch it gently?\"**\n\n3. **\"Look for the whitest or brightest spots and the greenest spots. Point to them. What do you think they are?\"**\n\n4. **\"Check: Are these colored parts on all sides of the rock or just some sides? Which side has more? Why do you think that is?\"**\n\n5. **\"Draw what you see on your observation sheet. Label the smooth parts, the bumpy parts, and the colored parts.\"**\n\n6. **(Optional: If using spray bottles)** \"I'm going to spray a little water on this rock. Watch what happens. How does it look different when it's wet? Does the green look more green?\"\n\n**Teacher Role:**\n- Circulate with magnifiers; let students lead the looking and talking.\n- Ask questions without giving answers: \"What do you notice? Can you find where it's wettest? Why do you think the color is different there?\"\n- Guide students to notice that growth appears mostly on the damper, shadier side.\n- Normalize all observations: \"Everyone's rock is different—that's what makes this interesting!\"\n\n**Expected Student Outcomes:**\n- Students will observe and record variations in rock texture, color, and the presence of fuzzy or bumpy growth.\n- They will notice that colored growth (lichen/moss) appears unevenly on the rock, often on damper or shadier sides.\n- They will produce a labeled drawing showing what they observed.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration; connect observations to the photo and real-world rock changes.\n\n**Materials:**\n- The original photograph (projected or printed)\n- Chart paper with vocabulary words and simple icons/pictures\n- Optional: Real specimens of lichen or moss in a clear container for closer inspection\n\n**Activity:**\n\n1. **Share-out from Explore (5 minutes):**\n   - Ask 3-4 student volunteers to share one observation: \"What did you find on or about your rock?\"\n   - Record their findings on a class chart using drawings and words.\n   - Affirm: \"Great noticing! You all found things I want to tell you about.\"\n\n2. **Introduce vocabulary with student-friendly definitions (5 minutes):**\n\n   - **Lichen** (pronounced \"LY-kun\"): \"Tiny living things that grow together on rocks, trees, and soil. They look like crusty spots or patches. Lichen eats the rock very, very slowly and helps break it down.\"\n   - **Moss:** \"A soft, fuzzy, green living thing that grows on damp rocks and soil. Moss likes shade and moisture.\"\n   - **Weathering:** \"When rocks slowly change and break into smaller pieces because of water, wind, ice, or living things like lichen and moss.\"\n   - **Erosion:** \"When pieces of rock and soil are carried away by wind or water, changing the shape of the land.\"\n\n3. **Connect back to the photograph (5 minutes):**\n   - Display the original photo again.\n   - Point to the white, crusty patches: \"Those are lichen—you probably saw something like that on your rocks!\"\n   - Point to the green fuzzy areas: \"That's moss—it likes the moist, shady parts of the rock.\"\n   - Ask: \"Why do you think the top of the rock in the photo has more lichen, and the side has more moss?\" (Elicit: top dries faster, side stays moist.)\n\n4. **Check for Understanding (3-5 minutes):**\n   - Show the photo and ask: \"Is the rock in this photo changing? Yes or no? How do you know?\"\n   - \"Are lichen and moss alive or not alive? How can you tell?\"\n   - \"What do you think this rock will look like in 10 years? In 100 years?\"\n\n**Vocabulary Chart (displayed and left up throughout unit):**\n\n| Word | Picture/Icon | Definition |\n|------|---|---|\n| **Lichen** | [crusty spots] | Tiny living things that grow on rocks and eat them slowly |\n| **Moss** | [fuzzy green] | Soft, green, fuzzy living thing that likes water and shade |\n| **Weathering** | [rock breaking] | Rocks slowly changing and breaking apart |\n| **Erosion** | [pieces moving] | Pieces of rock and soil being carried away by water or wind |\n\n**Expected Student Outcomes:**\n- Students can identify lichen and moss by sight and description.\n- Students understand that lichen and moss are alive and that they help rocks weather over time.\n- Students recognize that this process is slow but real.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply concepts to predict and model how rocks change in different environments.\n\n**Materials:**\n- Two or three small rocks (2-3 inches each), identical if possible\n- Three containers or plastic bags labeled: \"Very Wet,\" \"Dry Spot,\" \"Shady & Moist\"\n- Water, spray bottle\n- Damp cloth or sponge\n- Paper and pencils for predictions\n- Chart paper for group predictions\n\n**Activity:**\n\n**Scenario:** \"We've seen how lichen and moss grow on rocks in wet, shady places. But what if we could slow down how fast rocks change? Or make them change faster? Let's predict and test.\"\n\n**Teacher-Led Modeling (8 minutes):**\n\n1. Show students three identical rocks.\n\n2. **\"We're going to keep these three rocks in different environments for one week and see what changes. Make a prediction on your paper—draw or write what you think will happen.\"**\n\n3. **Set up three scenarios** (even if you can't actually grow lichen in a week, this teaches the principle):\n   - **Rock A (Dry Spot):** Place in a warm, dry, sunny location.\n   - **Rock B (Very Wet):** Place in a container where you'll spray it with water daily.\n   - **Rock C (Shady & Moist):** Wrap lightly in a damp cloth and place in a shaded location.\n\n4. **Ask:** \"Which rock will change the fastest? Which will change the slowest? Why?\"\n\n5. **Explain the thinking:** \"Lichen and moss need water to grow. More water means more living things can grow, which means the rock will weather faster. Less water means fewer living things, so the rock changes slower.\"\n\n**Student Application Activity (7-8 minutes):**\n\n1. **Partner work:** Give each pair a picture of a rock in different settings (sunny desert, rainy forest, inside a cave, on a sunny beach).\n\n2. **Task:** \"Draw or write: Does this rock have a lot of lichen and moss or a little? Will it weather quickly or slowly? Why?\"\n\n3. **Share out one example:** Ask a pair to explain their thinking.\n\n**Teacher Role:**\n- Guide predictions without saying right/wrong answers.\n- Ask: \"What does lichen need to grow? What does that tell us about which rock will weather faster?\"\n- Reinforce: \"You're thinking like scientists—using what we learned to predict!\"\n\n**Expected Student Outcomes:**\n- Students predict that wet, shady rocks will have more lichen/moss and weather faster.\n- Students explain reasoning based on what lichen and moss need to grow.\n- Students recognize that weathering can be slowed or sped up by environment.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of rock weathering, lichen/moss, and environmental factors.\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout lesson):**\n- Observe student explanations during share-outs and partner talks.\n- Check observation sheets for accurate drawings and labels.\n- Listen for use of vocabulary: lichen, moss, weathering, erosion.\n- Ask probing questions: \"How do you know that's moss? What made you predict that?\"\n\n**Exit Ticket / Summative Assessment (provide at end of Elaborate phase):**\n\n**Show the photograph again.** Ask students to respond (draw, write, or tell you) to **three questions:**\n\n1. **\"What living things are growing on this rock? Name or describe them.\"**\n   - ✓ Success: Student names lichen and/or moss or describes fuzzy/crusty growth.\n\n2. **\"Is this rock changing slowly or quickly? How do you know?\"**\n   - ✓ Success: Student says \"slowly\" and gives a reason (lichen/moss work over time, it takes a long time to break down a rock).\n\n3. **\"What does this rock need to stay wet so lichen and moss can grow? (Hint: Think about the weather.)\"**\n   - ✓ Success: Student names water, rain, moisture, or shade.\n\n**Success Criteria:**\n- Student correctly identifies lichen and/or moss.\n- Student correctly identifies that rock weathering is a slow process.\n- Student identifies at least one environmental factor (moisture/shade) that affects lichen/moss growth and rock weathering.\n\n**Modifications for Recording:**\n- Verbal response (student tells you; teacher records).\n- Picture/drawing response with labels.\n- Sentence starter: \"The rock is changing because ___.\"\n\n---\n\n### Differentiation\n\n**Support (Struggling Learners):**\n\n1. **Vocabulary scaffolding:** Introduce only two words first (lichen and moss) before adding weathering and erosion. Use picture cards and repetition.\n\n2. **Simplified observation task:** Assign students a \"buddy\" to observe rocks together. Provide a checklist sheet instead of blank: \"Color on rock? ☐ Yes ☐ No. Bumpy spots? ☐ Yes ☐ No. Looks fuzzy? ☐ Yes ☐ No.\"\n\n3. **Sentence stems for explaining:** Provide frames like \"The green fuzzy part is ____ because ____\" or \"This rock is changing ____ (slowly/quickly).\"\n\n**Challenge (Advanced Learners):**\n\n1. **Research question:** \"Some rocks weather faster than others. Why? Find out what kind of rock weathers the slowest.\" (Introduce granite, basalt, limestone as research options; older students can read simplified texts or look at images.)\n\n2. **Design a solution:** \"Design a way to protect a rock outside so that lichen and moss don't grow on it as fast. What would you do? Draw your idea and explain your thinking.\"\n\n3. **Timeline prediction:** \"If a rock like the one in the photo is covered in lichen and moss now, predict what it will look like in 1 year, 10 years, 100 years. Draw or describe each stage.\"\n\n---\n\n### Extension Activities\n\n1. **Rock Collection & Comparison:** Students collect rocks from around the school or home and classify them by weathering stage: \"Fresh rock,\" \"A little weathered,\" \"Very weathered with lots of growth.\" Create a display with photographs or the rocks themselves, arranged by weathering level.\n\n2. **Create a Lichen/Moss Habitat:** In a sealed clear container or terrarium, students layer soil, rocks, and add moss (if available from outdoors). Keep it moist and in indirect light for 2-3 weeks. Observe and record changes with drawings and notes. Discuss how environmental conditions affect organism growth.\n\n3. **Weathering Prevention Design Challenge:** \"Communities sometimes protect valuable rocks and sculptures from weathering. Research or brainstorm: How might people slow down weathering on a rock statue in a park? What could they do? Could a cover work? Wax? Could they move it indoors?\" Students sketch or prototype a solution and explain their reasoning.\n\n---\n\n## Teacher Tips & Notes\n\n- **Safety:** When collecting rocks outdoors, inspect for sharp edges. Have students wash hands after handling rocks and soil.\n- **Photography reminder:** Take photos of student observations and the rocks they find—these become excellent documentation and discussion starters.\n- **Real-world connection:** If possible, take students on a brief outdoor \"rock walk\" to spot lichen and moss in their actual habitat before or after this lesson. Pointing to a real rock on the school grounds is more powerful than any photo.\n- **Timing:** This lesson works best in a moist season (fall/spring in temperate climates). If you're in a dry climate, the photo becomes even more valuable as a reference point.\n- **Vocabulary persistence:** Use these four words repeatedly and intentionally over the next few weeks. Post them, revisit them, and reinforce them in other contexts (water cycle, landforms, etc.).",
  "inputTokens": 2379,
  "outputTokens": 3933,
  "cost": 0.022043999999999998,
  "generatedAt": "2026-02-12T22:27:58.335Z"
}