{
  "title": "Rock covered with Moss and Lichen",
  "category": "earth-space-science",
  "imageFile": "e05.jpeg",
  "imagePath": "images/earth-space-science/e05.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Rocks, Lichens, and Weathering\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Rocks and rock surfaces** — The photograph shows a large rock as a natural feature on Earth that can change over time\n- **Weathering and decomposition** — Visible lichens (the white, gray, and green growth) and moss represent organisms that help break down rock surfaces naturally\n- **Environmental conditions affect rock surfaces** — Moisture, shade, and light availability create different colors and growth patterns on the rock (note the greener side vs. lighter side)\n- **Living and non-living interactions** — Organisms (lichens, moss, grass) grow on non-living rocks, showing how nature works together\n\n---\n\n## Lesson Title\n\n**Rocks and Their Tiny Visitors: Exploring Weathering and Change**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes across two days)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted (connection: sun exposure affects lichen growth patterns)\n  - K-ESS2-1 (recommended foundational standard, though not strictly 1st-grade PE): Use observations of the sun, moon, and stars to describe patterns\n\n**Note:** First Grade ESS standards focus primarily on sun, moon, and stars patterns. This lesson reframes rock weathering through the lens of sun exposure patterns, directly connecting to 1-ESS1-1 by having students observe how sunlight creates visible patterns on rocks.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** how rocks in nature have different colors and textures based on where they are located.\n2. **Predict and explain** how sunlight and moisture affect what grows on rocks over time.\n3. **Identify** that living things (like moss and lichen) can live on rocks and help change them.\n4. **Compare and record** differences between rocks in sunny spots versus shady spots.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Spark curiosity about rocks and the tiny organisms that grow on them using the photograph as the hook.\n\n**Materials:**\n- Large color printout of the photograph (or project it on screen)\n- Chart paper and markers\n- Small hand lenses (one per pair of students, if available)\n\n**Activity:**\n\n1. **Display the photograph** on a screen or as a large poster where all students can see clearly. Give students 30 seconds to silently look and observe what they notice.\n\n2. **Ask these specific discovery questions** (one at a time, allowing time for responses):\n   - \"What do you see on this rock? What colors do you notice?\"\n   - \"Do you see anything green or white on the rock? What might those be?\"\n   - \"Why do you think one part of the rock looks different from another part?\" (Guide toward: one side is shadier, one side is in sun)\n   - \"Have you ever seen a rock like this before? Where?\"\n\n3. **Make a \"Wonder Wall\":** Draw a T-chart on chart paper labeled \"What We See\" (top left) and \"What We Wonder\" (top right). Record student observations and questions. Example wondering prompts:\n   - \"I wonder why the rock has fuzzy stuff on it?\"\n   - \"I wonder if the sun helps things grow on rocks?\"\n   - \"I wonder if rocks can change?\"\n\n4. **Prediction Prompt:** \"If we left this rock outside for one year, do you think it would look the same or different? Why?\"\n\n**Transition:** \"Let's go outside and become rock explorers to find rocks like this one and discover what's really happening on their surfaces!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate real rocks and observe patterns of lichen/moss growth in relation to sunlight and shade.\n\n**Materials:**\n- Hand lenses or magnifying glasses (one per pair)\n- Clipboards with paper for sketching (or pre-made observation sheets)\n- Pencils and crayons\n- Real rocks from outdoor schoolyard (various sizes, brought inside OR observed outside)\n- Optional: collected rocks with visible lichen, moss, or different colors\n- Digital camera or tablet (to document observations)\n\n**Activity:**\n\n**Phase A: Outdoor Investigation (or table-based if rocks brought indoors)**\n\n1. **Take students outside** (or gather around rock samples indoors). Assign pairs one or two rocks to investigate.\n\n2. **Give hands-on directions:**\n   - \"Look at your rock carefully. What color is it?\"\n   - \"Use the hand lens to look very, very close. Do you see anything fuzzy, bumpy, or greenish? That might be lichen or moss.\"\n   - \"Now look at different sides of your rock. Is one side greener than another? Is one side lighter? Why do you think?\"\n   - \"Feel the rock gently. Is it rough or smooth? Where is it roughest?\"\n\n3. **Encourage data collection:**\n   - Have students sketch their rock on paper and color the areas they see (help them use greens, whites, and grays for lichen/moss).\n   - Ask them to mark with an arrow which side gets the MOST sun and which side is SHADY.\n   - Have them draw a simple face showing: \"Does this rock look alive or not alive?\" (Introduce the idea that lichen is living but different from animals/plants.)\n\n4. **Document observations:** Take photos of student rocks or have students trace the rock outline and label what they see.\n\n**Phase B: Return to Classroom**\n\n- Post all sketches and observations on a \"Rock Collection\" board.\n- Note: Students may not use the term \"lichen\" yet—they'll say \"fuzzy stuff\" or \"the green things.\" That's developmentally appropriate.\n\n**Teacher Role:**\n- Circulate among pairs asking open-ended questions: \"What do you notice here? Which side of the rock has more green? Where is that part of the rock—in sun or shade?\"\n- Do NOT tell students the answer. Instead, guide observation: \"Let's look at the shady side and the sunny side. Are they the same?\"\n- Celebrate curiosity: \"Great observation! You noticed the fuzzy white stuff is mostly on the shadier side!\"\n\n**Expected Student Outcomes:**\n- Students observe and sketch rocks with visible color and texture differences.\n- Students notice greener/fuzzier growth on shadier sides or damper areas.\n- Students begin forming the idea that sun and shade affect what's on rocks.\n- Documentation shows diverse observations (various rock colors, lichen/moss patterns).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce vocabulary and concepts that explain students' observations.\n\n**Materials:**\n- Chart paper and markers\n- The original photograph (displayed again)\n- Picture cards of lichen, moss, and rock (optional, if available)\n- Student sketches from Explore phase\n- Poster of \"Sunny vs. Shady Rocks\" (prepared beforehand with two rock images)\n\n**Activity:**\n\n1. **Share Out from Explore (5 minutes):**\n   - Invite 2-3 students to show their rock sketches and say what they noticed.\n   - Ask the class: \"What did most groups find? Did rocks have more green stuff in sun or in shade?\"\n   - Build toward pattern: \"Rocks in the shade have MORE fuzzy green stuff!\"\n\n2. **Introduce vocabulary with student-friendly definitions (5-7 minutes):**\n\n   **Vocabulary with First Grade Definitions:**\n\n   | Term | Student-Friendly Definition |\n   |------|----------------------------|\n   | **Lichen** | Tiny living things that grow on rocks. They look fuzzy or crusty. They're not plants or animals—they're somewhere in between! Lichens love shady, wet places. |\n   | **Moss** | Tiny plants that grow on rocks and soil. They're soft and green. Moss likes damp, shady spots. |\n   | **Weathering** | When rocks slowly break down and change. Wind, water, ice, and sun make rocks crack and crumble over a very long time. Lichen and moss help weather rocks too! |\n   | **Sun/Sunlight** | Light and warmth from the sun. It makes things warm and bright. Lichen and moss don't need much sun—they like shade better! |\n   | **Shade** | A dark, cool spot where sunlight doesn't reach much. This is where lichen and moss grow best. |\n\n3. **Connect back to photograph (3-5 minutes):**\n   - Display the original rock photo again.\n   - Point to different areas: \"Here on the TOP, we see a lot of WHITE and GREEN fuzzy stuff. That's lichen and moss. Why is it there?\"\n   - Let students respond, then affirm: \"Right! That part probably gets rain and is shadier. Lichen and moss love that!\"\n   - Point to the darker areas: \"These spots are bare rock. Why don't the lichen grow there as much?\" (Guide: maybe too dry, too much sun, or different conditions.)\n\n4. **Check for Understanding (2 minutes):**\n   - Show two pictures/areas: sunny vs. shady rock.\n   - Ask: \"Where would we find more lichen? Sunny side or shady side?\" (Students respond; they should say shady.)\n   - Ask: \"What does the fuzzy white stuff help the rock do?\" (Guide: It helps break the rock apart slowly—weathering.)\n\n**Vocabulary List:**\n- **Lichen** — Tiny living things that grow on rocks in damp, shady places\n- **Moss** — Soft, green plants that grow on damp rocks\n- **Weathering** — When rocks slowly break down and change over time\n- **Sunlight** — Light and warmth from the sun\n- **Shade** — A dark, cool spot with less sunlight\n\n**Expected Student Outcomes:**\n- Students can name lichen and moss and explain where they grow.\n- Students understand that weathering is slow change to rocks.\n- Students connect sun exposure to lichen/moss growth patterns.\n- Students use vocabulary in simple sentences: \"The fuzzy stuff likes shade.\"\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting and planning an experiment about sun and shade effects.\n\n**Materials:**\n- Two identical rocks or rock samples\n- Two plastic containers or jars (one clear, one with shading [covered with paper])\n- Water in spray bottles\n- Poster board or chart paper\n- Crayons/colored pencils\n- Camera (optional)\n\n**Activity:**\n\n**Option A: \"Rock Keeper\" Prediction Experiment (Recommended for hands-on learners)**\n\n1. **Set up the activity:** Show students two identical rocks in containers.\n   - **Container A (Sunny):** Rock placed in a clear container or sunny window spot.\n   - **Container B (Shady):** Rock placed in a container covered with a shade cloth or kept in a dim corner. Mist both rocks with water every few days.\n\n2. **Make predictions together:**\n   - Ask: \"We're going to leave these rocks here for two weeks. What do you think will happen?\"\n   - \"Which rock do you think will get fuzzy lichen and moss first—the sunny one or the shady one?\"\n   - Have students draw and label their predictions on a chart: \"My Prediction: _____ will get more lichen.\"\n\n3. **Check observations weekly:**\n   - Each week, have students sketch what they observe on each rock.\n   - Ask: \"Is anything growing? Which side is growing more stuff?\"\n   - Keep a class chart of observations.\n\n4. **Discuss after two weeks:**\n   - \"Did our prediction come true? What actually happened?\"\n   - \"Why do you think the shady rock (if applicable) had more growth?\"\n\n**Option B: \"Design a Home for Lichen\" (Alternative for less hands-on settings)**\n\n1. Show students an outline of a large rock or boulder on poster paper.\n\n2. Ask: \"If we were lichen, where on this rock would we want to live? Would we pick the sunny top or the shady side?\"\n\n3. Have students color the rock to show:\n   - Where they'd place lichen (and why)\n   - Where sun hits vs. where shade is\n   - Draw tiny lichen in the best spots\n\n4. Students present: \"We put the fuzzy stuff here because it's shady and wet!\"\n\n**Teacher Role:**\n- Facilitate without directing outcome. Ask: \"What do you observe?\" rather than \"The lichen should be here.\"\n- Help students connect their design choices to what they learned about sun and shade.\n- Celebrate predictions: \"You predicted the shady side—let's see if you were right!\"\n\n**Expected Student Outcomes:**\n- Students make evidence-based predictions.\n- Students apply the concept that sun/shade affects lichen growth.\n- Students practice observing change over time (key to 1-ESS1-1).\n- Students explain their reasoning: \"I put lichen in the shade because it doesn't like sun.\"\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of rocks, weathering, and the relationship between sunlight and lichen/moss growth.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- Observe student sketches during Explore: Do students show differences in rock colors and textures?\n- Listen to Explain discussions: Can students explain where lichen grows and why?\n- Watch Elaborate predictions: Can students apply concepts to a new situation?\n\n**Exit Ticket / Summative Assessment (Choose one or combine):**\n\n**Option 1: \"Rock Drawing and Explanation\" (Most authentic for Grade 1)**\n- Provide students with an outline of a simple rock shape.\n- Ask them to:\n  1. Draw lichen and moss on the rock in the places where they would ACTUALLY grow.\n  2. Dictate or write (with teacher support): \"I put the fuzzy stuff here because _____.\"\n  3. Show which way the sun comes (with an arrow or sun symbol).\n\n**Option 2: \"Quick Picture Talk\"**\n- Show a new photo of a rock or a real rock students haven't seen.\n- Ask three questions (students respond verbally or with hand signals):\n  1. \"Where do you see lichen on this rock—sunny side or shady side?\"\n  2. \"Why does lichen like shade?\"\n  3. \"What is it called when rocks slowly break apart? (Weathering/Change)\"\n\n**Option 3: \"Comparison Sort\"**\n- Show picture cards of different rocks (some with lots of lichen, some bare, some mossy).\n- Ask students to sort them: \"Which rocks get lots of sun? Which are shady?\"\n- Explain sorting choices.\n\n**Success Criteria for Understanding:**\n✓ Student correctly identifies lichen/moss on rocks  \n✓ Student explains that lichen grows more in shade/damp places  \n✓ Student connects sun exposure to rock surface changes  \n✓ Student uses vocabulary: lichen, moss, shade, sunlight, weathering (in context)  \n✓ Student makes reasonable predictions about where organisms will grow on rocks  \n\n**How to Determine if Students Met Learning Objectives:**\n- **Objective 1 (Observe & describe):** Student sketches/descriptions show awareness of color and texture differences based on location (sun vs. shade).\n- **Objective 2 (Predict & explain):** Student predicts lichen growth location and explains using sun/shade language.\n- **Objective 3 (Identify living things on rocks):** Student names and describes lichen/moss; understands they're living and affect rocks.\n- **Objective 4 (Compare sunny vs. shady):** Student records or explains differences observed in rock samples.\n\n---\n\n## Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified vocabulary and visuals:**\n   - Use picture cards with labels (sun, shade, rock, fuzzy stuff) instead of expecting independent reading.\n   - Focus on one concept at a time: \"We're learning that lichen likes shade.\"\n   - Provide word bank for exit ticket (student circles \"sunny\" or \"shady\").\n\n2. **Hands-on, multi-sensory exploration:**\n   - Pair struggling learners with a strong partner for rock exploration.\n   - Provide real, touchable rocks with clearly visible lichen. Avoid abstract discussions.\n   - Use exaggerated examples: \"THIS rock is in complete shade. THIS rock is in bright sun. Which fuzzy stuff is more?\"\n\n3. **Scaffold predictions:**\n   - Use \"sentence frames\" for predictions: \"I think the _____ side will have more lichen because _____.\"\n   - Accept one-word or two-word responses: \"Shade.\" \"Sun makes it dry.\"\n   - Offer visual multiple-choice: Picture of sunny rock or shady rock—\"Where does lichen grow?\"\n\n**Challenge (For Advanced Learners):**\n\n1. **Deeper investigation of weathering:**\n   - Ask: \"Besides lichen and moss, what else might break rocks apart? (Rain, wind, ice, freezing.)\"\n   - Have them research or sketch multiple causes of weathering.\n   - Question: \"How long do you think it takes for weathering to change a rock? Days? Years? Hundreds of years?\"\n\n2. **Real-world application—outdoor survey:**\n   - Take advanced students on a \"rock walk\" around school to find and categorize rocks by sun exposure and lichen coverage.\n   - Create a simple map or chart: \"These rocks are sunny with little lichen. These are shady with lots of lichen.\"\n   - Predict: \"If we move a sunny rock to a shady spot, what will happen after one month?\"\n\n3. **Connection to time and patterns (supporting 1-ESS1-1):**\n   - Extend to sun patterns: \"We learned that shade helps lichen. The sun moves across the sky. How does that change where shade is?\" \n   - Introduce seasons: \"In winter, is the sun higher or lower? Will there be more shade on rocks in winter or summer?\"\n   - Create a chart showing how daily sun movement affects rock areas.\n\n---\n\n## Extension Activities\n\n1. **\"Lichen Through the Seasons\" Long-Term Observation Project**\n   - Mark a specific rock on the school grounds with a small flag or GPS location.\n   - Photograph or sketch it monthly for the entire year (or across two seasons if time is limited).\n   - Create a timeline poster: September (bare), November (a bit fuzzy), January (very fuzzy), March (less fuzzy?), June (drier?).\n   - Discuss: \"How does the season and sun angle change what grows on our rock?\" (Connects to 1-ESS1-1 on sun patterns.)\n\n2. **\"Create a Rock Habitat\" Art and Science Project**\n   - Provide students with paper rocks (cut from paper or foam), markers, and optional moss/lichen pictures to glue.\n   - Ask: \"Design a rock that has lichen on it. Show where the sun is, where the shade is, and draw or glue the fuzzy stuff where it belongs.\"\n   - Display with labels students create: \"Lichen grows here because it's shady and wet.\"\n\n3. **\"Weather or Not\" Story Writing**\n   - Read or share a simple story starter: \"A rock sits on a mountain. Sun beats on it. Rain falls on it. Snow freezes and thaws. And a tiny lichen arrives...\"\n   - Have students draw or write (with teacher scribing) what happens to the rock over time as weathering occurs.\n   - Reinforce that rocks DO change—slowly—and lichen helps.\n\n4. **Comparative Rock Jars**\n   - Have students make \"rock comparison jars\": one jar with a wet rock in the shade, one with a dry rock in the sun. Observe weekly.\n   - Prediction: \"Which jar's rock will change first? Why?\"\n   - Perfect for extending observation skills into early spring when growth accelerates.\n\n---\n\n## Summary of 5E Flow\n\n| Phase | Duration | Key Outcome |\n|-------|----------|------------|\n| **Engage** | 10–15 min | Students wonder about the photograph; curiosity is activated. |\n| **Explore** | 20–25 min | Students investigate real rocks and record observations about lichen/moss distribution. |\n| **Explain** | 15–20 min | Teacher introduces vocabulary (lichen, moss, weathering, shade) and connects observations to concepts. |\n| **Elaborate** | 15–20 min | Students apply learning by predicting future lichen growth or designing ideal rock habitats. |\n| **Evaluate** | 10–15 min | Students demonstrate understanding through drawings, explanations, and comparisons. |\n\n---\n\n## NGSS Alignment Notes\n\nThis lesson directly supports **1-ESS1-1** by having students:\n- **Observe patterns:** Lichen/moss growth patterns correlate with sun exposure (shady areas have more).\n- **Predict patterns:** Students predict that shady rocks will have more lichen; sunny rocks will have less.\n- **Relate patterns to predictability:** Over time, rocks in consistent shade will reliably develop more lichen. If you move a rock to shade, you can predict lichen will grow.\n\nWhile the photograph primarily addresses rock weathering (an Earth systems concept), the lesson *reframes* this through the lens of **sun patterns and how sunlight exposure predicts where organisms thrive**—making it directly aligned to First Grade ESS standards.\n\n---\n\n**This lesson is ready to teach. Print the photograph, gather materials, and enjoy watching your first graders become rock scientists!**",
  "inputTokens": 2319,
  "outputTokens": 5094,
  "cost": 0.027789,
  "generatedAt": "2026-02-12T22:27:13.789Z"
}