{
  "title": "Rock covered with Moss and Lichen",
  "category": "earth-space-science",
  "imageFile": "e05.jpeg",
  "imagePath": "images/earth-space-science/e05.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Rocks and Weathering\n\n## Core Science Concepts from Image Analysis\n\n- **Weathering and erosion**: The rock's surface is broken down by natural forces (water, wind, organisms), creating visible changes in texture and color over time\n- **Lichen and moss growth**: Living organisms colonize rock surfaces in moist environments, indicating how life interacts with nonliving Earth materials\n- **Rock as a natural resource**: Rocks are solid materials found in nature that make up Earth's surface and can be studied to understand Earth systems\n- **Environmental conditions and weathering**: The shaded, moist forest environment with nearby water creates ideal conditions for biological and chemical weathering processes\n\n---\n\n## Lesson Title\n\n**How Do Rocks Change? Exploring Weathering in Nature**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or flexible as three 30-minute sessions)\n- **NGSS Standards:** \n  - **3-ESS2-1**: Represent data in tables and graphical displays to describe typical weather conditions expected during a particular season\n  - **3-ESS3-1**: Make a claim about the merit of a design solution that reduces the impacts of a weather-related hazard\n\n---\n\n## Learning Objectives\n\nStudents will be able to...\n\n1. Identify and describe how rocks change over time due to weathering caused by water, wind, and living things.\n2. Explain how environmental conditions (moisture, shade, temperature) affect the rate of weathering and lichen/moss growth on rocks.\n3. Observe and record evidence of weathering using a data table and simple drawings.\n4. Design a simple solution to slow down or prevent rock weathering in an outdoor space.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of the weathered, lichen-covered rock.\n\n**Materials:**\n- Printed photograph (enlarged or projected on board/screen)\n- Chart paper or whiteboard for recording student observations\n- Marker\n\n**Activity:**\n\n1. **Display the photograph** to the whole class. Allow 30 seconds of silent looking time so students can notice details.\n\n2. **Ask these discussion questions** (one at a time, allowing wait time for answers):\n   - \"What do you see on this rock? Describe the colors and textures you notice.\"\n   - \"Where do you think this rock might be? What clues help you know?\"\n   - \"Do you think this rock looked like this when it was new? What might have changed it?\"\n   - \"What do you think could be making the fuzzy green parts on the rock grow there?\"\n\n3. **Prediction/Wonder Prompt:**\n   - \"I wonder why rocks outside look different than rocks indoors. What are your ideas?\"\n   - Invite students to turn and talk to a partner, then share 2–3 ideas aloud.\n   - Record student ideas on chart paper without correcting (e.g., \"Rain makes rocks change,\" \"Plants grow on rocks\").\n\n4. **Engagement Hook:**\n   - \"Today, we're going to become rock detectives! We'll investigate why rocks change and what makes fuzzy stuff grow on them.\"\n\n**Transition:** \"Let's go outside (or to our exploration station) and find some rocks like the one in our picture to study up close.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate and discover weathering and biological colonization through direct observation and data collection.\n\n**Materials:**\n- 1 rock per student or pair (can be collected from school grounds beforehand, or use rocks from a bucket you've prepared; rocks should vary in appearance—some smooth, some rough, some with visible lichen/moss)\n- Hand lenses (1 per pair)\n- Rock Observation Recording Sheet (template provided below)\n- Pencils\n- Paper towels (to gently wipe rock for clearer observation)\n- Optional: small containers of water for wetting rocks to see color differences\n\n**Activity:**\n\n**Step-by-step student directions:**\n\n1. \"Pick up your rock and look at it carefully. Don't squeeze it hard—just hold it gently.\"\n\n2. \"Use the hand lens to look very closely at the surface. What do you see?\"\n   - Rough or smooth spots?\n   - Different colors?\n   - Fuzzy growth (lichen, moss)?\n   - Cracks or holes?\n   - Wet or dry?\n\n3. \"Draw the rock on your recording sheet. Show what it looks like. Color your drawing if you can.\"\n\n4. \"Feel the rock with your finger. Is it bumpy? Smooth? Wet? Write one word that describes how it feels.\"\n\n5. \"Look for any green, white, yellow, or orange fuzzy or crusty growth. Circle or point to where you see it. Describe what it looks like.\"\n\n6. \"Think about where you found this rock. Was it in the sun or shade? Wet or dry? Write one clue.\"\n\n7. \"Complete this sentence: 'I think this fuzzy stuff grew on the rock because __________________.'\"\n\n**Connection to photograph:**\n- \"Does your rock look like the one in our picture? How? What's different?\"\n\n**What students should record:**\n- Labeled drawing of the rock\n- Texture description\n- Location of any lichen/moss\n- Prediction about how the fuzzy growth got there\n- Environmental clues (sunny/shady, wet/dry)\n\n**Teacher Role:**\n- Circulate and ask guiding questions without giving answers:\n  - \"What do you notice about the bumpy parts of the rock?\"\n  - \"Where is the fuzzy stuff growing—sunny spots or shady spots?\"\n  - \"Do you think water helped make these bumpy spots?\"\n- Help students use hand lenses effectively (look for texture, not just color).\n- Ensure everyone handles rocks carefully and returns to designated area.\n\n**Expected Student Outcomes:**\n- Students observe and record at least 3 visible characteristics of weathering (roughness, cracks, color changes, biological growth).\n- Students note that moisture and shade are present where organisms grow on rocks.\n- Students produce drawings and written observations showing engagement with the rock's surface features.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and scientific concepts after exploration, connecting back to observations.\n\n**Materials:**\n- Chart paper or whiteboard\n- Completed Rock Observation Recording Sheets from Explore phase\n- Images or specimens (if available): lichen, moss, smooth vs. rough rocks\n- Vocabulary cards (optional, with pictures)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 3–4 students to share their rock drawings and observations.\n   - Ask the class: \"What did we all notice that was the same? What was different?\"\n   - Record responses on chart paper (e.g., \"Rocks have bumpy parts,\" \"Green fuzzy stuff grows on rocks\").\n\n2. **Introduce key vocabulary (8–10 minutes):**\n   - **Weathering**: When rocks break down and change because of water, wind, sun, ice, and living things.\n   - **Lichen**: A living thing made of an alga and fungus that grows on rocks and trees. It's the fuzzy, crusty growth we saw.\n   - **Moss**: A small, soft green plant that grows on damp rocks and logs.\n   - **Erosion**: When weathered pieces of rock are moved away by water or wind.\n\n   *Teacher explanation (in child-friendly language):*\n   - \"The bumpy parts we saw? That's weathering happening! The water, sun, and wind are slowly breaking down the rock.\"\n   - \"The fuzzy green stuff? That's lichen and moss—they're living things that like to grow on rocks, especially when it's damp and shady.\"\n   - \"The lichen and moss actually help break down the rock by getting into tiny cracks. The rock changes, and the living things get a home. Pretty cool, right?\"\n\n3. **Connect back to photograph and observations (4–5 minutes):**\n   - Display the original photograph again.\n   - \"This rock is covered with lichen and moss, just like some of your rocks. The fuzzy white and green parts show it's been weathering for a long time. The bumpy texture means the rock is breaking down.\"\n   - \"Notice there's no moss in this picture [point to sunny areas]. Where is the moss? [Point to shaded areas.] Moss and lichen like wet, shady places.\"\n\n4. **Check for understanding strategy:**\n   - **Thumbs up, sideways, down:** \"Show me with your thumb—do you understand what weathering is?\"\n   - **Turn and talk:** \"Tell your neighbor one reason rocks change over time.\"\n   - **Quick questions:** \"Which grows on rocks—lichen or clouds?\" (Lichen.) \"Does weathering happen fast or slow?\" (Slow.)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Weathering** | When rocks slowly break down and change because of water, wind, sun, and living things. |\n| **Lichen** | A fuzzy or crusty living thing that grows on rocks and trees. It's made of an alga and a fungus working together. |\n| **Moss** | A tiny, soft green plant that grows on damp rocks, logs, and shady places. |\n| **Erosion** | When pieces of weathered rock are moved away by water or wind. |\n\n**Expected Student Outcomes:**\n- Students can define weathering in their own words.\n- Students can identify lichen and moss as living things that grow on rocks.\n- Students understand that moisture and shade speed up weathering and organism growth.\n- Students see the connection between their observations and scientific vocabulary.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply and deepen their understanding by solving a real-world problem about protecting rocks or structures from weathering.\n\n**Materials:**\n- Pictures or drawings of weathered buildings, statues, or bridges (printed or projected)\n- Design Challenge recording sheet (template provided)\n- Art supplies: paper, markers, crayons, colored pencils\n- Optional: small model rocks, clay, toothpicks, tape, plastic wrap, aluminum foil (for building a prototype)\n\n**Activity:**\n\n**Real-world scenario:**\n\n- \"People build things out of stone—like buildings, statues, monuments, and bridges. But weathering breaks them down slowly. Architects and engineers have to design ways to protect these structures so they last a long time.\"\n\n**Design challenge (student-friendly framing):**\n\n- \"Your job: Design a way to slow down or stop weathering on a rock or stone structure. What could you do? You can draw your idea or build a simple model to show how it works.\"\n\n**Guiding questions to help students think:**\n- \"What causes weathering? (Water, sun, wind, living things.)\n- What could we block or cover to slow weathering? (Water? Organisms? Sun?)\n- Could we use a coating, a shelter, or a cover?\"\n\n**Examples of solutions (share only after students brainstorm):**\n- Waterproof sealant or coating on the rock\n- A roof or shelter to keep water away\n- A special paint that stops lichen from growing\n- A layer of plastic or protective material\n\n**Student task:**\n1. Draw or describe your design solution.\n2. Label the parts and explain how it works.\n3. Explain why you think it would slow down weathering.\n4. Think about: Does your design have any problems? Could it be better?\n\n**Teacher Role:**\n- Ask students to explain their thinking: \"Why did you choose to cover/paint/shelter the rock?\"\n- Challenge advanced students: \"What might be a problem with your design? Could it be improved?\"\n- Encourage sketching and revising ideas.\n\n**Expected Student Outcomes:**\n- Students propose at least one practical solution to slow weathering.\n- Students explain their design using scientific vocabulary (e.g., \"The coating stops water from getting into cracks\").\n- Students demonstrate understanding that weathering can be slowed (not stopped) by controlling environmental factors.\n- Students show creative problem-solving and ability to apply concepts.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of weathering, lichen/moss growth, and environmental factors through formative and summative assessment.\n\n**Formative Assessment (ongoing throughout lesson):**\n\n- **Observe during Explore:** Are students noticing weathering features (roughness, cracks, color variation, organism growth)?\n- **Listen during Explain:** Do students use new vocabulary correctly when talking about their rocks?\n- **Check during Elaborate:** Can students explain why their solution would work using cause-and-effect reasoning?\n\n**Exit Ticket / Summative Assessment:**\n\nProvide each student with an **Exit Ticket** (written or drawn response). Choose one or use all three:\n\n**Option 1 (Drawing + Label):**\n- \"Draw a rock that is weathering. Show what is breaking it down (water, sun, living things, wind). Label your picture.\"\n- **Success criteria:** Rock shows at least 2 signs of weathering; student labels at least one cause (water, sun, lichen, wind).\n\n**Option 2 (Short Answer):**\n- \"Why does the fuzzy green stuff (lichen) grow on rocks in wet, shady places instead of sunny, dry places?\"\n- **Success criteria:** Student mentions that lichen likes moisture or shade, or explains that wet environments help it survive.\n\n**Option 3 (Comparison):**\n- \"Look at this new rock [show a smooth, clean rock]. How will it change over many years? What will make it change?\"\n- **Success criteria:** Student predicts weathering will happen and names at least one cause (water, living things, wind, sun).\n\n**Success Criteria for Understanding:**\n\nStudents demonstrate understanding if they can:\n- ✓ Describe at least 2 ways rocks change over time (by observing and recording)\n- ✓ Explain that water, sun, wind, and living things cause weathering\n- ✓ Identify lichen and moss as living things that grow on rocks in certain conditions\n- ✓ Use evidence from their rock observations to support their ideas\n- ✓ Propose a simple solution to slow weathering and explain why it works\n\n**How to Determine if Learning Objectives Were Met:**\n\n1. **Learning Objective 1** (Identify weathering): Review Rock Observation sheets—did students record bumpy texture, cracks, color changes, or organism growth?\n2. **Learning Objective 2** (Environmental conditions): Did students note that organisms grew in shady/wet spots? Can they explain why?\n3. **Learning Objective 3** (Observe and record data): Did students complete drawings, descriptions, and predictions?\n4. **Learning Objective 4** (Design solution): Did students propose a weathering-prevention idea and explain the science behind it?\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Provide a sentence starter sheet for observations:**\n   - \"The rock feels _______.\"\n   - \"I see fuzzy growth in the _______ places.\"\n   - \"I think the rock changed because _______.\"\n   - This scaffolds writing while maintaining student independence.\n\n2. **Pair students for the Explore phase:**\n   - Pair a struggling learner with a confident observer. Both students complete their own recording sheet, but they talk through observations together.\n   - Teacher circulates to this pair more often and asks guiding questions to deepen thinking.\n\n3. **Simplify the design challenge:**\n   - Instead of designing a solution, ask students to sort pictures of weathered vs. new rocks and explain one difference.\n   - Or: Provide 2–3 pre-made solution options (sealant, roof, cover) and ask which one would work best and why.\n\n### Challenge (for advanced learners):\n\n1. **Investigate a variable:**\n   - Give advanced students 2 different rocks (one weathered, one new) and ask: \"Which one do you think is older? How can you prove it?\" \n   - Have them hypothesize which areas of a rock weather fastest (edges vs. flat parts) and design a way to test it.\n\n2. **Extend the design challenge with constraints:**\n   - \"Your solution must be waterproof, last 5+ years, AND be affordable. Which solution do you think architects really use? Research it.\"\n   - Introduce real-world examples (marble statues, limestone buildings) and discuss why some structures need protection.\n\n3. **Introduce time scales:**\n   - \"How long does it take for a rock to fully weather? Days? Years? Centuries?\" \n   - Have students research and create a timeline showing how a rock changes over 100+ years, or predict what their observed rock will look like in 50 years.\n\n---\n\n## Extension Activities\n\n1. **Lichen and Moss Collection & Display:**\n   - Over 1–2 weeks, have students gently collect small pieces of lichen or moss from rocks around the school (or provide specimens).\n   - Create a \"Living Museum\" display with hand lenses and labels identifying species and the conditions where each was found (sunny, shady, wet, dry).\n   - Students write observation cards: \"Where I found this lichen,\" \"Why it grows here.\"\n\n2. **Rock Weathering Simulation (Home or Classroom Science):**\n   - Give students a small piece of chalk (a softer rock) and ask: \"If you rub this rock with water and sand, what happens?\"\n   - Provide a small container, chalk, sand, water, and a spoon. Students simulate weathering by mixing and observing.\n   - They record: \"Does the chalk get smaller? Do little pieces fall off? This is like natural weathering!\"\n   - Extend: Try different conditions (wet vs. dry, with vs. without sand/soil) and compare.\n\n3. **Seasonal Weathering Investigation:**\n   - Mark a specific rock or spot at school with chalk and photograph it monthly.\n   - Students collect photos and make a **Weathering Timeline** chart showing changes across seasons.\n   - Discussion: \"Does weathering happen faster in fall/winter when it's wet? Why?\"\n   - Data can be graphed: \"In which month did we see the most change?\"\n\n---\n\n## Rock Observation Recording Sheet (Template)\n\n```\nName: ________________________     Date: ________________\n\nMY ROCK DETECTIVE OBSERVATIONS\n\n1. Draw your rock. Show what it looks like.\n   [Space for drawing]\n\n2. How does your rock feel?\n   ☐ Smooth    ☐ Bumpy    ☐ Rough    ☐ Crumbly\n\n3. What colors do you see on your rock?\n   _________________________________________________________\n\n4. Do you see any fuzzy or crusty green, white, or orange growth?\n   ☐ Yes    ☐ No\n   If yes, where? Circle or draw it on your picture above.\n\n5. Where did you find your rock?\n   ☐ Sunny place    ☐ Shady place    ☐ Wet place    ☐ Dry place\n\n6. Finish this sentence:\n   \"I think the fuzzy stuff grew on my rock because _____________\n   _________________________________________________________\"\n\n7. How has your rock changed over time?\n   _________________________________________________________\n   _________________________________________________________\n```\n\n---\n\n## Design Challenge Recording Sheet (Template)\n\n```\nName: ________________________     Date: ________________\n\nROCK PROTECTION DESIGN CHALLENGE\n\nProblem: Rocks weather and break down over time. How can we slow this down?\n\nMY SOLUTION:\n\nDraw or describe your idea:\n[Space for drawing]\n\nWhat is your solution called? _______________________________\n\nHow would you build it or apply it to a rock? (Labels help!)\n_________________________________________________________\n_________________________________________________________\n\nWhy will this slow down weathering?\n_________________________________________________________\n_________________________________________________________\n\nDoes it stop or block any of these?  (Circle or check all that apply)\n☐ Water getting in     ☐ Lichen/moss growth     ☐ Wind\n☐ Sun damage           ☐ Something else: ______________\n\nWhat might be a problem with your design?\n_________________________________________________________\n\nCould you make it better? How?\n_________________________________________________________\n```\n\n---\n\n## Teacher Tips\n\n- **Timing flexibility:** This lesson can be compressed into one extended session (60–90 min) or spread over two full class periods depending on your schedule and students' pace.\n- **Rock sourcing:** Collect varied rocks beforehand (smooth granite, weathered shale, lichen-covered stones from local areas). This ensures all students see good examples.\n- **Safety reminder:** Remind students to handle rocks gently and return them to designated areas; they belong outside and should not be taken as souvenirs.\n- **Connection to seasons:** This lesson ties directly to **3-ESS2-1** if you extend it by monitoring the same rocks across seasons and recording weathering changes in a data table.\n- **Building vocabulary:** Use the vocabulary cards repeatedly across the lesson to reinforce lichen, moss, weathering, and erosion. Display them permanently in the classroom.",
  "inputTokens": 2350,
  "outputTokens": 4935,
  "cost": 0.027025,
  "generatedAt": "2026-02-12T22:28:49.423Z"
}