{
  "title": "Drought",
  "category": "earth-space-science",
  "imageFile": "e06.jpeg",
  "imagePath": "images/earth-space-science/e06.jpeg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Drought, Soil, and Earth's Water Systems\n\n## Core Science Concepts from Image Analysis\n\n- **Drought and Water Scarcity:** The cracked, dried soil visible in the photograph represents extreme water loss from the ground, demonstrating what happens when rainfall is limited over extended periods.\n- **Soil Structure and Composition:** The visible cracks and texture show how soil changes physically when it loses moisture, revealing layers and the connection between water presence and soil integrity.\n- **Earth Systems Interaction (Hydrosphere-Geosphere):** The photograph illustrates how water in the hydrosphere directly affects the geosphere (soil and land), showing dependence between these systems.\n- **Water Distribution on Earth:** This image represents areas where freshwater is scarce, connecting to the broader concept that water is unevenly distributed across Earth's surface.\n\n---\n\n## Lesson Title\n\n**Where Did All the Water Go? Understanding Drought and Earth's Thirsty Soil**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90-100 minutes (two 45-50 minute sessions, or one extended 90-minute block)\n- **NGSS Standards:** \n  - 5-ESS2-1: Develop a model using an example to describe ways the geosphere, biosphere, hydrosphere, and/or atmosphere interact.\n  - 5-ESS2-2: Describe and graph the amounts and percentages of water and fresh water in various reservoirs to provide evidence about the distribution of water on Earth.\n  - 5-ESS3-1: Obtain and combine information about ways individual communities use science ideas to protect the Earth's resources and environment.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Explain** how water moves between Earth's systems (atmosphere, hydrosphere, geosphere) and describe what happens to soil when water is removed.\n2. **Describe** why water is unevenly distributed on Earth and identify which areas receive more or less freshwater.\n3. **Predict and model** how soil changes physically when it loses water, and connect this to real-world drought conditions.\n4. **Propose** one way their community or they personally could help conserve water or support areas affected by drought.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about the dramatic photograph and activate prior knowledge about water, soil, and weather.\n\n**Materials:**\n- Printed or digitally projected photograph (e-06.jpeg) of cracked, dried soil\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the Photograph:** Project the image on a screen or show a large printed version. Say: \"Look carefully at this photograph for 30 seconds. I want you to notice everything you can see.\"\n\n2. **Guided Observations:** Ask students to turn to a partner and share what they notice without any explanation from you yet. After partner talk (1-2 minutes), facilitate a brief whole-class share-out. Record observations on chart paper (e.g., \"Cracked dirt,\" \"Dry,\" \"Separated pieces,\" \"Little plants growing\").\n\n3. **Discussion Questions to Spark Curiosity:**\n   - \"What do you think caused the soil to crack like this?\" (Expect responses about heat, dryness, or missing water.)\n   - \"If soil normally holds water, where do you think all that water went?\"\n   - \"Have you ever seen a puddle dry up on a hot day? What happened to the water?\" (Connects to evaporation.)\n   - \"Why do you think it's important for soil to have water in it?\"\n\n4. **Wonder Prompt:** Write on the board: *\"I wonder what happens to soil when all the water disappears...\"* Ask: \"What would you like to find out about this cracked soil?\"\n\n**Transition:** \"Today, we're going to explore exactly what happens when soil loses water, and we'll figure out where that water goes. Let's do some investigating!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how water affects soil structure through a hands-on experiment that models the drying process.\n\n**Materials (per small group of 3-4 students):**\n- 2 clear plastic cups or containers\n- Potting soil (about 2-3 cups per group)\n- Water (in a spray bottle or small pitcher)\n- Ruler\n- Paper towels\n- Optional: salt or food coloring (to make cracks more visible; 1-2 drops per cup)\n- Observation sheet (see below) or notebook\n- Heat lamp or sunny window location (optional, to speed drying if time is limited)\n\n**Activity:**\n\n1. **Setup (5 minutes):** Distribute materials to each group. Say: \"You're going to create a mini version of what's happening in the photograph. First, we're going to make soil with water in it, then we'll watch what happens as it dries out.\"\n\n2. **Student Directions:**\n\n   **Part A: Create \"Wet Soil\"**\n   - Fill Cup 1 with potting soil to about 2 inches high.\n   - Slowly add water (spray bottle or pour) until the soil is moist but not muddy—like the texture of a wrung-out sponge.\n   - Press the soil down gently so it's evenly packed.\n   - Measure and record the height of the soil. Look at the surface and describe how it looks and feels. (Record: \"Smooth,\" \"Wet,\" \"Clumpy,\" etc.)\n   - If using food coloring or salt, add 2-3 drops or a sprinkle to the surface now so cracks are easier to see later.\n\n   **Part B: Observation Over Time**\n   - Place Cup 1 in a sunny window or under a heat lamp (or let it sit at room temperature if time allows over 2-3 days).\n   - Every 5-10 minutes (or daily if this extends over multiple days), observe Cup 1 without adding more water. Record what you see:\n     - Does the soil look different? (Color, shine, texture)\n     - Do you see any cracks? Where do they start?\n     - How deep are the cracks?\n     - Is the surface smooth or bumpy?\n   - Keep Cup 1 as a comparison—do NOT add water to it.\n\n3. **Cup 2 (Control—Keep Wet):** Optional: Have students keep Cup 2 continuously moist throughout the observation period so they can compare wet vs. dry soil side by side at the end.\n\n4. **Teacher Role:** \n   - Circulate and ask guiding questions: \"What's changing?\" \"Why do you think cracks are forming?\" \"What do you think happened to the water?\"\n   - Do **not** tell students the answer; instead, encourage observation and inference.\n   - If students finish early, ask: \"Do you think this is what's happening in the photograph? Why?\"\n\n5. **Recording:** Students should sketch and describe their observations at the start and after 5, 10, 15, and 20 minutes (or each day if extended). Use a simple table:\n\n   | Time | Soil Color | Cracks? (Yes/No) | Crack Size | Notes |\n   |------|-----------|-----------------|-----------|-------|\n   | Start | Light brown | No | — | Wet, clumpy |\n   | 5 min | — | — | — | |\n   | 10 min | — | — | — | |\n\n**Expected Student Outcomes:**\n- Students observe soil changing color (darker to lighter) as water evaporates.\n- Visible cracks begin to form as the soil shrinks and loses moisture.\n- Students make informal predictions about where the water went (evaporation into the air).\n- Connection forms between the model and the photograph: \"Our soil is starting to look like that picture!\"\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Formalize vocabulary and concepts; connect observations to Earth systems and the water cycle.\n\n**Materials:**\n- Student observation sheets from Explore\n- Large diagram or poster of the water cycle (or draw one now)\n- Chart paper with vocabulary terms\n- Optional: photograph displayed again for reference\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):** Ask groups to share their key observations:\n   - \"What changed in your soil over time?\" \n   - \"What do you think caused those changes?\"\n   - Record their ideas on chart paper.\n\n2. **Teacher-Led Explanation (10 minutes):** Use student observations to launch explanation:\n\n   *Say:* \"You just watched something that happens on Earth every day. When water leaves the soil and goes into the air, we call that **evaporation**. That's one reason the photograph shows such cracked, dry soil—all the water evaporated because there was no rain to replace it.\"\n\n   Draw or display a simple water cycle diagram showing:\n   - Sun heating water in soil → evaporation (water vapor rises into atmosphere)\n   - Water vapor in atmosphere (hydrosphere and atmosphere interacting)\n   - Condensation → precipitation (rain returns to geosphere)\n   - Water infiltrates soil or runs off into rivers and oceans (geosphere and hydrosphere interacting)\n\n   *Say:* \"When it doesn't rain for a long time, evaporation keeps removing water, but no new water comes back in. That's called a **drought**. The soil dries out, shrinks, and cracks—just like in your cups and the photograph.\"\n\n3. **Connection to Water Distribution (3 minutes):** Show where Earth's water is located:\n   - 97% is salt water (oceans)\n   - 3% is freshwater\n   - Of that freshwater, most is frozen in ice caps or deep in the ground\n   - Only a tiny amount is available for people and plants to use\n\n   *Say:* \"Some parts of Earth get lots of rain and freshwater. Other places, like the one in the photograph, get very little rain. That's why water is precious and we need to use it carefully.\"\n\n4. **Check for Understanding:** Ask:\n   - \"Where does water go when it evaporates?\" (Into the air/atmosphere)\n   - \"What do we call it when there's no rain for a long time?\" (Drought)\n   - \"Why is the soil cracking?\" (It's shrinking because water left it)\n\n**Vocabulary:**\n\n- **Evaporation:** The process by which water changes from a liquid (like water in soil) into a gas (water vapor) that rises into the air, usually because of heat from the sun.\n\n- **Drought:** A long period of time with little or no rain, which causes water in soil and other places to dry up.\n\n- **Water Cycle:** The continuous movement of water between the atmosphere, hydrosphere, and geosphere—water evaporates from Earth's surface, forms clouds, falls as precipitation, and returns to the surface.\n\n- **Geosphere:** All of the solid parts of Earth, including soil, rocks, and land.\n\n- **Hydrosphere:** All of the water on Earth, including oceans, lakes, rivers, groundwater, and water in the atmosphere.\n\n**Expected Student Outcomes:**\n- Students can explain that evaporation removes water from soil and sends it into the air.\n- Students understand that drought is caused by lack of rainfall and is a consequence of the water cycle.\n- Students connect their model to the real-world photograph and understand the Earth systems involved.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Deepen understanding by applying concepts to a new scenario and exploring real-world connections to water conservation and community resilience.\n\n**Materials:**\n- Map of world showing areas with frequent droughts (e.g., Africa, Australia, southwestern USA)\n- Case study cards or short text (see below)\n- Chart paper for brainstorming\n- Optional: images of drought-resistant plants or water-saving devices\n\n**Activity:**\n\n**Option A: Real-World Drought Case Study (15 minutes)**\n\nDivide the class into three groups, each assigned a different drought region or scenario. Provide a brief case study (1-2 paragraphs, read aloud or summarized by teacher):\n\n**Group 1: Sub-Saharan Africa Drought**\n- \"Many countries in Africa, like Ethiopia and Kenya, experience long droughts. When rains fail, the soil dries up like the photograph. Crops die, and people don't have enough food or water. Scientists and communities are working together to build wells and collect rainwater when it does rain.\"\n\n**Group 2: Southwestern USA Drought**\n- \"States like California and Arizona use water from rivers for farms and cities. When there's a drought, these rivers don't have enough water. Communities must use less water by taking shorter showers, watering plants less, and using drought-resistant plants instead of grass.\"\n\n**Group 3: Australia Drought**\n- \"Australia has large areas with very little rain. During droughts, farmers can't grow crops, and wildfires threaten communities. People are planting trees that don't need much water and storing rainwater for emergencies.\"\n\n**Group Task (10 minutes):**\n- Read or listen to your case study.\n- Discuss: \"Why is this area in drought? What are people doing to adapt or conserve water?\"\n- Use chart paper to create a poster showing: (a) the problem (drought), (b) how it's connected to the water cycle, and (c) one solution the community is using.\n\n**Sharing (5 minutes):** Each group presents their poster. Class discusses similarities and differences in how communities respond to drought.\n\n---\n\n**Option B: Design a Water-Saving Plan (15 minutes)**\n\n*Say:* \"Now that you understand how water moves and why droughts happen, let's think about your own community and home. Where does your water come from? How can you and your family help conserve it?\"\n\n**Activity:**\n- Display a simple diagram of water use in a home (drinking, toilets, showers, laundry, plants).\n- In small groups, have students brainstorm 3-4 ways they can reduce water use. Examples:\n  - Shorter showers\n  - Turning off the tap while brushing teeth\n  - Watering plants only when needed\n  - Collecting rainwater in a barrel\n  - Fixing leaky faucets\n- Students create a \"Water-Saving Pledge\" poster or agreement they can take home to their families.\n\n**Teacher Role:** \n- Facilitate discussion; validate all ideas.\n- Guide students to think beyond their home to community-level solutions (e.g., city watering schedules, building cisterns, planting drought-resistant plants in parks).\n\n**Expected Student Outcomes:**\n- Students identify and explain real-world applications of drought and water conservation.\n- Students propose practical, age-appropriate solutions for conserving water.\n- Students recognize that understanding Earth systems helps communities solve problems.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of water systems, evaporation, drought, and conservation.\n\n**Activity:**\n\n**Formative Assessment Throughout Lesson:**\n- Observations during Explore: Were students accurately recording changes in soil? Did they make predictions about evaporation?\n- Discussion during Explain: Could students explain evaporation and drought in their own words? Did they connect observations to vocabulary?\n- Group work during Elaborate: Did students apply concepts to new scenarios? Were their conservation ideas reasonable?\n\n**Exit Ticket Assessment (5-7 minutes):**\nDistribute an exit ticket (or use a digital form) with these questions. Students complete individually before leaving:\n\n1. **Observation Recall:** \"Look at the photograph again. Explain what caused the soil to crack.\"\n   - Expected: Students mention evaporation and lack of water/rain.\n\n2. **Concept Application:** \"If it rains tomorrow where this photograph was taken, what might happen to the cracks in the soil?\"\n   - Expected: Students predict the cracks might fill in or get smaller as water infiltrates the soil.\n\n3. **Real-World Connection:** \"Name one way you or your community could save freshwater.\"\n   - Expected: Any reasonable conservation practice (shorter showers, watering plants less, fixing leaks, etc.).\n\n4. **Open-Ended Reflection:** \"What surprised you most about what you learned today about water and soil?\"\n   - Expected: Student responses may include the speed of evaporation, how much water is locked in ice, or how important water is.\n\n**Success Criteria:**\n- ✓ Student identifies evaporation and lack of rainfall as causes of drought and cracking soil.\n- ✓ Student explains or sketches how water moves between Earth systems.\n- ✓ Student proposes at least one realistic water conservation strategy.\n- ✓ Student uses vocabulary (evaporation, drought, water cycle, geosphere, hydrosphere) with general accuracy.\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding of the water cycle and Earth systems interaction.\n- Students can explain drought as a consequence of the water cycle and lack of precipitation.\n- Students recognize the importance of water conservation in their community and beyond.\n- Students can connect abstract concepts (evaporation, hydrosphere-geosphere interaction) to concrete observations (cracking soil).\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified Exit Ticket:** Offer multiple-choice or matching options instead of open-ended questions. Example: \"Which of these causes soil to dry out? (a) Rain, (b) Evaporation, (c) Salty water.\" Provide sentence stems: \"The water went into the ___ because ___.\"\n\n2. **Vocabulary Word Bank:** Create a visual vocabulary card for each term (evaporation, drought, water cycle, geosphere, hydrosphere) with a picture and simple definition. Students can reference these during Explain and Elaborate phases and can draw the term to reinforce meaning.\n\n3. **Peer Support During Explore:** Pair struggling students with a strong observer. Assign clear roles: one student records observations while the other describes what they see. Rotate roles so both participate in thinking and documenting.\n\n4. **Simplified Water Cycle Diagram:** Provide a partially completed water cycle diagram (with sun, rain, and ground labeled) for students to fill in, rather than asking them to create one from scratch.\n\n### Challenge (for advanced learners)\n\n1. **Quantitative Water Distribution Task:** Extend 5-ESS2-2 by having advanced students create a pie chart or bar graph showing the percentages of Earth's water (97% saltwater, ~3% freshwater, breakdown of freshwater). Ask: \"If Earth had 100 water bottles, how many would be freshwater? How many would be available for people to use?\"\n\n2. **Drought Severity Prediction:** Provide a graph showing rainfall amounts in a region over 10 years and ask: \"Based on this trend, when do you think a drought might occur? What would you predict would happen to farmers' crops?\" Students can research and present a case study of a specific historical drought.\n\n3. **Design a Water Conservation System:** Challenge students to design a system for collecting, storing, and using rainwater in their school or neighborhood. Have them create a labeled diagram and explain how it would reduce the need for freshwater from other sources. This extends 5-ESS3-1 (protecting Earth's resources).\n\n4. **Investigate Other Droughts in Time and Space:** Have advanced students research and compare droughts in different regions and time periods (e.g., the Dust Bowl in the 1930s, current droughts in California). They can create a presentation or poster showing causes, effects, and human responses.\n\n---\n\n## Extension Activities\n\n1. **Long-Term Soil Drying Observation:** Continue monitoring the soil cups over 1-2 weeks. Have students photograph or draw the soil at regular intervals and create a time-lapse presentation showing the progression of cracks. Compare wet (Cup 2) and dry (Cup 1) soil side by side at the end, discussing how water changed the physical properties of soil.\n\n2. **Water Usage Audit at Home or School:** Students track water use in their household (or school) for one day. They tally how many times water is used (toilet flushes, showers, handwashing, etc.) and calculate total gallons (rough estimates: toilet ~5 gal/flush, shower ~2 gal/minute). They then create a bar graph showing which activities use the most water and propose a goal for reducing usage by 10-20%.\n\n3. **Build a Miniature Water Filtration/Collection System:** Students design and construct a rain barrel or simple water filter using sand, gravel, activated charcoal, and coffee filters. They observe how rainwater can be collected and cleaned, connecting to water conservation and availability. This can be displayed at a school open house or environmental fair to educate the community.\n\n4. **Interview a Water Expert or Community Member:** Invite a local water department employee, farmer, or environmental scientist to visit the classroom or conduct a virtual interview. Students prepare questions about drought, water conservation, and how the community manages freshwater resources. This extends 5-ESS3-1 (learning how communities protect resources).\n\n5. **Create a Drought-Resistant Plant Garden Plan:** Students research native plants that thrive with little water and design a landscape plan for a school garden or community space using these species. They create a poster showing the plants, their water needs, and why they're suited to drought conditions. This connects ecosystem adaptation to human environmental stewardship.\n\n---\n\n## Teacher Notes\n\n- **Timing Flexibility:** The Explore phase can be compressed to 10 minutes if you use a heat lamp to accelerate drying, or extended over 2-3 days for a slower, more authentic observation of real-world drying. Adjust your lesson timing accordingly.\n- **Safety Consideration:** If using a heat lamp during Explore, place it at a safe distance (at least 12 inches) from students and flammable materials. Supervise carefully.\n- **Photo Relevance:** Return to the photograph multiple times throughout the lesson to anchor abstract concepts in a concrete visual. Ask, \"Does your soil look like the photograph yet?\" and \"Why do you think this is happening?\"\n- **Connection to Local Context:** If your region has experienced drought or water scarcity, reference it directly. Conversely, if your area receives plentiful rain, emphasize that this uneven distribution is one reason some communities face water challenges.\n- **NGSS Alignment Rationale:**\n  - **5-ESS2-1** is met through Explore and Explain, where students model and describe how the hydrosphere (water leaving soil) and geosphere (soil structure and composition) interact.\n  - **5-ESS2-2** is met during Elaborate when students discuss water distribution percentages and recognize that freshwater is limited.\n  - **5-ESS3-1** is met during Elaborate and Extension Activities as students identify and propose conservation strategies their communities can use.\n\n---\n\n## Standards Alignment Summary\n\n| NGSS Standard | Addressed In | Evidence |\n|---------------|-------------|----------|\n| **5-ESS2-1** | Explore, Explain | Students model water leaving soil (evaporation) and observe how the geosphere (soil) is affected when the hydrosphere (water) is removed. |\n| **5-ESS2-2** | Explain, Elaborate | Teacher explains that 97% of Earth's water is salt water and only ~3% is freshwater, with most unavailable for use, supporting evidence about water distribution. |\n| **5-ESS3-1** | Elaborate, Extensions | Students identify water conservation strategies and research how communities adapt to drought, demonstrating understanding of how humans use science to protect resources. |\n\n---\n\nThis lesson plan is designed to be immediately actionable. You have all materials lists, specific discussion questions, step-by-step student directions, and concrete assessment tools. Enjoy facilitating this important exploration of Earth's water systems with your students!",
  "inputTokens": 2452,
  "outputTokens": 5541,
  "cost": 0.030157,
  "generatedAt": "2026-02-12T22:35:24.369Z"
}