{
  "title": "Drought",
  "category": "earth-space-science",
  "imageFile": "e06.jpeg",
  "imagePath": "images/earth-space-science/e06.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Cracked Earth and Water\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Water and soil:** The photograph shows dried, cracked earth, which demonstrates what happens when water leaves soil and ground. This is a visible representation of the water cycle at work.\n- **Weather and its effects:** The cracked pattern is a direct result of dry weather conditions. Students can observe how weather changes the appearance and structure of Earth's surface.\n- **Seasonal changes:** Dry seasons cause soil to crack and shrink. This observable change helps students understand that weather changes throughout the year.\n- **Resilience of life:** Despite harsh conditions, small plants are growing in the cracks, showing that living things adapt to their environment.\n\n---\n\n## Lesson Title\n\n**Why Did the Ground Crack? Exploring Dry Earth and Water**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90–110 minutes total (two 45–55 minute sessions, or three shorter 30–35 minute sessions)\n- **NGSS Standards:** \n  - 1-ESS1-1 (Use observations of the sun, moon, and stars to describe patterns)\n  - 1-ESS1-2 (Make observations at different times of year to relate daylight to seasons)\n  \n*Note: While this image most directly supports water cycle and weather concepts, the NGSS ESS standards for First Grade are limited to astronomy. This lesson bridges by having students observe **seasonal weather patterns** (sunny/dry vs. rainy) and how the sun's energy affects water in soil, building toward later understanding of the water cycle.*\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** what happens to soil when water dries up (cracking, shrinking).\n2. **Predict** what will happen to soil when water is added and when it dries out again.\n3. **Explain** (in simple words) that the sun and dry weather cause water to leave soil.\n4. **Record observations** using drawings and simple words to document changes over time.\n\n---\n\n## 5E Lesson Sequence\n\n---\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by examining the cracked-earth photograph.\n\n**Materials:**\n- Printed color copies of the photograph (or one large version for display; one per 2–3 students if possible)\n- Chart paper and markers\n- Optional: hand lens (magnifying glass) for closer inspection\n\n**Activity:**\n\n1. **Display the photograph.** Show students the image on a screen or print large copies. Ask them to sit in a circle or gather close so everyone can see clearly.\n\n2. **Pose an initial observation question:** \"What do you see in this picture? What does it look like?\" \n   - Allow 1–2 minutes for free observations (e.g., \"It's cracked,\" \"It looks like a puzzle,\" \"It's dirt\").\n\n3. **Ask curiosity-sparking questions:**\n   - \"Why do you think the ground looks like this? What happened to it?\"\n   - \"Do you see any plants growing in the cracks? How do you think they got there?\"\n   - \"When was the last time you saw dirt like this? Where was it?\" (Connect to students' own experiences—puddles drying up, mud puddles in the yard after rain, etc.)\n   - \"If you touched this ground, do you think it would feel wet or dry? Why?\"\n\n4. **Prediction prompt:** \"I'm wondering... if we could pour water on this cracked ground, what do you think would happen? Would the cracks close up? Would the mud get soft again? Let's investigate!\"\n\n5. **Anchor the wonder:** Write 1–2 student predictions on chart paper to revisit later.\n\n**Transition:** \"Today, we're going to do an experiment with soil and water to see what really happens when ground gets dry and when it gets wet again.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate soil drying and cracking through hands-on experimentation.\n\n**Materials (per pair or small group of 3–4 students):**\n- 1 shallow clear container or pie pan (8–9 inches wide)\n- Potting soil or topsoil (enough to fill container to 1.5–2 inches deep)\n- 1 cup of water\n- 1 small watering can, spray bottle, or cup for pouring\n- 1 wooden stick or popsicle stick for smoothing soil\n- Paper towels\n- Observation sheet (pre-made template with spaces for drawings and checkboxes)\n- Optional: hand lens for detail observation\n- Camera or phone camera (for photo documentation if desired)\n\n**Activity:**\n\n**Setup (Teacher does, or with student help):**\n1. Fill each container with moist potting soil, smoothing the surface flat with the wooden stick.\n2. Have students pour enough water into their soil to make it wet but not soupy (about ½ to ¾ cup per container).\n3. Tell students, \"This is what soil looks like when it has lots of water in it—like after a rain. Today, we're going to watch what happens as it dries out.\"\n\n**Day 1 or Session 1 (Explore Phase Begins):**\n\n1. **Immediate observation:** Have students look closely at the wet soil. Ask:\n   - \"What does the soil look like right now?\"\n   - \"Is it smooth or cracked?\"\n   - \"Draw or describe what you see on your observation sheet.\"\n\n2. **Predict the change:** \"Over the next few days, the sun will dry out this soil. What do you think will happen? Will it stay smooth? Will it crack? Make a prediction and draw it on your sheet.\"\n\n3. **Set up for drying:** Place containers in a warm, sunny spot in the classroom (or near a window). Students may help carry them carefully.\n\n4. **Daily observations (Sessions 2 and 3, or the next day and the day after):**\n   - Each day, students look at their soil containers for 2–3 minutes.\n   - They observe and draw what they see on their observation sheet:\n     - Are cracks forming? Where?\n     - Is the soil still wet or getting dry?\n     - Have the cracks gotten bigger?\n   - They may take photos with a classroom camera to document progress.\n   - **Do NOT add more water yet** during the observation days—let the natural drying process occur.\n\n5. **Re-water (Final step of Explore phase):**\n   - On the third or fourth day, when soil is noticeably cracked and dry, ask: \"Remember our prediction about water? Now let's add water and see what happens!\"\n   - Have students pour water into their containers again (about ½ cup) and observe immediately and over the next few minutes.\n   - Ask: \"What's happening to the cracks? Is the soil getting softer? Are the cracks closing up?\"\n   - Students draw or write about this final observation.\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What do you notice?\" \"What's changing?\" \"Why do you think that happened?\"\n- Do **not** tell students what will happen. Let them discover the cracks forming and then be surprised by the soil becoming soft again.\n- Help students focus observations on specific details (size and direction of cracks, the color change from dark wet to light dry, etc.).\n\n**Expected Student Outcomes:**\n- Students will observe and draw a sequence showing soil changing from wet and smooth → dry and cracked → wet again.\n- Students will develop a visual or verbal understanding that **water leaving soil causes it to shrink and crack; water returning makes it soft again.**\n- Students will generate simple explanations: \"The sun dried it out\" or \"The water went away.\"\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Formalize observations with vocabulary and connect to the sun and weather.\n\n**Materials:**\n- Chart paper and markers\n- Observation sheets from Explore phase\n- Photograph from Engage phase\n- Optional: drawing or photo documentation from the Explore activity\n\n**Activity:**\n\n1. **Group share-out (7–8 minutes):**\n   - Gather students in a circle with their observation sheets.\n   - Ask 3–4 students to share what they drew or observed: \"What happened to your soil?\" \n   - Record their statements on chart paper using simple language.\n   - Celebrate accurate observations: \"Yes! The cracks got bigger as it dried out!\"\n\n2. **Introduce vocabulary (6–8 minutes):**\n   - Use the chart paper to write and define these terms in First Grade-friendly language:\n   \n   **Vocabulary:**\n   - **Water:** The clear liquid that falls from clouds as rain and fills puddles. Our soil needs water to stay soft.\n   - **Dry:** When something has very little or no water in it. The cracked ground in our photo is dry.\n   - **Cracks:** Long breaks or splits in something hard. When soil dries out, it shrinks and forms cracks.\n   - **Sun:** The big bright light in the sky that gives us warmth. The sun helps dry out soil by making water go away.\n   - **Weather:** What it's like outside—sunny, rainy, hot, or cold. Weather makes soil wet or dry.\n\n3. **Make connections back to the photograph and Explore activity (5 minutes):**\n   - Show the original cracked-earth photograph again.\n   - Say: \"This is what the ground looks like in real life when it's very dry. Look at all those cracks! Just like what happened in our soil containers. This means there hasn't been rain in a long time, and the sun has been hot and bright.\"\n   - Point out the tiny plants in the cracks: \"These little plants are still trying to grow even when the ground is dry. They're very tough!\"\n   - Connect to students' experiences: \"Have you ever seen puddles dry up on the playground? That's water leaving and going into the air, just like what happened to our soil.\"\n\n4. **Check for understanding (2–3 minutes):**\n   - Ask: \"What made our soil crack?\" (Answer: It dried out. The water left. The sun warmed it.)\n   - Ask: \"What happened when we added water again?\" (Answer: It got soft. The cracks filled with water. It looked wet again.)\n   - Use thumbs up/thumbs sideways/thumbs down for quick self-assessment: \"Thumbs up if you understand why soil cracks when it dries. Sideways if you're not sure. Down if you want to talk more.\"\n\n**Expected Student Outcomes:**\n- Students can name 3–4 vocabulary terms and connect them to their observation.\n- Students can give a simple explanation: \"The sun dried out the water, so the soil cracked.\"\n- Students recognize that the photo shows the same process that happened in their experiment.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding of soil, water, and the sun's role in a new scenario.\n\n**Materials:**\n- Chart paper and markers, or whiteboard\n- Clay or Model Magic (one fist-sized ball per pair)\n- Water in spray bottles or small cups\n- Paper plates or newspaper to protect work surfaces\n- Photos or drawings of different weather conditions (sunny day, rainy day, snowy day) — optional but helpful\n- Exit ticket template (see Evaluate section)\n\n**Activity:**\n\n**Choice 1: Soil Modeling Activity (Recommended for most First Graders)**\n\n1. **Review the cycle:** \"We saw that soil gets wet, then dry, then wet again. The sun helps dry it out. Let's show this with clay!\"\n\n2. **Demonstration (teacher models):**\n   - Roll a ball of Model Magic or clay smooth.\n   - Ask: \"What does wet soil look like?\" Spray it lightly or have students suggest it looks smooth and soft.\n   - Let it dry for a minute, then demonstrate gently squeezing or breaking it apart to show cracks forming.\n   - Say: \"As it dries, it gets hard and cracks, just like our soil container!\"\n\n3. **Student activity:**\n   - Give each pair a ball of clay.\n   - Step 1: They squeeze and smooth it into a flat pancake (like wet soil).\n   - Step 2: They set it on a plate and leave it out for 5–10 minutes while they continue the lesson (it will harden).\n   - Step 3: While waiting, they draw or discuss: \"If it rains on our ground tomorrow, what will happen?\" They can pantomime or sketch water being added.\n   - Step 4: When clay is firm, they gently try to break or crack it. They observe: \"See? It's hard now, like dry soil. The water left.\"\n\n**Choice 2: Weather Detective Activity (For students who finish early or need challenge)**\n\n1. Show pictures or have a conversation about different weather:\n   - Sunny and hot (like in the photo) — ground dries out fast.\n   - Rainy — ground stays wet.\n   - Cloudy — drying is slower.\n\n2. Ask: \"If we want our ground to have cracks like in the photo, what kind of weather do we need?\" (Sunny, dry, hot, no rain.)\n\n3. Students draw or circle which weather makes the ground crack. (Sun and dry = cracks. Rain = wet, no cracks.)\n\n**Teacher Role:**\n- Circulate and ask: \"Why do you think the ground is cracking?\" and \"What would fix those cracks?\"\n- Affirm student reasoning: \"You're right—the sun would make it crack more!\"\n- For struggling students, scaffold: \"Is the ground wet or dry?\" → \"What made it dry?\" → \"The sun!\" → \"So the sun helps make cracks.\"\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding by physically modeling the soil-drying-cracking process.\n- Students can answer: \"If it's sunny, the ground dries and cracks. If it rains, the ground gets wet and soft again.\"\n- Students apply the concept to a simple new scenario (different weather conditions).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess whether students met the learning objectives.\n\n**Formative Assessment (Throughout Lesson):**\n\n1. **Observation sheets:** Review student drawings from the Explore phase. Can they show a sequence of wet → dry → cracked? Do they label or describe what they observe?\n\n2. **Thumbs check:** During Explain, thumbs up/sideways/down tells you who grasps the concept and who needs follow-up.\n\n3. **Questioning:** Listen to student responses during group discussions. Can they explain *why* soil cracks? Do they reference the sun or water leaving?\n\n**Summative Assessment — Exit Ticket (5–7 minutes at end of lesson):**\n\nProvide each student with a simple exit ticket (paper or digital) with one or more of these prompts:\n\n**Option A (Drawing-based, for all students):**\n- \"Draw what the ground looks like after it's been dry and sunny for a long time.\" \n  - *Success criterion:* Student draws cracks or broken-up soil. (Shows understanding of drying causing cracks.)\n\n**Option B (Verbal, with teacher or aide writing):**\n- Teacher asks: \"What happened to the soil in our experiment? Why did it crack?\"\n  - *Success criterion:* Student explains: \"It dried out\" OR \"The sun made the water go away\" OR \"It had no water.\" (Simple but accurate.)\n\n**Option C (Multiple-choice / Picture matching):**\n- Show three pictures: (1) wet smooth soil, (2) dry cracked soil, (3) soil with plants.\n- Ask: \"Which picture shows soil that's been drying in the sun?\"\n  - *Success criterion:* Student selects picture 2 (cracked soil).\n\n**Option D (Reflection question):**\n- \"If it rained a lot tomorrow, what would happen to the cracked ground? Draw or tell.\"\n  - *Success criterion:* Student indicates the cracks would fill with water, or the soil would get soft again, or \"it would have water in it.\"\n\n**Expected Student Outcomes:**\n\n- **All students (Proficient):** Can identify cracked, dry soil in a picture or description and name the sun or water as the cause.\n- **Most students:** Can explain in simple words (or drawing) that drying soil cracks and that water makes it soft again.\n- **Some students:** May need a follow-up prompt: \"Was there water in the soil?\" → \"Does water leave when it's hot and sunny?\" This leads them to the connection.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary:** Use only 2 key words (water, sun) instead of all 5. Repeat them frequently with gestures: \"Water [mime pouring], Sun [point to window and smile].\"\n\n2. **Concrete model:** Have a pre-made comparison set: one container of wet soil (smooth), one of dry soil (cracked). Let students touch both and compare. Ask: \"Which one has water?\" \"Which one is hard?\"\n\n3. **Guided questioning:** Instead of open-ended \"Why did it crack?\", use yes/no: \"Did water leaving make it crack? Yes or no?\" Then confirm: \"Yes! When water goes away, the soil cracks.\"\n\n4. **Observation sheet adaptation:** Provide a template with three simple boxes and pictures:\n   - Box 1: Wet soil (picture provided) — Student checks or traces.\n   - Box 2: Drying soil (picture provided) — Student checks or traces.\n   - Box 3: Dry cracked soil (picture provided) — Student checks or traces.\n\n### Challenge (for advanced learners):\n\n1. **Prediction extension:** \"If we left the water out longer, what do you think would happen? Would the cracks get even bigger? Let's predict and check!\" (Observe over a longer time period, 1–2 weeks.)\n\n2. **Real-world connection:** \"Look at this photo of a dried lake bed (show another image of real cracked ground). Why did that happen? Is it the same as our experiment?\" Guide them to see that on a larger scale, the same process happens.\n\n3. **Weather patterns:** Provide a simple calendar for one week. Students draw weather symbols (sun, rain cloud) and predict whether the ground will be wet or dry each day. Correlate to cracks forming: \"Sunny days = more cracks forming.\"\n\n4. **Scientific writing:** Ask: \"Can you write a sentence (or two) that explains what happens to soil?\" Model a sentence frame: \"When the sun shines on soil, the water ______.\" Students complete and illustrate.\n\n---\n\n## Extension Activities\n\n1. **Build a \"Rainforest vs. Desert\" Diorama:**\n   - Divide a display board into two halves.\n   - One side: wet soil (kept moist), green plants, water droplets. Label: \"Lots of rain—soil stays wet.\"\n   - Other side: dry soil (allowed to crack), minimal/hardy plants, sun symbol. Label: \"Little rain—soil is dry and cracked.\"\n   - Students observe over 2–3 weeks and discuss which side looks like the photo.\n\n2. **Seasonal Observation Walk:**\n   - Take students outside each season (or at least once in a dry season if possible) to look for cracked ground.\n   - Photograph or sketch the ground's appearance: Is it cracked? Wet? Muddy?\n   - Create a seasonal chart: Spring/Summer/Fall/Winter and draw or describe the soil condition.\n   - Connect to learning: \"In dry seasons, we see more cracks, just like in our photo!\"\n\n3. **Water Cycle in a Bag:**\n   - Seal water and soil in a clear ziplock bag with sunlight.\n   - Over several days, students observe water droplets forming on the inside (condensation), showing water leaving the soil and returning. This extends their understanding toward the full water cycle.\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing flexibility:** If drying takes longer than expected (high humidity), have one container pre-dried at home to show to students while theirs continues to dry.\n- **Safety:** Ensure potting soil is classroom-safe and that students wash hands after handling it.\n- **Engagement:** First graders love hands-on, sensory activities. Let them *feel* the wet vs. dry soil—this is powerful for learning.\n- **Connections to astronomy (NGSS):** While this lesson focuses on Earth processes, you can briefly tie it to the sun's role: \"The sun is bright and warm, and it helps dry our soil. The sun is also important to all life on Earth.\"\n\n---\n\n**This lesson bridges observable Earth phenomena (soil cracking from drying) with First Grade's foundational understanding of the sun's effects, preparing them for later water cycle and weather study.**",
  "inputTokens": 2319,
  "outputTokens": 4880,
  "cost": 0.026719,
  "generatedAt": "2026-02-12T22:31:51.537Z"
}