{
  "title": "Drought",
  "category": "earth-space-science",
  "imageFile": "e06.jpeg",
  "imagePath": "images/earth-space-science/e06.jpeg",
  "content": "# Engineering Design Challenge: Cracked Earth\n\n## Visible Elements in Photo\n- Severely cracked, dried mud or clay forming a network of fissures\n- Multiple soil chunks separated by deep gaps and crevices\n- Sparse vegetation (thin green shoots and small plant seedlings) sprouting through cracks\n- Light-colored mineral deposits or salt residue on soil surface\n- Darker, moist soil visible in the deepest cracks below the surface\n\n## Reasonable Inferences\n- **From cracked soil + sparse vegetation**: The ground has experienced drought or prolonged water loss, yet plants persist by finding moisture in deep cracks—suggesting soil needs to retain water better or be protected from further drying.\n- **From gap network + visible depth**: Cracks allow water to escape and soil to become unstable, creating an erosion and stability problem for structures or crops built on this ground.\n- **From mineral deposits on surface**: High evaporation is occurring, which intensifies soil deterioration and could harm plant growth.\n\n## Engineering Task\n\n### K-2\n**\"Design a Protector for Dry Ground\"**  \nYour soil is cracking and drying out. Plants are struggling to grow. Build a cover or shield using paper, cloth, or natural materials that will help keep the soil moist and stop it from cracking so much. Test your design by sprinkling water on covered soil and uncovered soil, and see which one stays wetter longer.\n\n### 3-5\n**\"Design a Soil Retention System\"**  \nCracked, dried soil loses water quickly and becomes unstable for plant growth. Your challenge: Design a barrier or covering system that reduces evaporation and prevents further cracking in a 20 cm × 20 cm plot of soil. Your design must:\n- Be made from at least two different materials\n- Keep the soil visibly moister than an uncovered control plot after 3 days\n- Allow seedlings or water to penetrate it\n- Be removable without damaging plants\n\nTest by creating two identical soil plots: one with your design, one uncovered. Measure soil moisture, crack depth, and plant growth over one week.\n\n## EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real environmental problem (soil degradation from drought) without an obvious existing solution. Students must first observe and understand *why* the ground cracks, *what problems* it creates (water loss, plant stress, erosion), and *who needs help* (farmers, gardeners, ecosystems). This phase grounds the EDP in authentic scientific observation before moving to solutions.\n\n## Suggested Materials\n- Potting soil or clay-rich garden soil\n- Mulch (straw, wood chips, or shredded newspaper)\n- Plastic sheeting or burlap fabric\n- Water and spray bottles\n- Seedlings or bean seeds\n- Ruler or measuring tape\n- Optional: landscape fabric, compost, or crushed bark\n\n## Estimated Time\n**Two 40-minute sessions** (or three 25-minute sessions):\n- Session 1: Observe the photo, discuss soil problems, plan designs (20 min) + set up test plots (20 min)\n- Session 2: Water, observe, measure, and compare results after 3–7 days (40 min)\n\n## Why This Works for Teachers\nThis task directly supports **NGSS ETS1.A (Defining and Delimiting Engineering Problems)** by having students identify a real-world problem observable in nature, recognize criteria (water retention, crack prevention), and constraints (available materials, removability), while integrating Earth science and life science concepts naturally.",
  "inputTokens": 1805,
  "outputTokens": 811,
  "cost": 0.00586,
  "generatedAt": "2026-02-09T13:24:58.396Z"
}