{
  "title": "Fall Seasons",
  "category": "earth-space-science",
  "imageFile": "fall_seasons.jpg",
  "imagePath": "images/earth-space-science/fall_seasons.jpg",
  "content": "# Fall Leaves Engineering Challenge\n\n### Visible Elements in Photo\n- Fallen autumn leaves in many colors (red, yellow, pink, brown, white) scattered across grass\n- Short green grass visible beneath and between leaves\n- Basketball hoop in the background on a building\n- Residential building with siding\n- Evergreen shrub or tree on the right side\n- Sunny lighting casting shadows\n\n### Reasonable Inferences\n- **From dense leaf coverage**: Leaves accumulate in yards during fall; students may need to manage, organize, or repurpose large quantities of plant material.\n- **From color variety and condition**: Leaves at different decay stages (fresh vs. brittle) suggest varying structural properties that could affect how they function in a design.\n- **From outdoor residential setting**: This is a real maintenance challenge families and groundskeepers face—there's an authentic problem to solve here.\n\n### Engineering Task\n\n**K-2 Version:**\n\"Fall leaves are covering the yard! Design a **leaf catcher** using paper cups, a wire hanger, and a plastic bag. Your catcher should hold leaves without tipping over when you gently shake it. Test it by filling it with real leaves. Does it stay upright? Can you carry it without leaves falling out?\"\n\n**3-5 Version:**\n\"Design a **leaf collection and sorting system** for a residential yard. Your system must:\n- Collect fallen leaves from a 1-meter × 1-meter area in under 2 minutes\n- Sort leaves into at least two categories (by size, color, or condition)\n- Use only natural materials (sticks, string, cloth scraps) or recycled items\n- Hold at least 50 leaves without spilling\nCreate a labeled sketch first, then build and test your prototype. Measure how long collection takes and count how many leaves you sort correctly.\"\n\n### EDP Phase Targeted\n**Ask / Define Problem** — The photo shows a real, observable condition (leaf accumulation) that creates a genuine need. Students first identify *why* leaves are a problem, *what* needs to happen to them, and *who* this affects before designing solutions. This grounding in authentic challenge makes the task more meaningful than jumping straight to invention.\n\n### Suggested Materials\n- Paper cups or small buckets\n- Wire hangers or sticks\n- String or twine\n- Cloth scraps or old t-shirts\n- Plastic bags\n- Tape (duct tape or painter's tape)\n- Actual fallen leaves (from the yard or collected beforehand)\n\n### Estimated Time\n- **K-2**: 30–40 minutes (design discussion + building + one round of testing)\n- **3-5**: Two 35-minute sessions (Session 1: sketch, plan, gather materials; Session 2: build, test, measure, refine)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (define a design problem by specifying criteria and constraints) by anchoring student thinking in a visible, real-world problem that requires trade-offs between speed, accuracy, and material use.",
  "inputTokens": 1806,
  "outputTokens": 696,
  "cost": 0.005286,
  "generatedAt": "2026-02-09T13:34:05.169Z"
}