{
  "title": "Fall Seasons",
  "category": "earth-space-science",
  "imageFile": "fall_seasons.jpg",
  "imagePath": "images/earth-space-science/fall_seasons.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Seasonal Changes and Daylight\n## Inspired by Fall Leaves Photograph\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Seasonal change:** The photograph shows fall leaves in various stages of color change (red, yellow, brown, pink), which is a visible indicator of the autumn season—a predictable pattern that occurs at specific times of the year.\n- **Daylight and Earth's position:** Fall is characterized by decreasing daylight hours, and the angle of sunlight affects how plants change and prepare for winter.\n- **Natural cycles:** Leaf color change is part of Earth's seasonal cycle, which repeats predictably each year and is connected to the sun's position in the sky.\n- **Observation and patterns:** Students can use their own observations of seasons in their local environment to recognize that patterns in nature (like leaf changes) occur at predictable times of year.\n\n---\n\n### Lesson Title\n\n**When Leaves Change: Discovering Fall's Colorful Signs**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Three 35-minute sessions (or two 50-minute periods over consecutive days)\n- **NGSS Standards:** \n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Observe and describe the colors and changes they see in leaves during fall.\n2. Predict when leaves will change color based on patterns they notice in their environment.\n3. Explain that fall is a season when days get shorter and leaves change color.\n4. Use observations from different times of day and times of year to recognize seasonal patterns.\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Spark curiosity about why leaves change color and connect to students' real-world observations of fall.\n\n**Materials:**\n- Color photograph of fall leaves (displayed on screen, projector, or printed large poster)\n- Chart paper and markers\n- Real fall leaves collected from outside (bring 5-6 leaves in various stages of color change)\n\n**Activity:**\n\n1. **Display the photograph.** Show the image of the many colorful fall leaves on the ground. Let students look at it quietly for 10-15 seconds before speaking.\n\n2. **Ask engaging questions to spark wonder:**\n   - \"What colors do you see in these leaves? Point to your favorite color.\"\n   - \"Where do you think these leaves came from? (Accept all answers—trees, outside, the ground.)\"\n   - \"Why do you think the leaves are so many different colors instead of all green like in summer?\"\n   - \"Have you seen leaves like this where you live? When?\"\n\n3. **Prediction prompt:** \n   - Hold up one real fall leaf and show it to students. \"This leaf was green once. But now it's red/yellow/brown. What do you think made it change color? What changed—the sun, the weather, the time of year?\"\n   - Create a \"Wonderings\" chart on paper. Write down 2-3 student ideas without correcting them: *\"Maybe the sun turned them. Maybe it got cold. Maybe it's fall.\"*\n\n4. **Activate prior knowledge:**\n   - \"Who has played outside on a hot summer day? Who has worn a jacket outside in fall? What else changes when summer becomes fall?\"\n\n**Transition:** \"Today we're going to be scientists and observe fall leaves really carefully. We'll discover why leaves change color and what that tells us about the time of year.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate fall leaves and document their observations through color, touch, and description.\n\n**Materials (per small group or student):**\n- 3-5 real fall leaves in different stages of color change (collected from school grounds or brought in)\n- White paper or observation sheet with boxes for drawing\n- Colored pencils or crayons\n- Hand lenses (optional, but effective for First Grade)\n- Small basket or tray to hold leaves\n\n**Activity:**\n\n**Set-up:** Divide students into small groups (3-4 per group). Give each group a basket with 3-5 fall leaves and an observation sheet.\n\n**Step-by-step student directions (model these carefully):**\n\n1. \"Look at your leaves carefully. Do not crumple or tear them. Which leaf is the brightest red? Which one is the yellowest? Which one is the brownest?\"\n\n2. \"Pick one leaf and hold it up to the light (or near a window). What colors do you see? Use your colored pencils to draw the leaf and color it to match what you see.\"\n\n3. \"Now feel the leaf gently. Is it stiff or bendy? Is it dry or a little wet? Point to the veins (the lines on the leaf). Can you feel them with your finger?\"\n\n4. \"On your paper, draw a picture of your leaf. Use the real leaf as your model. Try to use the same colors.\"\n\n5. \"Look at all your leaves. Are they all the same colors? Why do you think some are more yellow and some are more red?\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: *\"Tell me about this leaf. What colors do you see? Is it different from that one? How?\"*\n- Avoid explaining *why* leaves change—let students observe first.\n- Model careful observation without judgment (e.g., \"I notice this leaf is crinkly. This one is smoother.\").\n- Encourage students to compare: *\"Which leaves are most alike? Which are the most different?\"*\n- Ask questions that support 1-ESS1-2: *\"If we looked at these same trees in summer, would the leaves look like this? Why not?\"*\n\n**Expected Student Outcomes:**\n- Colored drawings of 1-2 leaves showing observed colors\n- Verbal descriptions of leaf texture, feel, and appearance\n- Comparisons between leaves in the group\n- Recognition that fall leaves are not all one color\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce vocabulary and explain the connection between seasonal change, leaf color, and Earth's position relative to the sun.\n\n**Materials:**\n- Fall leaves from Explore phase (displayed where all can see)\n- Chart paper\n- Picture or diagram of a tree in summer vs. fall (optional but helpful—can be teacher-drawn)\n- Calendar showing the fall months (September, October, November)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 2-3 groups to show their leaf drawings and describe what they observed.\n   - Ask: *\"Who found a red leaf? Who found a yellow one? Why do you think the leaves are different colors?\"*\n   - Record observations on chart paper under the heading: *\"What We Noticed About Fall Leaves\"*\n\n2. **Introduce key vocabulary (8-10 minutes):**\n   \n   Use the real leaves and the photograph to explain these terms in First Grade-friendly language:\n\n   - **Season:** A time of year when the weather and nature change in a pattern. (Point to calendar.) *\"Fall is a season. Winter, spring, and summer are also seasons. They happen every year in the same order.\"*\n   \n   - **Fall (or Autumn):** The season when leaves change color, the weather gets cooler, and days get shorter. (Show the photograph again.) *\"This is fall. The leaves are changing from green to red, yellow, and brown.\"*\n   \n   - **Daylight:** The time during the day when the sun is up and it is light outside. *\"In summer, the sun is up for a long time, so we have lots of daylight. In fall, the sun goes down earlier, so we have less daylight.\"*\n   \n   - **Pattern:** Something that happens over and over in the same way. *\"Every year, leaves turn the same colors in fall. That is a pattern. We can predict it will happen.\"*\n   \n   - **Observe:** To look at or watch something carefully to learn about it. *\"We were scientists today when we observed the leaves carefully.\"*\n\n3. **Connect to the photograph and Explore activity (5 minutes):**\n   - Hold up the photograph again. *\"These are all fall leaves, just like the ones you drew. In fall, trees all over the place have leaves that turn red, yellow, and brown. This happens because it is fall—a special time of year.\"*\n   - *\"When fall comes, days get shorter. There is less daylight. The weather gets cooler. And the leaves change color. These are signs that tell us it is fall!\"*\n   - Revisit the \"Wonderings\" chart from Engage. *\"We wondered why leaves change. Scientists know that when the days get shorter in fall, the trees get ready for winter, and the green color in the leaves goes away. That's when we see the beautiful red, yellow, and brown colors!\"*\n\n4. **Check for understanding (2-3 minutes):**\n   - Ask: *\"What season are we in right now?\" / \"What color are the leaves in fall?\" / \"When days get shorter, what happens to the leaves?\"*\n   - Use thumbs up/middle/down to gauge understanding (no judgment—this is formative).\n\n**Vocabulary Summary Card (display for rest of lesson):**\n\n| Term | Kid-Friendly Definition |\n|------|------------------------|\n| **Season** | A time of year when weather and nature change in a pattern |\n| **Fall** | The season when leaves change color and get cooler |\n| **Daylight** | The time when the sun is up and it is light outside |\n| **Pattern** | Something that happens over and over in the same way |\n| **Observe** | To look at something carefully to learn about it |\n\n**Expected Student Outcomes:**\n- Students can name fall as a season and describe one change they observe (leaves change color, it gets cooler, days get shorter).\n- Students can identify that leaf color change is a *pattern* that happens every year.\n- Students can connect shorter days to fall and seasonal change.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Apply understanding of seasonal patterns by observing and predicting leaf changes and daylight in their own environment.\n\n**Materials:**\n- Chart paper and markers\n- Colored pencils\n- \"Observation cards\" (small cards with a simple tree outline—see below)\n- Real leaves still available from previous phases\n- (Optional) Access to a window or outdoor area for direct observation\n\n**Activity:**\n\n**Option A: \"Predict the Pattern\" (indoor, works best)**\n\n1. Show students a simple drawing of a tree with green leaves on chart paper. *\"In summer, trees look like this—all green leaves.\"*\n\n2. Show a second drawing of the same tree with colorful fall leaves. *\"In fall, trees look like this.\"*\n\n3. *\"Here's a question for you: What will the tree look like in winter? When it gets very, very cold?\"* Allow predictions (students will likely say: no leaves, bare branches, snow).\n\n4. Explain: *\"That's right! In winter, the leaves fall off the trees, and the branches are bare. But here's the cool part—every year, this same pattern happens. Summer, fall, winter, spring... then summer again! It's a pattern we can predict.\"*\n\n5. Give each student or pair an \"Observation Card\" with a simple tree outline. Ask them to:\n   - Draw what they think the tree will look like next (in winter or next spring).\n   - Use a sentence starter: *\"In [season], the tree will look like _____ because _____.\"*\n   - Encourage drawing and scribbled writing or invented spelling.\n\n**Option B: \"When Did You See Fall?\" (reflection, works if you did outdoor observation)**\n\nIf you can go outside or have access to windows:\n\n1. Take students to observe actual trees on the school grounds or neighborhood.\n\n2. Ask: *\"Look at these trees. Are the leaves changing? What colors do you see? Do you think this is fall or summer?\"*\n\n3. Return to classroom. On chart paper, create a group list: *\"Signs that Tell Us It Is Fall\"*\n   - Leaves are red, yellow, brown\n   - Days feel cooler\n   - We see more leaves on the ground\n   - There is less daylight (it gets dark earlier)\n\n4. Ask: *\"If we came back here in summer, what would be different? How would you know it's summer and not fall?\"*\n\n**Teacher Role:**\n- Facilitate predictions without correcting; guide students to think about patterns.\n- Ask: *\"Why do you think the tree will look that way? What will happen to the leaves?\"*\n- Encourage students to use the word \"pattern\" and \"predict.\"\n- Support students in connecting seasonal change to daylight: *\"In winter, the days are even shorter than in fall. In summer, the days are long. That helps us know what season it is!\"*\n\n**Expected Student Outcomes:**\n- Students draw or describe what happens to trees in the next season.\n- Students can name at least two signs of fall (leaf color, cooler weather, shorter days, more leaves on ground).\n- Students use the word \"pattern\" to describe seasonal change.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess whether students understand seasonal patterns, leaf changes, and connections to daylight.\n\n**Formative Assessment (ongoing throughout lesson):**\n- **During Explore:** Observe whether students can describe leaf colors and textures accurately.\n- **During Explain:** Listen for students who can use the word \"fall,\" \"season,\" or \"pattern\" in their speech.\n- **During Elaborate:** Check whether students can predict or explain the next seasonal change.\n\n**Summative Assessment - Exit Ticket (5-10 minutes):**\n\nAdminister this assessment at the end of the lesson or the next day. You can use any of these formats based on your students' abilities:\n\n**Option 1: Draw and Write**\n- Provide a simple template with a drawing box and a sentence frame.\n- Prompt: *\"Draw a fall leaf. Then write or tell me: What color was it in summer? What color is it now? Why did it change?\"*\n- Success Criteria: Student draws a leaf in fall colors and attempts to answer why (even if the answer is approximated: \"It's fall\" or \"The sun changed\").\n\n**Option 2: Oral Interview (1:1, 2-3 minutes per student)**\nAsk these questions and note student responses:\n\n1. *\"What season are we in right now?\"* (Look for: \"Fall\" or \"autumn\")\n2. *\"Show me a fall leaf. What colors do you see?\"* (Look for: Naming at least 2 colors—red, yellow, brown, orange)\n3. *\"Why do the leaves change color in fall?\"* (Look for: Any response indicating it's because of the season, cooler weather, or shorter days. Acceptance criteria: \"It's fall,\" \"It gets cold,\" \"The days get shorter\")\n4. *\"In summer, are the days long or short? In fall, are the days long or short?\"* (Look for: Understanding that fall days are shorter)\n\n**Option 3: Picture Sort (if students are not ready for written response)**\n- Show 4 pictures: a tree with green leaves, a tree with colorful fall leaves, a bare tree, a tree with pink blossoms.\n- Ask: *\"Which one shows fall?\"* and *\"Point to the tree where days are shorter.\"*\n- Success Criteria: Student can correctly identify the fall tree image.\n\n**Success Criteria for Meeting Learning Objectives:**\n\n| Learning Objective | Evidence of Success |\n|-------------------|-------------------|\n| Observe and describe leaf colors and changes | Student can name at least 2 fall leaf colors (red, yellow, brown, orange) |\n| Predict when leaves will change based on patterns | Student can say or draw what happens to leaves in another season |\n| Explain fall is when days get shorter and leaves change | Student connects shorter daylight to leaf change (e.g., \"In fall, the sun goes down earlier and leaves turn colors\") |\n| Use observations to recognize seasonal patterns | Student uses the word \"pattern\" or says \"every year\" or \"it happens again and again\" |\n\n**Expected Student Outcomes:**\n\n- **Meets Standard:** Student can identify fall, describe leaf color changes, and make a connection between season and daylight or leaf change.\n- **Approaching Standard:** Student can identify fall and name fall leaf colors but may struggle to explain the cause of change.\n- **Below Standard:** Student shows interest and observes leaves but cannot yet articulate seasonal connections; plan for small-group follow-up.\n\n---\n\n### Differentiation\n\n**Support for Struggling Learners:**\n\n1. **Reduced Vocabulary Load:** Use only 2-3 key words (fall, leaves, colors) rather than all five vocabulary terms. Build toward others over time.\n   \n2. **Hand-Over-Hand Observation:** Pair the student with a peer buddy during Explore. Have the buddy guide them to touch and look at the leaves together. Ask simpler questions: *\"Is this leaf red or yellow?\" \"Is it soft or stiff?\"*\n\n3. **Visual Supports:** Create a small chart with pictures of the four seasons (laminated if possible) and display it throughout the lesson. Point to the fall picture frequently: *\"Remember, we are in this season—fall.\"* Use the same picture when checking understanding.\n\n4. **Shorter Participation Requirement:** During group share-out, ask simpler questions: *\"Do you have a red leaf or a yellow leaf?\" \"Can you point to a fall leaf?\"* Accept nonverbal responses (pointing, nodding).\n\n**Challenge for Advanced Learners:**\n\n1. **Extended Prediction:** After Elaborate, ask: *\"If fall lasts about 3 months and winter comes after fall, how many months until we see green leaves again? What season comes next?\"* Provide a simple calendar and have them count or mark months.\n\n2. **Why Questions:** Push deeper into causation: *\"Why do you think leaves only change color in fall and not in summer? What is different about fall?\"* Accept scientific reasoning even if imperfect (e.g., \"The sun is not as strong,\" \"It's getting colder,\" \"The tree is getting ready for winter\").\n\n3. **Document the Pattern:** Ask students to make their own \"Season Book\" with pages for each season. They draw a tree in each season and write or dictate what the tree looks like. This reinforces the **pattern** concept: spring (buds) → summer (green) → fall (colors) → winter (bare).\n\n4. **Connection to Daylight:** Have them keep a simple \"Daylight Chart.\" Each day for a week, they note (or you record) what time the sun goes down. Discuss: *\"Is it getting darker earlier? What season is that a sign of?\"* This directly supports 1-ESS1-2.\n\n---\n\n### Extension Activities\n\n**Extension 1: \"Seasonal Walk\" (Outdoor Observation & Journaling)**\n- Take students on a walk around the school grounds or neighborhood weekly through fall and into winter.\n- Each week, have them draw or describe what they see on a simple seasonal observation sheet.\n- Compare weeks 1, 2, and 3: *\"What changed? What stayed the same?\"*\n- **Connection to NGSS:** Directly supports 1-ESS1-2 (making observations at different times of year).\n\n**Extension 2: \"Leaf Art & Color Science\"**\n- Collect fall leaves and use them for art: leaf rubbings, leaf collages, or pressed-leaf bookmarks.\n- While creating, ask: *\"Why do you think these leaves are red instead of green? What color was it in summer?\"*\n- Laminate finished products and display with labels about the seasons.\n- **Why this works:** Extends engagement with the material while reinforcing vocabulary and seasonal concepts.\n\n**Extension 3: \"Daylight Detective Challenge\"**\n- Over a 2-3 week period in fall, track sunrise and sunset times using a simple class calendar or chart.\n- Each Monday, ask: *\"Is the sun coming up earlier or later? Is it getting dark earlier or later?\"*\n- Record and notice the pattern: Days get shorter.\n- Compare fall data to summer data (if available from previous year or class photos).\n- Create a simple bar graph showing daylight hours getting shorter.\n- **Connection to NGSS:** Deeply supports 1-ESS1-1 and 1-ESS1-2 (describing patterns related to the sun and relating daylight to time of year).\n\n---\n\n## Teacher Notes & Implementation Tips\n\n1. **Timing:** This lesson works best in fall when students can see real changes around them. However, you can adapt it anytime using real leaves, photographs, and calendar reference.\n\n2. **Real Leaves Matter:** If possible, collect leaves the morning of or day before. Fresh leaves are more engaging and allow for better color observation and texture exploration.\n\n3. **Outdoor Connection:** Even 5-10 minutes outside looking at actual trees significantly deepens understanding. First graders are concrete thinkers and learn best from real objects.\n\n4. **Celebrate Observations:** This is about noticing patterns, not perfect scientific explanations. First graders will not understand chlorophyll or plant dormancy. Focus on observation and prediction of repeating patterns—that *is* the standard.\n\n5. **Revisit Throughout the Year:** Use this lesson as a springboard. In winter, ask: *\"Remember the fall leaves? What happened to the tree in winter?\"* This reinforces pattern understanding.\n\n6. **Family Connection:** Send home a note asking families to look for signs of fall together. Families can bring in leaves, photos, or observations to share the next day. This extends learning beyond the classroom.",
  "inputTokens": 2320,
  "outputTokens": 5090,
  "cost": 0.02777,
  "generatedAt": "2026-02-13T02:19:01.685Z"
}