{
  "title": "Gulf_of_mexico_5 ESS2 1",
  "category": "earth-space-science",
  "imageFile": "gulf_of_mexico_5-ESS2-1.jpg",
  "imagePath": "images/earth-space-science/gulf_of_mexico_5-ESS2-1.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- A wooden post or pole anchored in sand/ground\n- A rectangular warning sign with red and white coloring and black text reading \"CAUTION DROP OFF\"\n- Ocean water with visible waves and whitecaps\n- Clear blue sky\n- A sharp drop in water depth (inferred from sign placement and wave patterns)\n\n## Reasonable Inferences\n- **From the sign location and ocean backdrop**: There is a sudden, steep change in the ocean floor depth at this location, creating a hazard for swimmers or boats.\n- **From the sign's durability**: The structure must withstand salt water, wind, and wave exposure without failing quickly.\n- **From wave patterns**: Strong currents and wave action are present, suggesting the supporting post must resist lateral forces.\n\n---\n\n## Engineering Task\n\n### K-2 Version\n**\"Design a Strong Warning Sign for the Beach\"**\n\nYour beach needs a sign to keep people safe. Build a sign holder using sticks, straws, or paper tubes that can stand up tall and not tip over, even when you blow on it (like ocean wind). Your sign must:\n- Stand taller than your hand when you stand it up\n- Stay standing when you gently push it sideways\n- Have a sign attached that people can read from far away\n\nUse paper, markers, tape, and building sticks to make your solution.\n\n---\n\n### 3-5 Version\n**\"Engineer a Coastal Warning Sign Structure\"**\n\nA beach has a dangerous underwater drop-off. Design and build a sign post structure that can:\n1. **Stay upright** when subjected to simulated wind (use a fan or your breath directed at it for 10 seconds)\n2. **Support a readable sign** at least 12 inches above ground level\n3. **Resist tipping** when pushed sideways with a force equivalent to 2-3 pounds of pressure (use a hanging weight or scale)\n4. **Last at least 5 test cycles** without structural failure\n\n**Success criteria**: The sign remains vertical (within 5 degrees) after all tests, and the sign surface is visible and legible from 6 feet away.\n\n**Constraints**: Your post must be no thicker than 1 inch in diameter and use only one anchoring method (buried base, weighted base, or guy-wires—pick one).\n\n---\n\n## EDP Phase Targeted\n**Ask / Define Problem**\n\n**Why this phase fits**: The photo shows a real safety need (coastal hazard warning) without showing the solution process. Students must first identify *why* a sign is needed, *what forces threaten it* (wind, waves, erosion), and *what failure looks like* before designing. This mirrors how engineers encounter real-world infrastructure problems.\n\n---\n\n## Suggested Materials\n1. Wooden dowels, PVC pipes, or sturdy straws (for the post)\n2. Foam board, cardboard, or laminated paper (for the sign face)\n3. Sand, gravel, or a weighted bucket (for anchoring/stability)\n4. Tape, string, or zip ties (for assembly and bracing)\n5. Markers, paint, or printed graphics (for the warning message)\n\n---\n\n## Estimated Time\n- **K-2**: 45–60 minutes (design, build, test once)\n- **3-5**: 90–120 minutes across two sessions (Session 1: design & build; Session 2: test, observe failure, redesign, retest)\n\n---\n\n## Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting a design problem) and **ETS1.B** (developing possible solutions) by having students identify the structural and environmental constraints of a real coastal safety system, then prototype and test their solutions against those constraints.",
  "inputTokens": 2207,
  "outputTokens": 866,
  "cost": 0.006536999999999999,
  "generatedAt": "2026-02-12T09:32:02.557Z"
}