{
  "title": "Rocks",
  "category": "earth-space-science",
  "imageFile": "IMG_4086.jpeg",
  "imagePath": "images/earth-space-science/IMG_4086.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Rocks and Landscapes\n## Earth and Space Science, Grade 3\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Rocks and Rock Formations:** Stacked rocks of various sizes and shapes demonstrate how rocks can be arranged and used by humans; observation of different rock colors, textures, and sizes builds understanding of rock diversity.\n- **Erosion and Weathering:** Visible moss, lichen, and color variations on the stacked rocks show evidence of weathering over time; students can infer how rocks change due to weather and environmental conditions.\n- **Landforms and Human Design:** The rock pile represents a human-made structure that mimics natural landforms; this bridges natural systems with human modification of landscapes.\n- **Natural Resources:** Rocks are materials taken from Earth and used for construction and decoration; students observe how natural resources are extracted and repurposed in human environments.\n\n---\n\n### Lesson Title\n\n**Rock Builders: Exploring Rocks and How We Use Them**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 3-ESS3-1: Make a claim about the merit of a design solution that reduces the impacts of a weather-related hazard.\n  - Implicit connections to properties of materials and Earth systems (foundational to ESS understanding)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Describe different types of rocks and their characteristics (color, size, texture, shape).\n2. Explain how rocks can be used to build structures and solve human problems.\n3. Identify evidence of how weather changes rocks over time.\n4. Predict how stacking rocks in different ways affects the stability of a structure.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about rocks and human construction by examining the photograph.\n\n**Materials:**\n- Printed or displayed photograph of the rock pile and landscaping (IMG_4086.jpeg)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a screen or as a large print where all students can see it clearly. Say: \"Look carefully at this picture. What do you notice? What questions do you have?\"\n\n2. **Ask these discussion questions** (pause for student responses after each):\n   - \"What do you see in this picture? Can you describe the big pile of rocks in the middle?\"\n   - \"Why do you think someone stacked these rocks this way? What is the pile of rocks used for?\"\n   - \"Look closely at the rocks. Do they all look the same? What's different about them?\"\n   - \"If you touched these rocks, what do you think they would feel like? Why?\"\n\n3. **Prediction Prompt:** \"I'm going to show you some real rocks. I want you to predict: If I stack rocks like the pile in the picture, what would happen to the pile if we knocked on it or if it got rained on? Why do you think that would happen?\"\n\n4. **Record student predictions** on chart paper for reference later in the lesson.\n\n**Transition:** \"Today, we're going to explore rocks ourselves and find out how rocks are different and how we can use them to build things!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate rock properties and test how rocks stack through hands-on exploration.\n\n**Materials:**\n- 1 bag per small group (3-4 students) containing 15-20 rocks of varying sizes (smooth river rocks, rough rocks, small pebbles, larger stones—collected from a nature area or purchased from a landscape supplier)\n- Paper towels (3-4 per group)\n- Hand lenses or magnifying glasses (1 per group, optional but helpful)\n- Ruler or measuring tape (1 per group)\n- Recording sheet (provided below)\n- Tray or small box to contain rocks for each group\n\n**Activity:**\n\n**Part 1: Rock Observation (10 minutes)**\n\n1. Distribute one bag of rocks to each small group. Say: \"Your job is to become rock scientists. You're going to observe your rocks very carefully.\"\n\n2. **Students complete a \"Rock Investigation\" recording sheet** (you create a simple three-column chart):\n\n   | Rock # | What It Looks Like | What It Feels Like |\n   |--------|-------------------|------------------|\n   | 1      | (color, size, smooth/rough) | (texture description) |\n   | 2      | ... | ... |\n\n3. Students select 3-4 rocks from their bag and fill in at least two rows. Encourage them to use hand lenses if available.\n\n4. Circulate and ask guiding questions: \"What color is this rock? Is it smooth or rough? Is it heavy or light?\" **Do not tell students properties—let them discover.**\n\n**Part 2: Rock Stacking Challenge (10 minutes)**\n\n1. Say: \"Now we're going to test something. Can you stack your rocks to make a tall tower, just like the pile in the picture?\"\n\n2. **Challenge:** \"Stack your rocks as tall as you can without the pile falling over. Try stacking them different ways. What works best? What doesn't work?\"\n\n3. **Recording:** Students draw or describe in their notebooks:\n   - A picture of their successful stack\n   - Which rocks worked best for stacking (big ones? small ones? flat ones? round ones?)\n   - Why they think certain rocks stacked better than others\n\n4. **Optional second challenge:** \"Now try to stack the rocks so they are as wide as possible instead of tall. Does stacking them differently change which rocks work best?\"\n\n**Teacher Role:**\n- Observe without immediately fixing falling stacks—let students experiment and problem-solve.\n- Ask: \"What happened when you tried to stack that way? What could you try differently?\"\n- Encourage students to try multiple arrangements.\n- Photograph or save student rock stacks for Explain phase discussion.\n\n**Expected Student Outcomes:**\n- Students discover that flatter, larger rocks provide better bases.\n- Students notice that some rocks are smoother and rounder (harder to stack), while others are flatter (stack better).\n- Students develop vocabulary about rock characteristics (flat, round, smooth, rough, big, small, heavy, light).\n- Students document their findings through drawings and written descriptions.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and solidify understanding of rock properties and their uses.\n\n**Materials:**\n- Photographs or actual student rock stacks (from Explore)\n- Rock samples (from Explore activity, or fresh examples)\n- Chart paper\n- Markers\n- Picture book or photos showing rocks in human-made structures (bridges, buildings, sidewalks—optional but enhancing)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 2-3 groups to share their rock stacks (show photos or actual stacks if still intact).\n   - Ask the group: \"Why did these rocks work well for stacking? What's different about them?\"\n   - Listen for and affirm observations about flatness, size, and weight.\n\n2. **Introduce Key Vocabulary (7 minutes):**\n\n   Create a visual anchor chart with these terms:\n\n   - **Rock:** A hard, solid material found in nature made of one or more minerals. (Show examples and let students hold them.)\n   - **Weathering:** Changes that happen to rocks over a long time because of wind, water, rain, and sun. (Point to the photograph: \"See the green stuff and dark spots on those rocks? That's weathering—the rocks are changing slowly.\")\n   - **Erosion:** When rocks break into smaller pieces or move from one place to another because of water, wind, or ice. (Explanation: \"Weathering breaks rocks; erosion moves the broken pieces.\")\n   - **Properties:** Characteristics or qualities of something—what something looks like and feels like. (For rocks: color, size, texture, shape, weight.)\n   - **Structure:** Something that is built or constructed. (Show the rock pile, buildings, bridges as examples.)\n\n3. **Make Connections Back to the Photograph (5 minutes):**\n   - Display the landscape photograph again.\n   - Point to the stacked rocks: \"The person who built this structure used big, flat rocks. Why? Based on what you discovered, why would that be a good choice?\"\n   - Point to the moss and weathering on the rocks: \"These rocks have been outside for a long time. You can see they're changing—weathering is happening. What will happen to these rocks after many more years?\"\n\n4. **Check for Understanding:**\n   - Ask: \"If I want to build a rock structure that stays up, which rocks should I choose—the round ones or the flat ones? Why?\"\n   - Ask: \"What makes a rock smooth and round?\" (Answer should involve weathering and erosion over time.)\n   - Thumbs up/sideways/down: \"Do you understand what weathering means?\" Observe responses and reteach briefly if needed.\n\n**Vocabulary Chart:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Rock** | A hard, solid material from nature made of minerals. Examples: stones, pebbles. |\n| **Weathering** | When rocks slowly change and break apart because of sun, rain, wind, and temperature. |\n| **Erosion** | When broken rock pieces move to a new place by water, wind, or gravity. |\n| **Properties** | What something is like—its color, size, shape, texture, and weight. |\n| **Structure** | Something that is built or made to hold something up or contain something. |\n\n**Expected Student Outcomes:**\n- Students use the new vocabulary (rock, weathering, properties, structure) in sentences.\n- Students can explain why flatter rocks work better for building structures.\n- Students recognize evidence of weathering on rocks in the photograph.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Apply understanding by designing and testing a structure that protects against weather impacts.\n\n**Materials:**\n- Per group: 12-15 rocks (from previous exploration or fresh), small paper cups or containers\n- Small items to \"protect\" (modeling clay, a small plant, a toy figure—something representing something we want to protect)\n- Spray bottle with water (for simulating rain) or cup of water\n- Paper towels\n- Design planning sheet (provided below)\n- Markers and crayons\n\n**Activity:**\n\n**Challenge: Build a Weather-Safe Rock Structure**\n\n1. **Scenario:** \"In our community, we sometimes get heavy rain and strong winds. We want to use rocks to build a protective shelter or barrier. Your job is to design a rock structure that protects something inside (like a plant or a toy) from water.\"\n\n2. **Planning Phase (5 minutes):**\n   - Each group receives a simple planning sheet:\n     ```\n     Our Design Plan:\n     1. What are we protecting? _________________\n     2. What shape will our structure be? (circle, square, wall, etc.) _________________\n     3. Which rocks will we use? (big? small? flat? round?) _________________\n     4. How will our structure stop the rain? _________________\n     ```\n   - Groups discuss and draw a picture of their plan.\n\n3. **Building Phase (8 minutes):**\n   - Groups build their rock structure to protect their item.\n   - Teacher circulates and asks: \"How is your structure protecting the item inside? What would happen if rain came harder? Would you change anything?\"\n\n4. **Testing Phase (5 minutes):**\n   - Using a spray bottle, lightly spray water toward each structure (simulating rain).\n   - Observe: Does water get inside? Does the structure stay up? What breaks?\n   - Have groups make one quick change to improve their design if time allows.\n\n5. **Reflection Question:** \"What made some structures work better than others? Which rock properties were most important—size, flatness, or something else?\"\n\n**Teacher Role:**\n- Facilitate without building for students.\n- Ask guiding questions: \"What happens to your structure when water hits it? Why? What could you do differently?\"\n- Encourage testing and redesign rather than \"getting it right\" the first time.\n- Connect observations to the concept that good design choices help reduce weather hazards (3-ESS3-1).\n\n**Expected Student Outcomes:**\n- Students apply knowledge of rock properties to solve a design problem.\n- Students test a design and gather evidence about what works.\n- Students articulate why certain rocks or arrangements are more effective (flat rocks create barriers, big rocks provide weight/stability).\n- Students make a claim: \"We built a structure with flat rocks because flat rocks stop water better than round rocks.\"\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of rock properties, weathering, and application of rocks in structures.\n\n**Activity:**\n\n**Formative Assessment Throughout Lesson:**\n- Observation during Explore phase: Can students describe rock properties accurately? Are they experimenting with stacking?\n- During Explain: Do students use vocabulary correctly when discussing the photograph?\n- During Elaborate: Do students apply their knowledge of rock properties to the design challenge?\n\n**Exit Ticket (Summative Assessment):**\n\nAdminister this as a one-on-one or small-group check at the end of the lesson. You can ask verbally or use pictures/diagrams.\n\n**Option 1: Verbal Exit Ticket (3-4 minutes per student)**\n1. \"Show me two rocks that are different. Tell me how they are different.\" (Assess: Can they describe properties?)\n2. \"Why would you use a flat rock instead of a round rock to build something?\" (Assess: Do they connect properties to function?)\n3. \"What does weathering mean? Can you show me on a rock what weathering looks like?\" (Assess: Vocabulary and observation)\n\n**Option 2: Picture-Based Exit Ticket**\nProvide a simple worksheet:\n\n```\nRock Knowledge Check\n\n1. Look at these two rocks. Circle the rock that would be better for building \n   a tall stack. Why?\n   [Picture of flat rock]    [Picture of round rock]\n   \n   My reason: ___________________________________________\n\n2. What is weathering?\n   a) When rocks stay the same forever\n   b) When rocks slowly change because of rain, sun, and wind\n   c) When we paint rocks\n\n3. Draw a picture of a rock structure you could build to keep rain out \n   of something.\n```\n\n**Success Criteria for Student Understanding:**\n- ✓ Student accurately describes at least 2 properties of rocks (color, size, texture, shape, weight).\n- ✓ Student explains that flat or layered rocks work better for structures than round rocks.\n- ✓ Student uses the word \"weathering\" or describes weathering (rocks changing slowly due to weather).\n- ✓ Student applies rock properties to solve the design problem in Elaborate.\n- ✓ Student makes a claim about why certain rock structures work better (connects to 3-ESS3-1).\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding that rocks have different properties.\n- Students recognize that properties affect how rocks can be used.\n- Students explain that weathering changes rocks over time.\n- Students apply design thinking to reduce weather impacts.\n\n---\n\n### Differentiation\n\n**Support (Struggling Learners):**\n\n1. **Simplified Rock Properties Focus:**\n   - During Explore, provide a pre-labeled recording sheet with only 2 property categories: \"Looks Like\" and \"Feels Like\" with visual cues (pictures of \"smooth,\" \"rough,\" \"big,\" \"small\").\n   - Pair struggling students with a stronger partner during stacking challenges.\n\n2. **Vocabulary Scaffolding:**\n   - Use a word wall with pictures throughout the lesson. Point to images repeatedly when saying vocabulary words.\n   - During Explain, provide actual rock samples in the \"weathering\" example so students can feel and observe real evidence.\n\n3. **Structured Elaboration Task:**\n   - Provide struggling students with pre-cut shapes or containers to place rocks around (less open-ended design).\n   - Give explicit instructions: \"Stack big, flat rocks here. This will stop the water.\"\n   - Check in frequently and offer encouragement: \"Tell me what property of that rock helped your structure.\"\n\n**Challenge (Advanced Learners):**\n\n1. **Complex Property Analysis:**\n   - Ask advanced students to sort rocks by multiple properties at once: \"Group rocks that are BOTH big AND smooth\" or \"Find rocks that are small but heavy.\"\n   - Have them measure and compare rocks using rulers, recording data in a table.\n\n2. **Weathering Investigation:**\n   - Ask: \"How long do you think it takes to weather a rock this much?\" (point to weathered rock in photo). \"What could we do to test that?\"\n   - Challenge them to hypothesize: \"If we put a rock in water and freeze it, would that speed up weathering? Why or why not?\"\n   - Introduce the concept of water freezing and expanding in rock cracks (frost weathering).\n\n3. **Advanced Design Challenge:**\n   - Require advanced students to build two structures with different designs and compare them: \"Which design better protects against rain? Which is stronger? Why?\"\n   - Ask them to predict: \"What happens to your structure after many months of real rain and sun?\" and defend their prediction using what they learned about weathering.\n\n---\n\n### Extension Activities\n\n1. **Neighborhood Geology Walk:**\n   - Take students on a short walk around the school or neighborhood to find human-made rock structures (sidewalks, buildings, rock gardens, walls).\n   - Students photograph or sketch structures and discuss: \"What rocks were chosen here? Why do you think the builders chose those rocks? Is there weathering visible?\"\n   - Students can create a poster: \"Rocks in Our Community.\"\n\n2. **Create a Weathering Time-Lapse Display:**\n   - Take a photograph of the class's best rock structure on Day 1.\n   - Place identical structures outside (or near a window) and photograph periodically over 2-3 weeks.\n   - Display photos in order to show how weathering affects the structure and rocks over time.\n   - Students write captions: \"Week 1: Rocks are clean and bright. Week 2: Moss starts to grow. Week 3: Rocks are darker and more weathered.\"\n\n3. **Rock Art and Geology Connection:**\n   - Have students paint or decorate rocks, then discuss how paint/decoration changes the rock's appearance and properties.\n   - Ask: \"If we paint a rock, does weathering still happen to the rock underneath? What do you predict?\"\n   - Create a class rock garden or outdoor display and observe it monthly for weathering changes.\n\n4. **Book and Research Connection:**\n   - Read a picture book about rocks, erosion, or weathering (e.g., *Everybody Needs a Rock* by Byrd Baylor, or *Rocks and Soil* from a level-appropriate science series).\n   - Have students share their favorite rock from their Explore activity and write or draw why it's special (size, color, texture, how it can be used).\n\n---\n\n## Summary\n\nThis lesson leverages the photograph of the rock structure and landscape to guide students through authentic discovery of rock properties, weathering, and human use of natural materials. Students progress from observing and manipulating real rocks → understanding formal vocabulary and concepts → applying their learning to solve a weather-related design challenge. The alignment with **3-ESS3-1** (design solutions to reduce weather hazards) is woven throughout the Elaborate and Evaluate phases, giving students genuine practice in science and engineering thinking.",
  "inputTokens": 2884,
  "outputTokens": 4563,
  "cost": 0.025699000000000003,
  "generatedAt": "2026-02-12T22:05:44.095Z"
}