{
  "id": 43,
  "title": "Rock Formations and Weathering",
  "category": "earth-space-science",
  "imageFile": "IMG_4086.jpeg",
  "content": "## 📸 Photo Description\n\nThis creative photo shows a decorative rock formation in someone's yard! Large, flat rocks are stacked horizontally on top of each other to create a tall pillar or cairn structure. The rocks have different colors - browns, grays, and tan. Plants and shrubs surround the rock structure, and you can see a house in the background. The rocks look weathered and have been carefully balanced to create this interesting formation.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates rock properties and layering, even though this is a human-made structure. The flat, plate-like rocks shown here are likely sedimentary rocks or metamorphic rocks that naturally form in layers. In nature, sedimentary rocks form when sediments (sand, mud, shells) build up in layers and compress over millions of years. The different colors in rocks come from different minerals - iron creates reds and browns, while other minerals create grays and tans. The weathered appearance shows how exposure to wind, rain, and temperature changes gradually breaks down rock surfaces over time.\n\n## 📚 Core Concepts\n\n1. **Rock Layers**: Sedimentary rocks naturally form in horizontal layers as sediment builds up and compresses over time.\n\n2. **Rock Properties**: Rocks have different colors, textures, and shapes based on the minerals they contain and how they formed.\n\n3. **Weathering**: Natural processes that break down rocks over time through exposure to wind, water, temperature changes, and chemical reactions.\n\n<pedagogical-tip>\nCreate a \"Sedimentary Rock Layers\" demonstration! Use a clear jar or plastic cup. Have students add layers of different materials: sand, gravel, soil, crushed cookies (organic material), colored sand. Press down each layer. Add water and let settle. Discuss: How do layers form? What do different colors mean? How is this like rock formation? Extension: If possible, examine real layered rocks or photos of the Grand Canyon showing millions of years of layers! This hands-on model makes geological time and processes concrete.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Rock Collection**: Let students examine and sort rocks by color, texture, and properties\n- **Layer Observation**: Look for layered rocks in the local environment\n- **Mineral Identification**: Use simple tests (hardness, streak, color) to identify minerals\n- **Visual Comparisons**: Show photos of natural rock formations (Grand Canyon, sea cliffs)\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layers\n\n## 💬 Discussion Questions\n\n1. What Earth materials are stacked in this photo? (DOK 1: Recall)\n2. Why do you think these rocks have different colors? (DOK 2: Skill/Concept)\n3. How do layers form in sedimentary rocks in nature? (DOK 2: Skill/Concept)\n4. If you found a rock with many layers like these, what would that tell you about how it formed? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from layers of sediment that were pressed together over time\n- **Layers**: Horizontal sheets or levels stacked on top of each other\n- **Minerals**: Natural solid substances that make up rocks\n- **Weathering**: The breakdown of rocks through exposure to weather and environmental conditions\n- **Sediment**: Small particles like sand, mud, and shells\n\n## 🪨 Extension Activities\n\n- Research the three types of rocks (sedimentary, igneous, metamorphic)\n- Investigate how the Grand Canyon's layers formed over millions of years\n- Create a rock cycle diagram showing how rocks change over time\n- Test rock hardness using Mohs hardness scale with simple scratch tests",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis photo shows an interesting structure made of stacked rocks. The rocks are arranged in a tall, vertical pillar or tower. The rocks have different colors, including browns, grays, and tans. The rocks look smooth and weathered, as if they have been exposed to wind and rain for a long time. There are plants and shrubs growing around the rock structure, and a house can be seen in the background.\n\n## 🔬 Scientific Phenomena\n\nThe rocks in this photo are arranged in a way that resembles natural rock formations you might see in nature. Even though this is a human-made structure, the properties and appearance of the rocks are similar to how rocks form and change over time in the natural world. The different colors and layers in the rocks show how they were created from different materials and have been weathered and worn down by the environment over time.\n\n## 📚 Core Science Concepts\n\n1. **Rock Formation**: Rocks can form in layers, like the ones shown in the photo, through a process called sedimentation. Over millions of years, small particles like sand, mud, and shells build up and get compressed into solid rock.\n\n2. **Rock Properties**: Rocks come in many different colors, shapes, and textures depending on the minerals they are made of. The colors in the rocks in the photo likely come from different types of minerals.\n\n3. **Weathering**: The rocks in the photo look smooth and worn down, which is a sign of weathering. Weathering is the process where rocks break down and change shape over time due to wind, rain, and other environmental factors.\n\n<pedagogical-tip>\nTo help young students understand how rocks form and change, try setting up a simple \"rock layering\" demonstration. Use a clear container and have students add layers of different materials like sand, gravel, soil, and crushed cookies to represent how sedimentary rocks form. Then add water and let the layers settle. Discuss how the layers build up over time, and how weathering can gradually break down the rocks.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Hands-on Exploration**: Allow students to examine and sort a collection of real rocks based on their properties like color, texture, and shape.\n- **Visuals and Models**: Use diagrams, pictures, or 3D models to show how sedimentary rocks form in layers over time.\n- **Multimodal Learning**: Incorporate activities that engage multiple senses, like feeling the texture of rocks or observing the different colors.\n- **Scaffolding**: Break down complex concepts like the rock cycle into smaller, more manageable steps for younger students.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layers\n\n## 💬 Discussion Questions\n\n1. What materials do you see stacked in this photo? (DOK 1: Recall)\n2. Why do you think the rocks have different colors? (DOK 2: Skill/Concept)\n3. How do you think the rocks became so smooth and worn down? (DOK 2: Skill/Concept)\n4. If you found a rock with many layers like these, what could that tell you about how it formed? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: A type of rock that forms from layers of sediment, like sand, mud, and shells, that get pressed together over time.\n- **Layers**: Horizontal sections or levels stacked on top of each other.\n- **Minerals**: The natural materials that make up rocks and give them their different colors.\n- **Weathering**: The process where rocks break down and change shape over time due to wind, rain, and other environmental factors.\n- **Sediment**: Small particles like sand, mud, and shells that can build up and form new rocks.\n\n## 🌡️ Extension Activities\n\n- Go on a \"rock hunt\" around the school or neighborhood to find different types of rocks.\n- Create a model or diagram showing the rock cycle, and how rocks can change form over time.\n- Investigate how the Grand Canyon's layers were formed over millions of years.\n- Test the hardness of different rocks using the Mohs Hardness Scale.",
    "grade1": "## 📸 Photo Description\n\nThis photo shows an interesting rock formation in someone's yard. The rocks are stacked on top of each other, creating a tall, tower-like structure. The rocks have different colors - some are brown, some are gray, and some are tan. Plants and bushes are growing around the rock formation, and you can see a house in the background.\n\n## 🔬 Scientific Phenomena\n\nThe rocks in this photo are layered, just like rocks in nature. Over millions of years, rocks form in layers as sediments (like sand, mud, and shells) build up and get compressed. The different colors in the rocks come from the different minerals they contain, like iron which makes the rocks brown. Even though this is a human-made structure, it shows how natural rock formations are created.\n\n## 📚 Core Science Concepts\n\n1. **Rock Layers**: Rocks can form in horizontal layers over time as sediments build up and get compressed.\n2. **Rock Properties**: Rocks have different colors, textures, and shapes based on the minerals they contain.\n3. **Weathering**: Over time, rocks can break down and change from exposure to wind, rain, and temperature changes.\n\n<pedagogical-tip>\nTo help students understand rock layers, try a hands-on activity where they create their own \"sedimentary rock\" by layering different materials like sand, gravel, and crushed cookies in a clear container. This allows them to see how the layers form and how different materials create different colors and textures, just like real rocks. You can also go on a nature walk to look for layered rocks in your local environment.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Provide a variety of rock samples for students to examine and sort by color, texture, and properties.\n- Use visual aids like photos and diagrams to demonstrate how rock layers form over time.\n- Encourage students to make observations and draw connections between the rock formation in the photo and the natural rock formations they see around them.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layers\n\n## 💬 Discussion Questions\n\n1. What do you notice about the colors and shapes of the rocks in this photo? (DOK 1: Recall)\n2. How do you think the rocks in this formation were made? (DOK 2: Skill/Concept)\n3. If you found a rock with lots of layers like these, what could that tell you about how it formed? (DOK 3: Strategic Thinking)\n4. What other natural rock formations have you seen that look similar to this one? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from layers of sediment that were pressed together over time\n- **Layers**: Horizontal sheets or levels stacked on top of each other\n- **Minerals**: Natural solid substances that make up rocks\n- **Weathering**: The breakdown of rocks through exposure to weather and environmental conditions\n- **Sediment**: Small particles like sand, mud, and shells\n\n## 🪨 Extension Activities\n\n- Go on a nature walk and try to find examples of layered rocks in your local environment.\n- Investigate the different types of rocks (sedimentary, igneous, and metamorphic) and how they are formed.\n- Create a model or diagram to show the rock cycle and how rocks change over time.\n- Experiment with different materials to see how they can be used to create rock-like structures.",
    "grade2": "## 📸 Photo Description\n\nThis image shows an interesting rock formation in someone's garden. The rocks are stacked on top of each other in a tall, pillar-like structure. The rocks have different colors - browns, grays, and tans. The rocks look worn and weathered, with bumpy and uneven surfaces. Plants and shrubs are growing around the rock structure, and you can see a house in the background.\n\n## 🔬 Scientific Phenomena\n\nThe rock formation in this photo demonstrates how natural processes can shape and change the appearance of rocks over time. The flat, layered rocks are likely sedimentary rocks that formed when sand, mud, and other materials built up and compressed over many, many years. The different colors come from the different minerals present in the rocks. \n\nThe weathered, bumpy appearance of the rocks shows how exposure to wind, rain, and temperature changes can slowly break down and erode the rock surfaces. This process is called weathering, and it's how rocks in nature gradually change shape and become smoother or more jagged over long periods of time.\n\n## 📚 Core Science Concepts\n\n1. **Rock Formation**: Sedimentary rocks form in layers as sediments build up and compress over time.\n2. **Rock Properties**: Rocks have different colors, textures, and shapes based on their mineral content and how they were formed.\n3. **Weathering**: Natural processes like wind, water, and temperature changes slowly break down and erode rock surfaces over time.\n\n<pedagogical-tip>\nTo help 2nd grade students understand rock formation and weathering, try this hands-on activity:\n\nGather different types of sedimentary rocks, like sandstone, shale, and limestone. Have students observe the rocks closely and describe their properties - color, texture, layering. Then, have students gently rub the rocks together or drop them to simulate weathering. Observe how the rocks change over time. Discuss how natural processes like this can gradually alter the appearance of rocks in the real world.\n\nThis kinesthetic activity allows students to directly experience concepts like rock layering and weathering. It's a great way to make these abstract geological processes more concrete and relatable for young learners.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Engagement**: Use visual, auditory, and tactile methods to explore rock properties and weathering (e.g. observing, feeling, dropping rocks).\n- **Flexible Representation**: Provide images, diagrams, and physical rock samples to accommodate different learning preferences.\n- **Varied Responses**: Allow students to demonstrate their understanding through drawing, writing, modeling, or discussion.\n- **Supportive Technology**: Use digital simulations or apps to virtually observe rock formation and weathering processes.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in the properties and changes of rocks\n\n## 💬 Discussion Questions\n\n1. What types of materials do you see in the rock formation? (DOK 1: Recall)\n2. Why do you think the rocks have different colors? (DOK 2: Skill/Concept)\n3. How might the rocks have become stacked on top of each other like this? (DOK 2: Skill/Concept)\n4. If you found a rock with many layers like these, what could you learn about how it formed? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from layers of sediment (sand, mud, shells) that compressed over time\n- **Mineral**: A natural, inorganic substance that makes up rocks\n- **Weathering**: The gradual breakdown and change of rocks due to wind, water, and temperature\n- **Erosion**: The process by which wind, water, and ice wear away and move rock and soil\n\n## 🪨 Extension Activities\n\n- Investigate the three main types of rocks (sedimentary, igneous, metamorphic) and how they form\n- Explore the rock cycle and how rocks can transform from one type to another over long periods of time\n- Conduct simple tests to identify the properties of different rocks, like hardness and color\n- Research how the layers of the Grand Canyon formed over millions of years",
    "grade3": "## 📸 Photo Description\n\nThis image shows an interesting rock formation in someone's yard. The structure is made up of large, flat rocks stacked horizontally on top of each other, creating a tall, pillar-like shape. The rocks have different colors, ranging from browns and grays to tans. The rocks look weathered and worn, with some cracks and uneven surfaces. The rock formation is surrounded by plants and shrubs, and there is a house visible in the background.\n\n## 🔬 Scientific Phenomena\n\nThis rock formation demonstrates the natural process of rock weathering and erosion. Over time, exposure to wind, rain, and temperature changes can gradually break down and wear away the surfaces of rocks, creating the textured, weathered appearance seen here. The different colors in the rocks are due to the various minerals they contain, such as iron which creates the reddish-brown hues. \n\nAlthough this is a human-made structure, the flat, layered rocks used to build it are likely sedimentary or metamorphic rocks that naturally form in horizontal layers. In nature, sedimentary rocks are created when small particles like sand, mud, and shells accumulate and compress over millions of years, while metamorphic rocks form when existing rocks are subjected to heat and pressure deep within the Earth.\n\n## 📚 Core Science Concepts\n\n1. **Rock Layers**: Sedimentary and metamorphic rocks often form in horizontal layers as sediments or existing rocks are compressed over time.\n\n2. **Rock Properties**: The color, texture, and shape of rocks are determined by the minerals they contain and the processes that formed them.\n\n3. **Weathering**: The gradual breakdown of rocks due to exposure to wind, water, temperature changes, and other environmental conditions.\n\n<pedagogical-tip>\nTo help students understand rock layers and formation, create a hands-on \"sedimentary rock\" model using a clear container. Have students add layers of different materials like sand, gravel, soil, and crushed cookies, pressing each layer down. Then add water and observe how the layers settle. Discuss how this is similar to how real sedimentary rocks form over long periods of time. You can also extend this activity by having students examine real rock samples or photos of natural rock formations like the Grand Canyon.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Engagement**: Allow students to touch and examine real rock samples to observe their properties.\n- **Visual Representations**: Use diagrams, photos, and videos to illustrate the rock cycle and processes like weathering.\n- **Flexible Grouping**: Encourage students to work in pairs or small groups to explore and discuss rock formation.\n- **Multiple Means of Expression**: Have students create models, drawings, or presentations to demonstrate their understanding of rock concepts.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layers and formations\n\n## 💬 Discussion Questions\n\n1. What materials are the rocks in this photo made of? (DOK 1: Recall)\n2. Why do you think the rocks have different colors? (DOK 2: Skill/Concept)\n3. How do you think the layers in these rocks formed over time? (DOK 2: Skill/Concept)\n4. If you found a rock with many horizontal layers like these, what might that tell you about how it formed? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from layers of sediment that were pressed together over time.\n- **Metamorphic rock**: Rock that has been transformed by heat and pressure deep within the Earth.\n- **Layers**: Horizontal sheets or levels stacked on top of each other.\n- **Minerals**: Natural solid substances that make up rocks.\n- **Weathering**: The breakdown of rocks through exposure to weather and environmental conditions.\n- **Sediment**: Small particles like sand, mud, and shells that accumulate over time.\n\n## 🪨 Extension Activities\n\n- Research the three main types of rocks (sedimentary, igneous, metamorphic) and how they form.\n- Investigate how the layered rocks of the Grand Canyon were formed over millions of years.\n- Create a diagram or model showing the rock cycle and how rocks change over time.\n- Conduct simple hardness tests on rocks using the Mohs hardness scale.",
    "grade4": "## 📸 Photo Description\n\nThis photo shows an interesting rock formation called a cairn, which is a human-made stack of rocks. The cairn is made up of flat, horizontal sedimentary or metamorphic rocks in various shades of brown, gray, and tan. The rocks look weathered and worn, with some cracks and grooves on their surfaces. The cairn structure is surrounded by plants and shrubs, creating a natural, peaceful scene.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates how rocks can form in layers and be gradually worn down over time through weathering. The flat, plate-like rocks in the cairn likely started as sedimentary or metamorphic rocks that formed when sediments or minerals were compressed and hardened into layers. Over time, exposure to wind, rain, and temperature changes has slowly broken down the surfaces of these rocks, creating their weathered appearance.\n\n## 📚 Core Science Concepts\n\n1. **Rock Layers**: Sedimentary and metamorphic rocks often form in horizontal layers as sediments or minerals build up and compress over long periods of time.\n\n2. **Rock Properties**: The color, texture, and shape of rocks are determined by the types of minerals they contain and how they were formed.\n\n3. **Weathering**: The gradual breakdown of rocks due to exposure to wind, water, temperature changes, and other natural processes.\n\n<pedagogical-tip>\nTo help students understand rock layering and weathering, set up a simple demonstration. Use a clear container and have students layer different materials like sand, gravel, and crushed cookies to represent sedimentary rock formation. Then, have them spray the container with water to observe how the \"rocks\" start to wear down. Discuss how this models what happens in nature over long periods of time. You can also bring in real rock samples for students to observe and compare.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Use images and diagrams to illustrate rock layering and weathering processes\n- **Hands-on Exploration**: Allow students to examine and sort different rock samples by properties\n- **Varied Representation**: Encourage students to draw or model the rock formation and weathering processes\n- **Student Choice**: Let students select their own rock samples to investigate and share with the class\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layers and weathering\n\n## 💬 Discussion Questions\n\n1. What materials do you think were used to build this rock formation? (DOK 1: Recall)\n2. How do you think the rocks in this formation became weathered and worn-looking over time? (DOK 2: Skill/Concept)\n3. If you found a rock with clear horizontal layers, what could you infer about how it formed? (DOK 3: Strategic Thinking)\n4. How might the weathering of rocks in this formation be different if it was located in a very dry, hot climate versus a wet, rainy climate? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from layers of sediment that have been compressed and hardened over time\n- **Metamorphic rock**: Rock that has been transformed by heat and pressure deep within the Earth\n- **Weathering**: The breakdown of rocks due to exposure to wind, water, temperature changes, and other natural processes\n- **Erosion**: The process by which wind, water, or ice wears away and transports rock and soil\n- **Sediment**: Small particles like sand, silt, or clay that settle and accumulate over time\n- **Mineral**: A naturally occurring inorganic substance with a specific chemical composition\n\n## 🪨 Extension Activities\n\n- Conduct a rock hardness investigation using the Mohs Hardness Scale\n- Research how the layers of the Grand Canyon were formed over millions of years\n- Create a model or diagram of the rock cycle to show how rocks change over time\n- Go on a local rock hunt and classify the rocks you find based on their properties",
    "grade5": "## 📸 Photo Description\n\nThis photo shows an impressive stack of flat, layered rocks arranged in an artificial rock formation, or cairn. The rocks have different shades of gray, tan, and brown, indicating they are made of various minerals. The rocks look weathered and worn, with some cracks and pits on the surfaces. The structure is surrounded by plants and appears to be in someone's yard or garden.\n\n## 🔬 Scientific Phenomena\n\nThis rock formation demonstrates the natural processes of rock layering and weathering, even though it is a human-made structure. The flat, plate-like rocks likely started as sedimentary or metamorphic rocks that formed in horizontal layers over time. In nature, sedimentary rocks form when small particles like sand, mud, and shells accumulate and compress into layers. The different colors in the rocks come from the various minerals they contain, such as iron (which creates reddish-brown hues) and other minerals (which create grays and tans). The weathered appearance shows how exposure to wind, rain, and temperature changes gradually breaks down the surfaces of rocks over time.\n\n## 📚 Core Science Concepts\n\n1. **Rock Layers**: Sedimentary and metamorphic rocks form in horizontal layers as sediments or minerals build up and compress over millions of years.\n\n2. **Rock Composition**: Rocks are made of different minerals, which give them their unique colors, textures, and properties.\n\n3. **Weathering**: Physical, chemical, and biological processes that gradually break down and erode rocks over time.\n\n<pedagogical-tip>\nTo help students better understand rock layering and weathering, consider doing a hands-on demonstration. You could create a \"sedimentary rock\" model by layering different materials like sand, gravel, and crushed cookies in a clear container. This allows students to see how the layers form and how weathering processes like water and temperature changes can affect the rocks over time. You can also take students on a nature walk to observe layered rocks in the local environment, such as in cliffs or stream beds. Discussing how these natural rock formations developed will reinforce the core concepts.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Presentation**: Use images, videos, and physical rock samples to demonstrate rock properties and weathering processes.\n- **Collaborative Learning**: Have students work in small groups to sort and identify different rock samples based on their characteristics.\n- **Sensory Exploration**: Allow students to touch and observe rock samples, noting their textures, colors, and other features.\n- **Visual Aids**: Provide diagrams or illustrations to help students visualize the rock cycle and how sedimentary and metamorphic rocks form.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognize and describe patterns in rock layers and weathering processes.\n\n## 💬 Discussion Questions\n\n1. What materials do you think were used to create this rock formation? (DOK 1: Recall)\n2. Why do you think the rocks have different colors? (DOK 2: Skill/Concept)\n3. How do you think the natural process of weathering has affected the appearance of these rocks over time? (DOK 3: Strategic Thinking)\n4. If you found a rock with many distinct layers like these, what could that tell you about how it formed? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from layers of sediment that were compressed and cemented together over time.\n- **Metamorphic rock**: Rock that has been transformed by heat and pressure deep within the Earth's crust.\n- **Mineral**: A naturally occurring inorganic substance with a specific chemical composition and crystalline structure.\n- **Weathering**: The process of breaking down and eroding rocks and minerals through physical, chemical, and biological processes.\n- **Sediment**: Small particles like sand, silt, and clay that accumulate and are transported by water, wind, or ice.\n- **Erosion**: The process of wearing away and moving rock and soil by wind, water, ice, or gravity.\n\n## 🪨 Extension Activities\n\n- Investigate the three main rock types (igneous, sedimentary, and metamorphic) and how they form.\n- Explore the rock cycle and how rocks can change from one type to another over long periods of time.\n- Conduct simple tests to identify the properties and mineral content of different rock samples.\n- Research how the layered rock formations of the Grand Canyon were created over millions of years."
  }
}