{
  "title": "Mammal",
  "category": "earth-space-science",
  "imageFile": "IMG_1334.jpeg",
  "imagePath": "images/earth-space-science/IMG_1334.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Habitats and Resources in Our World\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Natural habitats and ecosystems** — The photograph shows a squirrel living among plants, soil, and flowers, representing a specific environment where animals find food and shelter (rocks, soil, and vegetation are visible environmental components).\n- **Seasonal food availability and plant growth** — The flowering plants and orange food visible in the image connect to how seasons affect what is available in an environment; plants grow during certain seasons providing food for animals.\n- **Soil as a natural resource** — The visible soil and ground substrate show how earth materials support plant and animal life; soil is essential for growing plants that animals depend on.\n- **Adaptation and survival in local environments** — The squirrel's presence among these plants demonstrates how animals are adapted to and dependent on their local landscape and weather conditions.\n\n---\n\n## Lesson Title\n\n**What Do Animals Need to Live in Different Places?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90–120 minutes (two sessions: one 45–60 minute session for Engage through Explain, one 45–60 minute session for Elaborate and Evaluate)\n- **NGSS Standards:** \n  - 3-ESS2-2: Obtain and combine information to describe climates in different regions of the world\n  - 3-ESS3-1: Make a claim about the merit of a design solution that reduces the impacts of a weather-related hazard\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Identify and describe** the natural resources (soil, plants, water, rocks) that animals need to survive in their habitats.\n2. **Explain how** seasonal changes in plant growth affect the food and shelter available to animals in different environments.\n3. **Describe the connection** between a region's climate (weather patterns) and the types of plants and animals that live there.\n4. **Design and propose** a solution that helps animals survive seasonal changes or weather challenges in their habitat.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by analyzing the photograph to wonder about animal habitats and resources.\n\n**Materials:**\n- Projected or printed copy of the squirrel photograph (enlarged for class visibility)\n- Chart paper and markers (for recording predictions)\n- Optional: Tablet or document camera for close-up viewing\n\n**Activity:**\n\n1. **Display and initial observation** (3–4 minutes): Project the photograph on the screen or pass around a printed copy. Ask students to sit silently for 20 seconds and just look, without talking.\n\n2. **Guided discussion with curiosity questions** (7–10 minutes): Ask students these questions one at a time, pausing for hand-raising and responses:\n   - *\"What animal do you see in this picture, and where is it?\"* (Look for: squirrel, in a garden or yard with plants and soil)\n   - *\"What do you see around the squirrel that might help it live and survive?\"* (Accept: plants, dirt/soil, flowers, rocks, grass, the orange food)\n   - *\"Why do you think the squirrel is holding that orange piece of food? What do you think it is?\"* (Guide toward: food, something to eat; squirrels need to eat)\n   - *\"If it started to rain really hard or got very cold, where do you think the squirrel would go? What from this picture might help it?\"* (Guide toward: shelter, hiding places, thick grass/plants)\n\n3. **Wonder prompt** (2 minutes): Record student responses on chart paper. End with: *\"Today we are going to discover what animals really need from their habitat to stay healthy and safe through all kinds of weather.\"*\n\n**Transition:** *\"Let's explore this by building our own mini-habitat and discovering what animals truly depend on!\"*\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate what plants and animals need to survive by observing and manipulating habitat components in a hands-on model.\n\n**Materials (per small group of 3–4 students):**\n- 1 clear plastic container (quart-sized or similar) or clear plastic cup\n- Handful of potting soil (about 2–3 cups)\n- 3–5 small living plants or plant cuttings (purchased from nursery or propagated; e.g., small clover, grass seedlings, or herb sprigs)\n- Handful of small rocks and pebbles\n- 1–2 earthworms or pill bugs (sourced from school garden or ordered; handle with care)\n- Water in a spray bottle\n- Cardstock or construction paper to create a \"shelter\" (small roof or cover)\n- Optional: magnifying glass per student\n- Record sheet (see below)\n\n**Student Record Sheet Template:**\n\n| What We Put in Our Habitat | Why We Think It Helps | What Happened After 5 Days |\n|---|---|---|\n| Soil | | |\n| Plants | | |\n| Rocks | | |\n| Water | | |\n| Shelter (cover) | | |\n\n**Activity — Step-by-Step Student Directions:**\n\n1. **Prepare your habitat** (5 minutes):\n   - Fill your container with soil to about 2 inches deep.\n   - Gently place 2–3 small plants into the soil.\n   - Add rocks around the plants.\n   - Lightly mist the soil with water so it feels damp (not soggy).\n   - Carefully place an earthworm or pill bug onto the soil surface; it will burrow down.\n\n2. **Create shelter** (3 minutes):\n   - Use the construction paper to make a small \"roof\" or cover that you can place over one side of the container. This provides a dark shelter like animals find under rocks or logs.\n\n3. **Observe and record** (5 minutes):\n   - Use the magnifying glass to look closely at the plants, soil, and where the animal moved.\n   - **What do the plants need from the soil?** (Record your idea on the record sheet.)\n   - **Why did the animal move under the shelter?** (Record your idea.)\n   - **What is each thing (soil, plants, rocks, water, shelter) doing to help the animal survive?** (Write or draw one word or simple picture in the \"Why We Think It Helps\" column.)\n\n4. **Care and observation over time** (assign homework):\n   - Mist the habitat lightly every 2 days.\n   - Make observations for 5 days and add notes to your record sheet.\n\n**Teacher Role:**\n- Circulate to each group, asking open-ended questions: *\"What do you notice about the soil? Is it the same as it was at the start? Why do you think the worm went under the shelter?\"*\n- Do NOT tell students the answers. Instead, ask: *\"What would happen if we took away the water? Let's predict and watch.\"*\n- Help groups gently handle animals and ensure they remain safe and moist.\n- Prompt students to make predictions: *\"What will the plants look like in 5 days? Why?\"*\n\n**Expected Student Outcomes:**\n- Students discover that soil supports plant roots and retains moisture.\n- Students observe that animals seek shelter and darkness.\n- Students recognize that plants need water and light to grow.\n- Students see connections between habitat components and animal behavior.\n- Record sheets document initial predictions and observations.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to earth science concepts about habitats, resources, and environmental conditions.\n\n**Materials:**\n- Chart paper with key vocabulary words written large\n- Photograph of squirrel displayed again\n- Student observation sheets from Explore phase\n- Visual anchor chart (teacher-made or printed, see Vocabulary section)\n\n**Activity:**\n\n1. **Share observations** (5–7 minutes):\n   - Invite 2–3 groups to briefly share one observation: *\"What did your worm or pill bug do? What did your plants look like?\"*\n   - Record key observations on a class chart.\n\n2. **Introduce vocabulary and concepts** (8–10 minutes):\n   - Display and read aloud each vocabulary term while pointing to examples in the photograph.\n   - Create an anchor chart showing how each term connects to the squirrel photo and student habitats:\n     - **\"Habitat\"** — *\"This is where an animal lives. It has everything the animal needs. The squirrel's habitat is this garden with soil, plants, rocks, and flowers.\"*\n     - **\"Natural resources\"** — *\"These are things in nature that living things need to survive. Soil, water, plants, and rocks are natural resources. What natural resources do you see around our squirrel?\"*\n     - **\"Soil\"** — *\"This is the dark material made from broken-down rock and dead plants. It holds water and feeds plants. Remember how wet the soil was in your container? That helps plants grow.\"*\n     - **\"Shelter\"** — *\"This is a safe, protected place where animals hide from danger and bad weather. The squirrel might hide in a hole, under leaves, or under rocks. In your habitat, the worm moved under your cover for shelter.\"*\n     - **\"Seasonal changes\"** — *\"This means how things change with each season. In spring and summer, plants grow and flowers bloom. The squirrel has more food. In fall and winter, plants die back and it's colder. The squirrel must find stored food.\"* (Show pictures or video clip if available.)\n\n3. **Connect back to photograph** (2–3 minutes):\n   - *\"Look at the squirrel again. It lives in a habitat with soil, plants, water, and rocks. These are natural resources. The squirrel is eating food that grows in this habitat. In winter, when flowers don't bloom, what do you think the squirrel does?\"* (Guide toward: stores food, hibernates, finds other sources)\n\n4. **Check for understanding** (formative):\n   - Ask: *\"Can someone show me soil in this picture? Where is a shelter the squirrel might use? What natural resource is the plant using to grow?\"*\n   - Listen for correct vocabulary use and conceptual understanding.\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|---|---|\n| **Habitat** | The place where an animal lives. It has everything the animal needs: food, water, shelter, and space. |\n| **Natural resources** | Things found in nature that living things need to live, like soil, water, plants, rocks, and sunlight. |\n| **Soil** | Dark material made from broken rock and dead plants. It holds water and nutrients that help plants grow. |\n| **Shelter** | A safe, protected place where animals hide from danger and bad weather, like under logs, rocks, or in holes. |\n| **Seasonal changes** | How the weather and environment change during different times of the year (spring, summer, fall, winter). Plants grow in some seasons and rest in others. |\n\n**Expected Student Outcomes:**\n- Students use habitat vocabulary accurately when describing the photograph and their model habitats.\n- Students explain that animals need food, water, shelter, and space from their habitats.\n- Students recognize that natural resources support both plants and animals.\n- Students understand that seasonal changes affect what is available to animals.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding by designing a solution that helps an animal survive a weather challenge in a specific climate or habitat.\n\n**Materials:**\n- Picture cards or descriptions of 3–4 different habitats/climates (see examples below)\n- Craft materials: cardstock, markers, colored paper, tape, clay, natural items (leaves, sticks, pebbles)\n- \"Design Challenge\" sheet (see below)\n- Optional: Images of seasonal changes (winter snow, dry summer)\n\n**Habitat/Climate Scenarios for Student Selection:**\n1. **Desert habitat in summer** — Very hot, dry, little rain. Animal: lizard.\n2. **Forest habitat in winter** — Very cold, snow, few plants growing. Animal: squirrel or deer.\n3. **Grassland in spring** — Mild weather, new plants growing. Animal: rabbit.\n4. **Wetland habitat (marsh)** — Wet year-round, some shelter from reeds and plants. Animal: duck or frog.\n\n**Design Challenge Sheet:**\n\n---\n\n**My Habitat Challenge**\n\n**The animal I'm helping:** ____________________\n\n**My habitat/climate:** ____________________\n\n**The weather problem:** ____________________\n\n**My design solution:**\n- *What will I build or create to help this animal survive?* (Draw or describe)\n- *What materials will it use?* (Soil? Plants? Rocks? Shelter?)\n- *How will it help the animal survive the weather?* (Explain in 2–3 sentences)\n\n**Why is this a good solution?**\n☐ It provides shelter\n☐ It helps the animal find food\n☐ It helps the animal stay warm/cool\n☐ It protects the animal from bad weather\n☐ Other: ____________________\n\n---\n\n**Activity — Step-by-Step Directions:**\n\n1. **Choose your habitat** (2 minutes):\n   - Students select one habitat/climate scenario (teacher may assign for differentiation).\n   - Read or listen to the weather challenge: *\"A squirrel lives in a forest. Winter is coming. It will be very cold and snowy. What can it do to survive?\"*\n\n2. **Plan your solution** (5 minutes):\n   - Discuss with a partner: *\"What does this animal need during this season? What natural resources can we use?\"*\n   - Sketch or write your idea on the Design Challenge sheet.\n   - Examples: Build a cozy den lined with leaves, create a storage area for food, make a shelter from branches.\n\n3. **Create your design** (8–10 minutes):\n   - Use craft materials to build or model your solution.\n   - Label the parts (e.g., \"shelter,\" \"food storage,\" \"insulation\").\n   - Be prepared to explain how it helps the animal.\n\n**Teacher Role:**\n- Facilitate small-group brainstorming by asking: *\"What natural resources are available in this habitat? How can the animal use them?\"*\n- Ask probing questions: *\"If it gets very cold, what kind of shelter would keep the animal warm? What materials stay warm?\"*\n- Encourage students to think about real animal behaviors: *\"Do you know what squirrels really do in winter? Have you seen them gathering nuts?\"*\n- Validate all design attempts; focus on reasoning, not realism.\n\n**Expected Student Outcomes:**\n- Students design a solution that addresses the weather challenge using available natural resources.\n- Students explain how their solution meets the animal's needs for food, shelter, or warmth.\n- Students make connections between habitat resources and seasonal survival.\n- Students articulate reasoning: *\"I built a shelter with leaves because they keep the animal warm and hide it from predators.\"*\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of habitat resources, natural resources, and animal survival needs through formative and summative strategies.\n\n**Formative Assessment (ongoing throughout lesson):**\n- **Observation during Explore:** Teacher notes whether students identify soil, shelter, and water as important habitat components.\n- **Discussion during Explain:** Listen for correct use of vocabulary and understanding of natural resource connections.\n- **Questions during Elaborate:** Observe whether students' design solutions logically connect to habitat resources and seasonal challenges.\n\n**Summative Assessment — Exit Ticket (5–7 minutes):**\n\nStudents respond to the following (may be written, drawn, or spoken for struggling writers):\n\n1. **Look at the squirrel photo again. Name two natural resources the squirrel uses to survive.**\n   - ________________\n   - ________________\n\n2. **Circle the things a squirrel's habitat must have:**\n   - Food (plants, nuts)\n   - Shelter (trees, logs, burrows)\n   - Soil\n   - Water\n   - Rocks\n\n3. **In winter, when flowers and plants stop growing, what might be hard for the squirrel? How could it solve this problem?**\n   - Drawing or sentence: ____________________________________\n\n4. **What did you learn about habitats and natural resources in this lesson?** (1–2 sentences)\n   - ____________________________________________________________________\n\n**Success Criteria — Students demonstrate understanding if they:**\n- ✓ Identify at least 2 natural resources visible in the photograph or needed by animals.\n- ✓ Explain that animals need food, water, shelter, and space (from their habitat).\n- ✓ Recognize that seasonal changes affect plant growth and animal food availability.\n- ✓ Design a reasonable solution to a habitat/weather challenge and explain how it uses natural resources.\n- ✓ Use at least 3 vocabulary terms (habitat, natural resources, shelter, soil, seasonal) accurately.\n\n**How to Determine if Students Met Learning Objectives:**\n- Review exit tickets for accuracy and completeness.\n- Compare student Design Challenge sheets to success criteria above.\n- Revisit observation notes from Explore and Explain phases.\n- If 80%+ of students demonstrate 4 of 5 criteria, learning objectives were met.\n- If fewer than 80%, plan a brief reteach focusing on vocabulary and habitat components before moving forward.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Guided habitat observation:**\n   - Pair with a strong peer during Explore activity.\n   - Provide a simplified record sheet with picture choices and blanks (e.g., *\"The plant needs: ☐ soil ☐ rocks ☐ light\"*) instead of open-ended prompts.\n   - Teacher checks understanding by asking: *\"Show me the shelter in our habitat. Why is it there?\"*\n\n2. **Vocabulary scaffolding:**\n   - Pre-teach vocabulary with visual anchor charts and photos before Explain phase.\n   - Create a personal word bank with pictures (draw or cut/paste images of soil, shelter, plant, water) for student reference during writing.\n   - Use the same vocabulary repeatedly and consistently; point to examples in the room.\n\n3. **Simplified design challenge:**\n   - Reduce habitat choices to 2 familiar options (e.g., \"forest\" or \"desert\").\n   - Provide a template or model solution (e.g., *\"Here's one way a squirrel stays warm: [example]. Now you try.\"*).\n   - Allow student to sketch design instead of building it; accept simple drawings with teacher scribe support.\n\n### Challenge (for advanced learners):\n\n1. **Multi-season habitat analysis:**\n   - Ask student to design a habitat that works for an animal across **two seasons** (e.g., spring AND winter for a squirrel).\n   - Prompt: *\"How must the habitat change? What resources are available in each season? How does the animal adapt?\"*\n   - Student creates two drawings or a before/after comparison.\n\n2. **Research a real animal's adaptation:**\n   - Provide access to nonfiction texts, videos, or reliable websites (teacher-vetted).\n   - Student researches how a specific animal (e.g., arctic fox, desert tortoise, migratory bird) is adapted to its climate and uses natural resources.\n   - Student creates a poster or short written report: *\"How does [animal] survive in [habitat]? What natural resources does it depend on?\"*\n\n3. **Design a nature preserve:**\n   - Advanced group designs a habitat that supports **multiple animals** in one ecosystem.\n   - Prompt: *\"If you were creating a nature preserve for squirrels, deer, and birds, what natural resources would you include? How would you make sure there's food in winter?\"*\n   - Student sketches or builds a model showing interconnected habitat zones with labels.\n\n---\n\n## Extension Activities\n\n1. **\"Seasons in a Jar\" — Observation Journal:**\n   - Students maintain a simple outdoor observation journal over 4 weeks (one week per season or simulated season).\n   - Each week, students sketch and record: plants they see, animals spotted, weather, and what resources are available.\n   - At the end, students compare their drawings and identify seasonal patterns.\n   - *Connection:* Deepens understanding of 3-ESS2-2 (climate and habitat variations) and seasonal resource availability.\n\n2. **Class Habitat Walk & Resource Scavenger Hunt:**\n   - Take students outside (schoolyard, nearby park, or nature area) with clipboards and a checklist.\n   - Checklist items: *Find soil, spot a plant, find a rock, locate water, find an animal home or shelter, observe signs of seasonal change.*\n   - Students photograph or sketch each discovery and label the natural resource.\n   - Return to class and compile findings into a class book: *\"Natural Resources in Our Neighborhood.\"*\n   - *Connection:* Grounds learning in local environment; reinforces real-world habitat observation.\n\n3. **\"Help an Animal Survive Winter\" — Engineering Design Project:**\n   - Provide a longer-term challenge: *\"Design and build a shelter or food source that could help an animal (squirrel, bird, hedgehog) survive winter in your backyard or neighborhood.\"*\n   - Students may design a birdhouse, nut storage device, insulated shelter, or food feeder using recycled materials.\n   - If possible, students test their design outdoors (with teacher supervision) and observe whether animals use it.\n   - *Connection:* Extends 3-ESS3-1 (design solutions to reduce hazards); applies engineering and real-world environmental stewardship.\n\n---\n\n## Teaching Notes & Tips\n\n- **Timing flexibility:** If the habitat observation must span multiple days, set up containers on a shelf and observe daily rather than waiting 5 days. Record observations progressively.\n- **Live animal sourcing:** Earthworms and pill bugs are easily obtained from garden soil, local nurseries, or scientific supply companies (Carolina Biological, etc.). Check school policies on live animals before purchasing.\n- **Climate/habitat pictures:** Use images from Google Images (creative commons), National Geographic Kids, or Scholastic articles to represent different habitats during Elaborate phase.\n- **Connection to seasons:** If teaching this in fall/winter, emphasize seasonal survival (very relevant). In spring, focus on plant growth. Adjust examples accordingly.\n- **Safety reminders:** Review gentle handling of live animals; emphasize that worms and pill bugs are living creatures. Supervise at all times.\n\n---\n\nThis lesson moves from concrete observation of a real squirrel habitat through exploration of a student-built model, to formal understanding of habitat resources and seasonal changes, and finally to design thinking that applies those concepts. Students leave with a clear understanding that natural resources (soil, water, plants, shelter, light) are essential for animals to survive, and that these resources change with seasons and climate—core earth and space science concepts for Third Grade.",
  "inputTokens": 2852,
  "outputTokens": 5357,
  "cost": 0.029637,
  "generatedAt": "2026-02-12T21:56:17.045Z"
}