{
  "title": "Beach",
  "category": "earth-space-science",
  "imageFile": "IMG_3140.jpeg",
  "imagePath": "images/earth-space-science/IMG_3140.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Beach Visitors and Daylight Patterns\n\n## Core Science Concepts from Image Analysis\n- **Daylight and Shadows:** The hazy sky and visible buildings in the background demonstrate how daylight changes throughout the day and year, affecting visibility and the length of shadows.\n- **Weather and Atmospheric Conditions:** The hazy, overcast conditions visible in the photograph show how weather affects what we observe and see (visibility, clarity).\n- **Water (Ocean) as a Natural Feature:** The ocean, beach, and water demonstrate Earth's water systems and how people interact with them.\n- **Seasonal Patterns:** Beach activity patterns are connected to seasons and the position of the sun, which relates to how daylight changes throughout the year.\n\n---\n\n## Lesson Title\n**Following the Sun: Our Beach Day Shadows and Daylight**\n\n---\n\n## Lesson Overview\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 75–90 minutes (conducted over two sessions: Session 1 = 40 minutes; Session 2 = 35–50 minutes)\n- **NGSS Standards:**\n  - **1-ESS1-2:** Make observations at different times of year to relate the amount of daylight to the time of year.\n  - **1-ESS1-1:** Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n\n---\n\n## Learning Objectives\nStudents will be able to:\n- **Observe and record** how the sun creates shadows at different times of day.\n- **Predict and explain** how daylight changes between different seasons and times of day.\n- **Connect observations** of the beach photograph to their own experiences with sunlight and shadows.\n- **Describe** how the sun's position affects whether it is daytime or nighttime.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or projected photograph (IMG_3140.jpeg)\n- Chart paper and markers\n- Whiteboard and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or screen. Give students 30–45 seconds of quiet observation time. Say: \"Look carefully at this picture. What do you notice?\"\n\n2. **Ask these discovery questions:**\n   - \"What do you see in the sky in this picture? Does it look bright and clear, or kind of hazy and soft?\"\n   - \"Look at the shadows on the ground. Can you see shadows made by the people? Are they long or short?\"\n   - \"Why do you think there are people on the beach? What is the sun doing in this picture?\"\n   - \"Look at the buildings far away. Can you see them clearly? Why or why not?\"\n\n3. **Wonder Prompt:** \"I wonder why the sun makes shadows at the beach, and why those shadows might look different at different times of day. Have you ever noticed your shadow change?\"\n\n4. **Record student ideas** on chart paper titled \"What We Notice About Sun and Shadows at the Beach.\"\n\n**Transition:** \"Today, we're going to become shadow scientists! We'll explore how the sun's light makes shadows, and we'll discover how the sun changes throughout the day.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Flashlights (one per pair of students, or 3–4 for classroom use)\n- Small objects (toy figures, blocks, or classroom objects)\n- White paper or poster board\n- Pencils and crayons\n- Sunny window or outdoor space (if available) OR rely on flashlight simulation\n- Recording sheet (see below)\n\n**Activity:**\n\n**Part A: Shadow Investigation with Flashlights (Classroom Simulation)**\n\n1. **Set up stations:** Pair students. Provide each pair with a flashlight, a small object (toy figure or block), and white paper.\n\n2. **Student directions (read aloud and demonstrate):**\n   - \"Place your object on the paper.\"\n   - \"Shine your flashlight close to the object from the side. What do you see?\"\n   - \"Now move the flashlight farther away. What happens to the shadow?\"\n   - \"Turn your flashlight to shine from a different angle. Draw what you see.\"\n   - \"Try shining the light from directly above the object. Is the shadow bigger, smaller, or different?\"\n\n3. **Recording:** Students sketch shadows in different positions on their paper and label them \"Short Shadow,\" \"Long Shadow,\" \"No Shadow,\" etc.\n\n**Part A Connection to Photograph:** \"Look at the beach picture again. The people there have shadows on the sand, just like your objects. The sun is the flashlight making those shadows!\"\n\n**Part B: Observation at a Window (if time/conditions allow)**\n\n1. If a sunny window is available, have students observe their own shadows or hand shadows.\n2. Students trace their hand shadow on paper and compare sizes across the room.\n\n**Teacher Role:**\n- Circulate and ask: \"What happens when you move the light?\" \"Can you make the shadow bigger?\"\n- Avoid saying *why*—let students discover the relationship between light position and shadow size.\n- Ask students to *predict* what will happen before moving the light.\n\n**Expected Student Outcomes:**\n- Students discover that shadow size and shape change based on light position.\n- Students observe that when light is far away, shadows are smaller.\n- Students record 3–4 different shadow observations.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper from Engage phase\n- Printed vocabulary cards with images\n- The photograph (displayed again)\n- Simple diagram showing sun position (morning/afternoon/evening)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3–4 student pairs to share what they discovered about shadows.\n   - Add their observations to the chart.\n   - Say: \"Great noticing! Your discoveries are just like what real scientists observe about the sun's light.\"\n\n2. **Introduce Key Vocabulary (8–10 minutes):**\n\n   - **\"Shadow\"** → A dark shape made when light is blocked by something. (Show examples from the photograph and from student flashlight activity.)\n   \n   - **\"Sunlight\"** → Light that comes from the sun. (Point to the photograph: \"The sun's light is making those shadows on the beach.\")\n   \n   - **\"Daylight\"** → The time when the sun is up and we have light from the sun. (Compare to nighttime: \"In the morning, the sun comes up and we have daylight.\")\n   \n   - **\"Sun Position\"** → Where the sun is in the sky—morning, afternoon, or evening. (Show simple diagram with sun in different positions.)\n   \n   - **\"Pattern\"** → Something that happens the same way over and over. (The sun comes up in the morning and goes down at night—that's a pattern!)\n\n3. **Make Connections (5 minutes):**\n   - Point back to the photograph: \"The people at the beach are in daylight. The sun is up. That's why we can see them and see their shadows.\"\n   - Ask: \"If this picture was taken in the morning, where was the sun? If it was taken in the afternoon, where would the sun be?\" (Guide students to see the hazy sky means the sun is high or bright.)\n\n4. **Check for Understanding:**\n   - Ask: \"Show me with your hand where your shadow is right now.\" (Students raise their hands and position them to show shadows.)\n   - Ask: \"Can we have shadows at night?\" (No, because there's no sunlight—guide to understanding the connection.)\n\n**Vocabulary:**\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Shadow** | A dark shape that appears when sunlight is blocked by something. |\n| **Sunlight** | Bright light that comes from the sun. |\n| **Daylight** | The time of day when the sun is up and light is bright. |\n| **Sun Position** | Where the sun is in the sky—it moves from morning to afternoon to evening. |\n| **Pattern** | Something that keeps happening the same way over and over again. |\n\n**Expected Student Outcomes:**\n- Students understand that shadows are created by sunlight being blocked.\n- Students can explain that the sun's position changes throughout the day.\n- Students connect their flashlight investigation to real sunlight at the beach.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Picture cards of beach/park scenes at different times of day (morning, noon, afternoon)\n- Chart paper\n- Crayons and drawing paper\n- Optional: Simple time cards (morning sun, noon sun, afternoon sun)\n\n**Activity:**\n\n**Scenario-Based Application: \"Beach Trip Predictions\"**\n\n1. **Set the scene:** \"Imagine you're going to the beach like the people in the picture. Let's think about what you might see at different times of day.\"\n\n2. **Present three scenarios with images/descriptions:**\n   - **Morning (8 AM):** \"The sun is low in the sky. It's just coming up. What do you think shadows look like?\"\n   - **Noon (12 PM):** \"The sun is high above. Shadows are very small or almost disappear under things. What would you see?\"\n   - **Afternoon (3 PM):** \"The sun is moving down toward the horizon. Shadows get longer again. What happens?\"\n\n3. **Student Task (Small Group or Pairs):**\n   - Show each scenario image.\n   - Ask: \"Where is the sun? How long do you think the shadow is? Would it be hot or getting cooler?\"\n   - Have students draw or arrange sun/shadow pictures in order.\n   - Record predictions: \"At _____, the shadow will be _____.\"\n\n4. **Real-World Connection:**\n   - \"Why does your shadow look different in the morning at the bus stop than it does at recess at noon? The sun moves!\"\n   - \"Can you predict what time of day the beach picture was taken? Look at the shadows—are they long or short?\"\n\n5. **Optional Outdoor Activity (5–10 minutes):**\n   - If outdoors, have students trace a partner's shadow and compare to morning/afternoon observations if time allows.\n\n**Teacher Role:**\n- Facilitate predictions without confirming/denying immediately.\n- Guide students to use their flashlight investigation knowledge.\n- Ask: \"How is this like what you discovered with the flashlight?\"\n\n**Expected Student Outcomes:**\n- Students correctly predict shadow length based on sun position.\n- Students articulate the relationship: \"The sun is low in the morning, so shadows are long.\"\n- Students apply their learning to real-world scenarios (school, home, playground).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (Throughout the Lesson):**\n- Observe student predictions during Elaborate phase.\n- Listen to explanations during group share-outs.\n- Review shadow drawings and recordings from Explore phase for accuracy.\n\n**Exit Ticket/Summative Assessment:**\n\n**Option A: Visual Exit Ticket (Easier)**\n- Show students three pictures of the same tree:\n  - Image 1: Long shadow on one side\n  - Image 2: Very short shadow beneath tree\n  - Image 3: Long shadow on opposite side\n- Ask: \"Which picture shows the morning? Which shows noon? Which shows afternoon? Draw the sun in each picture.\"\n\n**Option B: Verbal Reflection (Alternative)**\n- Ask individual students these questions as they leave:\n  1. \"What makes a shadow?\" (Should say: sunlight being blocked or the sun shining on something)\n  2. \"When would your shadow be longest—morning, noon, or afternoon?\" (Should say: morning or afternoon, when sun is low)\n  3. \"Why did we use flashlights today?\" (Should say: to learn how sun makes shadows)\n\n**Option C: Drawing + Sentence (More Advanced)**\n- Provide: \"Draw yourself at the beach with your shadow. Write or tell me: Where is the sun? Is it morning, noon, or afternoon?\"\n\n**Success Criteria for Student Understanding:**\n- ✓ Students can identify that shadows are made by sunlight.\n- ✓ Students can predict shadow length based on sun position.\n- ✓ Students can explain that the sun changes position throughout the day.\n- ✓ Students connect beach photograph to their own shadow observations.\n\n**Expected Student Outcomes:**\n- 80% of students correctly order morning/noon/afternoon images by shadow length.\n- 75% of students explain that sunlight creates shadows.\n- Students demonstrate understanding through drawings, explanations, or predictions.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Vocabulary:**\n   - Use only \"shadow,\" \"sunlight,\" and \"sun\" for first exposure.\n   - Pair complex terms with consistent visual aids (sun position diagrams).\n   - Repeat vocabulary 3–4 times across the lesson with the same visuals.\n\n2. **Hands-On Scaffolding:**\n   - Provide pre-drawn shadow outlines students can trace and color rather than drawing from scratch.\n   - Use a consistent visual anchor chart (sun high = short shadow, sun low = long shadow) visible throughout the lesson.\n   - Pair students for investigations so they can observe a peer's success.\n\n3. **Guided Prediction:**\n   - Provide sentence frames for predictions:\n     - \"The sun is _____, so the shadow is _____.\"\n     - \"In the morning, the shadow is _____.\"\n   - Use yes/no questions before open-ended ones.\n\n### Challenge (For Advanced Learners)\n\n1. **Extended Investigation:**\n   - Have students create their own \"sun path\" diagram showing where the sun travels during the day.\n   - Ask: \"If you knew when the picture was taken, how would you know what time it was by looking at shadows?\"\n   - Challenge them to measure shadow length at different flashlight angles and record data.\n\n2. **Deeper Application:**\n   - Connect to seasons: \"Would shadows be the same length in summer and winter? Why or why not?\"\n   - Explore: \"What other things make shadows? Can you find shadows from windows, trees, or buildings around the classroom?\"\n   - Design a shadow sundial: \"Can you use shadows to tell time?\"\n\n3. **Real-World Problem-Solving:**\n   - \"Why might someone at the beach want to know where their shadow is? What if you didn't want a long shadow?\"\n   - \"How would shadows be different on the moon versus Earth?\"\n\n---\n\n## Extension Activities\n\n1. **Shadow Theater (Puppet Show):**\n   - Use the flashlight to project hand/finger shadows on a white sheet.\n   - Students create a \"shadow story\" showing how shadows change as light moves.\n   - Connect to the lesson: \"Just like the sun moves and shadows change, our light source moves and shadows change.\"\n\n2. **Sunrise/Sunset Observation Journal:**\n   - Over one week, have students observe and draw the sun's position at the same time each day (e.g., 2:00 PM each afternoon).\n   - Record if shadows are getting longer or shorter over the week.\n   - Discuss what they notice (connects to 1-ESS1-2 about daylight changes).\n\n3. **Sun Position in Seasons:**\n   - Compare beach photographs from different seasons (if available) or gather images of the same location in summer and winter.\n   - Ask: \"Is the sun in the same place in the sky? Are shadows longer or shorter?\"\n   - Create a chart: Summer Sun vs. Winter Sun (position, shadow length, how warm it feels).\n\n---\n\n## Teacher Notes\n\n- **Timing:** This lesson works best across two short sessions. Conduct Engage and Explore on Day 1 (35–40 min); continue with Explain, Elaborate, and Evaluate on Day 2 (35–50 min).\n- **Outdoor Opportunities:** If weather permits, conduct shadow observations outside with actual sunlight for maximum authenticity. Have students trace shadows with chalk at the start and end of recess to show change.\n- **Vocabulary Reinforcement:** Post vocabulary cards with images in the classroom throughout the week. Reference them during other lessons and transitions.\n- **Assessment Note:** First-graders may struggle with abstract directional language (east, west). Use \"left,\" \"right,\" \"morning,\" and \"afternoon\" instead. Focus on the observable pattern rather than compass directions.\n- **Safety Reminder:** Never allow students to look directly at the sun. Emphasize that we observe the sun's *effects* (shadows, light), not the sun itself.",
  "inputTokens": 2821,
  "outputTokens": 3916,
  "cost": 0.022401,
  "generatedAt": "2026-02-12T21:59:23.540Z"
}