{
  "title": "Mammal",
  "category": "earth-space-science",
  "imageFile": "IMG_1334.jpeg",
  "imagePath": "images/earth-space-science/IMG_1334.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Sunlight, Shadows, and Garden Friends\n\n## Core Science Concepts from Image Analysis\n\n- **Earth's natural surfaces and habitats:** The soil, plants, flowers, and grass visible in the photograph represent natural materials that exist on Earth and provide homes for animals.\n- **Daylight and shadows:** The clear, bright conditions in the photograph show how sunlight creates shadows and illuminates the environment, demonstrating daily patterns of light.\n- **Living things and their environments:** The squirrel interacting with food in a garden ecosystem shows how animals depend on plants and natural resources for survival.\n- **Seasonal changes and plant growth:** The blooming flowers and green plants suggest a time of year with conditions favorable for growth, connecting to weather and seasonal patterns.\n\n---\n\n## Lesson Title\n\n**Squirrel's Garden: Following the Sun's Light**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how sunlight makes shadows and lights up outdoor spaces.\n2. Explain why animals like the squirrel in the photo need daylight to find food in gardens.\n3. Predict what time of day the photograph was taken based on the brightness and shadows visible.\n4. Recognize that plants grow better when they receive sunlight, supporting habitats for animals.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about sunlight, shadows, and how animals find food outdoors.\n\n**Materials:**\n- Printed copy of the squirrel photograph (8.5\" × 11\" or larger) OR display on interactive board\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or pass printed copies around the circle. Say: *\"Look carefully at this picture. I see a busy animal in a garden. What do you notice?\"*\n\n2. **Ask these guiding questions** (pause for responses after each):\n   - What animal do you see? What is it doing?\n   - Look at the flowers and plants around the squirrel. Are they in bright light or shadow? How can you tell?\n   - Why do you think this squirrel is outside during the daytime? What would happen if it was nighttime?\n   - When do *you* play outside? Is there more light in the morning, afternoon, or evening?\n\n3. **Wonder prompt:** Say: *\"I wonder what time of day this picture was taken. The sun is shining so brightly! How could we figure that out?\"* \n\n4. **Record student ideas** on chart paper. Validate all responses as \"good wondering.\"\n\n**Transition:** *\"Today, we're going to become shadow detectives! We'll use the sun outside to learn about light and shadows, just like in this squirrel's garden.\"*\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate sunlight, shadows, and how light changes throughout the day by observing their own shadows outdoors.\n\n**Materials:**\n- Access to outdoor space (playground, open grass area, or patio) with sunny conditions\n- Chalk (one piece per student or pair)\n- Paper and clipboards (optional, for note-taking)\n- Camera or phone to document shadows (teacher use)\n- Simple daily observation worksheet (see below)\n\n**Activity:**\n\n**Part A: Shadow Investigation (15 minutes)**\n\n1. **Take students outside** to a sunny area. Say: *\"Find a sunny spot where your shadow is really clear. You're going to be shadow detectives!\"*\n\n2. **Guide students through these steps:**\n   - Stand in a sunny spot and look down at your shadow. What shape is it?\n   - Trace around your shadow with chalk on the ground. Can you see the shape of your head? Your arms? Your legs?\n   - Move to a different part of the sun. Where is your shadow now? Did it move? Is it bigger or smaller?\n   - Jump! Spin! Wave your arms! Watch your shadow copy what you do.\n\n3. **Facilitate exploration** by circulating and asking:\n   - Why do you think the sun makes a shadow?\n   - Is your shadow always the same shape?\n   - What happens to your shadow when you move toward the sun? Away from the sun?\n\n4. **Document student discoveries** by taking photos of shadows and student engagement.\n\n**Part B: Connection to the Photograph (5 minutes)**\n\n1. Bring students back inside or to a shaded area.\n2. Show the squirrel photograph again. Ask: *\"Look at this garden. Do you see any shadows from the plants? What makes those shadows? How is it like the shadows we just made?\"*\n3. Have students point out shadows in the photograph.\n\n**Teacher Role:** \n- Facilitate without explaining; let students discover that sunlight creates shadows.\n- Ask open-ended questions: *\"What do you notice?\" \"What do you wonder?\" \"What happens if you...?\"*\n- Encourage movement and exploration rather than lecture.\n\n**Expected Student Outcomes:**\n- Students observe that shadows change position and size as they move relative to the sun.\n- Students connect their shadow observations to the photograph.\n- Students begin to understand that sunlight is necessary for shadows to form.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Formalize learning with vocabulary and Earth and Space Science concepts about sunlight and its effects.\n\n**Materials:**\n- Chart paper and markers\n- The squirrel photograph (printed or displayed)\n- Picture cards of the sun, shadows, and plants (simple drawings or clipart)\n- \"Light and Shadow\" vocabulary anchor chart template\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Gather students in a circle. Ask: *\"What did you discover about shadows when we were outside?\"*\n   - Record student observations on chart paper using their language.\n   - Example responses: \"Shadows move!\" \"The sun makes shadows!\" \"My shadow got bigger/smaller!\"\n\n2. **Introduce Key Vocabulary (7 minutes):**\n   - Create an anchor chart with pictures and words. Use simple, concrete language:\n\n     **Vocabulary:**\n     - **Sunlight:** The bright, warm light that comes from the sun. It travels from the sun to Earth.\n     - **Shadow:** A dark shape made when something blocks sunlight.\n     - **Daytime:** The part of the day when the sun is in the sky and it is bright outside.\n     - **Light:** Energy from the sun that we can see. It helps us see things and makes warmth.\n     - **Daylight:** The amount of time the sun is shining in the sky each day.\n\n   - **Point to the photograph** and identify each concept: *\"This is sunlight hitting the flowers and grass. See the shadows under the plants? Those are shadows! This picture was taken during daytime because it's so bright.\"*\n\n3. **Make Connections (5 minutes):**\n   - Revisit the squirrel photo. Say: *\"The squirrel is eating food in the garden during daytime. Why is it important that there is sunlight? Because sunlight helps the plants grow, and the squirrel eats the plants! And sunlight helps the squirrel SEE the food!\"*\n   - Draw a simple cause-and-effect diagram:\n     - **Sun shines → Plants grow → Squirrel has food**\n     - **Sun shines → There is light → Squirrel can see**\n\n4. **Check for Understanding:**\n   - Ask: *\"Show me with your hand: Is it daytime or nighttime right now? How do you know?\"*\n   - Ask: *\"Where do shadows come from?\"* (Expect: \"Sunlight!\" or \"The sun!\")\n   - Ask: *\"Do plants need sunlight to grow? Yes or no? Why?\"*\n\n**Expected Student Outcomes:**\n- Students use new vocabulary correctly in context.\n- Students understand that sunlight creates shadows.\n- Students recognize that plants need sunlight and that animals depend on plants.\n- Students can identify daytime vs. nighttime based on presence/absence of sunlight.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply understanding by predicting what time of day the photograph was taken and observing shadows at different times if possible.\n\n**Materials:**\n- Squirrel photograph (printed)\n- \"Time of Day\" observation cards (see activity)\n- Chart paper: \"Morning, Afternoon, or Evening?\"\n- Optional: Access to outdoor space for a second observation\n\n**Activity:**\n\n**Part A: Time-of-Day Prediction (10 minutes)**\n\n1. Show the photograph again. Say: *\"Now we're shadow detectives! We need to figure out: What time of day was this picture taken?\"*\n\n2. **Discuss these clues with students:**\n   - Look at the shadows in the garden. Are they long or short?\n   - Is the sun making the photo very bright or not so bright?\n   - If this squirrel is eating, is it morning, afternoon, or getting dark?\n\n3. **Introduce the concept:**\n   - Morning sunlight comes from one side and makes long shadows.\n   - Afternoon sunlight is brighter and shadows are shorter.\n   - Evening (late afternoon) shadows get longer again and are orange/golden.\n\n4. Create a chart on paper:\n   ```\n   MORNING    AFTERNOON    EVENING\n   Long       Short        Long\n   shadows    shadows      shadows\n   ```\n\n5. **Guide students to conclude:** *\"This photo looks like afternoon because there is very bright, strong sunlight. The shadows aren't super long. The squirrel is busy eating in the bright sun!\"*\n\n**Part B: Optional – Observe Shadows at Different Times (5–10 minutes)**\n\n- If scheduling allows, take students outside at a different time of day (e.g., if you did shadow tracing in the morning, go back after lunch or 1–2 hours later).\n- Have them re-trace their shadows with different chalk colors.\n- Compare: *\"Did your shadow move? Is it longer or shorter than before?\"*\n- Discuss: *\"The Earth is always moving, so the sun looks like it moves across the sky!\"*\n\n**Teacher Role:**\n- Guide students toward the conclusion using questions rather than telling.\n- Validate reasoning: *\"You noticed the sun is very bright — that's good evidence!\"*\n- Help students connect pattern observations to the photograph.\n\n**Expected Student Outcomes:**\n- Students predict the time of day based on light and shadow observations.\n- Students understand that shadows change as the sun moves across the sky during the day.\n- Students apply the concept of \"daylight\" to explain when the squirrel can find food.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of sunlight, shadows, and daytime observations.\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout the lesson):**\n- Observe students during outdoor shadow investigation. Do they notice shadows? Do they see shadows change?\n- Listen to student language during Explain phase. Are they using vocabulary correctly?\n- Monitor responses to guiding questions. Do answers show understanding of cause and effect (sunlight → shadows, daylight → plant growth)?\n\n**Exit Ticket / Summative Assessment (5 minutes):**\n\nAsk students to respond to these prompts (orally for First Grade, or through drawings + dictation):\n\n1. **Draw or show:** *\"Draw a picture of the squirrel from our photo. Show where the sunlight is coming from using an arrow or yellow line. Draw a shadow under the squirrel or plants.\"*\n\n2. **Tell me:** \n   - *\"What makes a shadow?\"* (Expected: \"Sunlight!\" or \"The sun blocks and makes a dark.\")\n   - *\"Why does the squirrel come out during the daytime?\"* (Expected: \"To see food,\" \"To find food,\" \"The sun helps it see,\" \"Plants grow when there's sun.\")\n\n3. **Predict:**\n   - *\"If it were nighttime, would the squirrel be able to find food? Why or why not?\"* (Expected: \"No, it's dark,\" \"No sun, no light.\")\n\n**Success Criteria:**\n\nStudents demonstrate understanding if they:\n- ✓ Correctly identify sunlight as the source of shadows\n- ✓ Observe and describe that shadows change position/size as the sun moves\n- ✓ Relate daylight (and plant growth) to animal activity in the photograph\n- ✓ Predict what time of day the photo was taken with evidence from the image\n- ✓ Use vocabulary (sunlight, shadow, daytime, daylight) appropriately\n\n**Expected Student Outcomes:**\n- Most First Graders will understand the basic cause-and-effect relationship: sunlight creates shadows and helps plants grow.\n- Students will recognize patterns of light and shadow in their environment.\n- Students will connect observation (shadows changing) to a predictable pattern (sun moving across the sky).\n\n---\n\n## Differentiation\n\n### Support (Scaffolding for Struggling Learners)\n\n1. **Simplified vocabulary:** Use simpler terms like *\"light\"* and *\"dark\"* instead of *\"daylight\"* and *\"nighttime\"* initially. Build to formal terms gradually.\n\n2. **Hands-on shadow modeling:** Provide a flashlight and small objects in a dark room. Let students move the flashlight to see how shadows change. This is more controlled than outdoor observation and helps concrete understanding.\n\n3. **Guided picture walk:** Before asking open-ended questions about the photograph, point to specific elements: *\"Here is the squirrel. Here is bright light. Here is the dark shadow. Show me the shadow.\"* Use directive language before expecting independent discovery.\n\n4. **Shorter outdoor time:** If a student becomes overwhelmed or overstimulated during the outdoor shadow investigation, invite them to trace just one shadow or observe from a shaded area. Document their learning through briefer, structured observations.\n\n### Challenge (Extensions for Advanced Learners)\n\n1. **Investigate shadow length over time:** Ask advanced students: *\"If we measure the length of shadows throughout the day, will they stay the same or change? Let's predict and test!\"* Have them use a string or ruler to measure shadows at 2–3 different times. Record on a chart.\n\n2. **Connect to moon and stars:** Advanced students can explore: *\"The squirrel sees during daytime when the sun is bright. What happens at nighttime? Can we see the moon? Stars?\"* Begin introducing 1-ESS1-1 (sun, moon, stars patterns) if appropriate.\n\n3. **Research nocturnal vs. diurnal animals:** Provide photos of other animals. Ask: *\"Do you think this animal comes out during daytime (like the squirrel) or at night? Why?\"* This deepens understanding of animal adaptation to light patterns.\n\n4. **Design a \"best time to garden\" poster:** Challenge students to create an advisory poster: *\"When should people plant flowers in a garden? Morning, afternoon, or evening? Why does that time have the most sunlight?\"* This applies learning to real-world gardening.\n\n---\n\n## Extension Activities\n\n1. **\"My Shadow Journal\" (follow-up over one week):**\n   - Provide a simple booklet with pages titled: \"Monday's Shadow,\" \"Tuesday's Shadow,\" etc.\n   - Each day, students draw or trace their shadow (or their hand's shadow on paper) at the same time of day.\n   - At the end of the week, compare: *\"Did the shadows stay the same or change? Why?\"*\n   - This reinforces the pattern that the sun appears to move, creating changing shadows.\n\n2. **Create a \"Daytime vs. Nighttime\" Sorting Activity:**\n   - Provide picture cards of animals and activities (squirrel eating, moon, child sleeping, sun, bird singing, stars, child playing).\n   - Students sort into two categories: *\"Happens during daytime\"* and *\"Happens during nighttime.\"*\n   - Discuss: *\"Why do some animals like squirrels come out during the day? Why do some animals come out at night?\"*\n\n3. **Plant a Class Sunflower Garden (if time allows):**\n   - Grow sunflower seeds in small cups on a sunny windowsill.\n   - Have students observe and document: *\"Do the sunflowers grow taller? Do they turn to face the sun?\"*\n   - Connect back: *\"Remember the squirrel photo? The plants grew big and strong because of sunlight. Our sunflowers need sunlight too!\"*\n   - This reinforces that plants need daylight to grow and that animals like squirrels depend on plants.\n\n---\n\n## Notes for Implementation\n\n- **Timing:** This lesson works best when conducted on a sunny day. If weather is cloudy, use a strong lamp for the shadow investigation indoors, or adjust the Explore phase to a simple shadow puppet activity.\n- **Safety:** During outdoor time, ensure students are supervised and know boundaries. Use chalk that easily washes off. Have students reapply sunscreen if needed.\n- **NGSS Alignment:** This lesson directly addresses 1-ESS1-1 (observing sunlight and its patterns) and can scaffold toward 1-ESS1-2 (relating daylight amounts to time of year) in spring/fall follow-ups by comparing shadow lengths across seasons.\n- **Cultural Connection:** Many cultures have traditions of observing the sun (sundials, sun festivals). Consider sharing an age-appropriate example if it fits your classroom community.\n\n---\n\nThis lesson plan transforms the squirrel photograph into a concrete, observable inquiry that helps First Graders understand Earth and Space Science through direct experience with sunlight, shadows, and the environment.",
  "inputTokens": 2821,
  "outputTokens": 4185,
  "cost": 0.023746,
  "generatedAt": "2026-02-12T21:54:42.561Z"
}