{
  "title": "Beach",
  "category": "earth-space-science",
  "imageFile": "IMG_3140.jpeg",
  "imagePath": "images/earth-space-science/IMG_3140.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Coastal Weathering and Hazy Skies\n\n## Core Science Concepts from Image Analysis\n\n- **Coastal erosion and sediment:** The beach shows sand, rocks, and seaweed scattered on the shore—evidence of water movement and weathering breaking down rocks into smaller pieces.\n- **Weather and visibility:** The hazy, misty appearance of the sky demonstrates how atmospheric conditions (fog, humidity, or haze) affect how far we can see and influence coastal weather patterns.\n- **Human-environment interaction:** The presence of people, buildings, and structures shows how communities develop in coastal areas and interact with natural processes like waves and tides.\n- **Water cycle and ocean systems:** The visible waves and water movement illustrate the dynamic nature of oceans and their connection to weather and coastal landscapes.\n\n---\n\n## Lesson Title\n\n**Foggy Beaches and Crumbly Rocks: Exploring Coastal Weather and Erosion**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 3-ESS2-1 (Represent data in tables and graphical displays to describe typical weather conditions expected during a particular season)\n  - 3-ESS2-2 (Obtain and combine information to describe climates in different regions of the world)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Describe how weather conditions at beaches differ from weather in other places using observations from the photograph.\n2. Explain how waves and water movement break down rocks and move sand on a beach (erosion).\n3. Collect and record observations about coastal weather patterns and organize information in a simple data table.\n4. Predict what might happen to a beach during different seasons or weather conditions.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about beaches, weather, and change over time.\n\n**Materials:**\n- Printed or projected photograph (large enough for whole-class viewing)\n- Chart paper and markers\n- Optional: photos of the same beach on a clear day (for contrast)\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see it. Pause for 30 seconds and let students simply look without talking.\n\n2. **Ask these specific discussion questions** (pause after each for responses):\n   - \"What do you notice about the sky in this picture? Why does it look so hazy and foggy?\"\n   - \"What do you see on the ground at the beach? What are all those brown pieces?\"\n   - \"If you went to this beach today, how would the weather feel different from our classroom right now?\"\n   - \"Do you think this beach always looks like this, or does it change?\"\n\n3. **Activate prior knowledge:**\n   - Ask: \"Has anyone been to a beach? What did you see there?\" (Accept all responses.)\n   - Record student responses on chart paper under \"What We Already Know About Beaches.\"\n\n4. **Prediction/Wonder prompt:**\n   - Display a second, clear photo of the same beach (if available) or describe: \"What if I told you this same beach looks completely different on a sunny day—you can see the tall buildings clearly! What do you think causes the difference?\"\n   - Ask students to turn to a partner and share one thing they wonder about this foggy beach. Collect 2-3 wonders aloud.\n\n**Transition:** \"Today, we're going to become beach scientists. We're going to investigate what happens to rocks and sand at the beach, and why the weather there is so different!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students discover erosion and weathering through hands-on investigation with rocks and water.\n\n**Materials (per student pair):**\n- 1 smooth river rock or larger pebble\n- 1 piece of chalk (or sandstone if available)\n- 1 small bowl or shallow container\n- Water (pitcher or bucket)\n- 1 wire brush or rough sponge\n- Paper towel\n- Observation sheet (template provided below)\n- Magnifying glass (optional but helpful)\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. \"Look at your rock and chalk. Feel them with your fingers. Are they smooth or bumpy? Are they the same or different? Write or draw what you feel on your observation sheet.\"\n\n2. \"Place your chalk in the bowl of water. Let it sit for 2 minutes. While you wait, wash your hands!\"\n\n3. \"Take the chalk out. Feel it again. What changed? Did it feel softer? Did any pieces break off? Draw or write what you notice.\"\n\n4. \"Now use the wire brush or rough sponge to rub your rock 10 times in one direction. Feel the rock before and after. What happened? Did tiny pieces come off? Look carefully—can you see dust or tiny pieces?\"\n\n5. \"Sprinkle a little water on your rock and rub it again with the brush. Does it wear away faster? Record what happens.\"\n\n6. \"Look at your observation sheet. Did your rock or chalk change? How?\"\n\n**Connection to Photograph:**\n- \"The beach in the photo has millions of rocks just like yours. Waves wash over them day after day, year after year. The water and sand act like the brush and water we just used. What do you think happens to rocks on a beach over a very long time?\"\n\n**What Students Should Record:**\n- Simple drawings or descriptions of rock/chalk before and after\n- Words describing changes: \"smoother,\" \"smaller,\" \"softer,\" \"pieces came off\"\n- Answers to: \"Did water help break down the rock faster?\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What do you notice? Did something change? What happened when you added water?\"\n- Resist explaining—let students discover. If asked, redirect: \"What do you think is happening? What do you observe?\"\n- Encourage use of magnifying glasses to see fine particles.\n- Prompt: \"Compare your rock now to how it looked at the start. What's different?\"\n\n**Expected Student Outcomes:**\n- Students observe visible changes (chalk breaks down faster; rocks feel smoother; water speeds up the process).\n- Students discover that repeated friction and water can break down hard materials.\n- Students record observations using drawings and simple labels.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect exploration to coastal weather and erosion concepts.\n\n**Materials:**\n- Chart paper and markers\n- Photograph displayed again\n- Vocabulary cards (with pictures for English learners)\n- Simple diagram showing waves breaking down rocks\n\n**Activity:**\n\n1. **Gather students on the carpet.** Ask 3-4 student pairs to share ONE discovery from the Explore phase using sentence starters:\n   - \"We noticed that the chalk/rock became...\"\n   - \"When we added water, the rock...\"\n   - \"This happened because...\"\n\n2. **Introduce key vocabulary** using the photograph and their exploration:\n\n   **Vocabulary:**\n   - **Erosion:** The wearing away of rocks and soil by water, wind, or ice over a long time. (Show the photograph: \"Waves cause erosion at this beach.\")\n   - **Weathering:** The breaking down of rocks into smaller and smaller pieces by weather, water, or rubbing. (Connect to their chalk and rock experiment: \"You created weathering with your brush!\")\n   - **Sediment:** Tiny pieces of rocks, sand, and shells that move around in water and create beaches. (Point to the brown pieces on the beach in the photo: \"That's sediment!\")\n   - **Coastal:** Near or along the ocean. (Show the buildings and beach: \"This is a coastal area.\")\n   - **Haze/fog:** A misty, cloudy weather condition where you can't see far away. (Point to the sky: \"See how cloudy it is? This is haze.\")\n\n3. **Make explicit connections:**\n   - \"Remember when your rock got smoother? That's weathering. At the beach, waves and sand do the same thing to millions of rocks.\"\n   - \"After rocks break apart into tiny pieces, waves carry those pieces away. That's erosion. Those pieces become the sandy beach!\"\n   - \"The hazy sky we see in the photo is common at beaches because of moisture from the ocean. That's a weather pattern of coastal areas.\"\n\n4. **Check for understanding:**\n   - Ask: \"Which happened in your experiment—erosion or weathering? Turn to your neighbor and explain.\"\n   - Hold up the photograph: \"Point to the sediment. Point to the haze. Point to where erosion is happening.\"\n\n**Expected Student Outcomes:**\n- Students use the four vocabulary words with reasonable accuracy.\n- Students connect their investigation to what happens at real beaches.\n- Students understand that coastal areas have unique weather patterns (haze, moisture).\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply erosion and coastal weather concepts to a new scenario and think about seasonal changes.\n\n**Materials:**\n- Drawing paper and colored pencils/markers\n- Optional: copies of blank weather charts\n- Photograph of the same beach (if a clear-day photo is available, or a different-season photo)\n\n**Activity:**\n\n**Scenario-Based Application:**\n\n1. **Present this scenario:** \"Scientists found out that the beach in our photograph gets really foggy in the summer because of ocean moisture. But in winter, it's cold and has big storms. In spring, it's mild and clear. What do you think happens to the beach during each season?\"\n\n2. **Engage students in a drawing + prediction activity:**\n   - \"Draw the beach as you think it looks in a different season (winter, spring, or fall).\"\n   - \"Think about: Will there be more fog? Will waves be bigger? Will the beach get smaller or bigger? Why?\"\n   - Students draw their predicted seasonal beach and label two things that will change.\n\n3. **Optional extension—Create a simple data chart:**\n   - Provide a chart with rows for \"Summer,\" \"Fall,\" \"Winter,\" \"Spring\" and columns for \"Weather,\" \"Wave Size,\" \"Visibility.\"\n   - As a class, hypothesize what each season might be like and fill in the chart with student ideas.\n\n4. **Class discussion:**\n   - \"If the beach gets more erosion in winter because of big storms, what might happen to the buildings nearby?\" (Introduce the idea that humans must adapt to natural processes.)\n\n**Teacher Role:**\n- Model thinking aloud: \"I'm wondering if more waves mean more erosion. What do you think?\"\n- Ask follow-up questions: \"Why did you choose that season? What evidence from what we learned supports your idea?\"\n- Encourage students to use vocabulary words (erosion, weathering, coastal, sediment, haze).\n\n**Expected Student Outcomes:**\n- Students create drawings that show understanding of seasonal change and coastal processes.\n- Students articulate a simple connection between weather patterns and beach erosion.\n- Students begin to consider human-environment interaction (buildings near eroding beaches).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of erosion, weathering, coastal weather, and data representation.\n\n**Activity:**\n\n**Formative Assessment (during lesson):**\n- Observation notes during Explore: Did students recognize changes in their rock/chalk? Did they recognize water's role?\n- Listen to student explanations during Explain phase—can they use vocabulary correctly?\n- Review drawings from Elaborate phase for understanding of seasonal change.\n\n**Exit Ticket (Summative Assessment):**\n\nDistribute a simple exit ticket with the following prompts (students can draw, write, or dictate):\n\n1. **\"Draw or write: What happened to the chalk in water? Why?\"**\n   - *Success criterion:* Student notes that chalk broke apart/softened/changed, and connects to water or friction.\n\n2. **\"Look at this picture of the beach. Circle or point to TWO things that show erosion or weathering is happening.\"**\n   - *Success criterion:* Student identifies rocks, sand, waves, or sediment and explains (simply) why these show erosion.\n\n3. **\"If you visited this beach in winter, what weather might you see that's DIFFERENT from summer?\"**\n   - *Success criterion:* Student predicts a seasonal weather change (colder, stormier, less haze, etc.).\n\n**Alternative (for non-readers/writers):**\n- Conduct a quick 1-on-1 verbal check: \"Tell me one thing that broke down in your experiment. Now tell me where that happens at the beach.\"\n\n**Expected Student Outcomes:**\n\n- **Proficient:** Students explain that water and friction cause weathering; identify sediment or rocks as signs of erosion; predict at least one seasonal weather difference.\n- **Developing:** Students note visible changes but may not connect cause and effect; identify one aspect of erosion; make a general seasonal prediction.\n- **Beginning:** Students observe changes but struggle to explain why; need prompting to connect to beaches; may not predict seasonal changes independently.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplify vocabulary using visuals:** Pair each vocabulary word with a picture card (laminated photo of erosion, rock weathering, coastal town, sediment, fog). Display these throughout the lesson and point to them when using the word.\n\n2. **Provide a sentence frame for observations:** Instead of open-ended recording, give students: \"The rock/chalk was _____ (smooth/hard). Now it is _____ (rough/soft/broken). Water/friction made it _____.\"\n\n3. **Pair with a strong reader:** During reading-based activities (like the exit ticket), allow students to work with a peer or teacher who can scribe their ideas.\n\n### Challenge (for advanced learners):\n\n1. **Investigate multiple rock types:** Give advanced students different rock types (granite, sandstone, limestone, slate) and have them predict and test which erodes fastest. Record data in a simple bar graph. (Extends 3-ESS2-1 about data representation.)\n\n2. **Research coastal communities:** Ask: \"How do people who live near beaches protect their homes from erosion?\" Students can draw or research simple solutions (seawalls, moving buildings, etc.). This begins building toward 3-ESS3-1 (design solutions to weather hazards).\n\n3. **Create a model beach erosion:** Students build a simple sand and pebble beach in a tray, add water waves (by tilting and rocking), and observe and sketch changes over 5-10 minutes. They can photograph before/after to create a data display.\n\n---\n\n## Extension Activities\n\n1. **Seasonal Weather Chart:** Students research or observe real weather data for a coastal city (temperature, rainfall, fog days) for different seasons. Create a class bar graph or table showing seasonal weather patterns. (Aligns with 3-ESS2-1 and 3-ESS2-2—comparing climates/seasons.)\n\n2. **Beach Sediment Exploration:** If possible, collect real beach sand/pebbles in a clear jar. Layer with water and observe settling. Discuss what the different layers represent (different-sized sediment). Compare to sediment from a river or stream if available. (Introduces comparative climates and habitats.)\n\n3. **Interview a Coastal Resident:** Invite a guest speaker (parent, community member, or virtually connect) who lives or works near a coast. Ask: \"What weather surprises you at the beach? Have you ever seen erosion? How do you protect your property?\" Students can prepare questions and write a thank-you note using new vocabulary.\n\n---\n\n## Alignment Notes\n\nThis lesson directly addresses the photograph's visible elements:\n- **The hazy sky** connects to coastal weather patterns and atmospheric conditions (3-ESS2-2).\n- **The rocks, sand, and seaweed on shore** illustrate sediment and erosion (3-ESS2-1 data representation).\n- **The seasonal nature of erosion** invites students to think about weather patterns across time (3-ESS2-1).\n- **The human structures and presence** subtly introduce the idea of communities adapting to natural processes, foundational thinking for 3-ESS3-1.\n\nStudents engage with real-world coastal science while building observation, vocabulary, and data literacy skills appropriate for Third Grade.",
  "inputTokens": 2852,
  "outputTokens": 3786,
  "cost": 0.021782,
  "generatedAt": "2026-02-12T22:00:51.280Z"
}