{
  "title": "Rocks",
  "category": "earth-space-science",
  "imageFile": "IMG_4086.jpeg",
  "imagePath": "images/earth-space-science/IMG_4086.jpeg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Rocks Tell Stories\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Weathering and Erosion:** The stacked rocks show how rocks break down into smaller pieces and can be moved and reshaped by natural processes over time.\n- **Rock Formation and Layering:** The visible layers of stacked stones demonstrate how rocks accumulate and stack in patterns, similar to how geological layers form in Earth's landscape.\n- **Natural Resources:** Rocks and stone are natural materials humans use for building, landscaping, and construction purposes.\n- **Earth's Surface Features:** This landscaped area shows how humans and natural processes shape Earth's surface, creating different landforms and features.\n\n---\n\n## Lesson Title\n\n**Rocks Tell Stories: Discovering How Earth Changes**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 4-ESS1-1 (Identify evidence from patterns in rock formations to support changes in landscape)\n  - 4-ESS2-1 (Make observations about effects of weathering and erosion)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** physical characteristics of rocks (size, color, shape, texture) and explain how rocks can change over time.\n2. **Identify evidence** of weathering by examining how rocks are broken down into smaller pieces through natural processes.\n3. **Explain** how stacked or layered rocks can show patterns that tell us about Earth's history and how landscapes change.\n4. **Apply understanding** by predicting how rocks at their school or home might be affected by weathering.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about rocks and their changes by examining the photograph's stone structures.\n\n**Materials:**\n- Projected image of the photograph (or printed large-format copies)\n- Whiteboard or chart paper for recording student observations\n\n**Activity:**\n\n1. **Display the photograph** to the class. Ask students to look closely without talking for 30 seconds.\n\n2. **Ask these discovery questions:**\n   - \"What do you notice about the stack of rocks in the middle of this picture? What shape is it?\"\n   - \"Why do you think someone stacked these rocks on top of each other?\"\n   - \"Do you think these rocks look the same size and shape? What differences do you see?\"\n   - \"If we left this rock stack outside for a whole year, what do you think might happen to it?\"\n\n3. **Record student predictions** on chart paper: \"What will happen to the rocks over time?\" Accept all reasonable answers without judgment.\n\n4. **Wonder prompt:** \"I wonder if rocks can change... and what makes them change?\"\n\n**Transition:** \"Today, we're going to be rock scientists and investigate how rocks actually change. Let's explore this mystery!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate weathering processes through hands-on manipulation and observation of rocks.\n\n**Materials per student pair:**\n- Assorted rocks of different sizes (collect from schoolyard, or purchase inexpensive assorted rocks)\n- 1 large rock and 1 small rock per pair\n- Hand lenses (magnifying glasses)\n- Observation sheets (template provided below)\n- Safety goggles\n- Paper towels\n- Plastic bins or trays to contain materials\n- Permanent markers for labeling\n\n**Step-by-Step Student Directions:**\n\n1. \"Put on your safety goggles. You are now official rock scientists!\"\n\n2. \"Place your large rock on a paper towel. Use the hand lens to look closely at its surface. What do you see? Draw or describe what the rock looks like up close on your observation sheet.\"\n\n3. \"Feel the rock with your fingers. Is it smooth or rough? Describe the texture.\"\n\n4. \"Now, gently rub your large rock against the smaller rock for 30 seconds. This action is similar to how wind, water, and ice rub rocks in nature.\"\n\n5. \"Use the hand lens to look at the surface of your large rock again. What changed? Look for any new scratches, worn areas, or tiny pieces that came off.\"\n\n6. \"Collect the very smallest pieces (dust or pebbles) that came off the rocks. What are these? Where did they come from?\"\n\n7. \"Draw or write what you observed on your observation sheet. Circle or highlight any changes you see.\"\n\n**How This Connects to the Photograph:**\n\"The stacked rocks in the photo are being changed by wind, rain, and temperature changes—similar to how you just changed your rocks by rubbing them together.\"\n\n**What Students Should Record:**\n- Labeled drawings of rock surfaces (before and after)\n- Descriptions of texture\n- Notes about what they noticed happening\n- Collection and observation of broken pieces\n\n**Teacher Role:**\n- Circulate and ask probing questions: \"What do you notice happening to the rock surface?\" \"Where do you think those tiny pieces came from?\" \"Do you think this happens in nature too?\"\n- Guide students to observe without leading them to conclusions\n- Help students focus observations on actual changes, not imagined ones\n- Ensure safety with eye protection\n\n**Expected Student Outcomes:**\nStudents will discover that rocks can break apart when friction is applied, producing smaller pieces (sediment). They will observe visible changes in rock surfaces and collect evidence of weathering.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect discoveries to Earth science concepts about weathering and rock formation.\n\n**Materials:**\n- Chart paper\n- Markers\n- Photographs of real weathering examples (optional: printed images of eroded rocks, layered rock formations)\n- Student observation sheets from Explore phase\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 3-4 student pairs to share one observation from their rocks.\n   - Ask: \"What changed about your rock?\"\n   - Record observable changes on a class chart.\n\n2. **Introduce Vocabulary (8 minutes):**\n   Present each term with a clear definition and visual example. Write terms on chart paper and leave it posted.\n\n   - **Weathering:** When rocks break down into smaller and smaller pieces because of wind, water, ice, or rubbing. (Show how their rubbing = weathering)\n   - **Erosion:** When broken rocks or soil are moved from one place to another by water, wind, or ice. (Explain: \"In the photo, rain could carry small rocks down the hill.\")\n   - **Sediment:** Tiny pieces of broken rock. (Hold up the pieces students collected) \"These are sediment!\"\n   - **Rock Layers:** Rocks that stack on top of each other, like in the photo. Each layer is older than the one on top.\n   - **Landscape:** The shape of Earth's surface—hills, valleys, rivers, rocky areas. (Point to the photo's landscape)\n\n3. **Connect Back to the Photograph (4 minutes):**\n   - \"Look at the rock stack again. Those rocks are being weathered by rain and wind right now.\"\n   - \"Over many years, small pieces break off. Those pieces are sediment.\"\n   - \"The pattern of how the rocks are stacked tells us something—each rock was placed at a different time, so the bottom rocks are oldest.\"\n\n4. **Check for Understanding:**\n   - \"Turn to a partner and explain weathering in your own words.\"\n   - Ask 2-3 students to share their explanation aloud.\n   - Quick yes/no questions: \"Does weathering make rocks bigger?\" (No) \"Can sediment come from weathering?\" (Yes)\n\n**Vocabulary Summary:**\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Weathering** | When rocks break into smaller pieces because of wind, water, ice, or friction |\n| **Erosion** | When broken rocks move from one place to another |\n| **Sediment** | Tiny pieces of broken rock |\n| **Rock Layers** | Rocks stacked on top of each other in a pattern |\n| **Landscape** | The shape of Earth's surface (hills, valleys, rocks, soil) |\n\n**Expected Student Outcomes:**\nStudents will understand that weathering breaks rocks down and that the rock stack in the photo shows a landscape that is changing over time. They will connect their hands-on experience to the vocabulary and real-world examples.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply weathering concepts to a new context and predict how landscapes change.\n\n**Materials:**\n- Chart paper divided into 4 sections (one for each scenario below)\n- Markers and colored pencils\n- Small rocks or pebbles (optional, for building)\n- Images of weathered landscapes (provided by teacher or from internet search: \"weathered rocks,\" \"rock formation,\" \"eroded hillside\")\n\n**Activity: Landscape Change Scenarios**\n\nDivide the class into 4 small groups. Assign each group one scenario below. Groups spend 5-7 minutes creating a visual prediction and explanation.\n\n**Scenario 1: Mountain in Heavy Rain**\n\"A mountain is covered in rock formations like in the photo. Heavy rain falls for many days. What happens to the rocks? Draw the mountain before and after. Use the vocabulary: weathering, erosion, sediment.\"\n\n**Scenario 2: Rocky Riverbank**\n\"A fast river flows past a bank of rocks. The water splashes and rubs against the rocks every day. What happens over one year? Two years? Draw what you predict.\"\n\n**Scenario 3: Rocky Path at School**\n\"Students walk on a rocky path every day at recess. What might happen to the rocks after many months? Why? Is this weathering or erosion (or both)?\"\n\n**Scenario 4: Beach Rocks**\n\"Waves crash on rocks at a beach every day. Wind blows on them. What changes might happen to the rocks? What would the sediment look like?\"\n\n**Share-Out:**\nEach group presents their scenario and drawing (2 minutes per group). Teacher highlights use of vocabulary and logical predictions.\n\n**Teacher Role:**\n- Assign groups strategically (mix strong and developing readers/writers)\n- Circulate and ask: \"What force is causing the change?\" \"What will happen to the rock pieces?\" \"Is this weathering, erosion, or both?\"\n- Push students to justify predictions: \"Why do you think that will happen?\"\n\n**Expected Student Outcomes:**\nStudents will demonstrate understanding by predicting realistic landscape changes due to weathering and erosion. They will use vocabulary correctly and explain cause-and-effect relationships in Earth processes.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of weathering, erosion, rock changes, and how landscapes evolve.\n\n**Formative Assessment (Throughout Lesson):**\n- Observation during Explore: Were students able to identify actual changes in rocks?\n- Listen to partner explanations in Explain phase for vocabulary understanding\n- Monitor Elaborate group work for accurate predictions and vocabulary use\n\n**Summative Assessment: Exit Ticket**\n\nProvide each student with an exit ticket (half-sheet or digital form). Students respond to these questions:\n\n1. **Draw and Label:** Sketch a rock undergoing weathering. Label what is breaking it down (wind, water, ice, or friction).\n\n2. **Explain in 2-3 Sentences:** \"How did the rocks in our investigation change? What caused the change?\"\n\n3. **Real-World Connection:** \"Think about rocks at your home or school. What might weather them over time?\" \n\n**Sample Exit Ticket Answer Key (Success Criteria):**\n\n✓ **Advanced Understanding:**\n- Drawing shows weathering agent clearly (rain, wind, rough surface)\n- Explanation uses vocabulary: \"weathering,\" \"sediment,\" \"smaller pieces\"\n- Real-world connection is realistic and specific (e.g., \"The rocks on our driveway get smaller because cars drive over them and rain hits them\")\n\n✓ **Proficient Understanding:**\n- Drawing shows a rock and some kind of change\n- Explanation mentions rocks breaking or getting smaller\n- Real-world example is attempted and mostly reasonable\n\n✓ **Developing Understanding:**\n- Drawing shows a rock but change may not be clear\n- Explanation is incomplete or vague\n- Real-world example is generic or needs prompting\n\n**How to Determine if Students Met Learning Objectives:**\n- **Objective 1 (Observe & describe):** Exit ticket drawing + Explore phase observations\n- **Objective 2 (Identify weathering evidence):** Exit ticket explanation + Explain phase partner discussion\n- **Objective 3 (Explain rock layers & landscape change):** Elaborate group work + real-world connection response\n- **Objective 4 (Apply understanding):** Exit ticket question 3 + Elaborate scenario work\n\n**Follow-Up Actions:**\n- Students who score \"Developing\" will participate in small-group reteach using photo analysis and vocabulary cards\n- Students who score \"Advanced\" will move to Challenge extension activities\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Observation Sheet:**\n   Provide a graphic organizer with sentence starters for the Explore phase:\n   - \"My rock looks like: _____\"\n   - \"After rubbing, I see: _____\"\n   - \"The pieces are: _____ (circle: big / small)\"\n\n2. **Vocabulary Anchor Chart:**\n   Create an illustrated chart with images paired to each vocabulary word. Keep visible throughout and refer back repeatedly. Use real photographs of weathering from the lesson's photo.\n\n3. **Paired Grouping:**\n   Partner emerging learners with stronger communicators during Elaborate group work. Assign this student the role of \"recorder\" or \"illustrator\" so they contribute without language barriers.\n\n4. **Sentence Frames for Exit Ticket:**\n   Provide frames such as:\n   - \"The rocks changed because _____.\"\n   - \"At my home, rocks get weathered by _____.\"\n\n### Challenge (For Advanced Learners)\n\n1. **Multi-Factor Weathering Investigation:**\n   Provide rocks to different conditions simultaneously: one in water, one in air, one with salt water (to simulate coastal weathering). Predict and monitor which weathers fastest and why.\n\n2. **Landscape Timeline:**\n   Given a series of photographs of the same rock formation over decades, ask students to sequence them from newest to oldest and explain the evidence. Extend to estimating: \"How many years might this take?\"\n\n3. **Scale and Percentage:**\n   Have students estimate what percentage of their rock's mass was lost during the investigation. Introduce: \"If a mountain is this big, and weathering removes this much per year, how long until it's gone?\" (Age-appropriate calculation with support)\n\n4. **Research Extension:**\n   Assign students to research and present on a real landscape shaped by weathering (Grand Canyon, sea stacks, natural arches). Students explain what forces caused the formation using ESS2-1 evidence framework.\n\n---\n\n## Extension Activities\n\n### Extension 1: Schoolyard Weathering Hunt (30-40 minutes)\n**Context:** Students apply learning to observe real weathering in their environment.\n\n**Procedure:**\n- Take students on a guided walk around the schoolyard (parking lot, garden, pathway, playground edges)\n- Provide clipboards with \"Weathering Detective\" observation sheets\n- Students find 2-3 examples of weathered rocks or stones and sketch/describe them\n- Ask: \"What do you think caused the weathering here?\" and \"How long might it have taken?\"\n- Return to class and share findings on a class map of the schoolyard\n\n**Learning Connection:** Connects to 4-ESS2-1 (observe effects of weathering and erosion in real environment)\n\n---\n\n### Extension 2: Make a Rock Cycle Flipbook (20-30 minutes, homework or early finisher)\n**Context:** Deepen understanding of how rocks change over long time periods.\n\n**Materials:**\n- Small notepads or 4-5 index cards stapled together\n- Colored pencils or markers\n\n**Procedure:**\n- Students draw a simple 4-5 frame \"movie\" showing:\n  1. A rock on Earth's surface\n  2. Weathering breaks it into pieces\n  3. Water carries sediment downstream\n  4. Sediment settles in layers (optional: settles in ocean)\n  5. Rocks reform underground (optional, simple version)\n\n- Students flip through their \"book\" to show the changes\n- Include labels and a one-sentence explanation for each frame\n\n**Learning Connection:** Introduces the rock cycle concept; extends thinking about long-term landscape changes\n\n---\n\n### Extension 3: Weather the Same Rock Over Time (Multi-day observation)\n**Context:** Students conduct a longer investigation to observe cumulative effects.\n\n**Materials:**\n- One rock per student\n- Plastic cups or containers\n- Water, salt, and vinegar (optional acid test)\n- Measurement tools (ruler, scale if available)\n- Observation journal\n\n**Procedure:**\n- Students select a rock on Day 1 and measure it (length, width, weight if possible)\n- Place rock in a container with water (or salt water, or dilute vinegar for advanced students)\n- Shake vigorously for 30 seconds daily for one week\n- Record observations every 2-3 days using photos or drawings\n- Measure again at the end of the week to detect change\n- Create a graph showing \"change over time\"\n\n**Learning Connection:** Demonstrates that weathering is a process that takes repeated actions; supports data collection and interpretation skills (4-ESS2-1)\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety:** Ensure students wear safety goggles during the Explore phase rock-rubbing activity. Collect any small rock pieces at the end to prevent tripping hazards.\n- **Rock Collection:** If collecting rocks from your schoolyard, avoid areas with valuable landscaping. Check student allergies before outdoor extension activities.\n- **Photo Engagement:** The rock stack in the photograph is visually compelling—use it frequently throughout the lesson to anchor explanations.\n- **Time Flexibility:** If your schedule is tight, combine Explain and Elaborate into one 25-30 minute session with group share-out immediately followed by scenario work.\n- **Vocabulary Reinforcement:** Display the vocabulary chart during all five phases. Use words consistently in your questions and explanations.\n- **Cultural Connection:** If students live in areas with visible geological features (rocky shores, hills, canyons), connect to local landscape examples they might have observed.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 2960,
  "outputTokens": 4316,
  "cost": 0.024540000000000003,
  "generatedAt": "2026-02-12T22:06:30.582Z"
}