{
  "title": "Rocks",
  "category": "earth-space-science",
  "imageFile": "IMG_4086.jpeg",
  "imagePath": "images/earth-space-science/IMG_4086.jpeg",
  "content": "# Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- A stacked stone structure (cairn/tower) approximately 3-4 feet tall, positioned in front of a residential building\n- Loose stones and rocks of varying sizes scattered around the base\n- Mulch/bark ground covering surrounding the structure\n- Living plants (hostas, ornamental grasses, shrubs) positioned near and around the stones\n- A sloped roof with overhanging vegetation above the structure\n\n### Reasonable Inferences\n\n- **From stacked stone structure**: The stones are balanced and stacked deliberately; this implies someone designed it to stand upright and withstand wind, weather, and gravity without mortar or fasteners.\n- **From loose stones at base**: Additional stones are available as materials, suggesting this is either a work-in-progress or there are spare materials for modification or repair.\n- **From proximity to building and plants**: The structure serves a decorative or landscape function; it must coexist with living elements without harming them or being unstable near a occupied structure.\n\n### Engineering Task\n\n**K-2:**\nBuild the tallest rock tower you can using rocks or blocks. Your tower must stand up by itself without glue or tape, and it must not fall over when you gently tap the table next to it. Can you make it taller than a pencil?\n\n**3-5:**\nDesign and build a freestanding stone or block tower that is at least 12 inches tall and can withstand a gentle side push (simulating wind) without toppling. Your tower must use at least 8 pieces and have a stable base. Test your design three times and record what happens each time. If it falls, redesign the base or rearrange the stones to make it stronger. Success means your tower stays standing after all three tests.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real-world structure (the cairn) that presents an implicit engineering challenge: *How do you stack irregular stones to create a tall, stable structure without adhesive?* Students can observe the existing design, identify the problem (gravity, balance, stability), and then plan their own solution. The visible structure invites questions before jumping to building.\n\n### Suggested Materials\n\n- River rocks, smooth stones, or wooden blocks (varying sizes)\n- A sturdy table or flat surface for building\n- A meter stick or ruler (for height measurement)\n- A camera or observation sheet (to record before/after and test results)\n- Small fan or hand for gentle push test (optional, for K-2 simplification use gentle table tap)\n\n### Estimated Time\n\n**K-2:** 20–30 minutes (build once, test, celebrate success)  \n**3-5:** 45–60 minutes (design, build, test three times, redesign if needed, record observations)\n\n### Why This Works for Teachers\n\nThis task directly supports **NGSS ETS1.A (Defining and Delimiting Engineering Problems)** and **ETS1.B (Developing Possible Solutions)** by having students observe a real constraint-based structure and then apply balance, stability, and material properties to their own design, making abstract physics concepts tangible through hands-on iteration.",
  "inputTokens": 2339,
  "outputTokens": 718,
  "cost": 0.005929,
  "generatedAt": "2026-02-09T13:23:43.795Z"
}