{
  "id": 42,
  "title": "Coastal Fog and Weather",
  "category": "earth-space-science",
  "imageFile": "IMG_3140.jpeg",
  "content": "## 📸 Photo Description\n\nThis atmospheric photo shows a foggy beach scene! People are walking and playing in the shallow ocean water. In the foreground you can see seaweed and other materials washed up on the wet sand, along with some seagulls. In the background, a tall building is partially hidden by thick fog or haze. The whole scene has a misty, gray appearance - you can barely see the building through the fog!\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates coastal fog formation and ocean-atmosphere interactions. Fog is actually a cloud at ground level - it's made of tiny water droplets suspended in the air. Coastal fog often forms when warm, moist air from over the ocean moves over cooler coastal land, causing the water vapor to condense into visible droplets. The seaweed on the beach shows evidence of tides and waves depositing materials on shore. This is part of coastal erosion and deposition - the ocean constantly shapes the shoreline by moving sand, shells, rocks, and organic materials.\n\n## 📚 Core Concepts\n\n1. **Fog Formation**: Fog occurs when water vapor condenses into tiny droplets near the ground, reducing visibility.\n\n2. **Condensation**: When water vapor (gas) cools and changes into liquid water droplets.\n\n3. **Coastal Processes**: Ocean waves and tides shape beaches through erosion (wearing away) and deposition (dropping materials).\n\n<pedagogical-tip>\nCreate a \"Fog in a Jar\" demonstration! Pour very hot water into a glass jar (fill about 1/3). Place a metal tray with ice cubes on top of the jar. Watch as fog forms inside when warm, moist air rises and hits the cold surface. Discuss: How is this like fog forming at the beach? Students draw the water cycle connection. Extension: Compare fog, clouds, and steam - all are water droplets! This hands-on model makes abstract concepts visible and understandable.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Video Resources**: Show time-lapse videos of fog rolling in over coastlines\n- **Water States**: Compare fog (liquid droplets), clouds (liquid droplets), and water vapor (invisible gas)\n- **Beach Materials**: Examine collections of items found on beaches (shells, seaweed, sand)\n- **Temperature Effects**: Use thermometers to show how temperature affects water vapor\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-ESS2.D]]: Weather and Climate\n- [[NGSS:DCI:K-ESS2.D]]: Weather and Climate\n- [[NGSS:DCI:2-ESS2.C]]: The Roles of Water in Earth's Surface Processes\n- [[NGSS:CCC:Cause]]: How temperature changes cause condensation and fog\n\n## 💬 Discussion Questions\n\n1. What weather condition is making it hard to see the building in the background? (DOK 1: Recall)\n2. How is fog similar to a cloud? (DOK 2: Skill/Concept)\n3. What do you think brought the seaweed onto the beach? (DOK 2: Skill/Concept)\n4. Why do you think fog is more common at beaches than in many other places? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility\n- **Condensation**: When water vapor cools and changes to liquid water\n- **Tide**: The regular rise and fall of ocean water levels caused by the Moon's gravity\n- **Deposition**: When material carried by water, wind, or ice is dropped in a new location\n- **Water vapor**: Water in gas form (invisible)\n\n## 🌊 Extension Activities\n\n- Research different types of fog (radiation fog, advection fog, sea fog)\n- Investigate how the water cycle creates fog, rain, and other weather\n- Study how ocean currents and air temperature affect coastal weather\n- Compare coastal climates to inland climates in your region",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis photo shows a foggy beach scene. You can see the ocean in the background, with waves crashing onto the wet sand. The air is filled with a thick, misty fog that makes it hard to see very far. Some seagulls are flying around, and there are some piles of seaweed and other materials on the beach.\n\n## 🔬 Scientific Phenomena\n\nThe foggy conditions in this image are caused by the interaction between the warm, moist air from the ocean and the cooler air over the land. As the warm air moves over the cooler land, the water vapor in the air condenses into tiny water droplets, forming the fog that you see. This fog reduces visibility, but it's an important part of the water cycle and how weather patterns form near the coast.\n\n## 📚 Core Science Concepts\n\n1. **Water Cycle**: Water can exist in three states - solid, liquid, and gas. As the sun heats up water in the ocean, the water turns into an invisible gas called water vapor. This water vapor can then condense into tiny liquid water droplets, forming clouds and fog.\n\n2. **Condensation**: When water vapor cools and changes into liquid water droplets, this is called condensation. Fog is a type of condensation that happens close to the ground.\n\n3. **Coastal Processes**: The ocean is constantly shaping the coastline through the movement of waves and tides. This process, called erosion and deposition, can bring seaweed and other materials onto the beach.\n\n<pedagogical-tip>\nTo help students understand fog formation, try a \"Fog in a Jar\" demonstration. Fill a jar with hot water, then place a cold metal tray on top. As the warm, moist air inside the jar cools, you'll see the water vapor condense into a foggy cloud. This hands-on activity allows students to observe condensation happening in real-time and connect it to the foggy conditions in the photo.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Use images and videos to show different types of fog and cloud formations.\n- **Sensory Exploration**: Have students feel the difference between warm and cool water, and observe how it affects the formation of water vapor.\n- **Kinesthetic Learning**: Encourage students to act out the water cycle, with some students representing water evaporating, condensing, and precipitating.\n- **Vocabulary Support**: Provide visual aids and multiple explanations for key terms like \"condensation\" and \"water vapor\".\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-ESS2-1]]: Use and share observations of local weather conditions to describe patterns over time.\n- [[NGSS:DCI:K-ESS3-2]]: Ask questions to obtain information about the purpose of weather forecasting to prepare for, and respond to, severe weather.\n- [[NGSS:CCC:Cause]]: Understand that events have causes that generate observable patterns.\n\n## 💬 Discussion Questions\n\n1. What do you notice about the weather conditions in this photo? (DOK 1: Recall)\n2. How is the fog in this photo similar to the clouds you see in the sky? (DOK 2: Skill/Concept)\n3. Why do you think there is so much seaweed and other material on the beach? (DOK 2: Skill/Concept)\n4. Why do you think fog is more common near the ocean than in other places? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility.\n- **Water vapor**: Water in its invisible gas form.\n- **Condensation**: When water vapor cools and changes into liquid water droplets.\n- **Erosion**: The process of wearing away or breaking down materials, like the shoreline.\n- **Deposition**: When materials are dropped or left behind in a new location, like seaweed on the beach.\n- **Tide**: The regular rise and fall of ocean water levels caused by the Moon's gravity.\n\n## 🌊 Extension Activities\n\n- Investigate how different types of fog (radiation fog, advection fog, sea fog) form in different weather conditions.\n- Explore how the water cycle drives the formation of clouds, fog, and precipitation.\n- Observe how tides and waves shape the coastline over time through erosion and deposition.\n- Compare and contrast the weather and climate patterns of coastal regions with inland areas.",
    "grade1": "## 📸 Photo Description\n\nThis photo shows a foggy beach scene. We can see the ocean in the background, with waves gently lapping at the sandy shore. In the foreground, there are some seagulls walking on the wet sand. The air is filled with a thick, gray fog that makes it hard to see the details in the distance.\n\n## 🔬 Scientific Phenomena\n\nThe fog in this image is an example of a coastal fog. Coastal fog forms when warm, moist air from the ocean moves over the cooler land near the coast. As the warm air cools, the water vapor in the air condenses into tiny water droplets, creating the foggy conditions we see. The fog can make it hard to see distant objects, like the building in the background of the photo.\n\n## 📚 Core Science Concepts\n\n1. **Water Cycle**: The continuous movement of water between the Earth's surface and the atmosphere, including processes like evaporation, condensation, and precipitation.\n\n2. **States of Water**: Water can exist as a liquid (water), a gas (water vapor), or a solid (ice). Fog is made up of tiny water droplets suspended in the air.\n\n3. **Coastal Environments**: The area where the land meets the ocean is called the coastal environment. Coastal areas can experience unique weather patterns, like fog, due to the interactions between the land and the ocean.\n\n<pedagogical-tip>\nTo help first-graders understand the science behind this photo, try using hands-on demonstrations. For example, you could have students create a \"mini-cloud\" in a jar by pouring hot water into a jar, then placing a cold tray or ice cubes on top. As the warm, moist air cools, the water vapor will condense and form a foggy cloud inside the jar. This can help students visualize how fog forms in the real world.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Instruction**: Use a combination of visual aids (the photo), physical models (the \"fog in a jar\" demo), and verbal explanations to help students understand the concepts.\n- **Varied Representation**: Provide opportunities for students to explore the different states of water (liquid, gas, solid) and how they relate to fog and the water cycle.\n- **Flexible Engagement**: Encourage students to share their observations and ideas about the photo, fostering active participation and discussion.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-ESS2.D]]: Weather and Climate\n- [[NGSS:CCC:Cause]]: Cause and effect relationships in natural systems, such as how temperature changes lead to condensation and fog formation.\n\n## 💬 Discussion Questions\n\n1. What do you notice about the weather in this photo? (DOK 1: Recall)\n2. How is the fog in this photo similar to the clouds we see in the sky? (DOK 2: Skill/Concept)\n3. Why do you think the fog is making it hard to see the building in the background? (DOK 3: Strategic Thinking)\n4. What do you think might have caused the seaweed and other materials to be on the beach? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility.\n- **Condensation**: The process of water vapor turning into liquid water droplets.\n- **Water vapor**: Water in the form of an invisible gas in the air.\n- **Coastal environment**: The area where the land meets the ocean.\n\n## 🌊 Extension Activities\n\n- Observe and compare different types of weather, such as rain, snow, and fog.\n- Investigate the water cycle and how water changes between its liquid, solid, and gas forms.\n- Explore the unique characteristics of coastal environments and how they differ from inland areas.\n- Conduct experiments to see how temperature affects the condensation of water vapor.",
    "grade2": "## 📸 Photo Description\n\nThis photo shows a foggy beach scene. You can see the waves of the ocean lapping up on the sandy shore, with some seaweed and other materials washed up on the wet sand. In the background, a tall building is partially hidden by the thick, gray fog that covers the area. The whole scene has a misty, hazy appearance - it's hard to see the building clearly through the fog.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific concept shown in this photo is the formation of coastal fog. Fog is a cloud that forms close to the ground, made up of tiny water droplets suspended in the air. Coastal fog often develops when warm, moist air from over the ocean moves over the cooler land, causing the water vapor to condense into visible fog. The fog reduces visibility and gives the scene a mysterious, atmospheric look.\n\n## 📚 Core Science Concepts\n\n1. **Fog Formation**: Fog is a cloud at ground level, formed when warm, humid air cools and the water vapor condenses into tiny droplets.\n\n2. **Condensation**: The process of water vapor changing from a gas into tiny liquid water droplets.\n\n3. **Coastal Processes**: The ocean continuously shapes the shoreline through erosion (wearing away) and deposition (leaving materials behind).\n\n<pedagogical-tip>\nTo help students understand fog formation, try the \"Fog in a Jar\" demonstration. Fill a glass jar about 1/3 full with very hot water, then place a metal tray with ice cubes on top of the jar. As the warm, moist air rises and hits the cold surface, fog will form inside the jar. Discuss how this is similar to how fog forms over the ocean and coastlines. This hands-on activity makes the abstract concept of condensation more concrete and memorable.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Show videos or images of fog rolling in over the ocean to help students visualize the process.\n- **Tactile Exploration**: Provide samples of materials found on beaches (seaweed, shells, sand) for students to examine and feel.\n- **Varied Formats**: Offer written, verbal, and visual/diagrammatic explanations of the water cycle and fog formation.\n- **Technology Integration**: Use online simulations or apps to demonstrate the effects of temperature on water vapor and condensation.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS2.C]]: The Roles of Water in Earth's Surface Processes\n- [[NGSS:DCI:2-ESS2.D]]: Weather and Climate\n- [[NGSS:CCC:Cause]]: Relationships between temperature changes and condensation\n\n## 💬 Discussion Questions\n\n1. What weather condition is making it hard to see the building in the background? (DOK 1: Recall)\n2. How is the fog in this photo similar to the clouds we see in the sky? (DOK 2: Skill/Concept)\n3. What do you think brought the seaweed and other materials onto the beach? (DOK 2: Skill/Concept)\n4. Why do you think fog is more common at beaches than in many other places? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility.\n- **Condensation**: The process of water vapor changing from a gas into liquid water droplets.\n- **Tide**: The regular rise and fall of ocean water levels caused by the Moon's gravity.\n- **Erosion**: The wearing away of land or materials by water, wind, or ice.\n- **Deposition**: The process of materials being left behind or dropped in a new location by water, wind, or ice.\n- **Water vapor**: Water in its invisible gas form.\n\n## 🌊 Extension Activities\n\n- Investigate the different types of fog (radiation fog, advection fog, sea fog) and how they form.\n- Study how the water cycle (evaporation, condensation, precipitation) leads to the formation of fog, clouds, and other weather.\n- Explore how ocean currents and air temperature affect the weather and climate of coastal regions.\n- Compare the climate and weather patterns of coastal areas to inland regions in your local area.",
    "grade3": "## 📸 Photo Description\n\nThis atmospheric image shows a foggy coastal scene. In the foreground, we can see a beach with seaweed, driftwood, and other natural materials washed up on the wet sand. Some people are walking and playing in the shallow ocean water. In the background, a tall building is partially obscured by the thick, gray fog. The whole scene has a misty, hazy appearance due to the low-hanging fog.\n\n## 🔬 Scientific Phenomena\n\nThis photo demonstrates the formation of coastal fog. Fog is a cloud that forms close to the ground, made up of tiny water droplets suspended in the air. Coastal fog often forms when warm, moist air from the ocean moves over the cooler land, causing the water vapor to condense into visible fog. The seaweed and other materials on the beach show evidence of the constant shaping of the shoreline through erosion and deposition by waves and tides.\n\n## 📚 Core Science Concepts\n\n1. **Fog Formation**: Fog is a cloud at ground level, formed when water vapor condenses into tiny droplets in the air.\n2. **Condensation**: The process of water vapor (gas) changing into liquid water droplets.\n3. **Coastal Processes**: Waves and tides constantly shape beaches through erosion (wearing away) and deposition (leaving materials behind).\n\n<pedagogical-tip>\nTo help students understand fog formation, create a \"Fog in a Jar\" demonstration. Pour hot water into a glass jar, then place a tray of ice cubes on top. As the warm, moist air rises and hits the cold surface, the water vapor will condense into visible fog inside the jar. This hands-on activity allows students to observe the connection between temperature changes and condensation, making the abstract concept more concrete.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Show videos of fog rolling in over coastlines to help students visualize the phenomenon.\n- **Sensory Exploration**: Provide collections of materials found on beaches (shells, seaweed, sand) for students to touch and examine.\n- **Temperature Experiments**: Use thermometers to demonstrate how changes in temperature affect water vapor and condensation.\n- **Multimodal Learning**: Encourage students to draw diagrams or models to explain the water cycle and fog formation.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-ESS2.D]]: Weather and Climate\n- [[NGSS:DCI:K-ESS2.D]]: Weather and Climate\n- [[NGSS:DCI:2-ESS2.C]]: The Roles of Water in Earth's Surface Processes\n- [[NGSS:CCC:Cause]]: How changes in temperature cause condensation and the formation of fog\n\n## 💬 Discussion Questions\n\n1. What weather condition is making it difficult to see the building in the background? (DOK 1: Recall)\n2. How is the fog in this image similar to the clouds we see in the sky? (DOK 2: Skill/Concept)\n3. What do you think brought the seaweed and other materials onto the beach? (DOK 2: Skill/Concept)\n4. Why do you think fog is more common at beaches than in many other places? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility.\n- **Condensation**: The process of water vapor (gas) changing into liquid water droplets.\n- **Tide**: The regular rise and fall of ocean water levels caused by the Moon's gravity.\n- **Erosion**: The wearing away of land or other materials by water, wind, or ice.\n- **Deposition**: The process of material being left behind or dropped in a new location by water, wind, or ice.\n- **Water vapor**: Water in its invisible gas form.\n\n## 🌊 Extension Activities\n\n- Research different types of fog, such as radiation fog, advection fog, and sea fog.\n- Investigate how the water cycle creates fog, rain, and other weather conditions.\n- Study how ocean currents and air temperature affect the climate and weather patterns in coastal regions.\n- Compare the weather and climate in coastal areas to inland regions in your local area.",
    "grade4": "## 📸 Photo Description\n\nThis photo shows a beautiful, misty scene at a coastal beach. The air is filled with a thick, gray fog that partially obscures the buildings and horizon in the background. People can be seen walking and playing in the shallow water along the shoreline. The wet sand is covered with seaweed, shells, and other natural materials that have been washed up by the waves.\n\n## 🔬 Scientific Phenomena\n\nThe fog visible in this image is a result of the interaction between the warm, moist air from the ocean and the cooler temperatures of the land near the coast. As the warm, humid air from the ocean moves over the colder land, the water vapor in the air condenses into tiny water droplets, creating the foggy conditions. This process is known as coastal fog formation. The seaweed and other materials on the beach are evidence of the constant erosion and deposition that occurs along coastlines due to the movement of ocean waves and tides.\n\n## 📚 Core Science Concepts\n\n1. **Condensation**: The process by which water vapor in the air changes into tiny liquid water droplets, forming clouds or fog.\n\n2. **Coastal Processes**: The way the ocean shapes and changes the shoreline through the ongoing processes of erosion and deposition.\n\n3. **Water Cycle**: The continuous movement of water from the Earth's surface to the atmosphere and back again, driven by the sun's energy.\n\n<pedagogical-tip>\nEngage students in a hands-on \"Fog in a Jar\" demonstration to help them visualize the process of condensation. This will allow them to see firsthand how warm, moist air cools and forms water droplets, just like what happens in the coastal environment. Encourage students to make connections between this model and the real-world phenomena they observe in the photo.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Use diagrams, animations, or videos to illustrate the water cycle and how it relates to fog formation.\n- **Tactile Exploration**: Allow students to examine and feel different materials found on beaches, such as seaweed, shells, and sand.\n- **Differentiated Instruction**: Provide reading materials and vocabulary support at various levels to accommodate diverse learners.\n- **Technology Integration**: Encourage students to use online resources to research different types of fog and coastal weather patterns.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS2.C]]: The Roles of Water in Earth's Surface Processes\n- [[NGSS:DCI:4-ESS2.D]]: Weather and Climate\n- [[NGSS:CCC:Cause]]: Cause and effect relationships can be used to explain changes in the Earth's surface.\n\n## 💬 Discussion Questions\n\n1. What do you think is causing the fog in this image? (DOK 2: Skill/Concept)\n2. How might the fog affect the people walking and playing in the water? (DOK 3: Strategic Thinking)\n3. What other types of natural materials might you expect to find on a beach like this one? (DOK 2: Skill/Concept)\n4. How do you think the ocean shapes the coastline over time? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility.\n- **Condensation**: The process of water vapor in the air changing into liquid water droplets.\n- **Erosion**: The wearing away of the Earth's surface by water, wind, ice, or other natural forces.\n- **Deposition**: The process of material being dropped or laid down in a new location by water, wind, or ice.\n- **Water Cycle**: The continuous movement of water from the Earth's surface to the atmosphere and back again.\n- **Coastline**: The area where the land meets the sea or ocean.\n\n## 🌊 Extension Activities\n\n- Investigate the different types of fog (e.g., radiation fog, advection fog, sea fog) and how they form.\n- Explore how the water cycle drives weather patterns, including the formation of fog and clouds.\n- Conduct experiments to observe the process of condensation and how temperature affects the formation of water droplets.\n- Study the impact of coastal processes, such as erosion and deposition, on the shape and features of different shorelines.",
    "grade5": "## 📸 Photo Description\n\nThis photo shows a misty, foggy scene at a coastal beach. You can see the ocean in the background, with a hazy, gray appearance due to the thick fog. In the foreground, there are people walking along the wet sand, and you can see some seaweed and other materials that have been washed up on the shore. The fog obscures the view, making it difficult to see any distant landmarks or buildings.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific phenomenon demonstrated in this photo is the formation of coastal fog. Fog is a cloud that forms at ground level, made up of tiny water droplets suspended in the air. Coastal fog often forms when warm, moist air from the ocean moves over the cooler land, causing the water vapor to condense into visible droplets. This creates the hazy, misty appearance seen in the image.\n\n## 📚 Core Science Concepts\n\n1. **Water Cycle**: The continuous movement of water from the Earth's surface to the atmosphere and back again, including processes like evaporation, condensation, and precipitation.\n\n2. **Condensation**: The process by which water vapor in the air changes into liquid water droplets, forming clouds, fog, and dew.\n\n3. **Coastal Processes**: The ways in which the ocean and land interact, such as erosion, deposition, and the movement of materials like seaweed and sand.\n\n<pedagogical-tip>\nTo help students understand the concept of fog formation, consider conducting a simple \"Fog in a Jar\" demonstration. This hands-on activity allows students to observe the condensation process firsthand and make connections to the real-world phenomenon shown in the photo. By creating a miniature model of fog formation, students can better grasp the underlying scientific principles.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimedia Resources**: Provide video clips or animations that illustrate the water cycle and fog formation processes.\n- **Hands-on Exploration**: In addition to the \"Fog in a Jar\" activity, encourage students to explore and collect samples of materials found on beaches, such as seaweed, shells, and sand.\n- **Vocabulary Support**: Offer visual aids, such as word walls or diagrams, to help students understand and retain key scientific terms related to the content.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:DCI:5-ESS2.C]]: The Roles of Water in Earth's Surface Processes\n- [[NGSS:CCC:Cause]]: Cause and effect relationships may be used to predict phenomena in natural or designed systems.\n\n## 💬 Discussion Questions\n\n1. What evidence in the photo suggests that this scene is taking place at a coastal location? (DOK 2: Skill/Concept)\n2. How do you think the fog is affecting the visibility and experience of the people walking on the beach? (DOK 3: Strategic Thinking)\n3. Based on what you know about the water cycle, why do you think fog is more common in coastal areas compared to inland locations? (DOK 3: Strategic Thinking)\n4. What other types of materials or objects do you think might be washed up on the beach, and how could they have gotten there? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Fog**: A cloud of tiny water droplets near the ground that reduces visibility.\n- **Condensation**: The process of water vapor in the air changing into liquid water droplets.\n- **Water cycle**: The continuous movement of water from the Earth's surface to the atmosphere and back again.\n- **Erosion**: The process of wearing away or carrying away of land or soil by natural forces such as water or wind.\n- **Deposition**: The process of material being dropped or left behind in a new location, often by water, wind, or ice.\n- **Coastal**: Relating to or located on the coast, the area where land meets the ocean.\n\n## 🌡️ Extension Activities\n\n1. Research and compare different types of fog, such as radiation fog, advection fog, and sea fog, and how they form in different environments.\n2. Investigate how ocean currents, air temperature, and other factors influence coastal weather patterns and the formation of fog.\n3. Explore the impact of coastal processes, like erosion and deposition, on the shoreline and the materials found on beaches."
  }
}