{
  "title": "Lake Landform",
  "category": "earth-space-science",
  "imageFile": "lake_landform.jpg",
  "imagePath": "images/earth-space-science/lake_landform.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- A lake or large body of water with calm surface\n- Fallen tree log partially submerged in water, extending from shore\n- Sandy/gravelly beach or shoreline in foreground with visible ripple patterns\n- Autumn trees with brown and orange foliage on both near and far shores\n- Eroded or undercut banks where trees meet water (visible on right side)\n\n### Reasonable Inferences\n\n- **From fallen tree log**: Trees along shorelines are unstable and fall into water due to bank erosion, root loss, or weather events.\n- **From ripple patterns on beach**: Water movement (waves, currents) shapes the shoreline and can transport sediment, creating visible erosion patterns.\n- **From undercut banks**: The soil is being worn away by water action, meaning the shoreline is actively changing and retreating.\n\n---\n\n### Engineering Task\n\n**K–2: Build a Shore-Protector Wall**\n\nYour job is to build a small wall or fence along the edge of a sandbox \"beach\" to stop the water from washing the sand away. Use sticks, rocks, and sand to make something that keeps the shoreline from disappearing. Can you build it strong enough that when you splash water, the sand stays put?\n\n---\n\n**3–5: Design a Shoreline Stabilization System**\n\nA lake community is losing its beach to erosion caused by waves and water movement. Your task: **Design and build a shoreline protection structure using natural and recycled materials** that will:\n- Reduce erosion of a soil sample or sand bed when exposed to water movement (splash, small stream, or wave simulation)\n- Stay stable for at least three splash/water tests without failing\n- Use only materials from the provided list\n- Fit within a 30 cm length along the \"shore\"\n\n**Success Criteria:** After three trials with controlled water movement, the protected zone should have lost less than 25% of its original soil/sand volume compared to an unprotected control area. Document with photos or measurements before and after.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a *real environmental problem* (shoreline erosion visible in the fallen tree, undercut banks, and changed beach pattern). Students should begin by observing the problem in nature, asking *why* it happens, and defining what the shoreline \"needs\" to stay stable. The task works best when students first investigate the cause (water movement, soil type, lack of roots) before jumping to solutions.\n\n---\n\n### Suggested Materials\n\n1. **Sticks, twigs, and branches** (for frame or barrier structure)\n2. **Rocks and gravel** (for weight, drainage, and base layer)\n3. **Sand and soil** (for testing erosion)\n4. **Recycled plastic bottles or containers** (for floating barriers or anchors)\n5. **Burlap, old fabric, or landscape cloth** (to contain sediment while allowing water to flow)\n\n---\n\n### Estimated Time\n\n- **K–2:** 30–40 minutes (building + 2–3 water tests)\n- **3–5:** Two 40-minute sessions (Day 1: design, material prep, build; Day 2: testing, measurement, reflection)\n\n---\n\n### Why This Works for Teachers\n\nThis challenge directly addresses **NGSS ETS1.A** (*defining engineering problems based on criteria and constraints*) by asking students to identify real erosion as a problem, then prototype and test solutions that balance natural materials, stability, and cost—mirroring how engineers actually protect coastlines and waterways.",
  "inputTokens": 2331,
  "outputTokens": 819,
  "cost": 0.006425999999999999,
  "generatedAt": "2026-02-09T13:34:58.864Z"
}