{
  "title": "Ornamental Grass",
  "category": "earth-space-science",
  "imageFile": "ornamental_grass.jpg",
  "imagePath": "images/earth-space-science/ornamental_grass.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Frost & Freezing Weather\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Frost Formation:** Water vapor in the air freezes into ice crystals on plants and surfaces when temperatures drop below freezing (visible as the white coating on grass and plant stems).\n- **Seasonal Weather Patterns:** This photograph shows how weather conditions change during cold seasons, reflecting seasonal cycles and patterns that repeat yearly.\n- **Water in Different Forms:** Students can observe water existing as both liquid (on the plant) and solid (ice crystals), connecting to the water cycle and Earth's systems.\n- **Evidence of Temperature Changes:** The visible frost indicates cold weather and demonstrates how temperature affects what we observe in nature — a foundational Earth and Space Science observation skill.\n\n---\n\n## Lesson Title\n\n**Frosty Mornings: When Water Turns to Ice**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (total: approximately 80 minutes)\n- **NGSS Standards:** \n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n  - (Connection to water and seasonal change through observation of weather patterns)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** frost and ice crystals on plants and understand that cold weather creates these changes.\n2. **Explain** that frost forms when water freezes, connecting to the water cycle and seasonal weather patterns.\n3. **Make predictions** about when frost appears based on time of year and temperature.\n4. **Record observations** of frost and ice using drawings and simple labels.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n#### Objective\nSpark curiosity about frost by presenting the photograph and connecting it to students' prior experiences with cold weather.\n\n#### Materials\n- Photograph of frost-covered ornamental grass (projected or printed)\n- Chart paper or whiteboard\n- Markers\n\n#### Activity\n\n**Display & Introduction:**\nDisplay the photograph on a screen or as a large printout. Ask students to look carefully for 30 seconds in silence. Then facilitate the following discussion:\n\n**Discussion Questions (calibrated for First Grade):**\n1. \"What do you see covering the grass and plants in this picture? What does it look like to you?\" *(Accept responses: sparkles, crystals, snow, ice, diamonds, white stuff)*\n2. \"Have you ever seen something like this outside on a cold morning? What did it feel like when you touched it?\"\n3. \"Where did this white sparkly stuff come from? Do you think it fell from the sky like snow, or did it come from somewhere else?\"\n4. \"What time of year do you think this picture was taken? How do you know?\"\n\n**Wonder Prompt:**\n\"I wonder what makes plants get covered in this sparkly frost. Let's figure out what frost is and why it appears when the weather gets really cold!\"\n\n**Transition:**\n\"Tomorrow, we're going to do an experiment to make our own frost and discover exactly what's happening!\"\n\n---\n\n### 2. EXPLORE (24 minutes)\n\n#### Objective\nStudents investigate frost formation through a hands-on activity that simulates freezing conditions.\n\n#### Materials\n- Clear plastic cups or small jars (one per student or pair)\n- Water (room temperature)\n- Food coloring (optional, for visibility)\n- Ice cubes\n- Rock salt or table salt\n- Shallow containers or tray to contain water spillage\n- Thermometer (optional, for teacher reference)\n- Paper towels\n- Cups with lids or plastic wrap (to cover experiments)\n\n#### Activity\n\n**Setup (Teacher does before lesson):**\nPrepare a station with all materials organized and accessible. Demonstrate the activity once with the whole group before independent exploration.\n\n**Step-by-Step Student Directions:**\n\n1. **Fill your cup halfway** with room-temperature water. Add a drop of food coloring if desired (makes it easier to see).\n2. **Add ice cubes** to the water until the cup is nearly full.\n3. **Sprinkle salt** generously over the ice. (Teacher note: Salt lowers the freezing point, creating very cold conditions.)\n4. **Watch closely** for the next 5-10 minutes. You should see frost forming on the *outside* of the cold cup.\n5. **Touch the outside of the cup carefully** — what do you feel? Is it cold? Is there anything sticky or crusty?\n6. **Draw what you observe** on a worksheet or in a science notebook: Draw the cup and the frost crystals you see forming.\n7. **Label your drawing** with the word \"frost\" where you see the white crystals.\n\n**Connection to Photograph:**\n\"Just like the grass in the picture got covered in frost when it was super cold outside, your cup is getting covered in frost because we made it very, very cold on the outside. The frost forms the same way!\"\n\n**What Students Should Record:**\n- Drawings of the cup showing frost formation\n- Written or dictated observations: \"I saw...\" \"I felt...\" \"The frost looks like...\"\n- A simple before-and-after comparison\n\n#### Teacher Role\n\n- **Circulate** among students, asking guiding questions: \"What's happening to the outside of your cup?\" \"Is it wet or dry? Hard or soft?\"\n- **Do NOT explain** why this is happening—let students observe first.\n- **Encourage sensory observation:** \"What do you notice with your eyes? Your fingers?\"\n- **Prevent confusion:** Clarify that the frost is forming on the *outside* of the cup, not inside the water.\n- **Manage time:** Give a 2-minute warning before cleaning up.\n\n#### Expected Student Outcomes\n\nStudents should:\n- Observe white, crystalline deposits forming on the outside of their cups.\n- Feel the extreme cold of the cup exterior.\n- Create drawings showing frost crystals.\n- Make simple observations: \"It's white,\" \"It's cold,\" \"It looks sparkly like in the picture.\"\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n#### Objective\nIntroduce vocabulary and connect students' observations to scientific concepts about frost, freezing, and seasonal weather.\n\n#### Materials\n- Photograph of frost-covered grass (redisplay)\n- Student drawings from Explore phase\n- Chart paper\n- Markers\n- A real plant stem or grass blade (if available) to examine together\n\n#### Activity\n\n**Group Share-Out (5 minutes):**\nAsk 3-4 volunteers to share their drawings and observations. Ask: \"What did you discover about frost? How is your cup's frost like the frost in the picture?\"\n\n**Teacher-Led Explanation (8 minutes):**\nUse the photograph and student observations to introduce concepts:\n\n\"You just made frost! Here's what happened: When water gets *really, really cold*, it turns from liquid water into solid ice crystals. That's frost! In nature, when the air gets very cold on certain mornings, the water in the air and on plants freezes into frost crystals—just like what happened on your cups.\n\nLook at the picture again. See the sparkly, white coating on the grass? That's frost. The grass didn't freeze because it was hot—it froze because the air temperature dropped below freezing during the night. The grass stayed cold as the sun came up, so the frost stayed on it and made it look beautiful and sparkly.\n\nFrost happens more often during certain times of year—especially in fall and winter when it gets colder. That's why we see frost in the early morning when temperatures are lowest.\"\n\n**Vocabulary Introduction & Display (3 minutes):**\nWrite each term on chart paper with a simple picture or symbol:\n\n**Vocabulary:**\n\n1. **Frost** — Tiny ice crystals that form on plants and ground when the air gets very cold.\n2. **Freeze** — When water turns into ice because the temperature gets very, very cold.\n3. **Temperature** — How hot or cold something is.\n4. **Seasonal** — Something that happens at certain times of year, like winter or fall.\n5. **Ice Crystals** — Tiny pieces of frozen water that are hard and sparkly.\n\n**Connections Back to the Lesson:**\n\"The frost in the picture formed because the temperature dropped at night. When temperatures get that cold, we say it's the frost season—and that happens in certain times of the year. In your investigation, you made the temperature drop by adding salt and ice, so frost formed on your cup just like it forms on grass!\"\n\n**Check for Understanding:**\nAsk:\n- \"Who can point to the frost in the picture?\"\n- \"Can someone show me where they saw frost on their cup?\"\n- \"What makes frost form?\" *(Accept: cold/freezing temperature)*\n- \"When do we usually see frost? In hot summer or cold winter?\" *(Cold seasons)*\n\n#### Expected Student Outcomes\n\nStudents should be able to:\n- Name frost and identify it in the photograph and from their investigation.\n- Understand that frost forms when it's very cold.\n- Recognize that frost is frozen water (ice crystals).\n- Begin to connect frost to seasonal weather patterns (cold times of year).\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n#### Objective\nDeepen understanding by applying frost concepts to a real-world scenario and making predictions about seasonal observation.\n\n#### Materials\n- Printed copies of four seasonal picture cards (or draw on chart paper): one showing morning frost (fall/winter), one showing sunny summer morning, one showing wet grass (spring/rain), one showing frosty plants\n- Chart paper labeled \"When Will We See Frost?\"\n- Markers\n- Optional: Simple calendar showing months\n- Worksheet: \"Frost Observation Prediction\"\n\n#### Activity\n\n**Real-World Application: Seasonal Frost Observations (10 minutes)**\n\nDisplay four seasonal picture cards showing the same outdoor scene in different seasons:\n- **Card 1 (Winter morning):** Plants covered in frost, very cold-looking\n- **Card 2 (Summer morning):** Green plants, no frost, sunny and warm-looking\n- **Card 3 (Spring morning):** Wet grass from rain, but no frost\n- **Card 4 (Fall morning):** Plants with frost crystals visible\n\n**Guided Discussion:**\n\"Now that we understand frost, let's think about when we'd actually see it in nature. Look at these pictures of the same garden in different seasons.\"\n\nAsk:\n1. \"Which picture shows frost? How do you know?\"\n2. \"In which pictures would the morning be too warm for frost?\"\n3. \"When do you think we'd be most likely to see frost—when it's hot or cold?\"\n4. \"Have you seen frost on grass or plants near your home? When was it? Was it in summer or winter?\"\n\n**Prediction Activity (8 minutes):**\n\nGive each student or pair a \"Frost Observation Prediction\" worksheet with prompts like:\n\n*\"I think I will see frost outside when it is _____ (cold/hot).\"*\n\n*\"Frost appears most in these months: _____\"*\n\n*\"Draw a picture of a frosty morning you might see.\"*\n\nStudents complete the worksheet by drawing or dictating predictions about when frost appears in their local area.\n\n#### Teacher Role\n\n- **Facilitate discussion** without confirming/denying predictions yet; accept all reasonable responses based on prior knowledge.\n- **Connect to local weather:** \"In our area, frost usually appears when...\"\n- **Encourage real-world connections:** \"Have you noticed frost on cars, windows, or grass on cold mornings?\"\n- **Challenge thinking:** \"Why do you think frost appears more in winter than summer?\"\n\n#### Expected Student Outcomes\n\nStudents should:\n- Correctly identify frosted scenes versus non-frosted scenes.\n- Make reasonable predictions about when frost appears (cold seasons/months).\n- Create drawings connecting frost to their own observations.\n- Begin to understand seasonal patterns in weather (NGSS 1-ESS1-2 connection).\n\n---\n\n### 5. EVALUATE\n\n#### Objective\nAssess student understanding of frost formation, seasonal patterns, and ability to observe and describe weather phenomena.\n\n#### Activity\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation Checklist:** During Explore and Elaborate, note which students:\n  - ✓ Correctly identified frost on their cups and in the photograph\n  - ✓ Made accurate sensory observations (cold, crystalline, white)\n  - ✓ Used vocabulary terms (frost, freeze, ice crystals) appropriately\n  - ✓ Made reasonable predictions about seasonal frost patterns\n\n**Exit Ticket / Summative Assessment (5 minutes at end of Day 2):**\n\nGive each student a half-sheet with the following prompts (teacher reads aloud; students answer by drawing, dictating, or writing):\n\n**Exit Ticket Questions:**\n\n1. **\"Show me frost.\"** Draw or point to where you see frost in this picture of a frosty plant.\n\n2. **\"Describe frost in your own words.\"** What is frost? You can draw or tell me.\n\n3. **\"When did we see frost?\"** Circle: summer / fall or winter\n\n4. **\"What did we learn in our cup experiment?\"** Draw or tell me one thing that happened.\n\n**Success Criteria:**\n\nStudents demonstrate understanding if they:\n- ✓ Can identify frost in a visual (photograph or illustration)\n- ✓ Describe frost as something frozen, white, sparkly, or cold\n- ✓ Recognize that frost appears in cold seasons (fall/winter)\n- ✓ Recall that very cold temperatures create frost (from their experiment)\n\n#### Expected Student Outcomes\n\n**Meets Standard:**\n- Identifies frost correctly in images and the photograph\n- Uses at least 2 vocabulary terms (frost, freeze, cold, ice crystals)\n- Predicts frost appearance in cold seasons\n- Describes their observation from the cup experiment\n\n**Approaching Standard:**\n- Identifies frost with teacher prompting\n- Uses 1 vocabulary term accurately\n- Recognizes cold is involved in frost formation\n\n**Support Needed:**\n- Requires visual cues or additional hands-on review of frost formation\n- Needs reteaching of vocabulary through repeated exposure\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified Vocabulary:** Use only 2-3 key terms (frost, freeze, cold) instead of all five. Create picture cards with words to support visual learners.\n\n2. **Guided Observation:** Pair struggling students with a peer or provide a sentence frame: \"I see _____ on the cup. It is _____.\" This reduces cognitive load while maintaining engagement.\n\n3. **Repeated Hands-On Time:** Offer a second chance to observe a frost-forming cup or revisit the photograph multiple times. Some students need extended time and repetition to build concepts.\n\n4. **Concrete, Real-World Connection:** If possible, show a short video clip of frost forming on a car window or plant, or bring in a frost-covered object from outside (with permission and safety in mind).\n\n### Challenge (for advanced learners)\n\n1. **Deeper Questioning:** Ask: \"Why does salt make the cup get colder?\" or \"Where does the frost come from—is it water from the cup, or from the air?\" Encourage students to think about where water comes from (water cycle connection).\n\n2. **Extended Investigation:** Have students predict and test: \"What if we used salt on one cup and didn't use salt on another? Which will get frostier? Why?\" This introduces variables and scientific thinking.\n\n3. **Seasonal Journaling:** Challenge students to predict and draw what their local area will look like in 4 weeks, 8 weeks, and 12 weeks. Will frost appear? When? This extends NGSS 1-ESS1-2 (observing patterns over time and relating to seasons).\n\n4. **Research & Sharing:** Advanced students can investigate: \"Does frost form on windy mornings or calm mornings? On cloudy or sunny mornings?\" Encourage simple observation and sharing with the class.\n\n---\n\n## Extension Activities\n\n1. **Frost Hunt Nature Walk (15-20 minutes):** Take students on an outdoor observation walk (on a cold morning if possible, or plan for fall/winter season) to search for frost. Students bring clipboards and sketch what they observe. Ask: \"Where do you see frost? On what kinds of plants? In sunny or shady spots? Why?\" This reinforces observational skills and connects to NGSS 1-ESS1-2 (observing at different times of year).\n\n2. **Freeze & Melt Investigation (20-25 minutes):** Place frost-forming cups in a warm indoor location and have students observe and record what happens over 15 minutes. Ask: \"What happens to the frost as it gets warmer? Where does it go? Does it turn back into water?\" This builds understanding of water phase changes and connects to the water cycle.\n\n3. **Frost Photo Collection & Comparison (homework/ongoing):** Send a note home asking families to photograph frost on their cars, windows, or grass on cold mornings. Students bring in photos or draw pictures of frost they've seen. Create a classroom display: \"Frost Around Our Community.\" This extends observational skills and builds family engagement with seasonal science.\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing Consideration:** This lesson is most engaging if taught during or immediately before an actual frost season in your region. If teaching in spring/summer, use the photograph as a bridge and discuss \"when this happens\" in your area.\n  \n- **Safety:** When students touch cups with salt-ice mixtures, they are very cold but should be safe for brief contact. Remind students not to hold the cup for more than a few seconds. Use a thermometer (optional) to show how cold the exterior gets.\n\n- **Vocabulary Simplification:** First graders vary widely in vocabulary development. Prioritize \"frost,\" \"freeze,\" and \"cold.\" The other terms can be reinforced through repeated, multimodal exposure.\n\n- **Connection to NGSS 1-ESS1-2:** While this lesson focuses primarily on observable weather and water (frost), it sets up future learning about seasonal patterns. As the year progresses, students can track frost appearance and daylight changes, directly addressing the standard.\n\n- **Photograph as Central Tool:** Return to the photograph repeatedly throughout the lesson. Its specificity and detail make abstract concepts (freezing, frost formation) concrete for young learners.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 2845,
  "outputTokens": 4256,
  "cost": 0.024125,
  "generatedAt": "2026-02-13T00:44:35.325Z"
}