{
  "title": "Ornamental Grass",
  "category": "earth-space-science",
  "imageFile": "ornamental_grass.jpg",
  "imagePath": "images/earth-space-science/ornamental_grass.jpg",
  "content": "### Visible Elements in Photo\n- Ornamental grass stems with fine, feathery seed heads (likely fountain grass or similar)\n- Frost or ice crystals coating the seed heads and stems\n- Green lower stems contrasting with frost-covered upper portions\n- Multiple individual grass plants clustered together\n- Delicate, hair-like structures extending from central stem axis\n\n### Reasonable Inferences\n- **From frost-covered seed heads**: Cold temperatures have caused moisture to freeze on the plants; plants in winter conditions need structural support to withstand ice weight and wind without breaking.\n- **From clustered growth pattern**: Individual grass plants grow close together, suggesting they may provide mutual support or protection in a group—a strategy for surviving harsh weather.\n- **From delicate filament structure**: The fine, lightweight design of seed heads suggests an efficient shape for dispersal, but also indicates fragility under ice load.\n\n### Engineering Task\n\n**K-2: Build a Frost-Proof Grass Shelter**\nMake a small shelter (using straws, twigs, or yarn) that keeps a bundle of grass stems standing up and safe from breaking under heavy frost or ice. Your shelter should be taller than your hand and strong enough that when you gently shake it, the grass doesn't fall over.\n\n**3-5: Design an Ice-Load Support Structure**\nDesign and build a support framework that holds ornamental grass upright while carrying a measurable ice load (water-filled plastic bag or cup of ice) on the seed head. Your structure must:\n- Stand at least 15 cm tall\n- Support at least 200g of ice or water without the grass bending more than 30 degrees from vertical\n- Use only paper, straws, string, and tape\n- Be built in under 25 minutes\n\nTest by gradually adding ice/water and measure the angle of tilt at failure point.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real environmental challenge (frost damage to delicate plants) without showing an existing solution. Students need to first observe *why* frost-covered grasses need support, then identify the specific problem (weight of ice + delicate structure = risk of breakage) before designing. This observation-to-problem framing is the core of the \"Ask\" phase.\n\n### Suggested Materials\n- Drinking straws or thin wooden dowels\n- String or yarn\n- Masking tape or duct tape\n- Paper (construction paper, newspaper, or paper towels)\n- Plastic bags, cups, or containers (for ice/water load)\n- Actual grass clippings or raffia (optional; for testing structure)\n\n### Estimated Time\n**45–60 minutes** (one class period)\n- 10 min: Observe photo, discuss frost damage and plant needs\n- 15 min: Plan and sketch design\n- 20 min: Build and test structure\n- 10 min: Debrief and discuss what worked\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A (defining and delimiting problems)** by having students identify a specific engineering need from a natural phenomenon and apply criteria and constraints (load, height, materials) to design a testable solution.",
  "inputTokens": 2331,
  "outputTokens": 717,
  "cost": 0.005916,
  "generatedAt": "2026-02-09T13:30:15.271Z"
}