{
  "title": "Erosion",
  "category": "earth-space-science",
  "imageFile": "p23.jpg",
  "imagePath": "images/earth-space-science/p23.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Rocks, Water, and Moving Earth\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Water and erosion:** The photograph shows a stream of moving water carving through soil and rocks, demonstrating how water shapes the land over time.\n- **Rocks and soil:** The visible layering of different-sized rocks (from large gravel to smaller stones) and brown soil shows Earth's materials and how they differ in size and composition.\n- **Weathering and change:** The mixture of broken rocks, stones, and sediment visible in the streambed demonstrates that Earth's surface changes through natural processes.\n- **Water as a force:** The flowing water is visibly moving soil and smaller rocks, showing that water is a powerful agent that shapes the ground.\n\n---\n\n## Lesson Title\n\n**Where Does Water Go? Exploring Rocks, Soil, and Streams**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90–120 minutes (two 45–60 minute sessions, or one extended lesson with breaks)\n- **NGSS Standards:** \n  - No direct First Grade ESS PE standards perfectly align with erosion/weathering concepts (which are Grade 2–3 standards). However, this lesson builds foundational understanding of Earth materials and water systems that support later ESS learning and addresses **science practices** (observation, asking questions, constructing explanations) required across all grade levels in NGSS.\n  - *Teacher note:* If strict adherence to listed First Grade ESS PEs is required, this lesson serves as preparatory/enrichment work or can be repositioned as a \"science practice\" lesson under the overarching NGSS framework rather than a specific PE match.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** what happens when water moves through rocks and soil.\n2. **Identify and sort** rocks by size and compare them to soil.\n3. **Explain** (using simple words and drawings) how water can move rocks and change the land.\n4. **Predict** what will happen to rocks and soil when water flows over them.\n\n---\n\n## 5E Lesson Sequence\n\n---\n\n### 1. ENGAGE (10–15 minutes)\n\n#### Objective\nCapture student curiosity about moving water and how it affects rocks and soil by exploring the photograph together.\n\n#### Materials\n- Printed or digital photograph (p23.jpg) displayed on screen or printed large (11\" × 14\" minimum)\n- Chart paper and markers\n- Optional: video clip (30 seconds) of a small stream or water flowing (YouTube: search \"stream flowing rocks\" and use age-appropriate clips)\n\n#### Activity\n\n**Display and Introduction (2–3 minutes):**\nShow the photograph on screen or as a large printout. Say: *\"Look carefully at this picture. What do you see? This is a real stream near railroad tracks. A stream is flowing water. Let's be detectives and look for clues!\"*\n\n**Guided Discovery Questions (6–8 minutes):**\nAsk these questions one at a time. Pause for student responses and write key words on chart paper:\n\n1. **\"What do you see in this picture? Tell me the colors and shapes you notice.\"** \n   - Listen for: rocks, water, brown/tan colors, plants, dirt\n   \n2. **\"Where is the water? What is it doing?\"** \n   - Listen for: flowing, moving, going down, wet, splashing\n   \n3. **\"Do you see big rocks or little rocks? Are they all the same size?\"** \n   - Listen for: big and small, different sizes, piles of rocks\n   \n4. **\"If you put your hand in that flowing water, what do you think might happen to the dirt and tiny rocks?\"** \n   - Listen for: wash away, move, float, get pushed\n\n**Wonder Prompt (2–3 minutes):**\nSay: *\"I wonder... if that water keeps flowing over these rocks for a very, very long time, what will happen? Will the rocks stay the same, or could they change? Turn and tell a friend what you think.\"* \nCollect 2–3 student predictions and record them on chart paper.\n\n#### Transition\n*\"Great questions! Let's become water scientists. We're going to build our own little stream with water, rocks, and soil to see what happens when water moves.\"*\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n#### Objective\nStudents will investigate how moving water interacts with rocks and soil through a hands-on simulation activity.\n\n#### Materials\nPer small group (3–4 students) or pair:\n- One clear plastic bin or shallow storage container (approximately 12\" × 8\" × 4\" deep) or a large aluminum baking pan\n- A spray bottle filled with water OR a cup with a pour spout\n- A collection of mixed-size rocks (1–2 inch diameter—smooth river rocks or pea gravel)\n- Sand or potting soil (2–3 cups per group)\n- Small pebbles and gravel (1 cup per group)\n- Newspaper or plastic tablecloth (to protect floors)\n- Small cups or containers for predictions/observations\n- Optional: tweezers, magnifying glasses\n\n#### Activity\n\n**Setup (3–5 minutes):**\n1. Place newspaper/tablecloth on tables to catch spills.\n2. Distribute one clear bin per group.\n3. Give each group: sand, pebbles, and water bottle.\n4. Show students a demonstration quickly: fill your demo bin with layers of soil and rocks similar to what they see in the photo.\n\n**Student Steps (15–18 minutes):**\n\nProvide simple, written + verbal directions:\n\n1. **\"Build a hill.\"** *\"Pour sand or soil into your bin to make a small hill shape. Don't fill it all the way to the top—leave some room.\"*\n\n2. **\"Add rocks.\"** *\"Press some small rocks and pebbles into the side of your hill to look like the picture we saw.\"*\n\n3. **\"Make a prediction.\"** *\"Before we add water, draw or write: What do you think will happen when water flows over your rocks and soil? Will anything move? Will anything stay the same?\"* \n   - Students draw/dictate predictions on a small card or in a science journal.\n\n4. **\"Create the stream.\"** *\"Now, slowly pour water from your cup (or spray with the bottle) at the top of your hill. Watch carefully. What is happening?\"*\n   - Students observe for 2–3 minutes as water flows.\n   - Guide with whisper-prompts: *\"What is moving? Is the soil moving? Are the rocks moving? Where is the water going?\"*\n\n5. **\"Record your observations.\"** *\"Draw or tell me what changed. What stayed the same? Show me with your hands—did the water go fast or slow? Did the rocks move a lot or a little?\"*\n\n#### Teacher Role\n- Circulate to each group.\n- Ask open-ended questions: *\"What do you notice now?\" \"Is that rock moving?\" \"Where is the water going?\"*\n- Avoid giving answers; instead, redirect: *\"What do YOU see happening?\"*\n- Ensure all students have a turn to pour water and observe.\n- Encourage students to repeat the activity if time allows, changing the hill shape or adding more rocks.\n\n#### Expected Student Outcomes\n- Students will observe that water flows downward over soil and rocks.\n- Students will notice that smaller soil particles and pebbles move with water, while larger rocks remain more stationary.\n- Students will see that water carves small channels or pathways through the soil.\n- Students will create simple drawings or verbal descriptions of changes they observed.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n#### Objective\nFormalize observations using vocabulary and connect the hands-on activity to the original photograph and Earth science concepts.\n\n#### Materials\n- Chart paper (prepared before lesson with vocabulary words and simple illustrations)\n- Original photograph (p23.jpg) printed large or displayed on screen\n- Teacher-drawn or printed diagram showing a stream (simple cross-section)\n- Optional: picture cards of rocks, soil, water, erosion (found in resource images)\n\n#### Activity\n\n**Group Share-Out (5–6 minutes):**\n1. Ask groups to share one thing they saw: *\"What happened in your stream?\"*\n2. Record responses on chart paper. Highlight repeated observations (water moved, rocks moved, soil moved, water carved a path, etc.).\n\n**Introduce Vocabulary (6–8 minutes):**\nUse simple language and point to the photograph or diagram frequently:\n\n**Vocabulary with First Grade-Friendly Definitions:**\n\n| **Word** | **Student-Friendly Definition** |\n|---|---|\n| **Stream** | Moving water that flows downhill, like a small river. |\n| **Rocks** | Hard pieces of Earth. They come in big sizes and tiny sizes. |\n| **Soil** | Brown dirt made of very tiny pieces of rocks and old plants mixed together. |\n| **Water flow** | The way water moves and goes downhill. |\n| **Erosion** | When water or wind moves soil and rocks from one place to another, changing the land. (Use simpler phrasing: *\"When water carries away soil and rocks and moves them.\"*) |\n\n**Connect Back to Photo & Activity (3–4 minutes):**\nSay: *\"Look at our photo again. See all those rocks? See the brown water? That's the same thing that happened in your bins! The water is moving. The rocks are moving. The soil is moving. This is called erosion—water is reshaping the land, just like you saw happen in your experiment. The picture shows us what happens in nature over a long, long time.\"*\n\n**Check for Understanding:**\nAsk quick questions with hand signals or thumbs up/down:\n- *\"If water keeps flowing over rocks, will the rocks change?\"* (Thumbs up or down?)\n- *\"Can water move soil?\"* (Nod or shake head?)\n- *\"What is flowing in our picture?\"* (Point to water in photo)\n\n#### Expected Student Outcomes\n- Students use vocabulary words (stream, rocks, soil, water flow) in simple sentences or drawings.\n- Students can point to the photograph and identify rocks, soil, and flowing water.\n- Students understand that moving water can change the land by moving rocks and soil.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n#### Objective\nStudents apply their learning to a new context and deepen understanding of how water shapes Earth.\n\n#### Materials\n- Small branch, twigs, or stick pieces\n- Leaves, grass clippings, or dried plant material\n- Rocks (various sizes)\n- Water (spray bottles or cups)\n- Bins or trays (same as Explore phase)\n- Soil\n- Optional: toy animals or houses (to introduce \"Where do things go?\" scenario)\n\n#### Activity\n\n**Scenario-Based Investigation:**\n\nPresent a story-based challenge:\n\n*\"Imagine a little town with a house, a garden, and some trees. One day, it rains very hard. Water starts to flow downhill. What happens to the soil? What happens to rocks and plants? Can moving water move away things we want to keep?\"*\n\n**Student Task:**\nIn the same bins they used before (or fresh ones), students:\n1. **Build a simple landscape:** small pile of soil, a twig \"tree,\" a small rock \"house,\" some grass \"plants.\"\n2. **Predict:** *\"What will water wash away? What will stay?\"*\n3. **Test:** Spray or pour water gently, then more forcefully, to simulate rain and runoff.\n4. **Observe and record:** Draw what moved and what stayed. Discuss with a partner.\n\n**Real-World Connection:**\nAfter the activity, show pictures (or discuss):\n- *\"In real life, when there is lots of rain, water flows downhill and can wash away soil from gardens and farms. This is why farmers sometimes plant trees and bushes—they help hold the soil in place so water doesn't carry it away.\"*\n- *\"In nature, streams like the one in our picture are always flowing, always moving rocks and soil, shaping the land year after year.\"*\n\n#### Teacher Role\n- Facilitate predictions and observations.\n- Ask guiding questions: *\"Is that rock moving?\" \"What happened to your tree?\" \"Can water move big rocks, or just little ones?\"*\n- Guide discussion toward the idea that moving water is powerful and changes landscapes.\n\n#### Expected Student Outcomes\n- Students predict and test how water affects different objects and materials.\n- Students recognize that water moves different sizes of objects differently (soil moves easily, large rocks move less).\n- Students begin to understand real-world applications of erosion and water's power.\n\n---\n\n### 5. EVALUATE\n\n#### Objective\nAssess student understanding of water movement, rocks, soil, and basic erosion concepts.\n\n#### Activity\n\n**Formative Assessment (ongoing throughout lesson):**\n- Listen to student language during each phase; note vocabulary usage.\n- Observe ability to describe changes in the Explore and Elaborate activities.\n- Ask clarifying questions: *\"How did the water change the soil?\" \"What moved and what didn't?\"*\n\n**Exit Ticket / Summative Assessment (5–10 minutes):**\n\nChoose one or combine both:\n\n**Option A: Drawing + Dictation**\nGive each student a simple page with two boxes:\n- Box 1: *\"Draw what happened when water flowed over your rocks and soil.\"*\n- Box 2: *\"Tell me one thing that moved and one thing that stayed.\"*\n- Teacher scribes student responses or students write/draw independently.\n\n**Option B: Quick Verbal Interview (1–2 minutes per student)**\nAsk each child individually:\n1. *\"What did you see happen to the rocks when water flowed over them?\"*\n2. *\"Can water move soil? How do you know?\"*\n3. *\"Look at this photo again. What is the water doing to the rocks and dirt?\"*\n\n**Success Criteria:**\n✓ Student can describe at least one observable change (e.g., water moved, rocks moved, soil flowed).  \n✓ Student can identify rocks, soil, or water in a photograph.  \n✓ Student uses simple sentences connecting water movement to changes in landscape.\n\n#### Expected Student Outcomes\nStudents demonstrate understanding by:\n- Describing changes observed in the experiment in simple language.\n- Using vocabulary (water, rocks, soil, flow, stream) appropriately.\n- Making a connection between the experiment and the photograph.\n- Answering inference questions about moving water and Earth materials.\n\n---\n\n## Differentiation\n\n### Support\n**For Struggling Learners:**\n\n1. **Simplified Vocabulary:** Use only *water, rocks, soil, move* in early phases. Introduce *stream* and *erosion* in small-group Explain time with visual support.\n\n2. **Hands-On Scaffolding:** Pair students with a stronger partner during Explore and Elaborate. Assign one student to pour water while the other observes and reports (then switch). Provide a **sentence starter card** for observations: *\"I see the water... / The rocks... / The soil...\"*\n\n3. **Reduced Complexity:** Simplify the elaborate activity—instead of building a full landscape, have students focus on just soil and water movement with one repeated variable (e.g., *only* change water speed, keep rocks the same).\n\n### Challenge\n**For Advanced Learners:**\n\n1. **Multiple Trials & Variables:** Ask students to investigate: *\"Does the water move faster on a steep hill or a gentle hill? Try it and find out!\"* or *\"What happens if you add bigger rocks? Smaller rocks? Which stops the water?\"*\n\n2. **Predictions with Reasoning:** Require students to write or draw **why** they think something will happen, not just what will happen. *\"I think the big rocks won't move because...\"*\n\n3. **Real-World Application:** Have advanced students observe an outdoor stream, puddle, or drainage system on school grounds (with teacher supervision). Ask them to photograph or sketch it and compare it to the experiment, noting similarities and differences.\n\n---\n\n## Extension Activities\n\n1. **Outdoor Water Detective:** Take students on a short walk around school grounds to find evidence of water moving soil or rocks—a puddle, a drainage path, a stream, water flowing from a downspout. Have them sketch or photograph what they see and compare it to the photo and experiment.\n\n2. **Build a Better Dam:** Provide materials (blocks, sticks, clay, rocks) and ask: *\"Can you build something that stops water from moving soil? Will it work?\"* This introduces the concept of barriers and human intervention in natural processes.\n\n3. **Read-Aloud Connection:** Pair the lesson with books like *Come On, Rain!* by Karen Hesse or *Up in the Mountains* (showing water's journey) to reinforce water movement and Earth changes through narrative.\n\n---\n\n## Teacher Reflection Notes\n\n- **Alignment reminder:** While this lesson addresses important earth science practices and foundational understanding of water and Earth materials, First Grade NGSS standards (1-ESS1-1 and 1-ESS1-2) focus specifically on celestial observations and daylight patterns, not erosion/weathering. Consider this lesson as:\n  - A preparatory foundation for Grade 2–3 standards on weathering and erosion (2-ESS2-1, 2-ESS2-2)\n  - A \"science practice\" enrichment lesson highlighting observation, prediction, and explanation\n  - Part of an integrated unit on water or Earth systems\n  \n- If strict PE alignment is required, request clarification on whether foundational Earth materials/water cycle explorations are permitted in Grade 1 or if they should be deferred to Grade 2.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 2319,
  "outputTokens": 4124,
  "cost": 0.022939,
  "generatedAt": "2026-02-12T22:55:56.430Z"
}