{
  "title": "Erosion",
  "category": "earth-space-science",
  "imageFile": "p23.jpg",
  "imagePath": "images/earth-space-science/p23.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Water, Rocks, and Erosion\n\n## Core Science Concepts from Image Analysis\n\n- **Erosion and water movement:** A stream or flowing water is visibly carving through a bed of rocks and sediment, demonstrating how water shapes Earth's surface over time.\n- **Different types of rocks and sediment:** The photograph shows varied sizes of rocks, gravel, and soil particles arranged by the action of water.\n- **Weather and water's role in changing landscapes:** Water (likely from rainfall or runoff) is actively transporting and rearranging materials, showing how weather impacts Earth's landforms.\n- **Natural processes that reshape Earth:** The visible channels and particle sorting demonstrate that Earth's surface is constantly changing through natural forces.\n\n---\n\n## Lesson Title\n\n**Water Works: How Streams Shape the Land**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions or one 90-minute block\n- **NGSS Standards:** \n  - 3-ESS2-1 (representing weather/water conditions and their effects)\n  - 3-ESS3-1 (design solutions to reduce impacts of weather-related hazards, specifically flooding/erosion)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Explain how moving water changes the shape of rocks and soil on Earth's surface.\n2. Describe the difference between large rocks, small rocks, and sediment (sand and soil).\n3. Predict and observe how water moves different sized materials in a stream-like environment.\n4. Design a simple structure to slow down water and prevent erosion in a model landscape.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Color printout or digital display of the photograph (p23.jpg)\n- Chart paper and markers\n\n**Activity:**\n\n**Display the photograph** on the board or screen. Tell students: \"This is a real place where water flows. I want you to look carefully and think about what you see.\"\n\n**Ask these discussion questions** (pause for 10-15 seconds after each):\n\n1. \"What do you notice in this picture? What's moving or changing?\" *(Looking for: water, rocks, dirt, stream, flow)*\n2. \"Where do you think the water is going? Why?\" *(Developing cause-effect thinking)*\n3. \"Do you see big rocks and little rocks? What's different about them?\" *(Comparing sizes)*\n4. \"If you touched this water, what do you think it would feel like? Why?\" *(Linking observation to properties)*\n\n**Prediction prompt:** \"I'm wondering: Did the big rocks always look the way they do now? Or did something change them? Turn and talk to a partner—what do you think?\"\n\nRecord student predictions on chart paper. Don't correct them yet.\n\n**Transition:** \"Today, we're going to build our own water stream and see how water changes rocks and soil, just like in this picture.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials (per pair or small group):**\n- 1 large, shallow aluminum pan or plastic basin (9\" × 13\" minimum)\n- Water (pitcher or spray bottle)\n- 1 cup of large gravel/rocks (about ½–¾ inch diameter)\n- 1 cup of small pebbles\n- 1 cup of sand\n- Soil (if available; otherwise additional sand)\n- Aluminum foil or plastic wrap (to elevate one end of pan)\n- Newspaper or towels (for spills)\n- Observation worksheet (see below)\n- Ruler or measuring tape\n\n**Activity: Build and Test a Model Stream**\n\n**Step 1 – Set up the landscape (5 minutes):**\n- Place the pan on newspaper.\n- Use crumpled foil or folded plastic to create a slight slope at one end of the pan.\n- Spread the large gravel on the higher end of the pan.\n- Layer small pebbles and sand in the middle and lower areas, creating a mixed-material landscape.\n- Show students the photograph again: \"Our pan is like that landscape in the picture.\"\n\n**Step 2 – Make predictions (2 minutes):**\nEach student writes or draws on their observation worksheet:\n- *\"Which rocks do you think will move when water flows? Circle: big rocks / small pebbles / sand\"*\n- *\"Where do you think the water will flow?\"*\n\n**Step 3 – Conduct the investigation (8-10 minutes):**\n- Slowly pour water at the highest point of the slope.\n- Students observe and describe what happens using their senses (but no touching during flow).\n- Pour water for 30-45 seconds, then pause.\n- Repeat 2-3 times, allowing materials to settle between pours.\n- Students sketch or write observations on their worksheet after each pour.\n\n**Step 4 – Investigate further (3-5 minutes):**\n- Ask: \"What if we made the slope steeper?\" or \"What if we poured faster?\"\n- Let one group test each variation while others observe.\n- Record differences in observation worksheet.\n\n**Teacher Role:**\n- Circulate and ask open-ended questions:\n  - \"What happened to the big rocks? Why?\"\n  - \"Look at where the sand ended up. What does that tell us?\"\n  - \"Is the water moving the same speed everywhere? Why or why not?\"\n- Do NOT explain why—let students observe and wonder.\n- Manage water overflow and keep energy focused on observation.\n\n**Expected Student Outcomes:**\n- Students will observe that:\n  - Large rocks move very little or not at all.\n  - Small pebbles move more easily and travel farther.\n  - Sand and soil move the farthest and resettle in new locations.\n  - Faster water or steeper slopes cause more movement.\n  - A channel (path) is formed where water flows most.\n- Students will record observations on their worksheet with sketches and simple sentences.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Observation worksheets from Explore phase\n- Chart paper with vocabulary definitions\n- Photograph (p23.jpg) displayed again\n- Whiteboard or large paper for anchor chart\n\n**Activity: Group Share and Concept Building**\n\n**Share-out (5 minutes):**\n- Ask 3-4 groups to share what they observed: \"What did the water do to your rocks and sand?\"\n- Create a class anchor chart titled **\"What Water Did in Our Model Stream\"**\n- Record phrases like: moved sand, made a path, changed the ground, rocks stayed still, made a channel\n\n**Introduce key vocabulary (10 minutes):**\n\nUsing the anchor chart and referring back to both the photograph and their own models:\n\n| **Vocabulary Term** | **Student-Friendly Definition** |\n|---|---|\n| **Erosion** | When water, wind, or ice slowly wears away and moves rocks, soil, and sediment from one place to another. |\n| **Sediment** | Tiny pieces of rock and soil, like sand and gravel, that can be moved by water. |\n| **Stream or creek** | A flowing body of water (like in the picture) that carves a path through land. |\n| **Weathering** | When rocks break apart or wear down over a very long time (by water, wind, or ice). |\n| **Channel** | The path or groove made by flowing water. |\n\n**Connect back to the photograph:**\n- Point to the visible channel in the photograph. \"This is a channel, just like the path the water made in our model.\"\n- Point to sorted materials. \"The stream sorted the rocks—big ones stayed, small ones moved. That's erosion.\"\n- Ask: \"How do you think this stream looked different 1 year ago? 10 years ago?\"\n\n**Check for Understanding:**\n- Show students the photograph again. Ask: \n  - \"Can you point to where you think erosion happened?\"\n  - \"Why do you think the rocks are different sizes in different spots?\"\n- Have students turn and explain to a partner: \"Erosion is…\"\n\n**Expected Student Outcomes:**\n- Students can use the words **erosion**, **sediment**, **stream**, and **channel** in simple sentences.\n- Students understand that moving water changes the land over time.\n- Students can point to evidence in the photograph and their own model to support these ideas.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Model streams from Explore phase (or rebuild if water was emptied)\n- Small sticks, pebbles, clay, or blocks (to design barriers)\n- Water pitcher\n- Observation worksheet for Part 2\n- Images or brief descriptions of real-world erosion problems (e.g., \"Heavy rain washes away a farmer's soil\" or \"A stream is eroding the side of a riverbank\")\n\n**Activity: Design a Solution to Stop Erosion**\n\n**Scenario presentation (2 minutes):**\nTell students: \"Farmers and builders sometimes have a problem. Rain and water wash away their soil and rocks. That's called erosion. We can use what we learned to design something that STOPS water from moving sand and soil so fast. Your job is to be an engineer.\"\n\n**Design challenge (10-12 minutes):**\n\nEach pair/group receives materials and a design worksheet with this challenge:\n- *\"Design a barrier (wall, dam, or pile of rocks) to stop the water from moving the sand and soil. You can use sticks, small rocks, clay, or blocks. Test your design at least twice.\"*\n\n**Student steps:**\n1. Sketch their design on the worksheet.\n2. Build the barrier in their model stream.\n3. Pour water and observe.\n4. Make notes: \"Did it work? What happened?\"\n5. Improve the design if needed and test again.\n\n**Example designs students might create:**\n- A wall of pebbles across the stream path\n- A clay dam\n- A barrier of small sticks arranged like a fence\n- Piling loose sediment behind a rock to trap it\n\n**Teacher Role:**\n- Ask guiding questions without giving answers:\n  - \"What do you think would make a stronger barrier?\"\n  - \"Did your first design work? What would you change?\"\n  - \"Which materials work best for stopping water?\"\n- Praise effort and iteration (\"I like how you tried a different design\").\n- Encourage students to test multiple times.\n\n**Expected Student Outcomes:**\n- Students will design and build a functional barrier that reduces erosion.\n- Students will explain *why* their design works or what they would improve.\n- Students will recognize that different materials and designs have different effects.\n- Students will understand that people can design solutions to reduce the impacts of water-related hazards (NGSS 3-ESS3-1).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity: Formative and Summative Assessment**\n\n**Formative assessment (ongoing during the lesson):**\n- Observation checklist during Explore and Elaborate phases:\n  - ✓ Student describes what water did to different-sized materials\n  - ✓ Student uses vocabulary (erosion, sediment, stream, channel) appropriately\n  - ✓ Student can point to evidence in the photograph to support ideas\n  - ✓ Student tests and refines their barrier design\n\n**Exit Ticket (5-10 minutes) – Summative Assessment:**\n\nStudents complete one of these (adjust based on literacy level):\n\n**Option A (Drawing + Sentence):**\n- Draw: \"Show what erosion looks like. Label the moving water, rocks, and sediment.\"\n- Write: \"Erosion happens when _________.\"\n\n**Option B (Multiple Choice + Explanation):**\n1. In the photograph, the water moved the _________ the farthest.\n   - A. Big rocks    B. Sand and soil    C. The whole pan\n\n2. Why did the sand move more than the big rocks? Explain your thinking.\n\n**Option C (3-2-1):**\n- 3 things you learned about erosion\n- 2 places where erosion might happen in real life\n- 1 question you still have\n\n**Success Criteria:**\n- ✓ Student identifies erosion as water moving rocks and soil.\n- ✓ Student recognizes that different materials move at different speeds.\n- ✓ Student can describe the difference between big rocks, small pebbles, and sediment.\n- ✓ Student applies learning to design a solution that reduces erosion.\n\n**Expected Student Outcomes:**\n- Most students (80%+) will demonstrate understanding of erosion and its effects.\n- Students will show evidence of understanding through drawings, written responses, or verbal explanations.\n- Students who exceed expectations will predict how erosion changes landscapes over longer time periods or design more complex solutions.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary list:** Provide a word bank with pictures during the Explain phase. Students can point to words rather than retrieving them from memory.\n\n2. **Guided observation sheet:** Use a worksheet with sentence frames during Explore:\n   - \"The water moved the _____.\"\n   - \"The rocks were/weren't moved because _____.\"\n   - \"I see _____ where the water flows.\"\n\n3. **Paired investigation:** Pair with a stronger reader/observer. One student pours water while the other records observations. They switch roles for the second trial.\n\n4. **Pre-teaching:** Before the lesson, show photographs of a stream, a beach, and a riverbank. Ask: \"What do you notice about these places? How is water changing them?\" This activates prior knowledge.\n\n### Challenge (for advanced learners):\n\n1. **Extended time-scale thinking:** Ask: \"If water poured through your stream every day for a whole year, what would it look like? Draw a prediction and explain why.\" Then have them research real examples of long-term erosion (Grand Canyon, river valleys).\n\n2. **Variables investigation:** Challenge them to design an experiment to test:\n   - How does the *angle of the slope* affect erosion?\n   - How does the *speed of water* affect where sediment settles?\n   - How does the *type of sediment* (sand vs. clay vs. gravel) affect erosion rates?\n   Have them make a data table and draw conclusions.\n\n3. **Real-world design project:** Provide images of erosion problems (river erosion, coastal erosion, or soil loss on a farm). Ask: \"Design a barrier or solution to prevent this erosion. What materials would work? Why? What would it cost?\" This connects to engineering and resource management.\n\n---\n\n## Extension Activities\n\n1. **Erosion in your schoolyard:** After a rainy day, take students outside to look for erosion evidence. Can they find:\n   - A channel or path made by water?\n   - Places where soil was carried away?\n   - Where sediment settled (like sand by a downspout)?\n   Have students sketch and label evidence. Discuss: \"How is this like our model stream?\"\n\n2. **Build a terraced landscape:** Challenge students to design a hillside with \"steps\" (terracing) to slow erosion. They can build this with soil or sand in a model and test whether terraces reduce erosion better than a flat slope. This connects to how farmers and builders reduce erosion in real life.\n\n3. **Water cycle + erosion connection:** Create a mini-unit where students trace the path of water from rain → stream → model erosion → settling sediment. Make a diagram: Rain falls → water flows → erosion happens → sediment moves → sediment settles. This bridges to the water cycle and shows how weather and erosion are connected.\n\n4. **Compare real streams:** Use Google Earth or photos of different streams/rivers. Ask: \"Which stream has more erosion? How do you know? What's different about the big rivers versus small streams?\" This extends observation skills to real-world contexts.\n\n---\n\n## Teacher Notes\n\n- **Timing flexibility:** If you have only 45 minutes, combine Engage and Explore into one session, then do Explain, Elaborate, and Evaluate in a second session.\n- **Water management:** Conduct this lesson in a location where spills are acceptable (outside, in a sink, on a table with a tarp). Have towels ready.\n- **Material prep:** Collect rocks and sand a few days in advance. You can use sandbox sand, aquarium gravel, or stones from outside.\n- **Vocabulary reinforcement:** Post the anchor chart in the classroom for the rest of the week. Refer back to it during read-alouds or other science discussions.\n- **NGSS connections:** This lesson hits 3-ESS3-1 strongly because students design solutions to reduce erosion hazards. It touches 3-ESS2-1 by showing water's role in weather and landscape change.",
  "inputTokens": 2350,
  "outputTokens": 3982,
  "cost": 0.022260000000000002,
  "generatedAt": "2026-02-12T22:57:29.725Z"
}