{
  "id": 38,
  "title": "Erosion by Running Water",
  "category": "earth-space-science",
  "imageFile": "p23.jpg",
  "content": "## 📸 Photo Description\n\nThis photo shows muddy water flowing over and around rocks and pebbles on the ground! The water has created small channels and paths as it flows downhill. You can see different sizes of rocks - from tiny pebbles to larger stones - and some patches of grass on the edges. The brown color of the water shows it's carrying dirt and sediment. This is a great example of erosion and water movement in action!\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates water erosion and sediment transport in real-time. When rain falls on soil, it doesn't just soak in - some of it runs across the surface, especially on slopes or compacted ground. As water flows, it picks up loose soil particles, sand, and small rocks, which is why the water looks brown and muddy. The moving water carves small channels called rills, and over time, these can grow into larger gullies. Notice how the water flows around larger rocks it can't move but carries smaller particles. This is the same process that creates river valleys and canyons - just on a much smaller scale!\n\n## 📚 Core Concepts\n\n1. **Erosion**: The process of Earth materials being worn away and transported by natural forces like water, wind, or ice.\n\n2. **Sediment Transport**: When moving water carries particles of rock, soil, and sand from one place to another.\n\n3. **Runoff**: Water that flows over the ground surface rather than soaking into the soil, often carrying sediment with it.\n\n<pedagogical-tip>\nCreate a hands-on erosion demonstration! Build a small hill using soil in a large tray or outdoors. Place small rocks, pebbles, and grass on different sections. Slowly pour water from a watering can at the top and observe what happens. Students record: Which materials moved? Where did they go? Which rocks stayed put? Compare fast-flowing water (heavy pour) vs. slow-flowing water (light sprinkle). Discuss: How is this like what happens during rainstorms? This concrete model makes erosion visible and understandable!\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Outdoor Investigation**: Find evidence of erosion on the school grounds after rain\n- **Time-Lapse Video**: Show erosion demonstrations at different water speeds\n- **Size Sorting**: Have students sort rocks by size to understand what water can move\n- **Comparison Photos**: Show erosion examples from different environments (beaches, mountains, deserts)\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: How water flow causes erosion and sediment movement\n\n## 💬 Discussion Questions\n\n1. What is making the water look brown and muddy? (DOK 1: Recall)\n2. Why do you think some rocks stay in place while smaller particles get carried away? (DOK 2: Skill/Concept)\n3. How might this same process create larger features like river valleys over many years? (DOK 3: Strategic Thinking)\n4. What could people do to slow down or prevent erosion on a hillside? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Erosion**: The wearing away and transportation of Earth materials by natural forces\n- **Sediment**: Small particles of rock, soil, and sand carried by water, wind, or ice\n- **Runoff**: Water flowing over the ground surface\n- **Channel**: A path carved by flowing water\n- **Transport**: To carry something from one place to another\n\n## 🌊 Extension Activities\n\n- Investigate how plants and roots help prevent erosion\n- Research how farmers use terracing to control water flow on hillsides\n- Create before-and-after drawings showing how erosion changes landscapes\n- Study how the Grand Canyon was formed by water erosion over millions of years",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis photo shows water flowing down a hillside, carving small paths and channels in the dirt and rocks. You can see the muddy, brown color of the water, which is carrying tiny bits of soil and pebbles with it as it moves downhill. The water is flowing around larger rocks and stones, leaving them behind while sweeping away the smaller particles.\n\n## 🔬 Scientific Phenomena\n\nThis image shows the process of erosion - how moving water can gradually wear away and transport earth materials like soil, sand, and small rocks. As the water flows downhill, it picks up these loose particles and carries them with it, creating small channels and gullies in the ground. Over time, this process can form larger features like river valleys and canyons. The brown color of the water indicates it is full of sediment, the technical term for the tiny bits of earth material being moved.\n\n## 📚 Core Science Concepts\n\n1. Erosion: The wearing away and movement of earth materials by natural forces like water, wind, or ice.\n2. Sediment Transport: The process of water carrying small particles of soil, rock, and sand from one place to another.\n3. Runoff: Water that flows over the ground surface rather than soaking into the soil.\n\n<pedagogical-tip>\nTo help young students understand erosion, try setting up a simple hands-on demonstration. Use a tray or bin filled with soil, pebbles, and small plants or grass. Slowly pour water at the top and observe what happens - the water will carve channels and carry away the smaller particles, just like in the photo. Encourage students to describe what they see and make connections to the real-world example. This concrete model makes the invisible process of erosion more concrete and understandable for Kindergarteners.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Provide visual supports like diagrams or images to illustrate the erosion process\n- Incorporate opportunities for hands-on exploration and sensory experiences (e.g., feeling the soil, observing flowing water)\n- Offer multiple ways for students to demonstrate their understanding, such as drawing, modeling, or describing the phenomena\n- Encourage collaboration and discussion to help students share their observations and ideas\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-ESS2.E]] Earth's Systems: Develop an understanding of how water shapes the Earth's surface\n- [[NGSS:CCC:Cause]]: Understand that events have causes that generate observable patterns\n\n## 💬 Discussion Questions\n\n1. What is making the water look brown and dirty? (DOK 1: Recall)\n2. Why do you think some rocks stay in place while the smaller particles get carried away? (DOK 2: Skill/Concept)\n3. How might this process of erosion and water flow create larger features in the landscape over time? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- Erosion: The process of earth materials being worn away and transported by natural forces\n- Sediment: Small particles of rock, soil, and sand carried by water, wind, or ice\n- Runoff: Water that flows over the ground surface rather than soaking into the soil\n- Channel: A path or groove carved by flowing water\n- Transport: To carry something from one place to another\n\n## 🌊 Extension Activities\n\n- Go on a nature walk and look for signs of erosion around the school grounds\n- Experiment with different materials (sand, gravel, clay) to see how they are affected by water flow\n- Create a model of a river system and observe how erosion and deposition shape the landscape over time\n- Research how plants and roots help prevent erosion on hillsides and slopes",
    "grade1": "## 📸 Photo Description\n\nThis photo shows a small stream of muddy water flowing down a hillside. The water is carving out little channels and paths as it moves, carrying small rocks, dirt, and other materials with it. You can see the water flowing around bigger stones and pieces of grass that are staying in place. The water looks brown because it is picking up and carrying a lot of soil and sediment.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of erosion, where water flow wears away and moves Earth materials like soil, sand, and rocks. As the water runs downhill, it picks up and carries these loose particles, creating small channels and channels in the ground. Over time, this ongoing erosion can reshape the landscape, carving out larger features like valleys and canyons. The water flow and sediment movement you see here is an example of this process happening on a smaller scale.\n\n## 📚 Core Science Concepts\n\n1. **Erosion**: The process of Earth materials being worn away and transported by natural forces like water, wind, or ice.\n2. **Sediment Transport**: When moving water carries particles of rock, soil, and sand from one place to another.\n3. **Runoff**: Water that flows over the ground surface rather than soaking into the soil, often carrying sediment with it.\n\n<pedagogical-tip>\nTo help students understand erosion, set up a simple demonstration in the classroom or outdoors. Use a shallow tray or box filled with soil and add some small rocks, pebbles, and pieces of grass. Slowly pour water at the top and observe what happens - the water will create channels and carry away the smaller particles, leaving the larger rocks behind. Discuss how this models the real-world process of erosion. Encourage students to make observations and ask questions about what they see happening.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Exploration**: Allow students to touch and feel different Earth materials (soil, sand, rocks) to understand their properties.\n- **Hands-on Model**: Provide opportunities for students to create their own erosion demonstrations using trays, water, and various objects.\n- **Visuals and Media**: Show videos or images of erosion occurring in different environments to help students make connections.\n- **Outdoor Observation**: Take students on a nature walk to observe signs of erosion in the local environment.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: Processes that Shape the Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: Cause and effect relationships can be used to explain changes in the natural world.\n\n## 💬 Discussion Questions\n\n1. What do you notice happening to the water as it flows down the hill? (DOK 1: Recall)\n2. Why do you think the water is carrying some materials but not others? (DOK 2: Skill/Concept)\n3. How might this same process create larger features in the landscape over time? (DOK 3: Strategic Thinking)\n4. What are some ways that people could try to slow down or prevent erosion? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Erosion**: The wearing away and transportation of Earth materials by natural forces\n- **Sediment**: Small particles of rock, soil, and sand\n- **Runoff**: Water flowing over the ground surface\n- **Channel**: A path carved by flowing water\n- **Transport**: To carry something from one place to another\n- **Landscape**: The natural features of an area of land\n\n## 🌊 Extension Activities\n\n- Investigate how plants and their roots can help prevent erosion\n- Research how farmers use techniques like terracing to control water flow and erosion on hillsides\n- Create before-and-after drawings showing how erosion can change the shape of a landscape over time\n- Explore how the Grand Canyon was formed by millions of years of water erosion",
    "grade2": "## 📸 Photo Description\n\nThis photo shows water flowing over soil and rocks on the ground. The water is carrying small particles of dirt, sand, and tiny rocks, making the water look brown and muddy. You can see the water has carved out small channels and paths as it flows downhill. There are different sized rocks - some are pebbles and some are larger stones - and a few patches of grass on the edges. This is a great example of how water can move and change the land over time.\n\n## 🔬 Scientific Phenomena\n\nThis photo demonstrates the process of erosion, where water wears away and carries away bits of the Earth's surface. As the rain falls on the ground, some of the water flows across the surface instead of soaking in. This moving water picks up tiny particles of soil, sand, and rocks, making the water look muddy. The flowing water carves out small channels, which can grow into larger gullies over time. This is the same process that helps create river valleys, canyons, and other large features on Earth!\n\n## 📚 Core Science Concepts\n\n1. **Erosion**: The process of Earth materials being worn away and transported by water, wind, or ice.\n2. **Sediment Transport**: The movement of small particles like soil, sand, and rocks by flowing water.\n3. **Runoff**: Water that flows over the ground surface rather than soaking into the soil, often carrying sediment with it.\n\n<pedagogical-tip>\nCreate a hands-on erosion demonstration for your students! Build a small hill using soil in a large tray or outside. Place rocks, pebbles, and some grass on the hill. Slowly pour water from a watering can at the top and observe what happens. Have students record which materials moved, where they went, and which rocks stayed in place. Compare what happens with fast-flowing water versus slow-flowing water. This will help students visualize and understand the process of erosion.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Outdoor Exploration**: Take students outside to find evidence of erosion on the school grounds after rain.\n- **Visual Aids**: Show time-lapse videos of erosion demonstrations at different water speeds.\n- **Sorting Activity**: Have students sort rocks by size to understand what water can move.\n- **Comparison Photos**: Show examples of erosion from different environments like beaches, mountains, and deserts.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: How water flow causes erosion and sediment movement\n\n## 💬 Discussion Questions\n\n1. What is making the water look brown and muddy? (DOK 1: Recall)\n2. Why do you think some rocks stay in place while smaller particles get carried away? (DOK 2: Skill/Concept)\n3. How might this same process create larger features like river valleys over many years? (DOK 3: Strategic Thinking)\n4. What could people do to slow down or prevent erosion on a hillside? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Erosion**: The wearing away and transportation of Earth materials by natural forces\n- **Sediment**: Small particles of rock, soil, and sand carried by water, wind, or ice\n- **Runoff**: Water flowing over the ground surface\n- **Channel**: A path carved by flowing water\n- **Transport**: To carry something from one place to another\n- **Gully**: A deep channel carved in the earth by flowing water\n\n## 🌊 Extension Activities\n\n- Investigate how plants and their roots help prevent erosion\n- Research how farmers use terracing to control water flow on hillsides\n- Create before-and-after drawings showing how erosion changes landscapes\n- Study how the Grand Canyon was formed by water erosion over millions of years",
    "grade3": "## 📸 Photo Description\n\nThis photo shows water flowing over soil and rocks on a hill or slope. The water has carved small channels and paths as it moves downhill, picking up dirt and tiny pebbles along the way. The water looks brown and muddy, showing it is carrying lots of sediment. You can see different sizes of rocks, from big boulders to tiny pebbles, as well as some patches of grass or vegetation on the edges.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of water erosion. When rain falls on soil, some of the water flows across the surface instead of soaking in. As the water moves downhill, it picks up loose particles of soil, sand, and small rocks. This is called sediment transport. The flowing water carves out small channels called rills, which can grow into larger gullies over time. Even though the larger rocks stay in place, the water is able to carry away the smaller particles, creating this eroded landscape.\n\n## 📚 Core Science Concepts\n\n1. **Erosion**: The process of Earth materials being worn away and transported by natural forces like water, wind, or ice.\n2. **Sediment Transport**: When moving water carries particles of rock, soil, and sand from one place to another.\n3. **Runoff**: Water that flows over the ground surface rather than soaking into the soil, often carrying sediment with it.\n\n<pedagogical-tip>\nTo help students visualize and understand erosion, create a hands-on demonstration. Build a small hill using soil in a large tray or outdoors. Place different sized rocks, pebbles, and pieces of grass on the hill. Slowly pour water from a watering can at the top and observe what happens. Have students record which materials moved and where they went. Compare what happens with fast-flowing water versus slow-flowing water. Discuss how this relates to real-world erosion during rainstorms. This concrete model makes the process of erosion and sediment transport much more understandable for 3rd graders.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Outdoor Investigation**: Take students outside to find evidence of erosion on the school grounds after a rainstorm.\n- **Time-Lapse Video**: Show a time-lapse video of an erosion demonstration at different water speeds to help visual learners.\n- **Size Sorting**: Have students sort rocks by size to better understand what materials water can easily move.\n- **Comparison Photos**: Show examples of erosion in different environments, like beaches, mountains, and deserts, to help students make connections.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: How water flow causes erosion and sediment movement\n\n## 💬 Discussion Questions\n\n1. What is making the water look brown and muddy? (DOK 1: Recall)\n2. Why do you think some rocks stay in place while smaller particles get carried away? (DOK 2: Skill/Concept)\n3. How might this same process create larger features like river valleys over many years? (DOK 3: Strategic Thinking)\n4. What could people do to slow down or prevent erosion on a hillside? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Erosion**: The wearing away and transportation of Earth materials by natural forces.\n- **Sediment**: Small particles of rock, soil, and sand carried by water, wind, or ice.\n- **Runoff**: Water flowing over the ground surface instead of soaking in.\n- **Channel**: A path carved by flowing water.\n- **Transport**: To carry something from one place to another.\n- **Rill**: A small channel carved by flowing water.\n\n## 🌊 Extension Activities\n\n- Investigate how plants and roots help prevent erosion by stabilizing the soil.\n- Research how farmers use terracing to control water flow and reduce erosion on hillsides.\n- Create before-and-after drawings showing how erosion can change landscapes over time.\n- Study how the Grand Canyon was formed by water erosion over millions of years.",
    "grade4": "## 📸 Photo Description\n\nThis image shows a stream of muddy water flowing over rocks and pebbles on the ground. The water has carved small channels and paths as it flows downhill, picking up soil particles and small rocks along the way. You can see different sizes of rocks, from tiny pebbles to larger stones, as well as some patches of grass on the edges. The brown color of the water indicates that it is carrying a lot of dirt and sediment.\n\n## 🔬 Scientific Phenomena\n\nThe photo demonstrates the process of water erosion and sediment transport. When rain falls on the ground, some of the water flows across the surface instead of soaking in, especially on sloped or compacted areas. As the water flows, it picks up loose soil, sand, and small rocks, which is why the water looks muddy. The moving water carves small channels called rills, which can eventually grow into larger gullies over time. Larger rocks stay in place, but the water is able to carry away the smaller particles.\n\n## 📚 Core Science Concepts\n\n1. **Erosion**: The process of Earth materials, like soil and rock, being worn away and transported by natural forces like water, wind, or ice.\n\n2. **Sediment Transport**: The movement of small particles of rock, soil, and sand by flowing water or wind.\n\n3. **Runoff**: The water that flows across the ground surface rather than soaking into the soil, often carrying sediment with it.\n\n<pedagogical-tip>\nCreate a hands-on erosion demonstration for students by building a small hill using soil in a tray or outside. Place different sized rocks, pebbles, and grass on the hill. Slowly pour water from the top and observe what happens. Have students record which materials move and where they go, and compare how the water flow affects the different materials. This concrete model will help students understand the process of erosion and sediment transport.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Outdoor Exploration**: Take students outside to observe evidence of erosion on the school grounds after a rain.\n- **Visual Aids**: Use time-lapse videos to show erosion demonstrations at different water flow speeds.\n- **Sorting Activity**: Have students sort rocks by size to understand what water can move.\n- **Comparison Photos**: Show examples of erosion in different environments, like beaches, mountains, and deserts.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:DCI:4-ESS2.E]]: Biogeology\n- [[NGSS:CCC:Cause]]: Understanding how water flow causes erosion and sediment movement\n\n## 💬 Discussion Questions\n\n1. What do you think is making the water look brown and muddy? (DOK 1: Recall)\n2. Why do you think some rocks stay in place while smaller particles get carried away? (DOK 2: Skill/Concept)\n3. How might this same process of erosion and sediment transport create larger features like river valleys over many years? (DOK 3: Strategic Thinking)\n4. What are some ways that people could slow down or prevent erosion on a hillside? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Erosion**: The process of Earth materials being worn away and transported by natural forces.\n- **Sediment**: Small particles of rock, soil, and sand that are carried by water, wind, or ice.\n- **Runoff**: Water that flows over the ground surface rather than soaking into the soil.\n- **Channel**: A path carved by flowing water.\n- **Transport**: To carry something from one place to another.\n- **Rill**: A small channel or groove carved by running water.\n\n## 🌡️ Extension Activities\n\n- Investigate how plants and their roots help prevent erosion.\n- Research how farmers use terracing to control water flow and erosion on hillsides.\n- Create before-and-after drawings showing how erosion can change landscapes over time.\n- Study how the Grand Canyon was formed by water erosion over millions of years.",
    "grade5": "## 📸 Photo Description\n\nThis photo shows a small stream of muddy water flowing over a rocky, sloped surface. The water has carved out shallow channels and paths as it moves downhill, carrying along small pebbles and dirt particles. You can see how the water has eroded the ground, leaving behind exposed rocks and soil. The brown color of the water indicates it is filled with sediment - tiny pieces of rock, sand, and dirt that have been picked up and transported by the flowing water.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of water erosion, where moving water wears away and carries off soil, rocks, and other materials from the Earth's surface. As the rain falls on the ground, some of it runs across the surface instead of soaking in, especially on sloped or compacted areas. This flowing water picks up loose sediment and carves small channels and pathways, called rills, as it moves downhill. Over time, these rills can grow into larger gullies and canyons. The brown, muddy color of the water shows how much sediment it is transporting - the more sediment, the more erosion is taking place.\n\n## 📚 Core Science Concepts\n\n1. **Erosion**: The process of Earth materials being worn away and transported by natural forces like water, wind, or ice.\n2. **Sediment Transport**: When moving water carries particles of rock, soil, and sand from one place to another.\n3. **Runoff**: Water that flows over the ground surface rather than soaking into the soil, often carrying sediment with it.\n\n<pedagogical-tip>\nTo help students visualize and understand erosion, create a hands-on demonstration using a small tray of soil. Have students add rocks, pebbles, and grass, then slowly pour water over the top to observe how the water carves channels and carries away the smaller sediment particles. Discuss how this relates to the processes they see in the photo. Encourage them to make connections between the small-scale demonstration and the larger-scale erosion that shapes landscapes over time.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Outdoor Exploration**: Take students on a nature walk to look for signs of erosion in the local environment, such as rills, gullies, or sediment deposits.\n- **Modeling and Simulation**: Use interactive simulations or animations to show how erosion occurs at different scales and in various environments.\n- **Multimodal Representations**: Provide students with a variety of materials (e.g., diagrams, videos, physical models) to explore the concept of erosion and sediment transport.\n- **Scaffolded Questioning**: Use a range of questions, from lower-level recalling to higher-level analysis and application, to support students' understanding of the scientific concepts.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:DCI:4-ESS2.E]]: Biogeology\n- [[NGSS:CCC:Cause]]: Cause and effect relationships can be used to explain change\n\n## 💬 Discussion Questions\n\n1. What evidence in the photo shows that water is causing erosion? (DOK 2: Skill/Concept)\n2. Why do you think the water is carrying small pebbles and dirt particles with it? (DOK 3: Strategic Thinking)\n3. How might this small-scale erosion be related to the formation of larger geological features, like river valleys or canyons? (DOK 3: Strategic Thinking)\n4. What are some ways that people could try to prevent or slow down erosion in an area like this? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Erosion**: The wearing away and transportation of Earth materials by natural forces.\n- **Sediment**: Small particles of rock, soil, and sand carried by water, wind, or ice.\n- **Runoff**: Water that flows over the ground surface rather than soaking into the soil.\n- **Channel**: A path carved by flowing water.\n- **Rill**: A small, shallow channel created by erosion.\n- **Gully**: A larger channel or ravine created by erosion.\n\n## 🌊 Extension Activities\n\n- Investigate how different types of vegetation (e.g., trees, grasses, shrubs) can help prevent erosion.\n- Research ways that farmers and land managers use techniques like terracing, cover crops, or contour plowing to control water runoff and erosion.\n- Create a model or diagram showing the formation of a river valley or canyon over time due to erosion.\n- Explore how erosion and sediment transport can affect aquatic ecosystems, such as by filling in streams or lakes."
  }
}