{
  "title": "Chrysalis",
  "category": "earth-space-science",
  "imageFile": "p48.jpg",
  "imagePath": "images/earth-space-science/p48.jpg",
  "content": "### Visible Elements in Photo\n\n- A metallic, weathered metal beam or rail with rust and corrosion visible\n- A green chrysalis (butterfly pupa) hanging from the beam by a thin silk thread\n- Blurred green background (foliage or outdoor setting)\n- Natural attachment point where the chrysalis connects to the structure\n- Evidence of structural support: the beam bears the weight of the hanging chrysalis\n\n---\n\n### Reasonable Inferences\n\n1. **From the chrysalis:** The organism needs a safe, stable place to hang during metamorphosis—it is vulnerable and depends entirely on its anchor point for survival.\n2. **From the metal beam:** Exposed structures in nature must withstand environmental forces (wind, rain, temperature changes) while remaining strong enough to support living things.\n3. **From the attachment method:** Small, delicate living things often use minimal materials but require strong, reliable connections—suggesting that strength and efficiency can coexist.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**  \n*Build a Safe Home for a Butterfly Baby*\n\nA chrysalis (a butterfly baby) needs a safe place to hang while it grows. Design and build a hanging pod using string and natural materials (leaves, twigs, clay). Your pod must:\n- Hold a small object (like a walnut or marble) safely\n- Hang from a stick or rod without falling\n- Keep the object dry and protected\n\n*How will you make sure your pod doesn't break or drop?*\n\n---\n\n**3-5 Version:**  \n*Design a Protective Chrysalis Shelter*\n\nButterfly chrysalises must hang safely from branches and withstand wind, rain, and temperature swings while remaining lightweight. Design and build a hanging shelter using only natural or recycled materials that:\n- Hangs stably from a wooden dowel or branch using a single attachment point\n- Protects a water-filled balloon (representing the chrysalis) from direct water spray for at least 30 seconds\n- Does not weigh more than 50 grams\n- Can support itself without additional support from below\n\nTest your design by suspending it, applying a light wind simulation (fan on low), and spritzing it lightly with water. Measure success by whether the \"chrysalis\" remains protected and the structure stays attached.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real organism in a real survival situation, making it ideal for starting with problem identification. Students observe that the chrysalis faces a genuine challenge (finding stable shelter during a vulnerable stage), and the engineering task emerges naturally from that authentic need. Rather than telling students \"here's how to build a hanging structure,\" they discover the *why* first.\n\n---\n\n### Suggested Materials\n\n- Yarn, string, or twine\n- Small branches, twigs, or wooden dowels\n- Leaves, bark, or moss (fresh or dried)\n- Air-dry clay or modeling clay\n- Recycled paper, newspaper, or tissue paper\n- Small objects to simulate weight (walnuts, marbles, water balloons)\n- Tape or natural plant fiber (optional reinforcement)\n\n---\n\n### Estimated Time\n\n- **K-2:** 45-60 minutes (one session: design, build, test)\n- **3-5:** 60-90 minutes (may span two 45-minute sessions: design/plan, build, test, refine)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) and **ETS1.B** (developing possible solutions) by anchoring the design challenge in a real organism's survival need, making the engineering constraints meaningful rather than arbitrary.",
  "inputTokens": 1805,
  "outputTokens": 829,
  "cost": 0.00595,
  "generatedAt": "2026-02-09T13:26:11.638Z"
}