{
  "title": "Chrysalis",
  "category": "earth-space-science",
  "imageFile": "p48.jpg",
  "imagePath": "images/earth-space-science/p48.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Chrysalis to Butterfly — A Study of Change and the Water Cycle\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Water in the Environment:** The chrysalis hangs from a rusty metal structure, demonstrating how water exists in natural and human-made environments and interacts with different materials.\n- **Weathering and Change Over Time:** The corroded, rust-colored metal shows how materials change when exposed to weather (water, oxygen), connecting to Earth processes that shape our world.\n- **Seasonal Weather Patterns:** Chrysalises are found during specific seasons when weather conditions support the transformation process; this relates to typical seasonal weather conditions.\n- **Natural Cycles and Systems:** The chrysalis represents a life cycle tied to Earth's seasons and weather patterns, demonstrating how living things depend on stable environmental conditions.\n\n---\n\n## Lesson Title\n\n**When Rain Meets Rust: How Weather Changes Our World**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 3-ESS2-1: Represent data in tables and graphical displays to describe typical weather conditions expected during a particular season.\n  - 3-ESS3-1: Make a claim about the merit of a design solution that reduces the impacts of a weather-related hazard.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Identify** how water and weather change materials over time (such as causing rust on metal).\n2. **Describe** the typical weather conditions that occur during different seasons and how living things respond to those conditions.\n3. **Explain** how rust forms when metal is exposed to water and air, and **claim** which design materials would resist rusting better.\n4. **Record and represent** observations about weathering in pictures, diagrams, or simple data tables.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or projected photograph of the chrysalis on the rusty rail\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a screen or as a large printed image where all students can see it clearly. Give students 30 seconds of silent observation time—no talking yet.\n\n2. **Pose these discussion questions** (write them on the board as you ask):\n   - *\"What do you see hanging from the metal rail? What do you think it is?\"*\n   - *\"Look closely at the metal. What color is it? Why do you think it looks rusty and orange instead of shiny silver?\"*\n   - *\"If we left this metal rail outside for a long time in the rain, what would happen to it? Would it stay the same?\"*\n   - *\"What do you think the weather (rain, sun, wind) does to things outside?\"*\n\n3. **Record student ideas** on chart paper. Accept all responses without judgment—misconceptions will be refined during Explain.\n\n4. **Wonder Prompt:** *\"I wonder what would happen if we left different kinds of metal in the rain for a week. Some might get rusty fast, and some might not get rusty at all. Why might that be?\"*\n\n**Transition:** *\"Let's do an experiment to see how water and air change metal, just like we see in this photograph.\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:** (Per group of 3-4 students)\n- 3-4 different metal objects (steel nails, aluminum foil, copper pennies, or steel washers)\n- 1 glass jar or plastic cup filled with water\n- Paper towels\n- Labels and markers\n- Observation sheet (see template below)\n- Optional: shallow trays to contain spills\n\n**Activity:**\n\n1. **Divide students into groups of 3-4.** Assign each group one or two metal objects to test.\n\n2. **Provide this step-by-step student direction card** (read aloud and display):\n   - *\"Place your metal object in the jar of water.\"*\n   - *\"Draw or write what your metal looks like RIGHT NOW. Color: shiny or dull? Any spots?\"*\n   - *\"Label the jar with your names and the type of metal.\"*\n   - *\"Leave the jar in a sunny spot for 3-5 days. This is our experiment!\"*\n   - *\"Each day, look at your metal WITHOUT taking it out of the water. Draw or write what you see changing.\"*\n\n3. **Observation Sheet** (simplified for Third Grade):\n\n   ```\n   Metal Type: ________________\n   \n   Day 1: Draw your metal here → [SPACE]\n   What color is it? _______________\n   \n   Day 3: Draw your metal here → [SPACE]\n   What changed? _______________\n   \n   Day 5: Draw your metal here → [SPACE]\n   Did it get rusty? YES / NO\n   ```\n\n4. **Connection to the Photograph:** *\"In the picture, that rusty rail has been outside in the rain for a LONG time. Our experiment is like a fast version of what happens to metal in nature.\"*\n\n**Teacher Role:**\n- Circulate and ask guiding questions: *\"What do you notice? Has anything changed? What color is appearing?\"*\n- **Do NOT say:** \"That's rust\" or \"Metal gets rusty when wet.\" Let students observe and describe first.\n- Help students draw or write observations. Provide sentence starters: *\"I see... The metal looks... It changed because...\"*\n\n**Expected Student Outcomes:**\n- Students will observe oxidation/rust forming on iron-based metals.\n- Students will record visual changes over multiple days.\n- Students will make predictions about which metals might rust faster or slower.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with vocabulary terms\n- Photograph (display again)\n- Student observation sheets from Explore\n- Optional: video clip (30-60 seconds) showing time-lapse rust forming (search \"rust time-lapse\" on YouTube for short, age-appropriate clips)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Call on 2-3 groups to show their observation sheets and describe what they saw.\n   - Ask the class: *\"Did all the metals change the same way? Why not?\"*\n   - Guide students to notice that some metals (iron, steel) rusted more than others.\n\n2. **Introduce Key Vocabulary** (use visual aids and the photograph):\n\n   | Term | Student-Friendly Definition |\n   |------|----------------------------|\n   | **Rust** | An orange or reddish coating that forms when metal (iron) gets wet and is exposed to air. It happens over time. |\n   | **Weather** | The condition of the air outside—rain, sun, wind, snow. Weather can change things. |\n   | **Weathering** | The slow wearing away and changing of rocks and metal because of water, wind, and sun. |\n   | **Season** | A time of year with typical weather (spring, summer, fall, winter). Different seasons have different rain and temperatures. |\n   | **Material** | What something is made of (metal, plastic, wood, rock). Different materials react differently to water. |\n\n3. **Make Connections to the Photograph:**\n   - *\"The rusty rail in the photograph got that way because of weathering. Rain fell on it many, many times. The water and air turned the metal orange, just like what happened in our jars, but over months or years instead of days.\"*\n   - *\"This rail sits outside through all four seasons—spring rain, summer sun, fall storms, winter snow. All that weather caused the rust.\"*\n\n4. **Check for Understanding:**\n   - Ask: *\"If we wanted to keep this rail from getting rusty, what could we do?\"* (Paint it, cover it, use a different material)\n   - Ask: *\"Why do you think the chrysalis is hanging here and not on the rusty rail? Does it need the rust?\"* (Likely no—it chose a safer spot, or the rust doesn't affect the chrysalis)\n\n**Vocabulary Display:**\n- Post the vocabulary chart on the wall and reference it throughout the lesson.\n\n**Expected Student Outcomes:**\n- Students can define \"rust\" and \"weathering\" in their own words.\n- Students understand that water and air cause metal to change over time.\n- Students recognize this as an Earth process that happens to materials in nature.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Chart paper and markers\n- Pictures of different materials/structures (laminated or printed: a playground, a bridge, a fence, a tree, a house)\n- Index cards with material names: metal, wood, plastic, concrete, glass\n- Optional: actual material samples to touch (a piece of untreated wood, a plastic bag, a painted board, a rock, aluminum foil)\n\n**Activity: \"Design a Weatherproof Structure\"**\n\n1. **Scenario:** *\"Imagine we're building a new outdoor play structure that will stay outside all year, through rain, snow, and sun. Some materials will rust or rot. Some will last a long time. Let's think about which materials are best.\"*\n\n2. **Hands-On Card Sort:**\n   - Display pictures of various structures or materials.\n   - Have students work in pairs or small groups.\n   - **Task:** *\"Sort these materials into two groups: 'Rusts or Rots Easily' and 'Stays Good for a Long Time.'\"*\n   - Materials to sort: metal, untreated wood, plastic, painted wood, concrete, glass.\n\n3. **Group Discussion:**\n   - After sorting, ask: *\"Why did you put metal in the 'Rots Easily' group?\"*\n   - Guide to idea: *\"Metal rusts when it gets wet. If we paint it or treat it, it lasts longer.\"*\n   - Ask: *\"For our playground, what material would you choose and why?\"*\n\n4. **Make a Class Claim:**\n   - Facilitate a short discussion to build a class claim statement together.\n   - Write it on chart paper: *\"We claim that **[plastic or painted metal]** is the best choice for an outdoor play structure because **[it doesn't rust/rot easily and lasts through rain and sun/different seasons]**.\"*\n   - This connects directly to 3-ESS3-1 (making claims about design solutions).\n\n**Teacher Role:**\n- Listen to student reasoning without correcting immediately.\n- Ask follow-up questions: *\"How do you know that? Have you seen wood that rots? What does rust look like?\"*\n- Validate logic: *\"That's smart thinking! You're using what we learned about weathering.\"*\n\n**Expected Student Outcomes:**\n- Students apply weathering concepts to real-world design decisions.\n- Students explain why some materials last longer outdoors than others.\n- Students make evidence-based claims about material durability.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (Throughout the lesson):**\n- **Observation Sheets:** Check for accurate drawings and descriptions of rust/change over time.\n- **Discussion Participation:** Listen to student responses during Engage and Explain. Do they use words like \"rust,\" \"weather,\" \"change\"?\n- **Card Sort Reasoning:** Listen to explanations during Elaborate. Do students reference water, time, or weathering?\n\n**Exit Ticket (Summative Assessment) — Choose ONE:**\n\n**Option A (Drawing-Based for Struggling Readers):**\nShow a picture of a shiny metal object and a rusty metal object side-by-side.\n- *\"Draw arrows to show what the weather did to the metal.\"*\n- *\"Write or tell: What made the metal change color?\"*\n\n**Option B (Written Response for On-Grade Readers):**\n- *\"A metal playground is getting rusty. What would you do to stop the rust? Explain your answer using the word 'weather' or 'water.'\"*\n\n**Option C (Data Representation for Advanced Learners):**\n- Provide a simple data table showing \"Days in Water\" and \"Amount of Rust\" (3 days = small spot, 5 days = medium spot, 7 days = large rust).\n- *\"Look at the data. What pattern do you see? Explain what this tells us about weathering.\"*\n\n**Success Criteria:**\n✓ Student can identify rust or weathering as a change caused by water and air.\n✓ Student can explain that this process happens over time (days, weeks, months, years).\n✓ Student connects weathering to the photograph (the rusty rail).\n✓ Student can suggest a solution to prevent rust (painting, choosing different material, covering).\n\n**Expected Student Outcomes:**\n- Most students (75%+) will demonstrate understanding that water and weather change metal over time.\n- Students will use vocabulary: \"rust,\" \"weather,\" \"metal,\" \"change,\" \"water.\"\n- Students will apply this understanding to a new context (playground design).\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners):\n\n1. **Simplified Observation Sheet:** Provide a sheet with pictures to circle instead of requiring writing. Example: *\"Was your metal shiny or dull? Circle one: [shiny picture] [dull picture]\"*\n\n2. **Peer Partnerships:** Pair each struggling student with a stronger reader/writer during Explore and Elaborate. Assign the stronger student as the \"recorder\" while the struggling student does the observing and describing aloud.\n\n3. **Vocabulary Anchor Chart:** Create a visual chart with pictures and words for rust, weather, and weathering posted near the work station. Students can point to images instead of generating their own descriptions.\n\n4. **Pre-Made Choice Board for Exit Ticket:** Provide three sentence starters and have students choose one to complete:\n   - *\"The metal turned orange because...\"*\n   - *\"Weathering means...\"*\n   - *\"We could stop rust by...\"*\n\n### Challenge (For Advanced Learners):\n\n1. **Variables Investigation:** Have advanced students design their own experiment: *\"What if we tested metal in SALT water vs. fresh water? What if we tested metal in the sun vs. in the shade? Which rusts faster?\"* Have them predict, test, and record results.\n\n2. **Seasonal Connection:** Ask students to research and present: *\"Why does rust happen faster in spring and fall (wet seasons) than in summer?\"* They can create a poster or short presentation explaining seasonal weather's effect on weathering.\n\n3. **Material Science Extension:** Provide samples of different finishes (painted metal, bare metal, galvanized metal) and have students predict and test which one will rust slowest. They can create a data table and presentation for the class.\n\n---\n\n## Extension Activities\n\n1. **Weathering Walk:** Take students on a 10-15 minute outdoor walk around the school grounds to find examples of weathering: rusty playground equipment, rotting wood fences, cracked concrete, weathered rocks. Have students photograph or sketch examples and categorize them by cause (water, wind, sun, freeze-thaw).\n\n2. **Seasons and Weathering:** Over the course of a month or semester, photograph the same rusty object or weathered area at different times. Create a \"Weathering Over the Seasons\" display showing how the same object changes in spring, summer, and fall. Discuss: \"Which season causes the most weathering? Why?\"\n\n3. **Paint Experiment:** Provide students with small metal objects (nails, washers) and let half the class paint them before placing them in water. After 3-5 days, compare the painted vs. unpainted metals. Discuss: \"Did the paint protect the metal? Why is this useful knowledge for engineers and builders?\" This reinforces the design thinking aspect of 3-ESS3-1.\n\n---\n\n## Notes for the Teacher\n\n- **Timing:** The Explore phase requires 3-5 days of observation. Plan accordingly—you may want to start this activity on a Monday so you have 5 days before the following weekend.\n- **Safety:** Water jars should be stable and supervised. If using very young Third Graders, fill jars yourself and ensure they are placed on stable tables away from traffic areas.\n- **Real-World Connection:** If your school has any rusted structures, playground equipment, or fences, students will be excited to recognize real examples of weathering they've studied.\n- **Photography Tip:** Take a photograph of the classroom experiment setup on Day 1 to include in a classroom display later, comparing the \"before\" and \"after.\"\n\nThis lesson firmly grounds earth-science concepts (weathering, weather, seasonal patterns, material properties) in observable phenomena, allowing Third Graders to connect abstract ideas to concrete experiences.",
  "inputTokens": 2350,
  "outputTokens": 3983,
  "cost": 0.022265,
  "generatedAt": "2026-02-12T23:01:51.590Z"
}