{
  "title": "Chrysalis",
  "category": "earth-space-science",
  "imageFile": "p48.jpg",
  "imagePath": "images/earth-space-science/p48.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: A Chrysalis in the Sun\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Weather and Environmental Observation:** The photograph shows a natural object (chrysalis) hanging in an outdoor environment, demonstrating how scientists observe living things in their natural habitats and how weather/sunlight affects organisms.\n- **Light and Daylight Patterns:** The bright, green-tinted background and clear visibility of the chrysalis suggest observation during daylight hours, connecting to patterns of sunlight throughout the day.\n- **Natural Resources and Habitats:** The weathered metal structure provides an example of how natural and human-made materials exist in outdoor environments where living things are found.\n- **Seasonal Change and Life Cycles:** A chrysalis represents a life stage that occurs during specific times of year, introducing the concept that Earth's position relative to the sun creates seasonal patterns affecting living things.\n\n---\n\n## Lesson Title\n\n**Hanging Around: Watching the Chrysalis in the Sun**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 40-minute sessions (80 minutes total), with optional outdoor observation between sessions\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe what they see in outdoor environments at different times of day.\n2. Explain that the sun provides light during the day and that we can see things better when the sun is shining.\n3. Predict and record how much sunlight an object receives at different times.\n4. Understand that living things, like butterflies and insects, depend on sunlight and daylight patterns in nature.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student curiosity about outdoor observations and sunlight by showing the photograph and asking what they notice.\n\n**Materials:**\n- Large printed color photograph (or projected on screen)\n- Chart paper and marker\n\n**Activity:**\n\n1. **Display the Photograph:** Show the image to students and say: \"I found something amazing hanging outside on a sunny day. Let me show you what I saw!\"\n\n2. **Guided Observation Questions** (ask one at a time, allow 30-45 seconds for discussion after each):\n   - \"What do you see hanging from this rusty bar? What color is it?\"\n   - \"Why do you think this thing is hanging outside in the bright sunshine?\"\n   - \"What time of day do you think this picture was taken? How can you tell?\"\n   - \"Have you ever seen something like this hanging in nature? Where?\"\n\n3. **Wonder Prompt:**\n   - Ask: \"I wonder... what would happen if this chrysalis hung in a dark place instead of in the sunshine? What if the sun wasn't shining?\"\n   - Record student ideas on chart paper with words and pictures.\n\n**Transition:** \"Good thinking! Let's explore what happens when things spend time in the sun and in the shade.\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate how sunlight affects what we can see and how objects change based on light exposure.\n\n**Materials:**\n- Small objects: a green leaf, a coin, a small toy, a white paper square\n- Two paper bags (one with holes punched in it, one sealed)\n- Sunny outdoor area (or sunny windowsill if outdoor not available)\n- Shaded indoor area\n- Clipboards with paper\n- Colored pencils or crayons\n- Tape\n\n**Activity:**\n\n**Part A: Observation Hunt (12 minutes)**\n\n1. **Divide the class into two groups:**\n   - **Group 1:** Goes outside to the sunny area for 5 minutes.\n   - **Group 2:** Stays indoors in a shaded area for 5 minutes.\n   - (Then swap groups and repeat.)\n\n2. **Student Directions for Sunny Group:**\n   - \"Look around and find three things you can see clearly in the sunshine.\"\n   - \"Draw what you see on your paper. Color it the way it looks in the bright sun.\"\n   - \"Notice: Can you see colors? Can you see shadows?\"\n\n3. **Student Directions for Shaded Group:**\n   - \"Look around and find three things in this shaded spot.\"\n   - \"Draw what you see. Does it look different than in the sun?\"\n   - \"Notice: Are the colors bright or dark? Can you see shadows?\"\n\n4. **Bring both groups together** and compare their drawings side by side.\n\n**Part B: Create a Sun Observation (10 minutes)**\n\n5. **Hold up one of each object** (leaf, coin, toy, paper square).\n\n6. **Have students predict:**\n   - \"Which of these will look brightest in the sun?\"\n   - \"Which might look dull in the shade?\"\n\n7. **Place objects in two bags:**\n   - Bag 1 (light in): tape holes on the bag, place in sunny windowsill.\n   - Bag 2 (dark): keep sealed, place in a dark cabinet.\n\n8. **Students record on a clipboard drawing:**\n   - \"What we put in the bright bag\" (draw the bag with holes)\n   - \"What we put in the dark bag\" (draw the sealed bag)\n\n**Teacher Role:** \n- Circulate to each group and ask: \"What do you notice that's different?\" and \"Why do you think that is?\"\n- Avoid telling students answers; guide them with questions.\n- Help students draw clearly enough to compare later.\n\n**Expected Student Outcomes:**\n- Students discover that sunny areas make things easier to see and show colors more brightly.\n- Students observe that shaded areas are darker and harder to see clearly.\n- Students predict that objects in light will look different from objects in darkness.\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce vocabulary and connect student observations to how sunlight creates patterns we can observe in nature.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- Photograph displayed again\n- Pictures of daytime and nighttime (simple images from google images or teacher-drawn)\n\n**Activity:**\n\n1. **Group Share-Out (6 minutes):**\n   - Ask students who visited the sunny area: \"What did you notice that was different?\"\n   - Ask students in the shaded area: \"What was harder to see?\"\n   - Record key words: \"bright,\" \"light,\" \"dark,\" \"see better\"\n\n2. **Introduce Key Vocabulary (8 minutes):**\n\n   Present each term with a simple definition and point to examples:\n\n   | **Vocabulary** | **Student-Friendly Definition** |\n   |---|---|\n   | **Sunlight** | Light that comes from the sun; makes things bright and warm. |\n   | **Daylight** | When the sun is up in the sky and it is light outside. |\n   | **Shadow** | A dark shape made when something blocks the sunlight. |\n   | **Chrysalis** | A green or brown covering where a caterpillar changes into a butterfly. |\n   | **Observe** | To watch and look carefully at something. |\n\n   - Point to the chrysalis in the photograph: \"This is a chrysalis. It hangs in daylight, where the sun shines on it. The sunlight helps the butterfly inside grow.\"\n   - Show a picture of daytime and nighttime: \"During the day, we have sunlight. We can see the chrysalis clearly. At night, there is no sunlight, and it would be dark and hard to see.\"\n\n3. **Check for Understanding (4 minutes):**\n   - Ask: \"When is there more light outside—during the day or at night?\" (Expect: \"During the day.\")\n   - Ask: \"Why do you think the chrysalis in our picture is hanging where the sun can shine on it?\" (Guide toward: Light helps it; the butterfly needs warmth; we can see it better.)\n   - Hold up the bags from Explore and ask: \"Which bag has more light inside—the one with holes or the sealed one?\" (Holes = light.)\n\n**Vocabulary Display:**\n- Create and post a simple visual vocabulary chart with pictures and words in the classroom for reference.\n\n**Expected Student Outcomes:**\n- Students understand that daylight comes from the sun.\n- Students can name the object in the photo (chrysalis) and know it changes into a butterfly.\n- Students connect light to visibility and can explain why the sunny area showed things more clearly.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Students apply their learning about sunlight and observation by exploring how daylight changes and predicting patterns.\n\n**Materials:**\n- Large paper or whiteboard divided into two columns\n- Markers or crayons\n- Pictures of morning, afternoon, and evening/sunset\n- Observation journals (one per student, can be simple paper booklets)\n\n**Activity:**\n\n1. **Sunlight Pattern Exploration (8 minutes):**\n\n   - Show three pictures: morning (sun low, longer shadows), afternoon (sun high, shorter shadows), evening (sun low, long shadows).\n   \n   - Ask: \"When do you think the sun's light is brightest?\" (Guide toward: middle of the day, afternoon.)\n   \n   - Ask: \"When is there less daylight?\" (Early morning and evening.)\n\n2. **Create a Prediction Chart (6 minutes):**\n\n   - Draw a simple chart on paper with headings: \"Morning,\" \"Afternoon,\" \"Evening\"\n   - Underneath, have students draw or color:\n     - How **bright** the daylight is (bright = use yellow/light colors; dim = use darker colors)\n     - How **long** the shadows are (long lines for morning/evening; short lines for afternoon)\n   \n   - Model the first one together: \"In the morning, the sun is lower, so shadows are long and light is softer.\"\n\n3. **Chrysalis Connection Activity (4 minutes):**\n\n   - Return to the photograph: \"The chrysalis is hanging in daylight. It sees sunlight many times during the day—bright sunlight in the afternoon and softer sunlight in the morning and evening.\"\n   \n   - Ask: \"If we watched the chrysalis from the morning to the evening, what changes would we see in how bright the sun makes it look?\"\n   \n   - Have students draw a simple picture in their observation journal: chrysalis at three different times of day, showing how light changes.\n\n**Teacher Role:**\n- Facilitate discussion without giving answers; guide with questions like \"What do you notice about shadows when the sun is high?\" and \"Is there more or less light in the morning?\"\n- Help students draw their predictions, modeling if needed.\n\n**Expected Student Outcomes:**\n- Students recognize that sunlight intensity changes throughout the day.\n- Students can draw or describe patterns in daylight (bright afternoon, dimmer morning/evening).\n- Students apply their understanding by predicting how a chrysalis would look at different times of day.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of sunlight, daylight patterns, and observation.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- During Explore: Observe whether students accurately describe differences between sunny and shaded areas; ask guiding questions to assess thinking.\n- During Explain: Listen to responses when asking about daylight and shadows; note who understands the connection.\n- During Elaborate: Review predictions and drawings for evidence that students see patterns in daylight changes.\n\n**Exit Ticket / Summative Assessment (5 minutes):**\n\nProvide each student with a simple paper with three questions or prompts (read aloud and allow drawing as response):\n\n1. **\"Draw the chrysalis from our photograph. Is it daytime or nighttime? How do you know?\"**\n   - *Success Criteria:* Student draws chrysalis and indicates daytime (draws sun, bright colors, or writes/says \"day\").\n\n2. **\"When is there MORE sunlight—in the morning or the middle of the day?\"**\n   - *Success Criteria:* Student says or points to \"middle of the day\" / \"afternoon\" and can explain \"the sun is higher\" or \"brighter.\"\n\n3. **\"Why do you think the chrysalis hangs in a sunny place and not in the dark?\"**\n   - *Success Criteria:* Student gives any reasonable answer (\"the sun helps it,\" \"we can see it,\" \"it needs light,\" \"it's warm\").\n\n**Expected Student Outcomes:**\n\n- **Proficient:** Student demonstrates understanding of daylight, can identify daytime vs. nighttime, makes a connection between sunlight and observing objects clearly, and understands that the chrysalis benefits from sunlight.\n\n- **Developing:** Student can identify day vs. night but may not fully explain reasons; can name sunlight but may not connect it to the chrysalis.\n\n- **Not Yet Proficient:** Student struggles to distinguish day from night or explain the role of sunlight; requires additional individual observation and discussion.\n\n---\n\n## Differentiation\n\n### Support (Scaffolds for Struggling Learners)\n\n1. **Paired Exploration:** Pair students with stronger observers during Explore phase; have the partner describe what they see while the struggling student records with drawings or marks.\n\n2. **Vocabulary Picture Cards:** Create laminated picture cards with the five vocabulary terms before the lesson; use these as references during all phases, allowing students to point rather than recall words.\n\n3. **Simplified Exit Ticket:** Reduce exit ticket to two questions and allow drawing-only responses with teacher scribing; use multiple choice for daytime/nighttime (point to two pictures and ask \"which one has sunlight?\").\n\n4. **Extended Observation Time:** Provide 2-3 extra minutes for the sunny/shaded walk; allow these students to stay in one location longer if needed, with a peer buddy.\n\n### Challenge (Extensions for Advanced Learners)\n\n1. **Pattern Prediction Over Time:** Have students predict and draw what the chrysalis would look like if photographed at sunrise, noon, and sunset over 2-3 days. Discuss why the pattern repeats.\n\n2. **Shadow Detective:** Challenge advanced students to notice and measure shadows (using hand spans or string) in the sunny area at the beginning and end of the exploration period; predict whether shadows grew longer or shorter and explain why.\n\n3. **Daylight Journal:** Ask advanced learners to create a multi-day home observation journal where they record (with drawings and teacher-scribed notes) how much daylight there is on three different days; look for a pattern and present findings to the class.\n\n---\n\n## Extension Activities\n\n1. **Classroom Window Observation Chart:** Set up a simple daily chart on the classroom window showing sunrise/sunset times for the current week (print from a weather website). Each day, have a student point to where the sun is on a simple diagram (morning left, afternoon middle, evening right). Over a month, discuss: Is the sun in the same place every day? Create a class chart showing if daylight is getting longer or shorter (connects to 1-ESS1-2).\n\n2. **Butterfly Chrysalis Life Cycle Observation (if available):** If your school can obtain a butterfly garden kit, place it in a sunny location and have students observe daily. Create a picture timeline: egg → caterpillar → chrysalis → butterfly. Track observations over 2-4 weeks, noting how sunlight and temperature affect the process.\n\n3. **\"Day vs. Night\" Venn Diagram:** Have students collaborate on a large Venn diagram comparing daytime and nighttime observations. In \"Day\" side: bright, see colors, shadows, sunlight. In \"Night\" side: dark, hard to see, stars (if observable from school). In middle: we can observe things, we go outside. Discuss how the sun's position changes what we can observe.\n\n---\n\n## Teacher Notes\n\n- **Pacing:** If your first graders need more time in Explore, extend that phase to 30 minutes and condense Elaborate to 12 minutes.\n- **Weather Contingency:** If sunny observation is not possible, use two spots in the classroom (a sunny windowsill and a dark reading corner) instead.\n- **Photograph Display:** Keep the chrysalis photograph visible throughout all five phases; return to it frequently with the prompt \"Remember our chrysalis? Let's see what we're learning about it.\"\n- **Real Chrysalis:** If possible, source a real chrysalis (milkweed pod or chrysalis for release) to observe during the lesson—actual observation is more powerful than photograph alone.\n- **Cultural Connection:** Discuss with students how different cultures observe seasonal changes and animal life cycles as part of their connection to Earth (e.g., migration patterns, seasonal celebrations).\n\n---\n\n**This lesson builds strong foundational skills in observation and pattern recognition while meeting NGSS standards for daylight and sun patterns—key precursors to later Earth-space science learning.**",
  "inputTokens": 2319,
  "outputTokens": 3922,
  "cost": 0.021928999999999997,
  "generatedAt": "2026-02-12T23:00:26.854Z"
}