{
  "id": 39,
  "title": "Weathering and Natural Materials",
  "category": "earth-space-science",
  "imageFile": "p48.jpg",
  "content": "## 📸 Photo Description\n\nThis close-up photo shows a weathered metal bar or railing with rust and corrosion! The metal has a rusty brown-orange color on the bottom and peeling gray paint on top. You can also see what appears to be a monarch chrysalis hanging from the bar. The metal shows signs of weathering - it's been exposed to rain, sun, and air for a long time, causing it to change and deteriorate.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates chemical weathering and oxidation. When iron in metal is exposed to oxygen and water over time, it undergoes a chemical reaction called rusting or oxidation. The iron combines with oxygen to form iron oxide (rust), which has that familiar reddish-brown color. This is weathering - not from physical forces like wind or water breaking things apart, but from chemical changes. The same process happens to rocks containing iron minerals! Weathering breaks down materials over time, which is an important part of soil formation and the rock cycle.\n\n## 📚 Core Concepts\n\n1. **Weathering**: The breaking down of rocks, soil, and minerals through contact with Earth's atmosphere, water, and biological organisms.\n\n2. **Oxidation**: A chemical reaction where materials combine with oxygen, often causing color changes and deterioration.\n\n3. **Chemical Weathering**: When rocks and materials break down due to chemical reactions rather than physical forces.\n\n<pedagogical-tip>\nCreate a rust observation experiment! Give students three identical iron nails. Place one in: (1) a dry cup, (2) a cup with water, and (3) a cup with salt water. Check daily for two weeks, drawing and describing changes. Graph rust development over time. Discuss: Which nail rusted fastest? Why does salt speed up rusting? How is this like weathering in nature? This long-term observation makes chemical weathering concrete and measurable!\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Photo Documentation**: Students photograph weathered objects around school over time\n- **Color Comparison**: Match rust colors to oxidized rocks with iron content\n- **Material Testing**: Compare how different metals weather (aluminum, copper, steel)\n- **Real-World Connections**: Discuss why cars rust faster near oceans (salt water)\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1.A]]: Structure and Properties of Matter\n- [[NGSS:DCI:2-PS1.B]]: Chemical Reactions\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: How oxygen and water cause weathering and rusting\n\n## 💬 Discussion Questions\n\n1. What color does iron turn when it rusts? (DOK 1: Recall)\n2. What two things does metal need to rust - just air, just water, or both? (DOK 2: Skill/Concept)\n3. Why do you think rocks with iron in them turn reddish-brown when they weather? (DOK 2: Skill/Concept)\n4. How is rusting metal similar to weathering rocks? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Weathering**: The breakdown of materials due to exposure to the environment\n- **Oxidation**: A chemical reaction where something combines with oxygen\n- **Rust**: Iron oxide formed when iron reacts with oxygen and water\n- **Corrosion**: The gradual destruction of materials by chemical reactions\n- **Chemical reaction**: When substances combine or break apart to form new substances\n\n## 🔬 Extension Activities\n\n- Find examples of weathered rocks with iron (reddish color) in your area\n- Research how the red color of Mars comes from iron oxide (rust)\n- Investigate how protective coatings prevent weathering and rust\n- Compare physical weathering (breaking) vs. chemical weathering (changing)",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis close-up photo shows a metal object, like a railing or bar, that has been exposed to the weather for a long time. The metal has a rusty, reddish-brown color on the bottom and some peeling gray paint on top. There is also a monarch butterfly chrysalis hanging from the bar. The metal looks weathered and worn down, showing signs of being exposed to rain, sun, and air for a long period.\n\n## 🔬 Scientific Phenomena\n\nThe photo demonstrates the process of chemical weathering, where materials like metal undergo a chemical reaction with oxygen in the air and water from the environment. This causes the metal to corrode and form a reddish-brown substance called rust. Rust is a type of iron oxide that forms when iron reacts with oxygen and water. This chemical weathering is what causes the deterioration and change in appearance of the metal over time.\n\n## 📚 Core Science Concepts\n\n1. **Weathering**: The breakdown of materials, like rocks and metals, due to exposure to the environment.\n2. **Oxidation**: A chemical reaction where a material, like iron, combines with oxygen to form a new substance, like rust.\n3. **Chemical Weathering**: When materials break down due to chemical reactions rather than physical forces.\n\n<pedagogical-tip>\nTo help kindergarten students understand this concept, set up a simple experiment where you place different metal objects (nails, washers, paperclips, etc.) in cups with water, salt water, and just air. Observe and record how the metals change over time. Discuss why some metals rust faster than others and how this relates to weathering in the real world. This hands-on activity will make the idea of chemical weathering more concrete and memorable for young learners.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Supports**: Provide samples of rusty and non-rusty metal for students to touch and observe the differences.\n- **Multimodal Representation**: Use images, videos, and physical demonstrations to show the weathering process.\n- **Customized Scaffolding**: Break down the concept of oxidation into simpler steps for younger learners, focusing on the color changes and deterioration.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-PS2.A]]: Forces and Motion\n- [[NGSS:DCI:K-PS2.B]]: Types of Interactions\n- [[NGSS:DCI:K-ESS2.E]]: Biogeology\n\n## 💬 Discussion Questions\n\n1. What color does the metal turn when it starts to rust? (DOK 1: Recall)\n2. What do you think causes the metal to change color and look worn down? (DOK 2: Skill/Concept)\n3. How is the rusting of metal similar to the weathering of rocks? (DOK 3: Strategic Thinking)\n4. Why do you think the metal railing has a monarch chrysalis attached to it? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Weathering**: The process of breaking down and changing materials due to exposure to the environment.\n- **Oxidation**: A chemical reaction where a material, like iron, combines with oxygen to form a new substance.\n- **Rust**: The reddish-brown substance that forms when iron reacts with oxygen and water.\n- **Chrysalis**: The hard, protective case that a caterpillar forms around itself as it transforms into a butterfly.\n\n## 🌡️ Extension Activities\n\n- Go on a scavenger hunt around the school or neighborhood to find other examples of weathered materials.\n- Experiment with different metals (copper, aluminum, steel) to see how they react to water and air over time.\n- Discuss how weathering and oxidation can affect the design and lifespan of outdoor structures and objects.",
    "grade1": "## 📸 Photo Description\n\nThis photo shows a rusty metal bar or fence post. The metal has a reddish-brown color, which means it has experienced weathering and oxidation over time. The surface of the metal looks rough and uneven, with some areas of the original gray paint still visible. This type of weathering is common for metal objects left outside and exposed to the elements.\n\n## 🔬 Scientific Phenomena\n\nThe reddish-brown color of the metal in this photo is due to a chemical process called oxidation. When metal, especially iron, is exposed to air and water (like rain), the iron in the metal reacts with oxygen to form a new substance called iron oxide. This iron oxide is what we call \"rust.\" Rust is a sign that the metal is weathering and breaking down over time through this chemical reaction.\n\n## 📚 Core Science Concepts\n\n1. **Weathering**: The process of breaking down and changing rocks, minerals, and other materials due to exposure to the environment.\n\n2. **Oxidation**: A chemical reaction where a substance combines with oxygen, often causing changes in color and structure.\n\n3. **Chemical Weathering**: When materials break down due to chemical reactions, like the rusting of metal, rather than physical forces.\n\n<pedagogical-tip>\nTo help students understand the concept of weathering and oxidation, set up a simple experiment where you place different metal objects (like nails, coins, or paper clips) in cups of water, salt water, and plain air. Have students observe and record changes over several days or weeks. This will allow them to see the process of oxidation and weathering happening before their eyes!\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Provide images showing the different stages of rust formation to support visual learners.\n- **Hands-On Exploration**: Allow students to closely examine weathered materials to observe the textures and colors.\n- **Vocabulary Support**: Provide word walls, glossaries, or other tools to help students understand key terms like \"weathering\" and \"oxidation.\"\n- **Real-World Connections**: Encourage students to look for examples of weathering in their everyday environment, such as rusty playground equipment or crumbling concrete.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1-1]]: Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n- [[NGSS:DCI:2-PS1-2]]: Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.\n- [[NGSS:DCI:2-ESS2-1]]: Compare multiple solutions designed to slow or prevent wind or water from changing the shape of the land.\n\n## 💬 Discussion Questions\n\n1. What color is the metal in the photo, and why does it have that color? (DOK 1: Recall)\n2. What do you think caused the metal to change color and texture over time? (DOK 2: Skill/Concept)\n3. How is the weathering of the metal in this photo similar to the weathering of rocks and other materials? (DOK 3: Strategic Thinking)\n4. If you left a metal object outside, how do you think it would change over time? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Weathering**: The process of breaking down and changing materials due to exposure to the environment.\n- **Oxidation**: A chemical reaction where a substance combines with oxygen, often causing changes in color and structure.\n- **Rust**: The reddish-brown substance that forms on iron or steel when it is exposed to air and water.\n- **Chemical Weathering**: The breakdown of materials due to chemical reactions, rather than physical forces.\n- **Metal**: A hard, shiny material that is a good conductor of electricity and heat.\n- **Environment**: The natural world, including the air, land, and water, in which people, animals, and plants live.\n\n## 🌡️ Extension Activities\n\n1. Go on a \"weathering walk\" around the school or neighborhood to find examples of weathered materials, like rusted metal, crumbling concrete, or faded paint.\n2. Conduct an experiment to test how different liquids (water, saltwater, vinegar, etc.) affect the weathering of metal objects.\n3. Research how weathering and oxidation have shaped the surface of other planets, like the reddish color of Mars.",
    "grade2": "## 📸 Photo Description\n\nThis photo shows a weathered metal fence or railing. The metal has a rusty, reddish-brown color and the original paint is peeling off. You can see that the metal has changed over time due to exposure to the elements. It looks like it has been outside for a long time, getting worn down by the weather.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific concept shown in this photo is chemical weathering. When metal like iron is exposed to air and water, it undergoes a chemical reaction called oxidation that causes it to rust. The iron in the metal combines with oxygen to form a new substance, iron oxide, which has a distinctive reddish-brown color. This chemical change is different from physical weathering, where materials are broken down by forces like wind, water, or ice. Chemical weathering alters the composition of the material itself.\n\n## 📚 Core Science Concepts\n\n1. **Weathering**: The breakdown of rocks, minerals, and other materials through exposure to the elements like air, water, and ice.\n\n2. **Oxidation**: A chemical reaction where a substance combines with oxygen, often causing a change in color or texture.\n\n3. **Chemical Weathering**: The breakdown of materials due to chemical reactions, as opposed to physical processes.\n\n<pedagogical-tip>\nTo help students understand chemical weathering, set up a hands-on experiment where they observe iron nails rusting over time. Have them place nails in different environments - dry, wet, salty water - and track the changes. This will make the process of oxidation and rust formation very concrete. Encourage them to draw diagrams and make observations to deepen their understanding.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Engagement**: Use images, videos, and physical models to demonstrate weathering and oxidation.\n- **Hands-On Exploration**: Provide opportunities for students to test different materials and observe weathering firsthand.\n- **Varied Presentation**: Present information through direct instruction, discussions, and independent research to accommodate different learning preferences.\n- **Flexible Assessments**: Allow students to demonstrate their understanding through written work, drawings, presentations, or other creative formats.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1.A]]: Structure and Properties of Matter\n- [[NGSS:DCI:2-PS1.B]]: Chemical Reactions\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n\n## 💬 Discussion Questions\n\n1. What color is the metal in the photo, and why does it look that way? (DOK 1: Recall)\n2. How is the process of the metal changing over time similar to the way rocks or minerals change in nature? (DOK 2: Skill/Concept)\n3. What do you think would happen if you left a piece of metal outside for a very long time? How would it change? (DOK 3: Strategic Thinking)\n4. Can you think of any other examples of materials that undergo chemical weathering or oxidation? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Weathering**: The breakdown of rocks, minerals, and other materials due to exposure to the environment.\n- **Oxidation**: A chemical reaction where a substance combines with oxygen, often causing a change in color or texture.\n- **Rust**: The reddish-brown substance that forms when iron is exposed to air and water.\n- **Chemical reaction**: A process where the molecular structure of a substance is changed, resulting in the creation of new substances.\n- **Corrosion**: The gradual degradation of a material, usually a metal, due to a chemical reaction with its environment.\n\n## 🌡️ Extension Activities\n\n1. Investigate different types of weathering (physical, chemical, biological) by examining rocks, minerals, or man-made materials around the school.\n2. Conduct experiments to test how various environmental factors, like temperature, moisture, or salt, affect the rate of oxidation and rust formation.\n3. Research how engineers and architects design buildings and structures to resist weathering and corrosion, and discuss the importance of this in the real world.",
    "grade3": "## 📸 Photo Description\n\nThis close-up photo shows a weathered metal bar or railing that has been exposed to the elements for a long time. The metal has a rusty brown-orange color on the bottom, and the top has peeling gray paint. You can also see a monarch chrysalis (the hard protective case a caterpillar forms before becoming a butterfly) hanging from the bar. The metal shows clear signs of weathering, meaning it has changed and deteriorated over time due to the effects of the environment.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific phenomenon shown in this image is chemical weathering and oxidation. When iron in metal is exposed to oxygen and water over an extended period, it undergoes a chemical reaction called rusting or oxidation. The iron in the metal combines with oxygen in the air to form a new substance called iron oxide, which has a reddish-brown color - this is the rust you see on the metal. Chemical weathering like this is different from physical weathering, where rocks and materials break down due to forces like wind, water, or ice. Weathering, whether chemical or physical, is an important process that shapes the Earth's surface over time.\n\n## 📚 Core Science Concepts\n\n1. **Weathering**: The breaking down of rocks, minerals, and other materials through contact with the atmosphere, water, and living organisms.\n\n2. **Oxidation**: A chemical reaction where a substance combines with oxygen, often causing changes in color and structure.\n\n3. **Chemical Weathering**: The breakdown of materials due to chemical reactions, as opposed to physical forces.\n\n<pedagogical-tip>\nSet up a hands-on experiment for students to observe the process of oxidation and chemical weathering. Provide them with several identical metal objects (nails, washers, etc.) and have them place them in different environments - dry, wet, with salt water. Have them observe and record the changes over several days or weeks. This will allow them to directly see how water and oxygen cause metals to rust and deteriorate, just like the weathering process in nature.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Observation**: Allow students to use magnifying glasses, cameras, and sketching to closely examine weathered objects.\n- **Tactile Exploration**: Provide samples of weathered rocks and metals for students to touch and feel the texture changes.\n- **Data Collection**: Have students graph or chart the changes they observe in their metal weathering experiment over time.\n- **Real-World Connections**: Encourage students to look for examples of weathering in their local environment and share their observations.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1.A]]: Structure and Properties of Matter\n- [[NGSS:DCI:2-PS1.B]]: Chemical Reactions\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: Understanding how oxygen and water cause weathering and rusting\n\n## 💬 Discussion Questions\n\n1. What color does iron turn when it rusts? (DOK 1: Recall)\n2. What two things does metal need to rust - just air, just water, or both air and water? (DOK 2: Skill/Concept)\n3. Why do you think rocks with iron in them turn reddish-brown when they weather? (DOK 2: Skill/Concept)\n4. How is the rusting of metal similar to the weathering of rocks? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Weathering**: The breakdown of materials due to exposure to the environment\n- **Oxidation**: A chemical reaction where a substance combines with oxygen\n- **Rust**: Iron oxide formed when iron reacts with oxygen and water\n- **Corrosion**: The gradual destruction of materials by chemical reactions\n- **Chemical Reaction**: When substances combine or break apart to form new substances\n- **Chrysalis**: The hard protective case a caterpillar forms before becoming a butterfly\n\n## 🌡️ Extension Activities\n\n- Go on a \"weathering hunt\" around your school or neighborhood to find examples of weathered rocks, metals, and other materials.\n- Investigate how rust-resistant coatings and paints can help prevent weathering and corrosion.\n- Research the reddish color of Mars and how it is caused by the presence of iron oxide (rust) on the planet's surface.\n- Explore the difference between physical weathering (breaking) and chemical weathering (changing) through additional experiments and observations.",
    "grade4": "## 📸 Photo Description\n\nThis photo shows a metal railing that has been weathered over time. The metal has a rusty, reddish-brown color on the bottom and is peeling and cracking on the top. You can also see what looks like a chrysalis or cocoon hanging from the railing. The weathered appearance of the metal demonstrates how exposure to the elements, like rain, sun, and air, can cause materials to change and deteriorate.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of chemical weathering, specifically the oxidation of metal. When iron in the metal is exposed to oxygen and water over time, it undergoes a chemical reaction called rusting or oxidation. The iron combines with oxygen to form iron oxide, which has that familiar reddish-brown color. This weathering is caused by chemical changes, not just physical forces like wind or water breaking things apart. The same process happens to rocks containing iron minerals, causing them to change color and break down.\n\n## 📚 Core Science Concepts\n\n1. **Weathering**: The breakdown of rocks, soil, and minerals through contact with Earth's atmosphere, water, and living organisms.\n\n2. **Oxidation**: A chemical reaction where materials combine with oxygen, often causing color changes and deterioration.\n\n3. **Chemical Weathering**: When rocks and materials break down due to chemical reactions rather than physical forces.\n\n<pedagogical-tip>\nConduct a hands-on experiment where students observe the rusting process over time. Give each student three identical iron nails and place them in different environments: one in a dry container, one in a container with water, and one in a container with salt water. Have them observe and record changes to the nails over the course of a few weeks. This will help students understand the role of oxygen and water in the chemical weathering process and make the concept more concrete.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Representation**: Encourage students to document the weathering process through drawing, writing, and photography.\n- **Sensory Exploration**: Allow students to touch and observe weathered materials, using their senses to better understand the changes.\n- **Adaptable Outputs**: Provide options for students to demonstrate their understanding, such as creating a poster, giving a presentation, or writing a report.\n- **Accessible Resources**: Ensure any written materials or instructions are at an appropriate reading level for the students.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-PS1.A]]: Structure and Properties of Matter\n- [[NGSS:DCI:4-PS1.B]]: Chemical Reactions\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: Identifying the causes of chemical weathering and oxidation\n\n## 💬 Discussion Questions\n\n1. What color does iron turn when it rusts? (DOK 1: Recall)\n2. What two things does metal need to rust - just air, just water, or both? (DOK 2: Skill/Concept)\n3. Why do you think rocks with iron in them turn reddish-brown when they weather? (DOK 3: Strategic Thinking)\n4. How is the rusting of metal similar to the weathering of rocks? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Weathering**: The breakdown of materials due to exposure to the environment.\n- **Oxidation**: A chemical reaction where something combines with oxygen.\n- **Rust**: Iron oxide formed when iron reacts with oxygen and water.\n- **Corrosion**: The gradual destruction of materials by chemical reactions.\n- **Chemical reaction**: When substances combine or break apart to form new substances.\n- **Minerals**: Naturally occurring, inorganic substances with a specific chemical composition.\n\n## 🌡️ Extension Activities\n\n- Investigate how the red color of Mars is caused by iron oxide (rust) in the soil.\n- Research the different types of weathering (physical, chemical, biological) and compare their effects on materials.\n- Explore how protective coatings, like paint or sealants, can prevent weathering and rust.\n- Compare the weathering of different metals, such as aluminum, copper, and steel, to understand how their chemical properties affect their resistance to oxidation.",
    "grade5": "## 📸 Photo Description\n\nThis close-up photo shows a weathered metal railing with rust and corrosion. The metal has a rusty brown-orange color on the bottom and peeling gray paint on top. You can also see what appears to be a monarch chrysalis hanging from the bar. The metal shows clear signs of weathering - it's been exposed to the elements like rain, sun, and air for a long time, causing it to change and deteriorate.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of chemical weathering and oxidation. When iron in metal is exposed to oxygen and water over time, it undergoes a chemical reaction called rusting or oxidation. The iron combines with oxygen to form iron oxide (rust), which has that familiar reddish-brown color. This is weathering - not from physical forces like wind or water breaking things apart, but from chemical changes at the molecular level. The same process happens to rocks containing iron minerals! Weathering breaks down materials over time, which is an important part of soil formation and the rock cycle.\n\n## 📚 Core Science Concepts\n\n1. **Weathering**: The breaking down of rocks, minerals, and other materials through contact with Earth's atmosphere, water, and living organisms.\n\n2. **Oxidation**: A chemical reaction where a substance combines with oxygen, often causing color changes and deterioration.\n\n3. **Chemical Weathering**: When materials break down due to chemical reactions rather than physical forces.\n\n<pedagogical-tip>\nConduct a hands-on rust observation experiment with your students. Give them three identical iron nails and have them place one each in a dry container, a container with water, and a container with saltwater. Have them observe and document the changes over 2 weeks, then compare the results. This will help make the concept of chemical weathering more concrete and measurable for 5th graders.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Provide images of different types of weathering (physical, chemical, biological) for students to compare.\n- **Sensory Experiences**: Allow students to feel and observe weathered rocks and metals to better understand the changes.\n- **Multiple Means of Expression**: Have students create models, diagrams, or videos to explain the process of oxidation and chemical weathering.\n- **Real-World Connections**: Discuss examples of weathering that students may observe in their daily lives, like rusty playground equipment or crumbling concrete.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-PS1.A]]: Structure and Properties of Matter\n- [[NGSS:DCI:5-PS1.B]]: Chemical Reactions\n- [[NGSS:DCI:5-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Cause]]: How oxygen and water cause weathering and rusting\n\n## 💬 Discussion Questions\n\n1. What color does iron turn when it rusts? (DOK 1: Recall)\n2. What two things does metal need to rust - just air, just water, or both? (DOK 2: Skill/Concept)\n3. Why do you think rocks with iron in them turn reddish-brown when they weather? (DOK 3: Strategic Thinking)\n4. How is the rusting of metal similar to the weathering of rocks? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Weathering**: The breakdown of materials due to exposure to the environment\n- **Oxidation**: A chemical reaction where something combines with oxygen\n- **Rust**: Iron oxide formed when iron reacts with oxygen and water\n- **Corrosion**: The gradual destruction of materials by chemical reactions\n- **Chemical Reaction**: When substances combine or break apart to form new substances\n- **Chrysalis**: The pupa stage of a butterfly, where it transforms inside a protective shell\n\n## 🌡️ Extension Activities\n\n- Go on a \"weathering walk\" around the school or neighborhood to find examples of weathered rocks, metals, and other materials.\n- Investigate how the red color of Mars is caused by iron oxide (rust) on the surface.\n- Experiment with different ways to prevent weathering, such as using protective coatings or paints.\n- Compare physical weathering (breaking) and chemical weathering (changing) using different materials."
  }
}