{
  "title": "Precipitation_hail",
  "category": "earth-space-science",
  "imageFile": "precipitation_hail.jpg",
  "imagePath": "images/earth-space-science/precipitation_hail.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Hail and the Water Cycle\n\n### Core Science Concepts from Image Analysis\n\n- **Water exists in multiple states:** The photograph shows water frozen as hail (solid ice), illustrating that water can change from liquid to solid form.\n- **Precipitation is a form of water falling to Earth:** Hail is a type of precipitation that falls from clouds, demonstrating how water moves from the atmosphere to Earth's surface.\n- **Earth events can occur quickly:** The formation and fall of hail happens relatively rapidly compared to slow processes like erosion, showing that some natural events occur fast.\n- **Water can be solid or liquid:** The hail stones (solid water) contrasted against the wet ground and moisture suggest the transition between water states and where water is found on Earth.\n\n---\n\n### Lesson Title\n\n**Frozen Rain: Exploring Hail and the Water Cycle**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 2-ESS2-3: Obtain information to identify where water is found on Earth and that it can be solid or liquid.\n  - 2-ESS1-1: Use information from several sources to provide evidence that Earth events can occur quickly or slowly.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n\n1. Identify hail as a form of solid water and describe how it looks and feels different from liquid water.\n2. Explain that water can exist as both a solid (ice/hail) and a liquid, and identify where each form is found in the environment.\n3. Describe hail as a weather event that happens quickly and falls from the sky as precipitation.\n4. Compare hail formation to other types of precipitation and explain why it occurs in the atmosphere.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student interest and activate prior knowledge about water, weather, and ice using the photograph of hail.\n\n- **Materials:**\n  - Printed or projected photograph of hail on ground\n  - Small ice cubes or crushed ice in a clear plastic bag (to pass around)\n  - Chart paper and markers\n\n- **Activity:**\n\n  **Display and Initial Exploration:**\n  Display the photograph of hail on the ground where all students can see it clearly. Ask students to look carefully and describe what they see without naming it yet.\n\n  **Discussion Questions:**\n  1. \"What do you see covering the ground in this picture? What color and shape is it?\"\n  2. \"Have you ever seen something like this fall from the sky? What was it like?\"\n  3. \"Is this the same as rain? How is it different?\" (Accept all responses—this activates prior knowledge.)\n  4. \"What do you think happens to water when it gets very, very cold in the clouds?\"\n\n  **Prediction Prompt:**\n  \"I'm going to show you something cold. I want you to predict: Is this the same as rain, or is it something different? Why do you think so?\" (Pass around the bag of ice cubes so students can feel the cold, solid ice.)\n\n  Write student predictions on chart paper under the heading \"What is Hail?\" to revisit later.\n\n- **Transition:** \"Today, we're going to discover what this frozen stuff is, where it comes from, and how it forms in the sky. Let's explore!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate the properties of solid water (ice) and compare them to liquid water through hands-on experimentation.\n\n- **Materials:**\n  - Small cups of water (liquid)\n  - Small cups with ice cubes or crushed ice (solid water)\n  - Paper towels\n  - Thermometer (optional, for observation)\n  - Small shallow trays or plates\n  - Observation sheet (template provided below) with simple pictures and words\n  - Hand lenses (optional)\n\n- **Activity:**\n\n  **Station Setup:**\n  Divide the class into two or three small groups. Each group rotates through two stations: Station A (Liquid Water) and Station B (Solid Water/Ice).\n\n  **Student Directions (Read aloud and display as visuals):**\n\n  **Station A: Liquid Water**\n  1. Look at the cup of water. What do you see? (Is it clear? Can you see through it?)\n  2. Touch the cup gently. How does it feel? (Cold? Cool? Smooth?)\n  3. Use a spoon or stick to stir it. What happens? (Does it move easily? Does it take the shape of the cup?)\n  4. Draw or write on your observation sheet: \"Water is _____ (liquid/can move/takes the shape of its cup).\"\n\n  **Station B: Solid Water/Ice**\n  1. Look at the ice. What do you see? (Is it clear? What shape is it?)\n  2. Feel the ice cube or crushed ice carefully. How does it feel? (Cold? Hard? Rough?)\n  3. Try to move it or change its shape with your fingers. What happens? (Does it stay the same shape? Does it move easily?)\n  4. Draw or write on your observation sheet: \"Ice is _____ (solid/hard/keeps its shape).\"\n\n  **Connection to Photograph:**\n  After station time, bring students together and ask: \"The hail in the picture looks like the ice at Station B, doesn't it? So hail is frozen water—water that got very cold in the clouds!\"\n\n  **What Students Record:**\n  - Simple drawings comparing liquid water and solid ice\n  - Words or phrases: \"water moves,\" \"ice is hard,\" \"water is clear,\" \"ice is cold,\" etc.\n  - Observations of texture, shape, and behavior\n\n- **Teacher Role:**\n  - Circulate between stations and ask guiding questions: \"What happens when you touch the ice? Is it the same as the water? Can you change its shape?\"\n  - Resist explaining—let students discover through observation and touch.\n  - Encourage use of descriptive words: soft, hard, moves, stays the same, clear, etc.\n  - Prompt students to notice similarities and differences without leading them to conclusions.\n\n- **Expected Student Outcomes:**\n  - Students observe that water and ice have different properties (solid vs. liquid).\n  - Students discover that ice is hard and keeps its shape, while water moves and takes the shape of its container.\n  - Students begin to understand that water can change forms.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce formal vocabulary and the concept of hail as solid water that falls from clouds.\n\n- **Materials:**\n  - Chart paper with vocabulary words and simple pictures\n  - Photograph of hail (displayed again)\n  - Picture cards or simple diagram showing the water cycle with labels\n  - Optional: short video clip (2-3 minutes) showing hail formation or falling hail\n\n- **Activity:**\n\n  **Group Share-Out:**\n  Ask groups to share one observation from the Explore stations. Record key words on chart paper:\n  - \"Ice is hard.\"\n  - \"Water moves.\"\n  - \"Ice stays the same shape.\"\n  - \"Ice is very cold.\"\n\n  **Introduce Vocabulary and Concepts:**\n\n  Display each term with a simple picture and explain in student-friendly language:\n\n  **Vocabulary:**\n\n  1. **Hail** – Ice balls or chunks that fall from clouds during storms. Hail is frozen water that forms high in the sky where it is very, very cold.\n\n  2. **Solid** – Something hard that keeps the same shape. Ice and hail are solids. You cannot pour them like water.\n\n  3. **Liquid** – Something that can move and pour. Water is a liquid. It takes the shape of whatever container it's in.\n\n  4. **Precipitation** – Water that falls from clouds to the ground. Rain, hail, snow, and sleet are all types of precipitation.\n\n  5. **Freeze** – When a liquid (like water) gets so cold that it turns into a solid (like ice).\n\n  **Connect Back to the Photograph and Explore Activity:**\n  \"Remember at Station B? That ice felt hard and cold—it was a solid. The hail in this picture is the same thing! It's frozen water that fell from the clouds. The hail formed high up in the sky where it is very cold. When water freezes, it becomes a solid and stays solid until it melts again.\"\n\n  **Introduce a Simple Water Cycle Idea:**\n  \"Water moves in a circle. Some water evaporates—that means it goes up into the air and becomes invisible. When that water gets very cold high in the sky, it freezes and becomes hail. Then the hail falls down as precipitation. That's the water cycle!\"\n\n  **Check for Understanding:**\n  Ask students quick comprehension questions:\n  - \"Is hail a solid or a liquid?\" (Solid.)\n  - \"Where does hail come from?\" (From the clouds in the sky.)\n  - \"Why is hail hard and cold?\" (Because it's frozen water.)\n  - \"Is hail a type of precipitation?\" (Yes, it falls from clouds.)\n\n- **Expected Student Outcomes:**\n  - Students can define hail, solid, liquid, precipitation, and freeze in age-appropriate terms.\n  - Students understand that hail is frozen water that falls from clouds.\n  - Students recognize hail as a form of precipitation.\n  - Students can explain that water exists in solid and liquid forms.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply their understanding of hail and solid water to a real-world scenario and deepen their knowledge about weather events that occur quickly.\n\n- **Materials:**\n  - Picture cards showing different weather events (rain, snow, hail, sleet, sunshine, clouds)\n  - Chart paper labeled \"Fast or Slow?\"\n  - Optional: actual weather photos or illustrations from books or websites\n  - Small white pom-poms or cotton balls, blue paper, glue sticks (for creating a hail scene)\n\n- **Activity:**\n\n  **Activity Option 1: Fast vs. Slow Weather Events**\n\n  Explain: \"Some weather events happen quickly, and some happen slowly. Remember, hail falls from the sky very fast—that's a quick event! Let's sort other weather events.\"\n\n  Show picture cards of different weather events one at a time. For each, ask: \"Does this happen quickly or slowly?\"\n  - Hail falling → **Fast** (happens in minutes or seconds)\n  - Rain falling → **Fast** (happens in minutes or hours)\n  - Snow forming in clouds → **Slow** (takes a long time)\n  - A cloud forming → **Slow** (takes time)\n  - Water freezing into ice → **Slow** (takes time)\n  - Ice melting in the sun → **Medium** (takes time, but faster than freezing)\n\n  Create a chart with two columns: \"Fast Weather Events\" and \"Slow Weather Events.\" Place picture cards or write event names under the appropriate column.\n\n  **Activity Option 2: Create a Hail Scene**\n\n  Provide students with blue paper (sky), white pom-poms or cotton balls (hail), brown construction paper (ground), and glue.\n\n  Directions:\n  1. Glue your brown ground at the bottom of the blue sky paper.\n  2. Glue white pom-poms as hail falling from the sky and piling on the ground.\n  3. Label your picture: \"This is hail. Hail is frozen water that falls from the sky.\"\n  4. Write or dictate one sentence: \"Hail happens quickly\" or \"Hail is a solid.\"\n\n  **Teacher Role:**\n  - Ask guiding questions during card sorting: \"Will this happen in seconds or in a long time? Why?\"\n  - Encourage students to explain their reasoning using vocabulary from the Explain phase.\n  - Support students in creating their hail scene by helping with cutting and gluing as needed.\n  - Ask students to explain their creations: \"Show me where the hail is coming from. Is it a solid or a liquid?\"\n\n- **Expected Student Outcomes:**\n  - Students categorize weather events by speed (quick vs. slow).\n  - Students apply their understanding that hail is a fast-moving precipitation event.\n  - Students demonstrate through art and writing that hail is frozen water.\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of hail, solid water, precipitation, and the difference between fast and slow Earth events.\n\n- **Activity:**\n\n  **Formative Assessment Throughout the Lesson:**\n  - Observation of student responses during Engage discussion questions\n  - Review of observation sheets from the Explore stations\n  - Listen to student explanations during the Explain phase vocabulary check\n  - Observe student sorting choices and reasoning during the Elaborate activity\n\n  **Exit Ticket (Summative Assessment):**\n\n  Display three simple pictures and ask students to choose one or respond orally (teacher or aide records):\n\n  **Picture 1:** A cup of water (liquid)\n  **Picture 2:** Ice cubes (solid)\n  **Picture 3:** Hail falling from clouds (solid)\n\n  **Questions (read aloud; students can point, draw, or say answers):**\n\n  1. \"Which picture shows a solid?\" (Picture 2 or Picture 3)\n  2. \"Which picture shows a liquid?\" (Picture 1)\n  3. \"Where does hail come from?\" (The sky/clouds)\n  4. \"Is hail a fast event or a slow event?\" (Fast)\n  5. \"Hail is frozen ______.\" (water)\n\n  **Success Criteria:**\n  - Student correctly identifies solids and liquids.\n  - Student can name hail as frozen water.\n  - Student demonstrates understanding that hail falls from clouds.\n  - Student recognizes hail as a fast weather event OR describes hail as precipitation.\n\n  **Expected Student Outcomes:**\n  - Students who meet the learning objectives will correctly identify hail as solid, frozen water; distinguish between solids and liquids; and explain that hail falls quickly from clouds.\n  - Students who exceed expectations will explain the connection between freezing temperatures in clouds and hail formation, or discuss why hail is dangerous/important.\n  - Students who need support will require repetition and visual reminders of the concepts, but may identify hail as \"cold and hard\" even if formal vocabulary is not yet solid.\n\n---\n\n### Differentiation\n\n- **Support (for struggling learners):**\n\n  1. **Simplified Vocabulary:** Use consistent, simple terms throughout. Repeat \"hail is frozen water\" and \"ice is cold and hard\" in every phase. Pair vocabulary words with pictures at all times.\n\n  2. **Hands-On Reinforcement:** Allow these students extra time at the Explore stations and permit them to repeat activities. Provide ice cubes to manipulate frequently and ask open-ended questions: \"What does the ice feel like? Can you change its shape?\"\n\n  3. **Visual Supports:** Create a word wall with pictures of liquid water, solid ice, hail, and clouds. Point to visuals when using vocabulary. Use the photograph repeatedly and have students physically point to hail, ground, and sky to build spatial awareness.\n\n- **Challenge (for advanced learners):**\n\n  1. **Extend Water Cycle Thinking:** Ask: \"Where does the water in the hail go after it melts? Can it become hail again? Why or why not?\" Introduce the terms *evaporation* and *condensation* informally. Have students draw or dictate a longer story of water's journey from ground to sky to hail to ground again.\n\n  2. **Compare Multiple Precipitation Types:** Provide pictures of rain, snow, sleet, and hail. Ask: \"Which of these is solid? Which is liquid? Why do you think hail is round, but snow has points?\" Have students create a comparison chart or make predictions about when each type occurs.\n\n  3. **Investigate Freezing Times:** Set up a simple experiment where students predict and observe how long it takes liquid water to freeze in a freezer. Compare freezing time to the speed of hail falling. Ask: \"Does freezing happen as fast as hail falling? Why not?\"\n\n---\n\n### Extension Activities\n\n1. **Hail Safety and Weather Awareness:** Read aloud an age-appropriate picture book about severe weather (e.g., *Cloudy with a Chance of Meatballs* for fun, or a non-fiction weather book). Discuss: \"What should we do if hail is falling? Is hail dangerous?\" Create a simple safety poster: \"If Hail Falls, Go Inside!\" Students draw and label steps to stay safe.\n\n2. **Water State Transitions Cycle:** Students create a visual cycle showing water → ice → water again. Use pictures or drawings to show: \"Liquid water gets very cold and becomes solid ice (freezing). Solid ice gets warm and becomes liquid water again (melting).\" Extend to include hail: \"Hail is ice that falls and then melts.\"\n\n3. **Local Weather Observation Journal:** Over one to two weeks, students keep a simple weather observation chart marking whether they see rain, sun, clouds, or other weather. If hail occurs locally, students sketch and describe it. This connects to 2-ESS1-1 (evidence that Earth events occur quickly or slowly) by having students observe real events in real time.\n\n4. **Sensory Sorting Activity:** Provide bags or containers with items of different states (water, ice, sand, air). Students sort by \"solid\" and \"liquid\" and explain their choices. This reinforces the concept that many things can be solids or liquids, not just water.\n\n---\n\n**Teacher Notes:**\n\nThis lesson builds foundational understanding of water states and introduces the concept that Earth has rapidly changing events (hail storms) and slowly changing processes. Second graders benefit from frequent hands-on exploration, repetition of vocabulary with visuals, and concrete examples. The photograph serves as an anchor throughout all five phases. If hail has not occurred locally, emphasize that hail is \"like the ice we saw at the station—frozen water from the clouds—and it falls very fast!\"",
  "inputTokens": 218,
  "outputTokens": 4236,
  "cost": 0.021925800000000002,
  "generatedAt": "2026-02-15T05:34:08.505Z"
}