{
  "title": "Precipitation Snow",
  "category": "earth-space-science",
  "imageFile": "precipitation_snow.jpg",
  "imagePath": "images/earth-space-science/precipitation_snow.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Snow and Weather Changes\n\n## Core Science Concepts from Image Analysis\n\n- **Precipitation as a form of water:** Snow is water falling from clouds to Earth in solid form, visible in the photograph as white particles falling on the building and surrounding landscape.\n- **Weather patterns and seasonal changes:** The snowy conditions demonstrate how weather changes the appearance of the land and environment; snow coverage alters how the landscape looks.\n- **Water in different states:** The photograph shows water as a solid (snow) versus the liquid water that was present before freezing, connecting to the water cycle concept.\n- **How water and weather shape our environment:** Snow accumulation and precipitation affect the land, buildings, and vegetation visible in the scene.\n\n---\n\n## Lesson Title\n\n**Falling Snow: Watching Water from the Sky**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** 90 minutes (can be split into two 45-minute sessions)\n- **NGSS Standards:** \n  - 2-ESS2-3: Obtain information to identify where water is found on Earth and that it can be solid or liquid.\n  - 2-ESS1-1: Use information from several sources to provide evidence that Earth events can occur quickly or slowly.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify snow as a form of water that falls from clouds to Earth.\n2. Explain that water can be both solid (snow/ice) and liquid (rain/water).\n3. Describe how snow and precipitation change the land and what we see around us.\n4. Compare how weather events happen at different speeds (snow falling slowly, melting at different rates).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about snow and precipitation using the photograph.\n\n**Materials:**\n- Projected or printed copy of the photograph (large enough for all students to see clearly)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or projector without explanation. Let students look at it silently for 30 seconds.\n\n2. **Ask these four guiding questions** (pause for responses after each):\n   - \"What do you see falling from the sky in this picture?\" (Listen for: snow, white stuff, rain, flakes)\n   - \"Where does the snow land? What does it cover?\" (Listen for: buildings, trees, ground, roof)\n   - \"Have you ever seen snow fall? What did it feel like or look like?\" (Activate personal experience)\n   - \"What do you think happens to all that snow after it falls?\" (Listen for: melts, goes away, makes puddles, turns to water)\n\n3. **Prediction prompt:** Say, \"I'm going to show you what snow really is. I think you'll be surprised! Who wants to find out?\"\n\n4. **Record student wonderings** on chart paper: \"What we want to know about snow.\" Keep this visible for later reference.\n\n**Transition:** \"Let's do an experiment to see what happens when snow melts and turns back into water.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate the properties of ice/snow and discover that frozen water (solid) becomes regular water (liquid) when it melts.\n\n**Materials:**\n- 1 plastic cup per student (or 1 per small group)\n- Ice cubes (or crushed ice in a plastic bag labeled \"pretend snow\")\n- Warm water (in a pitcher, at comfortable touching temperature—not hot)\n- Spoons or craft sticks\n- Paper towels\n- Simple observation recording sheet (template provided below)\n\n**Activity:**\n\n**Step-by-step student directions:**\n\n1. \"Look at your cup with ice cubes (our pretend snow). Feel the cup carefully. What does it feel like? Is it cold or warm?\" (Record: cold)\n\n2. \"Draw or write what you see: Is the ice solid or can you break it apart?\" (Students should observe it's hard and doesn't move.)\n\n3. \"Now, I'm going to pour warm water over your ice. Watch what happens!\" (Teacher adds about 2-3 tablespoons of warm water to each cup.)\n\n4. \"What's happening? Is the ice changing? Draw or write what you see.\" (Give 3-4 minutes for observation.)\n\n5. \"Stir gently with your spoon. Watch the ice. What do you notice?\" (Students observe ice breaking apart and melting.)\n\n6. \"After 5 minutes, look at your cup again. Where did the ice go? What do you see now?\" (Record: it turned into water; the cup now has water, not ice.)\n\n7. \"The ice was solid and hard. Now we have liquid water that we can pour. It's the same water—just changed!\"\n\n**Teacher Role:**\n- Circulate to each student/group; ask open questions: \"What's changing?\" \"Where is the ice going?\" \"What do you think will happen next?\"\n- Do NOT say \"The ice is melting into water\" yet—let students discover and describe it first.\n- Guide students to touch the cup (carefully) to feel the temperature change.\n- Record student observations and language on a sticky note for later reference.\n\n**Expected Student Outcomes:**\n- Students observe that ice (solid) changes into water (liquid) when warmed.\n- Students use words like \"melted,\" \"turned into water,\" \"disappeared,\" \"became liquid.\"\n- Students record observations through drawing or simple writing (e.g., \"Ice was hard. Now it is water.\").\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect the ice-melting experiment to snow in the photograph.\n\n**Materials:**\n- The original photograph (displayed again)\n- Chart paper with three labeled pictures/words: SOLID, LIQUID, SNOW\n- Sentence frame poster: \"Snow is solid water. When it gets warm, snow becomes liquid water.\"\n- Real ice cube (or image of snowflake) and cup of water for demonstration\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Ask: \"What did you discover about the ice in our experiment?\"\n   - Record key words students use: melted, turned into water, got soft, became liquid.\n   - Affirm: \"You discovered something really important!\"\n\n2. **Introduce vocabulary (7 minutes):**\n\n   Display pictures and teach these three terms:\n   \n   - **SOLID:** Something hard and stiff that keeps its shape. (Show ice cube.) \"Ice is solid. You can hold it. It doesn't change shape unless you break it.\"\n   \n   - **LIQUID:** Something that flows and takes the shape of its container. (Show water in cup.) \"Water is liquid. It can pour. It takes the shape of the cup.\"\n   \n   - **SNOW:** Frozen water that falls from clouds. It's solid, like ice. (Point to photograph.) \"Look at this picture—all that white stuff falling is snow. Snow is frozen water.\"\n   \n   - **PRECIPITATION:** Water that falls from the sky. It can be rain (liquid) or snow (solid). (Gesture upward, then down.) \"Precipitation comes from clouds above and falls down to Earth.\"\n   \n   - **MELT:** When solid ice or snow turns into liquid water because it gets warmer. (Demonstrate with remaining ice in warm water.) \"Watch the snow in the photograph. When the weather gets warmer, the snow will melt and turn into water, just like our ice did.\"\n\n3. **Connect back to the photograph (5 minutes):**\n   - Display the snow photograph again.\n   - Say: \"Remember this picture? All that white is snow—frozen water falling from the clouds. Just like our ice, when the sun warms everything up, the snow will melt into water. The water might go into the ground, into puddles, or into rivers.\"\n   - Ask: \"What do you think happens to all that snow?\" (Listen for: melts, turns to water, goes away, soaks in ground.)\n\n4. **Check for understanding:**\n   - Ask individual students: \"Is snow solid or liquid?\" / \"What happens to snow when it gets warm?\"\n   - Observe non-verbal responses: thumbs up/sideways/down for understanding.\n   - Use a quick show-me: \"If I hold up a picture of snow, show me with your hands if it's solid (make a fist) or liquid (wiggle fingers).\"\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Solid** | Something hard and stiff that keeps its shape, like ice or a block. |\n| **Liquid** | Something that flows and pours, like water or juice. |\n| **Snow** | Frozen water that falls from clouds. It's solid and cold. |\n| **Precipitation** | Water that falls from the sky—can be rain (liquid) or snow (solid). |\n| **Melt** | When ice or snow gets warm and turns into water. |\n\n**Expected Student Outcomes:**\n- Students can identify snow as solid water.\n- Students understand that snow and ice can turn into liquid water.\n- Students use the new vocabulary (solid, liquid, snow, melt) in simple sentences.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of snow and water states to a real-world scenario: observing how different places are covered differently by snow.\n\n**Materials:**\n- 2-3 additional photographs showing snowy scenes (optional: one with snow on grass, one with snow on a car, one with snow on trees—search \"snow weather\" for classroom-safe images)\n- Student worksheet: \"Snow Detective\" (template below)\n- Crayons or colored pencils\n- Optional: small sample of cotton balls to represent snow\n\n**Activity:**\n\n1. **Scenario introduction (2 minutes):**\n   - Say: \"Pretend you're a Snow Detective! We're going to look at pictures and figure out where snow lands and what happens to it.\"\n\n2. **Guided exploration (10 minutes):**\n   - Show each additional photograph (or refer back to the original).\n   - For each photo, ask:\n     - \"Where do you see snow?\" (on building, on trees, on ground)\n     - \"Why do you think there's more snow on the tree branches than on the road?\" (Introduce: wind blew it; some melted from friction or sun)\n     - \"If the sun shines on that snow tomorrow, what will happen?\" (it will melt, turn to water)\n   \n3. **Snow Detective worksheet (8 minutes):**\n   - Students complete a simple chart with three rows labeled: BUILDING, TREE, GROUND\n   - Students draw or write: \"Where do I see snow?\" and \"What might happen to this snow?\" (or \"Will it melt fast or slow?\")\n   - Provide sentence frame: \"I see snow on the _______. When it gets warm, the snow will _______.\"\n\n4. **Share findings (5 minutes):**\n   - Ask 3-4 students to share one discovery: \"Where did you find snow? What do you think happens to it?\"\n\n**Teacher Role:**\n- Ask probing questions: \"Why is the snow thicker there?\" / \"Which snow do you think melts first—on the roof or on the ground?\" (Hint: sun's warmth)\n- Affirm all observations and connections to the Explore phase.\n- Guide students to see that snow is water and that warmth causes it to change.\n\n**Expected Student Outcomes:**\n- Students identify snow in multiple contexts (buildings, trees, ground).\n- Students predict what happens to snow when it warms up.\n- Students apply the concept that snow is solid water that melts into liquid water.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of snow as solid water and the concept of melting.\n\n**Activity:**\n\n**Formative assessments (used throughout lesson):**\n- Observation during Explore: Were students able to describe the ice changing to water?\n- Vocabulary check during Explain: Can students point to and identify solid vs. liquid?\n- Snow Detective worksheet: Can students locate snow and predict melting?\n\n**Exit ticket (summative assessment):**\nProvide each student with a simple exit ticket. Read questions aloud; students draw, write, or circle answers:\n\n**Question 1:** \"Is snow solid or liquid?\"\n- (Provide pictures: a hard block of ice labeled SOLID, and water in a cup labeled LIQUID. Students point or circle.)\n\n**Question 2:** \"What happens when snow gets warm?\"\n- (Provide three options with pictures):\n  - A) Snow stays the same\n  - B) Snow melts and becomes water\n  - C) Snow floats away\n- (Students circle the correct answer or draw what happens)\n\n**Question 3:** \"Where does snow come from?\"\n- (Open response with visual support): \"Snow falls from the _______ (sky/clouds).\"\n\n**Success Criteria:**\n- ✓ Student correctly identifies snow as solid.\n- ✓ Student explains that snow melts into water when warm.\n- ✓ Student identifies that snow comes from the sky/clouds.\n\n**Expected Student Outcomes:**\n- At least 80% of students will correctly identify snow as solid water.\n- At least 75% of students will demonstrate understanding that snow melts into water.\n- Students will use the terms \"snow,\" \"solid,\" \"liquid,\" or \"melt\" in their responses.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Use concrete manipulatives:** Provide actual ice cubes and warm water for every student (not just a demonstration). Tactile learners benefit from hands-on experience with all senses.\n\n2. **Simplified vocabulary:** Use only two terms initially: \"HARD (solid)\" and \"WET WATER (liquid).\" Introduce \"snow\" and \"melt\" as descriptive words before formal terms.\n\n3. **Visual anchor chart:** Create a large, colorful chart with three columns:\n   - SNOW (picture of snowflake + real cotton ball)\n   - MELTS (arrow)\n   - WATER (picture of water drop)\n   - Keep this visible throughout the lesson. Point to it frequently and have struggling students repeat the sequence multiple times.\n\n4. **Partner with a stronger peer:** During Explore, pair a struggling student with a peer who can model observations and use vocabulary. The peer can help record findings.\n\n5. **Simplified exit ticket:** Use only multiple-choice or point-to-picture options for students with writing or processing delays. Avoid open-ended prompts.\n\n### Challenge (for advanced learners):\n\n1. **Extend the water cycle:** Ask advanced students, \"After snow melts into water, where does that water go?\" Introduce evaporation: \"The sun can turn water back into invisible water in the air—this is called evaporation.\" Create a simple diagram showing: Snow → Water → Evaporation → Clouds → Snow again.\n\n2. **Investigate temperature:** Provide thermometers (or simple warm/cold indicators). Ask: \"How warm does it need to be for snow to melt? Let's test!\" Use cups at different temperatures (cool, warm, hot—safely) and time how long ice takes to melt in each. Record and compare.\n\n3. **Real-world problem:** Present a scenario: \"A city is having a big snowstorm. Roads are covered with snow. What are two ways people could make the snow melt faster?\" (salt, heat from equipment, dark surfaces absorb more heat). Have students sketch or explain one solution.\n\n4. **Research snow types:** Provide images of different snow forms (powdery, icy, slushy). Ask: \"Why does snow look different? What causes these changes?\" Guide them to consider temperature, wind, and how long snow has been on the ground.\n\n5. **Measurement and prediction:** Ask advanced students to estimate: \"How much snow fell in our photograph? How long do you think it would take to melt?\" Encourage them to compare melting times of ice in different conditions (sunlight, shade, warm room, cold room).\n\n---\n\n## Extension Activities\n\n1. **Snow Simulation in a Bag (follow-up activity, 10 minutes):**\n   - Students create a mini \"snow cycle\" in a ziplock bag.\n   - Layer: damp soil, ice cubes (snow), seal the bag.\n   - Leave in sunlight for 2-3 hours. Students observe condensation (water vapor) forming on the bag and returning to liquid—a mini evaporation and condensation cycle.\n   - Discussion: \"Where did the water come from? Where is it going?\"\n\n2. **Weather Journal with Photographs (ongoing, 5 minutes daily):**\n   - Over two weeks, students observe and record daily weather.\n   - On snowy days (or rainy days as an alternative), they draw or photograph the weather and write one sentence: \"Today it is snowing/raining. The precipitation is solid (snow) / liquid (rain).\"\n   - Track how weather changes the landscape each day. Compare day 1 (snowy) to day 7 (melted).\n   - This reinforces 2-ESS1-1 (Earth events occurring quickly or slowly).\n\n3. **Create a \"Snow Melting\" Prediction Graph (hands-on math integration, 15 minutes):**\n   - Place an ice cube on a plate in the sun, another in the shade.\n   - Predict: Which will melt first? How long will it take?\n   - Students draw or color a simple bar graph showing predictions vs. actual results.\n   - Discuss: \"What made one melt faster? Was it fast or slow?\"\n   - This reinforces slow vs. fast Earth events (2-ESS1-1).\n\n---\n\n## Notes for Teachers\n\n- **Safety:** Ensure warm water is at a comfortable touching temperature (around 100-110°F), never hot. Test it yourself first.\n- **Timing:** This lesson can be split across two days: Day 1 (Engage + Explore: 30 minutes) and Day 2 (Explain + Elaborate + Evaluate: 60 minutes).\n- **Real snow alternative:** If your region doesn't experience snow, use crushed ice or provide detailed photographs and real ice for the Explore phase—the conceptual understanding is identical.\n- **Inclusivity:** Ensure students who have never seen snow understand it's a real phenomenon that happens in many places. Show varied landscapes and cultures with snow to broaden perspective.\n- **Connection to prior knowledge:** Ask about winter, holidays, and seasonal changes to activate existing understanding before the lesson.",
  "inputTokens": 2380,
  "outputTokens": 4335,
  "cost": 0.024055,
  "generatedAt": "2026-02-13T02:30:13.585Z"
}