{
  "title": "Precipitation_hail",
  "category": "earth-space-science",
  "imageFile": "precipitation_hail.jpg",
  "imagePath": "images/earth-space-science/precipitation_hail.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- Small, translucent spheres of varying sizes scattered across brown soil/ground\n- Clear, rounded ice formations (some larger, some tiny)\n- A natural outdoor surface with exposed earth and rocks\n- Light reflecting through the ice, showing internal structure\n- Mixed distribution of ice pieces—some clustered, some isolated\n\n### Reasonable Inferences\n1. **From ice spheres + soil surface** → These are hailstones that have fallen during a storm; the ground captured them before melting.\n2. **From size variation** → Hailstones grew at different rates in the atmosphere, suggesting layered ice formation.\n3. **From transparent structure** → The ice formed from water freezing and refreezing, building layers like an onion.\n\n---\n\n### Engineering Task\n\n**K–2 (Playful Building Challenge):**\nYour job is to **build a catcher** that can hold falling ice balls without breaking them. Use cups, paper, or soft materials to make a holder that stops ice from bouncing away. Test it by dropping ice balls into it. Does your catcher keep the ice safe?\n\n**3–5 (Constraint-Based Challenge):**\nDesign and build a **hail collection and protection device** that:\n- Catches falling spheres (ice balls or marbles as models) without them bouncing away\n- Protects collected pieces from melting or breaking for at least 10 minutes\n- Uses only classroom materials (foam, cotton, cloth, containers)\n- Must have a funnel or opening at least 15 cm wide\n- Success criterion: Collect at least 5 pieces and measure how many remain unbroken and unfragmented after the time limit\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem** — This photo shows a natural phenomenon (hail impact on ground) without an obvious human solution present. Students must first identify the problem (\"How do we safely catch and preserve hail?\") before designing, making this phase the natural starting point.\n\n---\n\n### Suggested Materials\n1. Paper cups or plastic containers\n2. Foam sheets or packing peanuts\n3. Cotton balls or cloth scraps\n4. Paper funnels or rolled paper\n5. Ice cubes or small marbles (to simulate hailstones)\n\n---\n\n### Estimated Time\n**One 45-minute session** (K–2: define + build + test one design)  \n**Two 40-minute sessions** (3–5: define + plan, then build + test + refine)\n\n---\n\n### Why This Works for Teachers\nThis challenge directly addresses **NGSS ETS1.A (defining engineering problems)** and **ETS1.B (developing solutions)** by having students identify a real-world need (protecting falling ice) and prototype a practical solution using available materials.",
  "inputTokens": 2198,
  "outputTokens": 641,
  "cost": 0.005403,
  "generatedAt": "2026-02-15T05:31:36.951Z"
}