{
  "title": "Precipitation Snow",
  "category": "earth-space-science",
  "imageFile": "precipitation_snow.jpg",
  "imagePath": "images/earth-space-science/precipitation_snow.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Snow and Weather Patterns\n\n## Core Science Concepts from Image Analysis\n\n- **Precipitation:** Water falling from clouds to Earth in the form of snow (visible in the photograph)\n- **Weather patterns and conditions:** Observable changes in local weather conditions over time (snow falling, cloudy sky, cold temperature conditions)\n- **Seasonal changes:** Seasonal weather variations and how they affect environments and living things (trees losing leaves, preparing for winter)\n- **Human and environmental interaction:** How buildings and structures (the brick building, courtyard) provide shelter from weather conditions\n\n---\n\n## Lesson Title\n\n**Snowflakes Are Falling! Observing Weather Changes**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total), or can be divided across two days\n- **NGSS Standards:** \n  - K-ESS2-1: Use and share observations of local weather conditions to describe patterns over time.\n  - K-ESS3-2: Ask questions to obtain information about the purpose of weather forecasting to prepare for, and respond to, severe weather.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n- **Observe and describe** what happens during snow and cold weather using words and pictures\n- **Identify snow** as a type of weather that falls from clouds\n- **Explain** why people and animals need shelter and warm clothes when it snows\n- **Predict** what the weather might be like tomorrow based on observing patterns\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of falling snow.\n\n**Materials:**\n- Printed or projected photograph of the snowing courtyard (color, large display)\n- Chart paper and markers\n- Document camera (optional, for displaying the photo large)\n\n**Activity:**\n\n1. **Display the photograph** using a projector or document camera. Make it large so all students can see clearly. Ask students to sit in a carpet circle where they can all view the image comfortably.\n\n2. **Pose these discussion questions one at a time, allowing think-pair-share time:**\n   - \"What is falling from the sky in this picture? What does it look like?\" (Guide toward: snow, white, fluffy, small pieces)\n   - \"What do you think it feels like when snow falls on your hand?\" (Cold, wet, soft)\n   - \"Why do you think there are green trees and buildings in this picture if it's snowing?\" (Set context that snow falls on outdoor places where people live and plants grow)\n   - \"Have you ever seen snow? What were you wearing? Why do you think people wear those things?\" (Lead to: clothing protects us from cold)\n\n3. **Wonder prompt:** \"I wonder what would happen if we tried to catch snowflakes in a jar. Would we be able to keep them?\" Write student predictions on chart paper in simple words (even if predictions are fanciful—Kindergarten thinking is concrete and imaginative).\n\n**Transition:** \"Today, we're going to do an experiment to see what snow is like, and then we'll talk about why snow is important weather!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate the properties of snow/cold weather through sensory exploration and data recording.\n\n**Materials:**\n- 1-2 containers of clean, fake snow (available at craft stores) OR ice cubes in a cooler as an alternative\n- Shallow trays (4-5 for groups of 4-5 students)\n- Magnifying glasses (1 per student or shared)\n- Watercolor paper or white construction paper (1 per student)\n- Tempera paint in cool colors (blue, white, light blue)\n- Paint brushes\n- Small cups of water (one per group)\n- Paper towels\n- Clipboards and paper for simple weather observations\n\n**Activity:**\n\n1. **Set up exploration stations** with fake snow or ice cubes in shallow trays. Divide the class into 2-3 rotation groups so students can explore without crowding.\n\n2. **Student directions (delivered simply and demonstrated):**\n   - \"First, feel the snow/ice with your fingers. Is it cold? Is it wet? What does it feel like?\" (Students touch and describe to a partner)\n   - \"Now, use your magnifying glass to look very closely at the snow. What shapes do you see? Are the pieces big or small?\" (Students look and point out details)\n   - \"Watch what happens when we add a drop of water to the snow. What happens? Is the snow still there?\" (Observe melting; this connects to water cycle informally)\n   - \"Sprinkle some snow on your paper. What do you notice?\" (Some melts, some stays, it's wet, etc.)\n\n3. **Documentation:**\n   - Students draw or paint what they observed using cool-colored paints on watercolor paper. Teacher circulates and asks: \"What did the snow feel like? What did you see when you looked closely?\"\n   - Students place a mark on a simple weather chart (smiley face if they liked touching it, circle if it was okay, etc.)\n\n4. **Teacher Role:**\n   - Circulate and ask open-ended questions: \"Tell me what you're noticing.\" \"Why do you think it melted?\" \"Is it cold or warm?\"\n   - Avoid correcting observations; guide curious thinking\n   - Take photos or anecdotal notes on student statements and reactions\n   - Use language: \"That's an interesting observation!\" \"What else are you noticing?\"\n\n**Expected Student Outcomes:**\n- Students experience cold temperature (sensory learning)\n- Students observe that snow melts when warmed or touched\n- Students create a visual representation of their observation\n- Students use describing words: cold, wet, soft, melting, small pieces\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to weather patterns.\n\n**Materials:**\n- Chart paper with simple weather vocabulary already written and illustrated\n- Student artwork from Explore phase\n- Photograph (displayed again)\n- Picture cards of different weather types (sunny, rainy, snowy, cloudy)\n- Small whiteboard or easel\n\n**Activity:**\n\n1. **Gather students on the carpet.** Display the photograph again.\n\n2. **Share observations from Explore phase:**\n   - \"Let's talk about what we learned when we touched the snow and watched it change. Who wants to tell what they noticed?\" (Call on 3-4 students)\n   - Hold up student paintings and have the artist briefly describe: \"You painted blue and white—that looks like snow falling!\"\n\n3. **Introduce vocabulary with visuals and simple definitions:**\n\n   | **Vocabulary Term** | **Student-Friendly Definition** | **Visual Support** |\n   |---|---|---|\n   | **Snow** | Cold, white water falling from clouds in tiny pieces | Point to snow in photo |\n   | **Weather** | What the air and sky are like outside (hot, cold, rainy, snowy) | Show picture cards |\n   | **Cold** | A low temperature that makes us feel chilly; snow only falls when it's cold | Have student recall: \"Did the snow feel hot or cold?\" |\n   | **Melting** | Something solid (like snow) turning into liquid (water) when it gets warmer | Demonstrate: \"The snow got wet and turned to water—that's melting!\" |\n   | **Clouds** | The white or gray parts of the sky where water and precipitation come from | Point to sky in photo |\n\n4. **Connect back to the photograph:**\n   - \"In this picture, snow is falling from the clouds. That's because it was very cold. The building is there to keep people safe and warm. The trees are still there even though it's snowing!\"\n\n5. **Check for understanding:**\n   - Ask: \"Is snow hot or cold?\" (Students respond chorally: \"Cold!\")\n   - Ask: \"What happened to the snow when we touched it?\" (It melted/turned to water)\n   - Ask: \"Where does snow come from?\" (Clouds)\n   - Ask: \"Who can point to the clouds in this picture?\"\n\n**Expected Student Outcomes:**\n- Students use the word \"snow\" and \"cold\" appropriately\n- Students understand that snow falls from clouds\n- Students know that snow melts when it gets warm\n- Students can identify weather in the photograph\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting weather needs and connecting to real-world scenarios.\n\n**Materials:**\n- Picture cards: children wearing summer clothes, winter clothes (snow boots, coat, mittens, hat)\n- Paper dolls or cutouts of simple people shapes\n- Pre-drawn outline of a winter scene (bare trees, building) on large chart paper\n- Crayons, markers, stickers\n- Real items (if available): child-sized winter hat, gloves, scarf\n- Simple weather observation chart (printed template)\n\n**Activity:**\n\n1. **Scenario-based thinking:**\n   - \"If it's snowing outside like in the picture, what would you need to wear to stay warm and dry?\" (Show picture cards of winter clothing)\n   - Hold up items (hat, gloves) and ask: \"Would you wear this in snow? Why?\"\n   - Have 3-4 volunteers come up and act out putting on winter clothes\n\n2. **Create a collaborative winter scene:**\n   - Provide the large chart paper with a simple scene (building, trees, sky)\n   - Pass out paper dolls or ask students to draw simple people shapes\n   - \"Let's create a snowy day scene. I want you to draw your person in winter clothes and place them in this snowy picture. Do they need a coat? A hat? Why?\"\n   - Students collaborate by adding their figures to the scene, discussing why certain clothing choices matter\n\n3. **Weather prediction practice:**\n   - Show the photograph again and ask: \"Look at this snowy day. What will tomorrow's weather be like? Will it still be snowing? Will it be cold?\"\n   - Provide a simple template: \"Tomorrow I think...\" with pictures of sunny, snowy, or rainy options\n   - Students point to or circle what they predict\n\n4. **Teacher Role:**\n   - Facilitate discussion without lecturing\n   - Ask follow-up questions: \"Why do you think people need to wear a coat in the snow?\"\n   - Validate creative predictions: \"That's a good thought! Let's think about what happens when it stays cold...\"\n\n**Expected Student Outcomes:**\n- Students understand that snow weather requires protective clothing\n- Students make predictions about future weather based on patterns\n- Students explain the connection between weather and human needs (shelter, warm clothes)\n- Students create a visual product showing winter scene understanding\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of snow, weather, and weather preparation.\n\n**Activity:**\n\n**Formative Assessment (ongoing during lesson):**\n- Observe students during Explore phase—do they accurately describe temperature (cold)?\n- Listen to student language during Explain phase—are they using \"snow,\" \"cold,\" and \"melting\" correctly?\n- Note student responses to direct questions about the photograph (Where do clouds? What does snow feel like?)\n\n**Summative Assessment - Exit Ticket (administered at end of Day 2):**\n\nUse one of these methods depending on your class:\n\n**Option A: Visual Response**\n- Show the photograph again\n- Ask: \"Draw or point to the snow in this picture. Show me where it's falling from.\"\n- Ask: \"What should you wear if you go outside in this snowy weather? Draw one piece of clothing.\"\n\n**Option B: Oral Response (teacher asks individually or in small group)**\n- \"Tell me one thing you learned about snow.\" (Accept any response: \"It's cold,\" \"It falls from the sky,\" \"It melts,\" etc.)\n- \"If you went outside right now and it was snowing, what would you wear? Why?\"\n- \"What was your favorite part of our snow exploration? Why?\"\n\n**Option C: Simple Checklist (Teacher observation)**\nCheck if student can:\n- ☐ Identify snow as cold precipitation (formal term not needed; evidence: calls it \"snow,\" says \"cold\")\n- ☐ Describe what happens when snow melts\n- ☐ Explain why people wear warm clothes in snow\n- ☐ Make a simple prediction about weather\n\n**Success Criteria for Meeting Learning Objectives:**\n- **Mastery:** Student identifies snow, describes it as cold, explains melting, and connects to clothing/shelter needs\n- **Developing:** Student identifies snow and describes it as cold; may need prompting for other connections\n- **Beginning:** Student shows curiosity about snow/weather; may focus on sensory details without formal connections\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding that snow is cold precipitation\n- Students show awareness that weather affects clothing and shelter needs\n- Students make connections between the photograph and their own weather experiences\n\n---\n\n## Differentiation\n\n### Support (for Struggling Learners)\n\n1. **Simplified vocabulary:** Use only \"snow,\" \"cold,\" and \"water\" during Explain phase; introduce \"melting\" in context without formal label if overwhelming\n   - Pair these students with patient peers during group activities\n   - Use more visuals and fewer words; point to pictures in the photograph instead of asking \"where\" questions\n\n2. **Concrete, repeated exploration:** Allow struggling learners extra time at the Explore station with fake snow\n   - Provide a picture card showing what snow looks like so they can reference it\n   - Ask simpler questions: \"Is this hot or cold?\" (yes/no response) rather than open-ended\n\n3. **Pre-teach vocabulary:** Before the lesson, show the student a real image of snow and say: \"This is snow. It's very cold.\" Show them a picture of melting snow: \"When it gets warm, the snow melts and becomes water.\"\n\n### Challenge (for Advanced Learners)\n\n1. **Prediction and documentation:** Provide a \"weather journal\" template where students draw the weather for 3 consecutive days and record predictions\n   - Ask: \"If it's snowing today and it stays cold, what do you think will happen to the snow tomorrow?\"\n   - Introduce the concept that snow stays on the ground if it remains cold\n\n2. **Extended vocabulary and concept exploration:** Introduce \"precipitation\" as \"water falling from clouds\" that can be rain, snow, or sleet\n   - Ask: \"What's different about snow and rain? When do we get snow instead of rain?\"\n   - Connect to water cycle vocabulary (evaporation, condensation, precipitation) using child-friendly language: \"Water goes up into the clouds and comes back down as snow or rain\"\n\n3. **Research and share:** Have advanced learners interview family members: \"When was the last time it snowed? What was the temperature? What did you wear?\"\n   - Students share findings with class; create a simple class graph of \"It was very cold\" or \"It was a little cold\"\n\n---\n\n## Extension Activities\n\n1. **\"Snow\" sensory bin for future learning stations:**\n   - Fill a sensory bin with fake snow, small containers, shovels, and measuring cups\n   - Students explore volume, scooping, pouring—connecting to math concepts\n   - Label with picture cards: \"Snow is cold,\" \"Snow melts,\" \"Snow is white\"\n\n2. **Winter clothing sort and match activity:**\n   - Provide picture cards of weather types (sunny, snowy, rainy) and clothing items (t-shirt, winter coat, umbrella, boots)\n   - Students match clothing to weather: \"This coat goes with snowy weather because...\"\n   - Extend: Create a \"Getting Ready for Snow\" checklist poster students can illustrate\n\n3. **Read-aloud follow-up with winter/snow-themed books:**\n   - Suggestions: *Snowflakes* by Loretta Holland, *The Snowy Day* by Ezra Jack Keats, or *Snow* by Manya Stojic\n   - After reading, ask: \"How is the snow in this book like the snow in our photograph? How is it different?\"\n   - Students draw their favorite part and dictate a sentence to the teacher: \"I like snow because...\"\n\n---\n\n## Notes for Teacher Implementation\n\n- **Timing flexibility:** This lesson can be taught as two 30-minute sessions on consecutive days, or condensed into one 60-minute session with adapted transitions\n- **Weather connection:** If it's currently winter/snowing in your area, students will have greater engagement; if not, the photograph and fake snow provide authentic sensory learning\n- **Fake snow alternative:** If unavailable, use ice cubes (which is equally cold and will melt), or bring in snow from outside if possible (store in a freezer-safe container)\n- **Safety notes:** Supervise closely during cold/wet explorations; have paper towels available; ensure students wash hands afterward\n- **Assessment emphasis:** For Kindergarten, prioritize observation and description over formal testing; students should demonstrate understanding through play, conversation, and drawing",
  "inputTokens": 2434,
  "outputTokens": 3941,
  "cost": 0.022139,
  "generatedAt": "2026-02-13T02:28:43.301Z"
}