{
  "title": "Precipitation Snow",
  "category": "earth-space-science",
  "imageFile": "precipitation_snow.jpg",
  "imagePath": "images/earth-space-science/precipitation_snow.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: When Snow Falls from the Sky\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Precipitation as a form of water:** Snow is frozen water that falls from clouds to Earth during certain weather conditions.\n- **Seasonal weather patterns:** Snow falls during colder times of year (winter), making snow a predictable seasonal event.\n- **Observable weather changes:** Snow visibly changes what we see outdoors—trees, buildings, and the ground look different when covered with snow.\n- **Connection between seasons and daylight:** Winter, when snow occurs, has less daylight than other seasons, helping students recognize patterns in Earth's cycles.\n\n---\n\n## Lesson Title\n\n**Falling Snow: Watching Winter Weather**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total) or flexible introduction + follow-up over 2-3 days\n- **NGSS Standards:** \n  - **1-ESS1-2** Make observations at different times of year to relate the amount of daylight to the time of year.\n  - **1-ESS1-1** Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe what snow is** and how it falls from the sky during winter.\n2. **Recognize that snow is a type of weather** that happens at certain times of year.\n3. **Connect seasonal changes** (winter brings snow and less daylight) to weather observations.\n4. **Record observations using drawings and words** to show what they see when it snows.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about snow and winter weather using the photograph.\n\n**Materials:**\n- Projected or printed copy of the snow photograph (large enough for all to see)\n- Chart paper and markers (for recording wonderings)\n- Optional: A cotton ball or piece of white yarn to represent snowflakes\n\n**Activity:**\n\n1. **Display the photograph** on the board or screen. Say: *\"Look closely at this picture. What do you notice falling from the sky? What's happening in this picture?\"*\n\n2. **Ask these discovery questions** (pause after each for student responses):\n   - *\"What is falling down in this picture? Have you ever seen this before?\"*\n   - *\"When do you see this white, cold stuff falling? What time of year is it?\"*\n   - *\"How does everything look different when this happens? What changed?\"*\n   - *\"Why do you think the trees and buildings are covered with this white stuff?\"*\n\n3. **Wonder prompt:** Say: *\"I wonder... where does all this white, cold stuff come from? Does it come from the ground, or does it come from the sky? Let's find out!\"* Write student wonderings on chart paper.\n\n4. **Optional engagement boost:** Hold up a cotton ball or piece of white yarn. Say: *\"This is like a snowflake. It's so light and fluffy, it floats down from the clouds. What do you think happens to it when it lands?\"*\n\n**Transition:** *\"You have lots of great ideas! Now let's do an activity to see how snow falls and what happens when it lands on cold things.\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how water and temperature interact to create snow-like precipitation through a hands-on simulation.\n\n**Materials:**\n- Ice cubes (pre-made; 1-2 per student or small group)\n- Small cups or shallow dishes\n- Warm water (in a warm container; teacher-prepared)\n- Cold water (in a separate container)\n- Paper towels\n- Student observation sheets (simple drawings with labels like \"Before\" and \"After\")\n- Crayons or colored pencils\n\n**Activity:**\n\n**Step-by-step student directions:**\n\n1. *\"Take your ice cube. Hold it in your hand (over a paper towel). What does it feel like? Is it cold?\"* (Students observe and feel.)\n\n2. *\"Now, place your ice cube in a cup of cold water. Look at it carefully. Does anything change? Can you see any white, frosty stuff around it?\"* (Students observe for 1-2 minutes.)\n\n3. *\"Now, let's try something different. Watch what happens when we put a new ice cube in warm water. The teacher will do this together.\"* (Teacher demonstrates putting an ice cube in warm water and asks: *\"What happens? Does the ice stay the same, or does it change?\"*)\n\n4. *\"Here's your job: Draw a picture of what your ice cube looked like at the start. Then draw a picture of what it looks like now, after sitting in cold water. Label your pictures 'Cold Water' and 'Warm Water.'\"*\n\n5. *\"As you draw, think about this: Ice is frozen water. In real snow, frozen water (ice) falls from clouds in the sky. When it's very cold outside, it stays frozen and becomes snow!\"*\n\n**How it connects to the photograph:**\nThe ice melting (or staying frozen) helps students understand that temperature matters for snow. In the photograph, it's cold enough that water stays frozen and becomes snow instead of melting into rain.\n\n**What students should record:**\n- Drawings showing the ice before and after\n- Words or labels: \"cold,\" \"frozen,\" \"ice,\" \"water\"\n- Observations: *\"The ice was hard and cold. It didn't melt as fast in cold water.\"*\n\n**Teacher Role:**\n- Circulate and ask guiding questions: *\"Is your ice changing? Why do you think that is?\"* and *\"Where does snow come from—the ground or the sky?\"*\n- Avoid telling students the answer; instead, ask them to observe and describe what they see.\n- Provide sentence starters: *\"I see... I notice... The ice is...\"*\n\n**Expected Student Outcomes:**\nStudents will observe that ice melts more slowly in cold water and understand that cold temperatures keep water frozen (like snow in winter).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student observations to snow and seasonal patterns.\n\n**Materials:**\n- The snow photograph (projected again)\n- Chart paper with key vocabulary written in large letters\n- Simple picture cards showing: cloud, snow, winter, cold, frozen\n- \"Snow Observation Anchor Chart\" (teacher-created, to be completed with students)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Ask 3-4 students to share their ice observations: *\"What did you see happen? Did the ice change?\"*\n   - Record their words on chart paper: *\"The ice was cold and hard. It didn't change much in cold water. It melted in warm water.\"*\n\n2. **Introduce vocabulary (8 minutes):**\n\n   Present these terms using the photograph and real-world examples:\n\n   | **Vocabulary Term** | **Student-Friendly Definition** | **Show It** |\n   |---|---|---|\n   | **Snow** | Cold water that falls from clouds and looks white and fluffy. It's frozen. | Point to snow in photo |\n   | **Frozen** | So cold that water turns hard like ice. It can't move. | Show ice cube from Explore |\n   | **Winter** | The coldest time of year. Snow falls in winter. | Ask: *\"When do you see snow?\"* |\n   | **Cold** | A low temperature. Things freeze when it's very cold. | Ask: *\"Did your ice stay frozen in cold water?\"* |\n   | **Precipitation** | Water that falls from the sky. Rain, snow, and hail are types of precipitation. | Point to falling snow in photo |\n\n3. **Connection back to photograph and activity (5 minutes):**\n   - *\"Look at the picture again. The snow is falling because the air is very, very cold. Remember your ice cube? When water gets very cold, it turns into ice and freezes. In the clouds high up in the sky, it's super cold. So the water freezes and becomes snow!\"*\n   - *\"Snow is precipitation—that means it falls from clouds. It's like rain, but it's frozen!\"*\n\n4. **Check for understanding (2 minutes):**\n   - Ask: *\"Turn to a partner and tell them: Is snow cold or warm?\"*\n   - Ask: *\"Point to the sky in our picture. Where is the snow coming from?\"*\n   - Ask: *\"When does it snow? Which season is it?\"*\n\n**Vocabulary:**\n- **Snow:** Frozen water that falls from clouds; looks white and fluffy\n- **Frozen:** So cold that water becomes hard like ice\n- **Winter:** The coldest time of year when snow can fall\n- **Cold:** A low temperature that freezes water\n- **Precipitation:** Water falling from the sky (rain, snow, sleet, hail)\n\n**Expected Student Outcomes:**\nStudents can use the word \"snow\" and \"frozen\" correctly; they understand snow comes from clouds and falls during winter when it's cold.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding by making personal observations and predictions about snow in winter.\n\n**Materials:**\n- \"My Winter Weather Journal\" template (one per student; see below)\n- Crayons, markers, or colored pencils\n- Window access (if possible, to observe real weather)\n- Chart showing the months of winter (December, January, February in most U.S. regions)\n\n**Activity:**\n\n**Option A: Window Observation (if weather permits real snow; 10-15 minutes):**\n\n1. If snow is currently falling or visible, take students to a window or outside (with coats).\n2. Ask: *\"Look! Do you see snow falling? Count how many snowflakes you can see in 30 seconds. What shapes do you notice? Where is it coming from?\"*\n3. Have students draw what they see in their Winter Weather Journal.\n4. Ask: *\"Is this the same as the snow in our picture? How is it the same? How is it different?\"*\n\n**Option B: Winter Scene Creation (if actual snow is not available; 15-20 minutes):**\n\n1. Provide students with the \"Winter Scene\" activity sheet (drawing template showing a simple landscape with sky, ground, trees).\n2. *\"Draw snow falling in this picture. Show where the snow comes from (the sky). Show what happens to the snow (it lands on trees and the ground, like in our photograph).\"*\n3. As students draw, ask: *\"Why does snow fall in winter? What makes it so cold that water freezes? When do you think you'll see real snow?\"*\n4. Have students label or dictate: \"This is snow.\" \"It's cold.\" \"Snow falls in winter.\"\n\n**Option C: Seasonal Pattern Investigation (10 minutes + ongoing):**\n\n1. Show a calendar highlighting winter months.\n2. *\"Snow usually falls in these months: December, January, and February. These are the coldest months. In spring and summer, it's too warm for snow.\"*\n3. Ask: *\"What do you think happens to snow when the weather gets warmer in spring?\"* (Scaffold: *\"Does it stay frozen, or does it melt into water?\"*)\n4. Have students predict: *\"Will we see snow this winter? When?\"*\n\n**Teacher Role:**\n- Facilitate observation and description without judgment.\n- Ask open-ended questions: *\"What do you notice? Why do you think that happens?\"*\n- Validate all responses; correct misconceptions gently: *\"Good thinking! Here's another way to think about it...\"*\n\n**Expected Student Outcomes:**\nStudents create drawings or write observations showing that snow falls from the sky in winter, connects to the photograph, and demonstrates understanding that cold weather = frozen water.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of snow as precipitation and its connection to winter seasons and cold temperatures.\n\n**Activity:**\n\n**Formative Assessment (ongoing during lesson):**\n- **During Engage:** Listen to student responses to photographs questions. Do they recognize snow? Do they know it's winter?\n- **During Explore:** Observe whether students can describe the ice and make predictions about temperature.\n- **During Explain:** Ask check-for-understanding questions. Can students use \"snow,\" \"cold,\" and \"frozen\" correctly?\n- **During Elaborate:** Review drawings and listen to student explanations. Do they show snow falling from the sky?\n\n**Exit Ticket / Summative Assessment (5-10 minutes, end of lesson):**\n\nAdminister one of the following based on student needs:\n\n**Option 1: Picture-Based Assessment (for all learners)**\nShow three images: \n- Image A: Snow falling from clouds\n- Image B: Rain falling\n- Image C: Sun and blue sky\n\nAsk: *\"Point to the picture that shows snow. Point to the picture that shows the coldest weather.\"* Students point or circle.\n\n**Option 2: Statement Response (for students ready for more complex thinking)**\nRead these statements. Students show thumbs up (true) or thumbs down (false):\n1. *\"Snow is frozen water that falls from the sky.\"* (True)\n2. *\"Snow falls when it's warm outside.\"* (False)\n3. *\"Winter is a cold time of year.\"* (True)\n4. *\"Snow comes from the ground.\"* (False)\n\n**Option 3: Draw and Label (open-ended, works for all levels)**\n*\"Draw a picture of snow falling. Label the sky and the snow. Tell me or write: Why does it snow in winter?\"*\n\n**Success Criteria for Student Understanding:**\n✓ Student can identify snow in a photograph.\n✓ Student knows snow is cold and frozen.\n✓ Student understands snow falls from the sky (clouds).\n✓ Student connects snow to winter (cold season).\n✓ Student can describe what they observed in the Explore activity.\n\n**Expected Student Outcomes:**\nMost students will demonstrate understanding that snow is frozen precipitation that falls in winter. Advanced students will begin to make connections between temperature and state of water (solid ice vs. liquid water).\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary focus:** Teach only \"snow\" and \"cold\" initially. Add other terms gradually in subsequent lessons.\n   - Use the photograph repeatedly and point to the same features each time: *\"This is snow. Snow is cold.\"*\n\n2. **Concrete, repeated experiences:** Allow students to hold ice cubes multiple times across different days.\n   - Pair struggling readers/language learners with a buddy during partner shares.\n   - Use picture-word cards they can keep as references.\n\n3. **Scaffolded questioning:** Ask yes/no or either/or questions instead of open-ended questions.\n   - *\"Is snow cold or warm?\"* (either/or)\n   - *\"Does snow come from the ground?\"* (yes/no)\n   - *\"Do you see snow in this picture?\"* (yes/no)\n\n### Challenge (for advanced learners):\n\n1. **Deeper cause-and-effect thinking:** Ask students to investigate and explain *why* snow doesn't fall in summer.\n   - Provide a chart showing monthly temperatures. Ask: *\"Look at these numbers. Which months are coldest? Which months are warmest? When does snow fall? Why?\"*\n\n2. **Connection to the water cycle:** Introduce a simple diagram showing that snow comes from clouds, which form from evaporated water.\n   - *\"Snow is part of a big circle called the water cycle. Water goes up to the sky, turns into clouds, falls as snow or rain, and then starts all over again. Where do you think the water goes after the snow melts in spring?\"*\n\n3. **Comparative investigation:** Have students research or discuss: How is snow different from rain? How is snow the same as ice?\n   - Provide picture cards and a Venn diagram. Students sort similarities and differences.\n   - *\"Both snow and rain fall from the sky. But snow is frozen, and rain is liquid. Both are types of precipitation!\"*\n\n---\n\n## Extension Activities\n\n1. **Snowflake Art & Science Study (20-30 minutes):**\n   - Provide white paper, scissors, and spray bottles with water.\n   - Show images of real snowflakes (symmetric, six-sided).\n   - Have students cut paper snowflakes and spray them with water to see how they glisten like real snow.\n   - *\"Real snowflakes have special shapes. They're all different, but they all have six sides. Your snowflakes look like real ones!\"*\n   - **NGSS Connection:** Observing patterns (snowflake symmetry) ties to 1-ESS1-1.\n\n2. **Winter Weather Observation Chart (ongoing, 1-2 weeks):**\n   - Create a classroom chart to track daily weather during winter months.\n   - Each day, students draw the weather (sun, clouds, rain, snow) in a small box.\n   - At the end of a week or month, ask: *\"How many days were snowy? How many days were sunny? When did we see the most snow?\"*\n   - **NGSS Connection:** Connects to 1-ESS1-2 (making observations at different times to relate weather patterns).\n\n3. **\"Where Does the Snow Go?\" Follow-Up Lesson (15-20 minutes, days or weeks later):**\n   - If snow melted, ask: *\"Our snow is gone! Where did it go? What happened to it?\"*\n   - Place a handful of snow (or ice) in a clear container in a warm room. Observe over time.\n   - Students predict and record: *\"Will it stay frozen? Will it turn to water?\"*\n   - This bridges to understanding the water cycle and state changes (solid → liquid).\n\n---\n\n## Notes for Implementation\n\n- **Timing flexibility:** If real snow is falling during your lesson, capitalize on the excitement! Move outside (weather-appropriate) to observe. If snow is not expected in your region, the ice cube simulation and photograph are fully sufficient.\n- **Cultural responsiveness:** Some students may not have experienced real snow. Validate their observations and use the photograph as a shared reference.\n- **Connection to standards:** This lesson addresses **1-ESS1-2** by having students observe and recognize that winter (a specific time of year) brings snow, a seasonal weather pattern. It also supports **1-ESS1-1** by helping students recognize predictable patterns (cold season = snow).\n\n---\n\n**You're all set!** This lesson is ready to teach. Adjust timing based on your students' engagement and attention span, and don't hesitate to revisit the photograph multiple times—it's your anchor throughout all five phases.",
  "inputTokens": 2320,
  "outputTokens": 4378,
  "cost": 0.02421,
  "generatedAt": "2026-02-13T02:29:28.563Z"
}