{
  "title": "Precipitation_hail",
  "category": "earth-space-science",
  "imageFile": "precipitation_hail.jpg",
  "imagePath": "images/earth-space-science/precipitation_hail.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# Hail on the Ground: A First Grade Investigation\n\n### Core Science Concepts from Image Analysis\n\n- **Precipitation:** Water falling from clouds in different forms (rain, snow, sleet, hail)\n- **Weather Patterns:** Observable changes in weather conditions that occur at different times\n- **Properties of Water:** Water can be solid (ice/hail) and is part of Earth's weather system\n- **Seasonal Observations:** Different types of precipitation occur during different times of year and weather conditions\n\n---\n\n### Lesson Title\n\n**Icy Bounces: What Is Hail?**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** 1st Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 30-40 minute sessions (or one 60-75 minute block)\n- **NGSS Standards:** 1-ESS1-1 (Use observations of the sun, moon, and stars to describe patterns that can be predicted); 1-ESS1-2 (Make observations at different times of year to relate the amount of daylight to the time of year)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** what hail looks like and how it forms as a type of precipitation.\n2. **Compare and contrast** hail with other types of water precipitation (rain, snow).\n3. **Predict and record** what time of year hail is most likely to happen based on weather observations.\n4. **Explain** that hail is frozen water that falls from clouds during certain weather conditions.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about precipitation using the hail photograph.\n\n**Materials:**\n- Photograph of hail on ground (displayed via projector or printed on large poster)\n- Chart paper and markers\n- Optional: small ice cubes or hailstones (if available from freezer)\n\n**Activity:**\n\n1. **Display the Photograph:** Show students the image of hail on the ground. Ask them to observe quietly for 30 seconds without talking. Point out the clear, round, icy balls mixed with soil and sand.\n\n2. **Open with Curiosity Questions:**\n   - \"What do you see on the ground in this picture? What does it look like?\"\n   - \"Have you ever seen ice balls fall from the sky? What do we call frozen rain?\"\n   - \"Do you think these icy balls are hard or soft? How do you know?\"\n   - \"When do you think this happened—in summer or winter? Why do you think that?\"\n\n3. **Wonder Prompt:** \"I wonder what would happen if we tried to catch these falling ice balls in our hand! What do you think would happen?\"\n\n4. **Activate Prior Knowledge:** Ask students: \"Who has seen rain? Who has seen snow? Today we're going to learn about a special kind of frozen water that falls from the sky called hail!\"\n\n**Transition:** \"Now let's do an experiment to see what happens when water freezes into hard ice balls, just like hail!\"\n\n---\n\n#### 2. EXPLORE (22-28 minutes)\n\n**Objective:** Students investigate the properties of frozen water and how it behaves, connecting to hail formation.\n\n**Materials (per small group of 3-4 students):**\n- Small plastic cups (one per student)\n- Water\n- Food coloring (optional, for visual interest)\n- Freezer access or pre-made ice cubes\n- Shallow trays or plates\n- Droppers or small spoons\n- Paper towels\n- Observation recording sheet (simple picture sheet with labels)\n- Thermometer (teacher demonstration tool)\n\n**Activity:**\n\n**Session 1 (Freezing)**\n1. **Set Up Stations:** Divide students into groups. Each group fills a small cup with water (and a drop of food coloring if desired).\n\n2. **Make a Prediction:** Before freezing, ask: \"What do you think will happen to this water if we put it in the freezer? Will it stay wet? Will it change?\" Have students draw their prediction on their observation sheet.\n\n3. **Freeze the Water:** Place cups in the freezer for at least 2 hours (or use pre-made ice cubes). Explain: \"We're going to make ice, just like what happens high up in the clouds when it gets really, really cold.\"\n\n4. **Teacher Demonstration (while waiting):** Show students the thermometer. Explain that when it's very cold, water freezes into ice. Point to the hail photo again: \"These ice balls in the picture are frozen water, just like the ice we're making!\"\n\n**Session 2 (Observation & Exploration)**\n1. **Observe Frozen Water:** Remove cups from freezer. Have students carefully observe their ice:\n   - Is it hard or soft?\n   - What color is it?\n   - What shape is it?\n   - Can you break it? (Have them gently tap it on the tray)\n\n2. **Compare to Hail:** Show the hail photo again. Ask: \"How is our ice cube like the hail in the picture? How is it different?\"\n\n3. **Feel & Test:** Let students safely feel the ice (brief contact, on a tray to catch drips). Ask: \"Is it cold? Would this hurt if it fell on your head from the sky?\"\n\n4. **Melt It:** Leave one ice cube on a plate at room temperature. Ask students to predict: \"What will happen to our ice if we leave it here?\" Watch it melt over 5-10 minutes. Ask: \"Where did the ice go? Did the water come back?\"\n\n5. **Recording:** Students draw or write (with teacher scribing) what they observed. Simple sentence stems:\n   - \"The ice felt _____.\"\n   - \"When the ice melted, it turned back into _____.\"\n   - \"Hail is made of _____.\"\n\n**Teacher Role:**\n- Facilitate small group observations without giving away answers.\n- Ask guiding questions: \"What do you notice? How does it feel? What's happening?\"\n- Encourage peer discussion: \"What did your partner notice that's different from what you noticed?\"\n- Circulate to ensure all students engage with the ice and the hail photo.\n\n**Expected Student Outcomes:**\n- Students will discover that water freezes into a hard, cold solid.\n- Students will observe that ice melts back into water when warm.\n- Students will make connections between ice and hail through direct observation.\n- Students will have concrete evidence that hail is frozen water.\n\n---\n\n#### 3. EXPLAIN (15-18 minutes)\n\n**Objective:** Introduce formal vocabulary and explain hail formation using student discoveries and the photograph.\n\n**Materials:**\n- Hail photograph\n- Chart paper with vocabulary words\n- Simple diagram showing hail formation (clouds → frozen water → hail falling)\n- Picture cards of different types of precipitation (rain, snow, sleet, hail)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2-3 groups to share: \"What did you discover about ice?\"\n   - Write student observations on chart paper.\n   - Celebrate observations: \"You found out that ice is hard, cold, and made of frozen water!\"\n\n2. **Introduce Vocabulary (7 minutes):**\n   Display each word with a simple image or definition. Use the chart paper to create an anchor chart students can reference.\n\n   - **Hail:** Frozen raindrops that fall from clouds during thunderstorms. (Point to photo: \"This is hail.\")\n   - **Precipitation:** Any water that falls from clouds to Earth (rain, snow, sleet, hail).\n   - **Freeze:** When water gets very cold and turns into solid ice.\n   - **Melt:** When ice gets warm and turns back into water.\n   - **Thunderstorm:** A storm with lightning, thunder, and heavy rain that can produce hail.\n\n3. **Make Connections (5-6 minutes):**\n   - Return to the hail photograph. Point and explain: \"This picture shows hail. These are tiny ice balls that fell from the sky. See how round they are, like the ice we made?\"\n   - Reference the Explore activity: \"Just like our water froze into ice in the freezer, high up in the clouds it gets so cold that raindrops freeze into ice balls.\"\n   - Use hand motions to show: \"The ice balls bounce around inside the cloud, getting bigger and bigger, until they're heavy enough to fall to the ground. That's hail!\"\n\n4. **Check for Understanding (2 minutes):**\n   - Ask: \"Who can tell me: Is hail made of water or something else?\" (Water!)\n   - Ask: \"Is hail hot or cold?\" (Cold!)\n   - Ask: \"When do you think hail falls—on a sunny day or during a storm?\" (During a storm, usually in summer or spring.)\n   - Use thumbs up/sideways/down: \"Do you understand what hail is?\" Scan the room to informally assess.\n\n**Vocabulary:**\n- **Hail:** Frozen raindrops that fall from clouds during storms.\n- **Precipitation:** Water that falls from clouds (rain, snow, hail, sleet).\n- **Freeze:** When water gets very cold and turns into ice.\n- **Melt:** When ice gets warm and turns back into water.\n- **Thunderstorm:** A strong storm with rain, lightning, and sometimes hail.\n\n**Expected Student Outcomes:**\n- Students will understand that hail is frozen water.\n- Students will be able to identify hail as a type of precipitation.\n- Students will connect their ice-freezing experience to real-world hail formation.\n- Students will know that hail occurs during storms.\n\n---\n\n#### 4. ELABORATE (16-20 minutes)\n\n**Objective:** Students apply their understanding by predicting when hail occurs and relating it to seasonal patterns and weather observations.\n\n**Materials:**\n- Picture cards of different seasons\n- Weather observation chart (large calendar or grid)\n- Images/cards of different weather events: sunny day, rainy day, snowy day, hail storm\n- Chart paper and markers\n- Optional: real hailstones in a container (if available) for extended exploration\n\n**Activity:**\n\n**Part 1: When Does Hail Happen? (10-12 minutes)**\n1. **Introduce Seasonal Patterns:** Display pictures of the four seasons. Ask: \"When do you think hail happens? In spring, summer, fall, or winter?\"\n\n2. **Guided Discussion:**\n   - \"Hail usually falls in spring and summer when it can be warm AND cold at the same time.\"\n   - \"Hail happens during thunderstorms, not on sunny days.\"\n   - Ask: \"Has anyone seen hail where you live? When was it?\"\n\n3. **Sort and Classify Activity:**\n   - Give each student (or small group) a weather card: rain, snow, hail, sunshine.\n   - Ask: \"Which of these is frozen like ice?\" (Hail and snow)\n   - Ask: \"Which happens during a storm?\" (Hail and sometimes rain)\n   - Ask: \"Which is hardest?\" (Hail)\n   - Create a class chart:\n\n   | Weather | Frozen? | Falls from Storms? | Time of Year |\n   |---------|---------|-------------------|--------------|\n   | Rain    | No      | Sometimes         | Year-round   |\n   | Snow    | Yes     | Sometimes         | Winter       |\n   | Hail    | Yes     | Yes (mostly)      | Spring/Summer|\n\n**Part 2: Prediction & Recording (6-8 minutes)**\n1. **Make a Prediction:** Ask students: \"Over the next month, when do you think we'll see hail? When will we see rain? When will we see snow?\"\n\n2. **Create an Observation Tracker:** Give each student a simple monthly calendar. Say: \"Let's watch the weather together. Every day, we'll mark what we see outside. After a few weeks, we can see patterns—just like scientists do!\"\n\n3. **Optional Extended Exploration:** If hailstones are available, let students observe them closely with magnifying glasses. Ask: \"Why are they round? What do you notice about their size?\"\n\n**Teacher Role:**\n- Guide the sorting and discussion with open-ended questions.\n- Facilitate the chart creation, recording student thinking.\n- Model how to make a prediction: \"I think hail will happen in May because that's when storms are common here.\"\n- Set up the observation tracker so it can continue beyond this lesson.\n\n**Expected Student Outcomes:**\n- Students will predict that hail occurs in spring/summer during storms.\n- Students will understand that hail is different from rain and snow.\n- Students will begin tracking weather patterns over time.\n- Students will see that science involves making observations and predictions.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of hail, precipitation, and weather patterns.\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation During Explore:** Watch students as they interact with ice. Can they describe its properties? Do they connect it to hail?\n- **Questioning During Explain:** Listen to student responses to check-for-understanding questions. Can they identify hail as frozen water?\n- **Vocabulary Recognition:** During the weather sorting activity, do students correctly identify which precipitation is frozen?\n\n**Exit Ticket / Summative Assessment:**\n\n**Option 1 (Drawing with Labels):** Give each student a half-sheet with a simple hail cloud illustration. Ask:\n- \"Draw what hail looks like.\"\n- \"Is it hot or cold?\"\n- \"When does it fall?\"\nStudents draw and/or dictate responses to an adult scribe.\n\n**Option 2 (Simple Interview):** Ask each student 2-3 questions:\n- \"What is hail made of?\" (Expected: Water that's frozen / ice)\n- \"Is hail hard or soft?\" (Expected: Hard)\n- \"When do you see hail—on a sunny day or during a storm?\" (Expected: During a storm)\n\n**Option 3 (Picture Sorting):** Show students 4 picture cards (rain, snow, hail, sunshine). Ask: \"Which one is hail? How do you know?\" Students point and explain.\n\n**Success Criteria:**\n✓ Student can identify hail as frozen water/ice.  \n✓ Student can describe hail as hard and cold.  \n✓ Student can connect hail to thunderstorms.  \n✓ Student can relate the ice from the Explore activity to real hail in the photograph.\n\n**Expected Student Outcomes:**\n- Most students will demonstrate that hail is frozen water and understand it falls during storms.\n- Students will show connections between their hands-on ice experience and the photograph.\n- Students will be ready to continue weather observations as part of an ongoing ESS1-1 activity.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified Vocabulary:** Use consistent, repeated language. Stick to \"frozen water,\" \"ice balls,\" and \"storm\" rather than introducing too many new terms at once. Create a picture word wall with just 2-3 key terms.\n\n2. **Hands-On Ice Stations:** Provide extended time at the ice exploration station. Let students manipulate the ice multiple times. Use guiding questions with yes/no or two-choice answers: \"Is this ice hard or soft?\" rather than open-ended prompts.\n\n3. **Peer Buddies:** Pair with a more verbal student during the group share-out in Explain. Let them listen and observe first before being asked to contribute.\n\n**Challenge (for advanced learners):**\n\n1. **Deeper Observation:** Provide magnifying glasses for closer inspection of hailstone structure. Ask: \"Can you see layers in the ice? Why do you think hail has layers?\" (Guide them to understand that hail bounces in the cloud and gets more ice on it each time.)\n\n2. **Weather Prediction & Data:** Have advanced students keep a detailed daily weather log with sketches and predictions over 2-3 weeks. Ask: \"Can you find a pattern? When is a storm most likely? What comes after rain?\"\n\n3. **Compare Multiple Precipitation Types:** Provide images and descriptions of rain, snow, sleet, and hail. Ask: \"How are these the same? How are they different? Why do you think some are frozen and some aren't?\" Create a Venn diagram or comparison chart.\n\n---\n\n### Extension Activities\n\n1. **Hail Safety Discussion:** Read a simple book or show images about what to do during a hail storm. Create a class safety poster: \"If Hail Falls, What Should You Do?\" Students draw and dictate ideas (seek shelter, move indoors, cover your head). This connects to real-world applications and reinforces that hail can be dangerous.\n\n2. **Weather Journal Project:** Extend the weather observation tracker from Elaborate into a month-long (or longer) project. Students draw or paste pictures of weather daily, then analyze the data: \"Which weather did we see the most? When did we see hail? Did we see hail during spring like we predicted?\" Display the completed journal as a class data visualization.\n\n3. **Ice Experiment Variations:** Repeat the freezing experiment with different variables:\n   - Freeze water with salt (shows a different freezing point).\n   - Freeze water in different shapes (round like hail, or square).\n   - Add objects to water before freezing (leaves, sticks) to show how hail can contain impurities.\n   - Freeze saltwater vs. freshwater—which freezes faster? This deepens understanding of how conditions affect freezing.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 158,
  "outputTokens": 4110,
  "cost": 0.021235800000000003,
  "generatedAt": "2026-02-15T05:33:23.238Z"
}