{
  "title": "Precipitation Snow",
  "category": "earth-space-science",
  "imageFile": "precipitation_snow.jpg",
  "imagePath": "images/earth-space-science/precipitation_snow.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- Red brick buildings with slate roofs arranged in a courtyard\n- Climbing ivy or vines covering walls and structures\n- Snow or hail falling heavily across the scene\n- Metal umbrellas or circular canopies in the foreground courtyard\n- Metal fence or gate structures on the perimeter\n- Bare and leafed tree branches framing the space\n\n### Reasonable Inferences\n\n- **From falling precipitation + outdoor courtyard**: People need protection from snow/rain when moving through or gathering in open spaces.\n- **From metal umbrellas + buildings**: Existing structures provide some shelter, but the umbrella design suggests current solutions may be inadequate or temporary.\n- **From climbing vines + walls**: Natural or semi-natural materials can adhere to and protect building surfaces from weather exposure.\n\n### Engineering Task\n\n**K-2 Version:**\n\"Design a cozy shelter to keep people dry when snow falls. Use materials to make a small roof or covering that stays up on its own. Test it by pouring water on top—does the water drip away, or does it soak through?\"\n\n**3-5 Version:**\n\"Design a weather shelter for a snowy courtyard that meets these criteria: (1) spans at least 30 cm across, (2) is made from at least two different materials, (3) keeps a paper towel dry when water is poured on top for 10 seconds, and (4) stands without support from hands. Test your design and explain what worked and what you'd change.\"\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This phase fits best because the photo shows a real environmental challenge (heavy precipitation in an open space) with visible evidence of existing attempts at solutions (the umbrellas). Students must first identify *why* shelter is needed before designing one.\n\n### Suggested Materials\n\n- Plastic cups, containers, or plastic wrap\n- Aluminum foil or wax paper\n- Popsicle sticks, straws, or small dowels\n- Tape (masking or duct tape)\n- Paper towels or cloth scraps\n- Water in a spray bottle or pitcher (for testing)\n\n### Estimated Time\n\n**45–60 minutes** (one class period):\n- 10 min: Observation and problem discussion\n- 15 min: Planning and sketching\n- 20 min: Building\n- 10 min: Testing and reflection\n\nOr **Two 30-minute sessions** if iteration is included.\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (\"defining and delimiting engineering problems\") by asking students to identify a real need (protection from precipitation) and design a solution with testable success criteria, making abstract weather science tangible and actionable.",
  "inputTokens": 1806,
  "outputTokens": 628,
  "cost": 0.004946,
  "generatedAt": "2026-02-09T13:34:23.765Z"
}