{
  "title": "Rain Gauge",
  "category": "earth-space-science",
  "imageFile": "rain_gauge.jpg",
  "imagePath": "images/earth-space-science/rain_gauge.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- A clear plastic rain gauge mounted on a wooden post or fence\n- Red measurement markings and numbers (visible increments up to 5)\n- A white plastic collection base at the bottom\n- Weathered wooden fence/post (brown, textured grain)\n- Outdoor setting with grass, gravel, and a yellow/orange fence in the background\n\n## Reasonable Inferences\n- **From rain gauge design**: Water needs to be collected without splashing out, spilling, or evaporating—this tells us containers must have a specific shape and opening size.\n- **From outdoor placement**: The gauge must stay stable in wind and withstand weather exposure over time, suggesting materials need durability and weight distribution.\n- **From measurement markings**: Accurate tracking requires clear, readable gradations—precision in calibration matters.\n\n## Engineering Task\n\n### **K-2: Design a Water Catcher**\n**Challenge**: Design and build a container that catches rain water without spilling it out. Your container must:\n- Have an opening at the top (at least 2 inches wide)\n- Stand up straight without tipping over\n- Keep water inside even when you tilt it gently\n\n**Materials to test**: plastic cups, paper towel tubes, bottle caps, clay, tape.\n\n**Success check**: Pour water slowly into your catcher. Does it stay in? Does it tip over when you move it?\n\n---\n\n### **3-5: Design an Accurate Rain Gauge**\n**Challenge**: Create a rain measurement device that collects and measures rainwater with 0.5-inch accuracy.\n\n**Constraints**:\n- Collection container opening must be between 2–4 inches in diameter\n- Gauge must stand upright without support for at least 10 minutes\n- Must include a calibrated measuring scale (in inches) that can be read from the side\n- Must be made from recyclable or classroom materials\n\n**Success Criteria**:\n- When you pour exactly 1 inch of water into it, your scale reads 1 inch (±0.25 inch tolerance)\n- The device does not tip when gently bumped\n- All markings are visible and legible from at least 12 inches away\n\n## EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows a *finished solution* (the working rain gauge), but students have not yet identified *why* such a tool is needed or *what problems* accurate rainfall measurement solves. Starting here invites students to ask: \"Why do we need to measure rain? Who uses this data? What happens if the measurement is wrong?\" This grounds the engineering work in real-world purpose before diving into design.\n\n## Suggested Materials\n- Clear plastic bottles or containers (2-liter soda bottles, clear cups)\n- Permanent markers or paint pens (for scale markings)\n- Ruler or measuring tape\n- Tape (masking, duct, or clear)\n- Small rocks, sand, or clay (for ballast/stability)\n- Optional: funnels, straws, labels\n\n## Estimated Time\n\n**K-2**: 30–45 minutes (one session)  \n**3-5**: Two 40-minute sessions (Day 1: design & build; Day 2: test, calibrate, refine)\n\n## Why This Works for Teachers\n\nThis task directly supports **NGSS ETS1.A** (*defining and delimiting a design problem*) and **ETS1.B** (*developing possible solutions*) by having students identify that rainfall measurement requires a *precise, stable container design*—and then build and test solutions that meet real constraints.",
  "inputTokens": 2330,
  "outputTokens": 825,
  "cost": 0.006455000000000001,
  "generatedAt": "2026-02-09T13:39:55.253Z"
}