{
  "title": "Renewable_resource",
  "category": "earth-space-science",
  "imageFile": "renewable_resource.jpg",
  "imagePath": "images/earth-space-science/renewable_resource.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- Wooden structural framing (vertical studs, horizontal beams, angled roof trusses)\n- Fiberglass or mineral wool insulation material (gray/tan batts between studs)\n- Large multi-pane window (8–9 panes) with light cyan-colored glass\n- Wooden roof with exposed beam framework and small roof vents\n- Interior wooden floor/platform\n- Metal brackets or connectors joining structural members\n\n---\n\n## Reasonable Inferences\n1. **From insulation + window + framing**: This is a new building under construction designed to retain heat or regulate indoor temperature—likely a shed, cabin, or agricultural structure.\n2. **From roof vents + large window**: The structure is being designed to balance natural light and passive ventilation while maintaining thermal control.\n3. **From wooden construction + insulation placement**: The builder prioritizes sustainable or locally available materials (wood framing) combined with energy efficiency.\n\n---\n\n## Engineering Task\n\n### K–2 Version:\n**Build a Cozy Box House**\n\nImagine you are making a small house for animals (or toys). Your job is to **build a box structure that keeps the inside warm and lets in light**. \n\n- Use a cardboard box as your frame.\n- Add a window (cut a small square and cover it with clear plastic or cellophane).\n- Stuff newspaper or cotton balls inside the walls to keep warmth in.\n- Test: Put your hand inside—does it feel cozy? Can you see light through the window?\n\n**Success**: Your box has a working window, insulation stuffed inside, and feels warmer than a box with no insulation.\n\n---\n\n### 3–5 Version:\n**Design an Insulated Structure with Thermal & Light Control**\n\nYou are designing a small storage shed that must:\n- **Keep the inside 5°C warmer than outside** (using insulation material)\n- **Allow natural light in without losing too much heat** (strategic window sizing)\n- **Use only sustainable or recycled materials** (wood frames, recycled insulation, cardboard)\n- **Fit within a 30 cm × 30 cm × 25 cm footprint**\n\n**Measurable Criteria**:\n- Record temperature inside vs. outside every 5 minutes for 30 minutes\n- Measure the total window area (in cm²) as a percentage of wall area\n- Identify what material you used for insulation and why it was chosen\n- Sketch your design showing insulation placement and window location\n\n**Success Condition**: Interior temperature exceeds exterior by at least 3°C within 20 minutes; structure withstands a gentle push without collapsing.\n\n---\n\n## EDP Phase Targeted\n\n**Ask / Define Problem** ← *Best fit for this photo*\n\n**Why**: The photo shows a real-world structure mid-construction with visible design choices (insulation placement, window size, frame design). Students should first **identify the problem the builder was trying to solve**: \"How do you create a space that is warm in winter, has natural light, and uses sustainable materials?\" This grounds their engineering work in authentic human need before they imagine or build solutions.\n\n---\n\n## Suggested Materials\n\n1. **Cardboard boxes or wooden frames** (repurposed materials)\n2. **Fiberglass insulation batts, newspaper, or cotton balls** (thermal insulation)\n3. **Clear plastic wrap or cellophane sheets** (window simulation)\n4. **Wooden dowels, popsicle sticks, or straws** (structural framing)\n5. **Thermometers** (to measure and compare temperature change)\n6. **Tape, glue, or fasteners** (assembly)\n\n---\n\n## Estimated Time\n\n- **K–2**: 40–50 minutes (30 min building + 10–15 min testing/observation)\n- **3–5**: Two 35–40 minute sessions (Session 1: Design & build; Session 2: Test & record data)\n\n---\n\n## Why This Works for Teachers\n\nThis task directly supports **NGSS ETS1.A (defining engineering problems)** and **ETS1.B (developing solutions)** by having students recognize that structures must balance competing priorities—insulation for efficiency, windows for light, and sustainable material use—mirroring real architectural decisions.",
  "inputTokens": 2197,
  "outputTokens": 994,
  "cost": 0.007167,
  "generatedAt": "2026-02-11T16:13:50.508Z"
}