{
  "title": "Renewable Resource",
  "category": "earth-space-science",
  "imageFile": "renewable_resource.jpg",
  "imagePath": "images/earth-space-science/renewable_resource.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Building with Natural Resources\n\n### Core Science Concepts from Image Analysis\n\n- **Renewable Resources:** Wood and other natural materials from the environment can be harvested and used repeatedly for human needs, like building structures.\n- **Insulation and Protection:** Materials like wood frames and fibrous insulation help protect buildings from weather conditions and reduce the impacts of temperature extremes.\n- **Human Use of Earth's Resources:** Humans depend on natural materials from the Earth (wood, minerals for tools) to construct shelters and solve problems caused by weather.\n- **Design Solutions:** The structure shown demonstrates how thoughtful arrangement of materials (layering, framing) creates a solution to protect people from harsh weather and environmental conditions.\n\n---\n\n### Lesson Title\n\n**Building Strong Shelters: How Humans Use Earth's Materials**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions\n- **NGSS Standards:** \n  - 3-ESS3-1: Make a claim about the merit of a design solution that reduces the impacts of a weather-related hazard.\n  - 3-ESS2-2: Obtain and combine information to describe climates in different regions of the world.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Identify natural materials (like wood and insulation) used in building construction and explain why each material is chosen.\n- Design a simple shelter structure using classroom materials that protects against a weather-related challenge (wind, rain, or cold).\n- Make a claim about whether their design solution works and support it with observations or evidence.\n- Explain how the materials and structure of a building help humans adapt to different climate conditions.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student interest in how humans build shelters and use Earth's materials to protect themselves from weather.\n\n- **Materials:** \n  - Photograph of the building interior (projected or printed for display)\n  - Chart paper and markers\n\n- **Activity:** \n  1. Display the photograph prominently. Ask students: \"What do you see in this picture?\" Allow 1-2 minutes of think-aloud responses. Guide them to notice the wooden frame, the thick grayish material between the wood pieces, the window, and the roof structure.\n  2. Pose these discussion questions:\n     - \"Why do you think someone built this structure with so much wood?\"\n     - \"What is that thick, fluffy-looking material between the wooden pieces? What might it do?\"\n     - \"If it was very cold outside, how would this building help keep people warm inside?\"\n     - \"What problems could happen to a building if it didn't have these materials? What about in rain or snow?\"\n  3. Prediction/Wonder Prompt: \"If you had to build a small shelter for a pet or toy using materials from our classroom, what would you use to keep it safe from wind or cold? Why?\"\n  4. Record student ideas on chart paper for later reference.\n\n- **Transition:** \"Today, we're going to explore how people use materials from Earth to build buildings, and then you'll design your own shelter to protect something from weather!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate how different materials protect against weather by conducting a hands-on shelter-building challenge.\n\n- **Materials:**\n  - Small cardboard boxes (one per pair or small group)\n  - Craft sticks or popsicle sticks\n  - Newspaper, tissue paper, bubble wrap, cotton balls, or wool felt squares\n  - Tape and glue sticks\n  - One thermometer per group\n  - Paper cups (to represent windows)\n  - Markers for labeling\n  - Optional: spray bottle for \"rain\" test\n\n- **Activity:** \n  1. Divide students into pairs or small groups (3 students max).\n  2. Assign each group a \"weather challenge\": Group A = keep it warm inside (insulation challenge); Group B = keep water out (water resistance challenge); Group C = reduce wind impact (wind protection challenge).\n  3. Give each group a small box and explain: \"This is your shelter. You need to protect it from your weather challenge using only these materials. You have 15 minutes to build.\"\n  4. Step-by-step student directions:\n     - Choose which materials you think will work best for your challenge.\n     - Use tape, glue, or sticks to attach materials to your box.\n     - Make sure you can still see inside your shelter (leave or create an opening).\n     - Label your shelter with your team's names and the weather challenge you're solving.\n  5. Connection to photograph: \"Just like the building in our photo uses thick material to insulate and wood to frame it, you'll choose materials that protect your shelter.\"\n  6. Documentation: Students draw their shelter on paper and write 1-2 sentences about what materials they used and why.\n\n- **Teacher Role:** \n  - Circulate and ask guiding questions: \"How will that material help with your challenge?\" or \"Does that look thick enough to protect your shelter?\"\n  - Do NOT tell students which materials to use.\n  - Encourage problem-solving: \"What could you try if that's not working?\"\n  - Assist with tape/glue only if needed for safety or motor skill reasons.\n\n- **Expected Student Outcomes:** \n  - Each group produces a shelter with materials attached for their assigned weather challenge.\n  - Students can verbally explain one reason they chose their materials.\n  - Drawings and written labels show which materials were used where.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce formal vocabulary and connect student discoveries to how real buildings use natural resources.\n\n- **Materials:**\n  - Chart paper with key vocabulary (prepared in advance)\n  - Photograph of building (display again)\n  - Student shelters from Explore phase\n  - Optional: images of different building types (log cabin, brick house, straw shelter, igloo)\n\n- **Activity:** \n  1. **Group Share-Out (8 minutes):** Invite each group (or 2-3 groups) to present their shelter for 1-2 minutes. Ask:\n     - \"What materials did you use?\"\n     - \"Why did you choose those materials for your challenge?\"\n     - \"Do you think your shelter works? Why or why not?\"\n  2. **Connect to Photograph (5 minutes):** Point to the building photo and review:\n     - \"The building in our photo has thick insulation material, just like some of you used cotton or felt. This keeps heat inside.\"\n     - \"It has a strong wooden frame to hold everything together, just like a skeleton holds our bodies.\"\n     - \"The window lets light in but the insulation keeps cold air out.\"\n     - \"All these materials come from nature — wood from trees, insulation from plants or minerals.\"\n  3. **Key Vocabulary Introduction:** Display and define these terms using student-friendly language:\n     - **Insulation:** A thick material that stops heat from escaping or cold from entering (like a blanket for a building).\n     - **Natural Resource:** Something from nature that people use (wood, water, rocks, plants).\n     - **Renewable Resource:** A natural resource that can be regrown or replaced (like trees for wood).\n     - **Weather Hazard:** A dangerous condition caused by weather, like strong wind, heavy rain, or extreme cold.\n     - **Design Solution:** A planned way to solve a problem using materials and ideas.\n  4. **Check for Understanding:** \n     - \"Show me with your hands how thick insulation needs to be.\"\n     - \"Turn to a neighbor and explain why wood is a good material for building frames.\"\n     - Exit question (verbal): \"Where do the materials for buildings come from?\" Expect answers like \"trees,\" \"ground,\" \"nature.\"\n\n- **Vocabulary:**\n  - **Insulation:** A thick, fluffy, or dense material that keeps heat inside a building or keeps cold out (like a blanket for your house).\n  - **Natural Resource:** Something found in nature that people use and need, like wood, water, rocks, or plants.\n  - **Renewable Resource:** A natural resource that nature can replace or regrow, like trees that grow new wood after being cut.\n  - **Weather Hazard:** A dangerous weather event like strong wind, heavy rain, snow, or extreme heat that can harm buildings or people.\n  - **Design Solution:** A plan using materials and structures to fix or prevent a problem.\n\n- **Expected Student Outcomes:** \n  - Students can name at least two materials used in building construction.\n  - Students understand that some materials protect buildings from weather.\n  - Students can use the word \"insulation\" or \"natural resource\" in a sentence with teacher support.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply their understanding by testing shelters and making claims about design effectiveness.\n\n- **Materials:**\n  - Student shelters from Explore phase\n  - Thermometer (for temperature group)\n  - Spray bottle filled with water (for water-resistance group)\n  - Fan or hair dryer on low (for wind group) — **teacher-controlled only**\n  - Observation sheet (template provided below)\n  - Markers and colored pencils\n\n- **Activity:** \n  1. **Shelter Testing (10 minutes):**\n     - **Temperature Challenge Group:** Place a thermometer inside their shelter and outside (room temperature area) for 5 minutes. Record the temperature difference.\n     - **Water Challenge Group:** Lightly spray their shelter (NOT directly through openings) and observe where water enters or stays out.\n     - **Wind Challenge Group:** Teacher holds fan at low speed near the shelter for 10 seconds and students observe if it tips, shifts, or stays stable.\n  2. **Students complete an \"Observation Sheet\"** with drawing and writing:\n     - Draw your shelter and label the materials.\n     - Write or dictate: \"My shelter works / doesn't work well because ________.\"\n     - Write one thing you would change if you built it again.\n  3. **Real-World Connection (5 minutes):**\n     - Discuss: \"Why do houses in snowy places (like Canada or Alaska) have really thick insulation and sloped roofs? Why do houses in hot, dry places have different designs?\"\n     - Show images of different building types adapted to different climates (optional).\n     - Explain: \"People use Earth's materials differently depending on where they live and what weather they face.\"\n\n- **Teacher Role:** \n  - Facilitate testing procedures safely (control fans/water spray).\n  - Ask prompts: \"What does this tell you about your design?\"\n  - Help students record observations on paper without providing the \"right\" answer.\n  - Validate all claims as long as students provide a reason.\n\n- **Expected Student Outcomes:** \n  - Students gather data (temperature, water entry, stability observations).\n  - Students write or dictate a claim about whether their shelter works: \"My shelter keeps heat in because the cotton is thick and fluffy.\"\n  - Students identify one improvement: \"I would add more insulation,\" \"I would tape the cracks,\" etc.\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of natural resources, weather hazards, and design solutions for shelters.\n\n- **Activity:** \n\n  **Formative Assessment (throughout lesson):**\n  - Observation during Explore: Are students choosing materials thoughtfully? Can they explain their choices?\n  - Listen during group discussions: Do students use vocabulary correctly?\n  - Review drawings and written responses for understanding of material function.\n\n  **Exit Ticket (summative assessment, 5 minutes):**\n  Students respond to the following (orally, drawn, or written depending on writing level):\n  1. \"Name one material we used to build shelters. What does it protect buildings from?\"\n  2. \"Is wood a renewable resource? Why or why not?\"\n  3. \"If you lived somewhere very cold, what would you want your shelter to have? Why?\"\n\n  **Success Criteria for Understanding:**\n  - ✓ Student identifies at least one material (wood, insulation, paper, etc.) and describes its function (keeps heat in, stops water, makes frame strong).\n  - ✓ Student understands renewable resources (can say \"yes, wood grows back\" or \"trees make new wood\").\n  - ✓ Student connects shelter design to climate needs (cold places need insulation; wet places need water protection).\n  - ✓ Student uses at least one domain vocabulary word (insulation, natural resource, design solution) correctly.\n\n- **Expected Student Outcomes:** \n  - Most students (80%+) can name a material and say what it does in a building.\n  - Most students understand that buildings are designed to handle different weather.\n  - Students who struggle can identify insulation by pointing and saying \"keeps warm\" with support.\n  - Advanced students explain why specific materials (like wood) are renewable and why different climates need different designs.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n- Provide a **sentence frame** for exit ticket: \"This material protects the shelter from ________.\" \n- During Explore, **pre-select 3-4 materials** and let students choose from only those options to reduce decision paralysis.\n- **Pair students** with a stronger partner during building and testing phases.\n- Use **visual aids**: pictures of different climates and buildings to support discussion about how humans adapt to weather.\n- Allow **oral responses** instead of writing for students with writing challenges; scribe their ideas.\n\n**Challenge (for advanced learners):**\n- Ask students to **compare two climates** (e.g., desert vs. arctic): \"How would the shelter need to be different? Draw both and label materials.\"\n- Challenge them to **design for multiple hazards**: \"What if your shelter had to handle BOTH cold AND heavy rain? What would you change?\"\n- Encourage **quantitative thinking**: \"Measure the thickness of different insulation materials. Does thicker always work better? Test it.\"\n- Introduce **trade-offs**: \"If we use more insulation, the shelter is warmer but heavier. If we use less, it's lighter but colder. What's the best balance?\"\n- Have them **research** real buildings: \"Find a picture of a house from a different country. What materials do they use? Why?\"\n\n---\n\n### Extension Activities\n\n1. **Climate Detective Research Project:** \n   - Assign each student or pair a different climate region (rainforest, desert, tundra, temperate forest, grassland).\n   - Task: Find pictures of traditional buildings from that region. Write or draw how the buildings are designed to handle that climate. Share findings in a gallery walk or presentation. *Addresses 3-ESS2-2.*\n\n2. **Renewable vs. Non-Renewable Sorting Activity:**\n   - Create a chart with pictures of materials: wood, brick, plastic, metal, straw, stone, glass, cotton.\n   - Students sort them into \"Renewable\" and \"Non-Renewable\" columns.\n   - Discuss: \"Which materials come back? Which don't?\" \n   - Extension: \"How could we build a shelter using ONLY renewable materials?\"\n\n3. **Design a Disaster-Proof Shelter:**\n   - Present a scenario: \"A storm is coming with heavy wind and rain. Design an emergency shelter using a blanket, sticks, and string. Will it keep people safe?\"\n   - Students sketch and label their design.\n   - Discuss: \"What makes a shelter strong enough to protect people?\" *Addresses 3-ESS3-1.*\n\n---",
  "inputTokens": 188,
  "outputTokens": 3622,
  "cost": 0.0188258,
  "generatedAt": "2026-02-13T07:22:47.990Z"
}