{
  "title": "Renewable Resource",
  "category": "earth-space-science",
  "imageFile": "renewable_resource.jpg",
  "imagePath": "images/earth-space-science/renewable_resource.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# Complete 5E Lesson Plan: Building with Wood and Light\n\n### Core Science Concepts from Image Analysis\n\n• **Natural resources and their uses:** Wood is a renewable resource harvested from trees and used to build structures like this shed frame.\n\n• **Light and its properties:** Sunlight enters through windows and gaps, illuminating the interior space and allowing us to see the wooden structure and insulation materials.\n\n• **Patterns of daylight:** The amount and direction of sunlight visible through the window changes throughout the day and seasons, affecting how bright the interior is.\n\n• **Materials and their properties:** Different materials (wood, insulation, glass) have different properties that make them useful for specific purposes in construction.\n\n---\n\n### Lesson Title\n\n**Watching Sunlight Build Our World**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (total 90 minutes)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n### Learning Objectives\n\nStudents will be able to...\n\n- Observe how sunlight enters a building through windows and describe what they see.\n- Record and compare the amount of light in different parts of a room at different times of day.\n- Explain that sunlight helps us use materials like wood to build things we need.\n- Predict when it will be brighter or darker inside a building based on the time of day.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about how sunlight affects the spaces where we live and work.\n\n**Materials:**\n- Photograph of the wooden shed interior displayed on a screen or printed large poster\n- Window blinds or curtains in the classroom (if available)\n- Flashlight or lamp (optional, for demonstration)\n\n**Activity:**\n\n1. **Display the photograph** in a prominent location where all students can see it clearly.\n\n2. **Pose these discussion questions:**\n   - \"What do you notice about the bright spots in this picture? Where is the light coming from?\"\n   - \"Why do you think someone put a window in this wooden building?\"\n   - \"Look at the shadows on the walls and roof. Can you see where the sun is shining?\"\n   - \"If you were inside this building in the morning, afternoon, and evening, when do you think it would be brightest? When would it be darkest?\"\n\n3. **Wonder prompt:** \"I wonder what would happen if this building had no windows at all. Would it be bright or dark inside? How would that feel?\" Allow students to share their ideas freely.\n\n4. **Activate prior knowledge:** Ask, \"When you go outside on a sunny day and then come inside, what do you notice? Is it darker or lighter?\" Encourage students to describe their observations.\n\n**Transition:** \"Today, we're going to be light detectives! We're going to watch how sunlight moves through our classroom, just like the sunlight moving through that wooden building.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how sunlight changes in their classroom at different times and places.\n\n**Materials:**\n- Chart paper or large white paper (at least 3-4 sheets)\n- Crayons, colored pencils, or markers (in various colors, especially yellows and oranges)\n- Tape (masking tape or painter's tape)\n- Hand mirrors (2-3, optional, for reflecting light)\n- Clipboards or hard writing surfaces for each pair\n- Observation sheets (see \"Activity\" below)\n\n**Activity:**\n\n1. **Divide students into pairs or small groups** (3-4 students per group).\n\n2. **Explain the investigation:** \"We're going to look for sunlight in different parts of our classroom. We'll mark where the sunlight is brightest, and we'll draw what we see.\"\n\n3. **Assign each group one location to investigate:**\n   - Near a window (if available)\n   - In a corner away from windows\n   - In the middle of the room\n   - Under a light fixture or in a darker area\n\n4. **Student directions:**\n   - Walk to your assigned spot.\n   - Look around. Do you see sunlight here? Where is it brightest?\n   - Feel the temperature on your skin where the sunlight hits—is it warm or cool?\n   - On your observation sheet, draw where you see sunlight. Use yellow or orange crayons for bright areas.\n   - Mark dark areas with blue or gray crayons.\n   - Write or dictate to an adult: \"I see sunlight here because _____.\"\n\n5. **Teacher role:** Circulate between groups, asking guiding questions:\n   - \"What do you notice about where the light is brightest?\"\n   - \"Is there a window nearby? How far away is it?\"\n   - \"If the sun moves, do you think this light will change later?\"\n   - Do NOT provide the answers—let students discover through observation.\n\n6. **Documentation:** Have students record their observations on clipboards or hand them their observation sheets to complete.\n\n**Expected Student Outcomes:** \n- Students identify at least one area of sunlight in the classroom.\n- Students create a simple visual record (drawing) showing where light and dark areas are in their location.\n- Students begin to notice that sunlight comes from windows and travels across the room.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce vocabulary and connect discoveries to the photograph and concepts of daylight patterns.\n\n**Materials:**\n- The original photograph of the wooden shed\n- Chart paper for creating a class anchor chart\n- Markers\n- Optional: a globe or Earth ball to show day/night\n\n**Activity:**\n\n1. **Group share-out:** Have each small group share their findings (1-2 minutes per group).\n   - Ask, \"Where did you find the most sunlight? Why do you think it was brightest there?\"\n   - Record key observations on chart paper: \"The sunlight is brightest near the window\" or \"The corner is darker because the sun doesn't reach there.\"\n\n2. **Return to the photograph:**\n   - \"Look again at the shed in our picture. You found sunlight in our classroom—now find the sunlight in this picture.\"\n   - Point out the window and the bright beam of light entering through it.\n   - \"The wood in this shed is a natural resource. That means it comes from nature—it comes from trees! The sun helps trees grow, and then people use the wood to build buildings.\"\n\n3. **Introduce vocabulary with student-friendly definitions:**\n\n| **Vocabulary Term** | **Student-Friendly Definition** |\n|---|---|\n| **Daylight** | The time when the sun is in the sky and it is bright outside. |\n| **Sunlight** | Light that comes from the sun. It travels through windows and makes things bright. |\n| **Natural resource** | Something from nature that people use to make things they need (like wood from trees). |\n| **Window** | An opening with glass that lets sunlight into a building. |\n| **Pattern** | Something that happens the same way again and again, like the sun rising in the morning and setting at night. |\n\n4. **Check for understanding:**\n   - \"Point to the window in our photograph. What do you see coming through it?\"\n   - \"Why do you think the builders of this shed put windows in it?\"\n   - \"What would happen inside this shed if there were no windows?\"\n\n**Expected Student Outcomes:**\n- Students understand that sunlight enters buildings through windows.\n- Students recognize that wood (a natural resource) is used to build structures.\n- Students can use the word \"daylight\" and \"sunlight\" accurately in simple sentences.\n- Students predict that buildings need windows to let sunlight in.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting and observing daylight changes over time.\n\n**Materials:**\n- Observation windows or access to a window with a view outdoors\n- Chart paper titled \"Our Sunlight Predictions\"\n- Markers\n- Student journals or paper for drawings\n- Optional: a simple bar graph template showing morning, afternoon, and evening\n\n**Activity:**\n\n1. **Introduce a prediction task:** \"Today it's [morning/afternoon]. In a few hours, will it be brighter or darker outside? Let's make a prediction.\"\n\n2. **Create a class chart:** Draw three simple pictures of the sun (or circle with rays):\n   - Morning (sun low on horizon, partially bright)\n   - Afternoon (sun high, very bright)\n   - Evening (sun low again, less bright)\n\n3. **Ask students:** \"Which time do you think will be brightest? Why?\" Record their predictions.\n\n4. **Hands-on activity—Light Tracker:**\n   - Give each student a small drawing or sticky note labeled \"Morning,\" \"Afternoon,\" or \"Evening.\"\n   - Ask, \"If you were inside the wooden building from our photograph during [your assigned time], where would you stand to see the most sunlight?\"\n   - Have them draw or point to where they think sunlight would be brightest at that time.\n\n5. **Real-world connection:** \n   - \"People who build houses and sheds think about where the sun is. In the morning, the sun comes from one side. In the afternoon, it moves to the other side. Builders put windows where people will see the most sunlight during the times they use that building most.\"\n\n6. **Prediction journal entry:**\n   - Students draw a picture of the shed at two different times (morning and afternoon).\n   - Ask them to add sunlight rays where they think the light will enter at each time.\n   - Optionally, have them dictate: \"The sunlight is [brighter/darker] in the [morning/afternoon] because _____.\"\n\n**Teacher Role:** \n- Guide students' thinking without giving answers.\n- Ask, \"What did you notice about shadows this morning? Where was the sun?\"\n- Encourage students to look out the window and make comparisons.\n\n**Expected Student Outcomes:**\n- Students predict that daylight changes from morning to afternoon.\n- Students make simple drawings showing sunlight entering the shed at different times.\n- Students begin to understand that the sun's position changes throughout the day, affecting where light enters buildings.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of sunlight patterns and how they relate to buildings and natural resources.\n\n**Activity:**\n\n**Formative Assessment (throughout the lesson):**\n- Observe students during Explore phase: Can they identify sunlight and describe where it is brightest?\n- Listen to group discussions during Explain: Do students use vocabulary (sunlight, daylight, window) accurately?\n- Review observation sheets and drawings: Can students show sunlight reaching different areas?\n\n**Summative Assessment—Exit Ticket (delivered orally or with simple drawings):**\n\nAsk each student these questions individually or in small groups:\n\n1. **\"Show me or tell me: Where does sunlight come into a building?\"** \n   - Expected answer: \"Through windows\" or pointing to a window in the photograph.\n\n2. **\"Why do you think builders put windows in the wooden shed from our picture?\"**\n   - Expected answer: \"To let sunlight in\" or \"So people can see\" or \"Because sunlight helps us.\"\n\n3. **\"When do you think there is MORE sunlight—in the morning or at night?\"**\n   - Expected answer: \"In the morning\" or \"During the day\" (some may say afternoon).\n\n4. **\"Wood comes from trees. Why is it good to use wood to build things?\"**\n   - Expected answer: \"Because trees grow and give us wood\" or \"Because the sun helps trees grow\" or \"Because we have a lot of trees.\"\n\n**Success Criteria—Students demonstrate understanding if they:**\n- Correctly identify a window as a source of light entry.\n- Recognize that daylight changes from morning to evening.\n- Explain that sunlight is important for buildings.\n- Understand that wood (from trees) is a natural resource used to build.\n- Use new vocabulary (sunlight, daylight, natural resource) in context.\n\n**Expected Student Outcomes:**\n- Most first graders will demonstrate emerging understanding of daylight patterns.\n- Students will successfully identify sunlight in photographs and classroom spaces.\n- Students will begin to connect daylight patterns to daily activities and building design.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n- **Simplified observations:** Pair struggling students with a strong language partner. Focus only on identifying sunlight vs. shadow using one large photograph rather than exploring multiple classroom locations.\n- **Vocabulary scaffolding:** Provide picture cards labeled \"Sunlight,\" \"Window,\" and \"Dark\" so students can point to or match images rather than generating language independently.\n- **Guided exploration:** Walk through the classroom investigation with a small group yourself, asking only \"Do you see light here? Is it bright or dark?\" to keep focus narrow and achievable.\n\n**Challenge (for advanced learners):**\n\n- **Time-lapse thinking:** Ask advanced students, \"If you looked at this shed window at 8 AM, 12 PM, and 4 PM, where would the sunlight be each time? Draw it!\" This connects to 1-ESS1-2 (relating daylight to time of year).\n- **Seasonal prediction:** Introduce the idea that seasons change where sunlight enters buildings. \"In winter, does the sun come from a different direction than in summer? Why might a builder care about this?\"\n- **Design challenge:** \"If you were building a shed, where would you put windows to get the MOST sunlight in the afternoon? Draw your design and explain why.\"\n\n---\n\n### Extension Activities\n\n1. **Shadow Tracking Over Days:** Create a simple shadow tracker by taping a white paper to the classroom window and tracing shadows at the same time each day for one week. Students observe how shadows change size and position, connecting to 1-ESS1-2 about daylight changes over time.\n\n2. **Building Interview:** Invite a local carpenter, contractor, or facility manager to discuss why they place windows in buildings. Students prepare 2-3 questions: \"Why did you put windows here?\" \"How does sunlight help your building?\" This extends real-world application of daylight observation.\n\n3. **Home Observation Journal:** Send home a simple sheet asking families to observe sunlight in their home at three different times (morning, midday, evening). Students draw or dictate where sunlight is brightest at each time, creating a take-home extension of daylight pattern recognition aligned to 1-ESS1-2.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 157,
  "outputTokens": 3412,
  "cost": 0.017744799999999998,
  "generatedAt": "2026-02-13T07:21:24.780Z"
}