{
  "id": 53,
  "title": "Sedimentary Rock Layers",
  "category": "earth-space-science",
  "imageFile": "rock.jpeg",
  "content": "## 📸 Photo Description\n\nThis impressive photo shows a large piece of sedimentary rock with many visible layers! The rock sits on gravel near a street. You can clearly see horizontal bands of different colors - tan, brown, white, and cream layers stacked on top of each other. Each layer has a slightly different thickness and color. The rock looks weathered and worn, with rough edges. This layered structure tells the story of how this rock formed over millions of years!\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates sedimentary rock formation and stratification (layering). Each layer you see represents a different period of sediment deposition. Millions of years ago, this area might have been underwater or part of a river system. Sand, mud, shells, and other particles settled in layers - maybe a layer of sand during one season, then clay during another, creating different colored bands. Over time, the weight of upper layers compressed the lower layers, squeezing out water and cementing particles together into solid rock. The different colors come from different mineral content - iron creates red/brown colors, while calcium carbonate creates white/tan layers. Geologists can \"read\" these rock layers like pages in a history book!\n\n## 📚 Core Concepts\n\n1. **Stratification**: The layering of sedimentary rocks, with each layer representing a different time period of deposition.\n\n2. **Sedimentary Rock**: Rock formed when sediments (sand, mud, shells) are compressed and cemented together over millions of years.\n\n3. **Deposition**: When particles carried by water, wind, or ice settle and build up in layers.\n\n<pedagogical-tip>\nCreate \"Sediment Jar\" demonstrations! Each student needs a clear jar with lid. Layer different materials representing different sediments: gravel (coarse particles), sand, soil, crushed leaves (organic matter), colored sand layers. Add water, shake vigorously, let settle overnight. Observe: Layers form with heaviest on bottom! Discuss: How is this like rock formation? What do different layers tell us? Students sketch and label their jars. This visible, hands-on model makes abstract sedimentary processes concrete!\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Layer Counting**: Count and measure different rock layers in samples or photos\n- **Color Analysis**: Identify what minerals create different layer colors\n- **Field Trip**: Visit locations with visible rock layers (road cuts, quarries, canyons)\n- **Timeline Connection**: Relate rock layers to time - bottom layers are oldest\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:4-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layering\n\n## 💬 Discussion Questions\n\n1. What do the different colored bands in this rock represent? (DOK 2: Skill/Concept)\n2. How did this layered rock form over millions of years? (DOK 2: Skill/Concept)\n3. If you found a fossil in one of these layers, what could it tell you about when that layer formed? (DOK 3: Strategic Thinking)\n4. Why are the oldest layers at the bottom and newest layers at the top? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Stratification**: The formation of layers in sedimentary rock\n- **Sedimentary rock**: Rock formed from compressed sediment layers\n- **Deposition**: When sediment particles settle and accumulate\n- **Layer**: A horizontal sheet of material\n- **Erosion**: The wearing away and transportation of Earth materials\n\n## 🗻 Extension Activities\n\n- Research the Law of Superposition (older layers are on bottom)\n- Study famous layered rock formations (Grand Canyon, Badlands)\n- Investigate the three types of rocks and the rock cycle\n- Create cross-section diagrams showing rock layer formation over time",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis photograph shows a fascinating example of sedimentary rock layers! The rock is made up of many different colored bands stacked on top of each other. The layers range from tan and brown to white and cream. You can see how the thickness of each layer varies, creating a striped pattern. The rock looks a bit rough and weathered on the outside, but the layers inside tell a story about how it formed over a long, long time.\n\n## 🔬 Scientific Phenomena\n\nThis photo demonstrates the process of sedimentary rock formation. Over millions of years, small particles like sand, mud, and shells settled in layers at the bottom of rivers, lakes, or oceans. Each layer represents a different period of time when different materials were deposited. As more and more layers built up, the weight compressed the lower layers, squeezing out water and cementing the particles together into solid rock. The different colors in the layers come from the types of minerals present - iron creates the brown and red colors, while calcium makes the white and tan layers.\n\n## 📚 Core Science Concepts\n\n1. **Sedimentary Rocks**: Rocks formed when small particles (sediments) are compressed and cemented together over time.\n2. **Deposition**: The process of sediments settling and building up in layers.\n3. **Stratification**: The layering of sedimentary rocks, where each layer represents a different period of time.\n\n<pedagogical-tip>\nTo help young students visualize sedimentary rock formation, try a \"Sediment Jar\" demonstration. Have each student fill a clear jar with different materials like sand, gravel, soil, and crushed leaves to represent different sediment types. After shaking up the jar, they can observe the layers forming as the heavier particles settle to the bottom. Discuss how this models the real-life process of sedimentary rock formation over millions of years. This hands-on activity makes the abstract concept more concrete and memorable.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Representations**: Use diagrams, models, and photos to illustrate the concept of sedimentary rock layering.\n- **Kinesthetic Learning**: Allow students to create their own \"sediment jars\" and observe the layering process firsthand.\n- **Differentiated Instruction**: Provide different levels of reading material or vocabulary support based on student needs.\n- **Real-World Connections**: Take a field trip to see exposed sedimentary rock layers in your local area.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layering\n\n## 💬 Discussion Questions\n\n1. What do the different colored layers in the rock tell us? (DOK 2: Skill/Concept)\n2. How do you think these rock layers formed over time? (DOK 2: Skill/Concept)\n3. If you found a fossil in one of the layers, what could it tell you about when that layer was formed? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Sedimentary rock**: Rock formed from compressed layers of sediments.\n- **Sediment**: Small particles like sand, mud, or shells that settle and accumulate.\n- **Deposition**: The process of sediments building up in layers.\n- **Stratification**: The layering of sedimentary rocks.\n- **Mineral**: A natural, inorganic substance with a specific chemical composition.\n\n## 🌡️ Extension Activities\n\n- Explore other famous examples of layered sedimentary rock formations, such as the Grand Canyon.\n- Investigate the three main types of rocks (igneous, sedimentary, and metamorphic) and how they are related in the rock cycle.\n- Create a model or diagram to show how sedimentary rock layers form over time.",
    "grade1": "## 📸 Photo Description\n\nThis image shows a large piece of rock that has many visible horizontal layers, or bands, of different colors. The rock looks like it has been worn down over time, with rough, uneven edges. The layers include tan, brown, white, and cream colors, stacked neatly on top of each other. Each layer has a slightly different thickness, showing how the rock formed over a long period of time.\n\n## 🔬 Scientific Phenomena\n\nThe layered structure of this rock demonstrates a process called sedimentary rock formation. Over millions of years, small particles like sand, mud, and shells settled in layers, one on top of the other. As more layers built up, the weight compressed the lower layers, turning them into solid rock. The different colors come from different minerals in the sediments - for example, iron creates the brown and red layers, while calcium carbonate makes the white and tan layers. Geologists can \"read\" these rock layers like pages in a history book, learning about the changes that happened in this area over long periods of time.\n\n## 📚 Core Science Concepts\n\n1. **Stratification**: The process of sediments settling and forming layers, creating the banded appearance of sedimentary rocks.\n\n2. **Sedimentary Rock**: Rock formed when small particles are compressed and cemented together over a long time.\n\n3. **Deposition**: The process of sediments, like sand, mud, and shells, building up and accumulating in layers.\n\n<pedagogical-tip>\nTo help first graders understand these concepts, create a hands-on \"Sediment Jar\" demonstration. Have each student fill a clear jar with different materials like gravel, sand, soil, and crushed leaves, representing different types of sediments. Then add water, shake the jar, and observe as the layers form with the heaviest materials on the bottom. Discuss how this process is similar to the formation of the rock layers in the photo. Encourage students to sketch and label their jars, and share their observations with the class.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Observational Drawing**: Have students draw and label the different layers they see in the rock sample or photo.\n- **Color Analysis**: Discuss what minerals might be responsible for the different layer colors.\n- **Field Trip**: Visit a location with visible rock layers, such as a road cut or quarry, for a firsthand observation experience.\n- **Timeline Connection**: Explain how the oldest layers are on the bottom, and the newest layers are on top, relating to the concept of the passage of time.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in the layering of sedimentary rocks\n\n## 💬 Discussion Questions\n\n1. What do you notice about the different colored layers in the rock? (DOK 1: Recall)\n2. How do you think the layers in this rock formed over time? (DOK 2: Skill/Concept)\n3. If you found a fossil in one of the layers, what could it tell you about when that layer was formed? (DOK 3: Strategic Thinking)\n4. Why are the oldest layers at the bottom and the newest layers on top? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Stratification**: The formation of layers in sedimentary rock.\n- **Sedimentary Rock**: Rock formed from compressed and cemented sediment layers.\n- **Deposition**: The process of sediment particles settling and accumulating.\n- **Layer**: A horizontal band or sheet of material.\n- **Erosion**: The wearing away and transportation of Earth materials.\n- **Fossil**: The remains or impressions of a plant or animal that lived long ago.\n\n## 🗻 Extension Activities\n\n- Explore the three main types of rocks (sedimentary, igneous, and metamorphic) and how they relate to the rock cycle.\n- Investigate famous sedimentary rock formations, such as the Grand Canyon or the Badlands, and learn about their geological history.\n- Create a model or diagram showing how sedimentary rock layers form over time.",
    "grade2": "## 📸 Photo Description\n\nThis image shows a fascinating view of sedimentary rock layers. You can see clear horizontal bands or \"strata\" of different colors - tan, brown, white, and gray. Each layer has a slightly different thickness and shade, showing how the rock formed over a long period of time. The rock looks rough and worn, with some cracks and holes on the surface. This layered pattern helps tell the story of how this rock was created!\n\n## 🔬 Scientific Phenomena\n\nThe layers you see in this sedimentary rock are the result of sediments slowly building up over millions of years. Imagine this area was once part of an ancient ocean, lake, or river. As sand, mud, shells, and other particles settled to the bottom, they formed thin horizontal layers. Over time, the weight of newer layers compressed the older layers, turning them into solid rock. Each distinct band represents a different period of sediment deposition - maybe a sandy layer one year, followed by a muddier layer the next. The varying colors come from the different minerals in each sediment type. By studying these layers, scientists can learn about the environmental changes and events that occurred here long ago!\n\n## 📚 Core Science Concepts\n\n1. **Stratification**: The formation of distinct horizontal layers in sedimentary rocks, representing different time periods.\n\n2. **Sedimentary Rock Formation**: How sediments become compacted and cemented together over millions of years to form solid rock.\n\n3. **Deposition**: The process where particles suspended in water, wind, or ice settle and accumulate in layers.\n\n<pedagogical-tip>\nHands-on demonstrations are key for helping 2nd graders understand sedimentary rock formation. Try the \"Sediment Jar\" activity - have students create their own layered jars with sand, soil, gravel, etc. Observing how the heavier particles settle first, while finer materials form thinner upper layers, concretely shows the process of stratification. Discuss how this models the formation of real sedimentary rocks over long time periods.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Experiences**: Examine real rock samples to observe layers and textures up close\n- **Differentiated Media**: Provide diagrams, videos, and physical models to explain rock formation\n- **Collaborative Learning**: Have students work in pairs or small groups to analyze rock photos and diagrams\n- **Concept Mapping**: Create visual organizers linking key ideas like deposition, compression, and layering\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth's Materials and Systems\n- [[NGSS:CCC:Patterns]]: Identifying patterns in rock layers over time\n\n## 💬 Discussion Questions\n\n1. What differences do you notice between the layers in this rock? (DOK 1: Recall)\n2. How do you think the layers in this rock were formed over time? (DOK 2: Skill/Concept) \n3. If a fossil was found in one of the layers, what could it tell us about that time period? (DOK 3: Strategic Thinking)\n4. Why are the oldest rock layers usually found at the bottom? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Sedimentary Rock**: Rock formed from compressed layers of sediments like sand, mud, and shells.\n- **Stratification**: The formation of distinct horizontal layers in sedimentary rocks.\n- **Deposition**: The process where particles settle out of water, wind, or ice and accumulate.\n- **Compression**: When the weight of upper layers presses down on lower layers.\n- **Mineral**: A naturally occurring inorganic substance with a distinct chemical composition.\n- **Fossil**: The preserved remains or traces of ancient organisms.\n\n## 🌡️ Extension Activities\n\n- Make your own sedimentary rock model by creating a layered \"sediment sandwich\" in a clear container.\n- Research famous examples of sedimentary rock formations like the Grand Canyon or Badlands.\n- Explore the three main rock types (igneous, sedimentary, metamorphic) and how they relate to the rock cycle.\n- Investigate how fossils are preserved in sedimentary rock layers and what they can tell us about the past.",
    "grade3": "## 📸 Photo Description\n\nThis photo shows a large piece of sedimentary rock with many visible layers! The rock has different colored bands stacked on top of each other - tan, brown, white, and cream. Each layer has a slightly different thickness and color. The rock looks weathered and worn, with rough edges. This layered structure tells the story of how this rock formed over a long time.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates sedimentary rock formation and stratification (layering). Each colored layer represents a different period of sediment deposition. Millions of years ago, this area may have been underwater or part of a river system. Sand, mud, shells, and other particles settled in layers - maybe a sandy layer during one season, then a clay layer during another, creating the different colored bands. Over time, the weight of upper layers compressed the lower layers, squeezing out water and cementing the particles together into solid rock. The different colors come from different mineral content - iron creates red/brown colors, while calcium carbonate creates white/tan layers. Geologists can \"read\" these rock layers like pages in a history book!\n\n## 📚 Core Science Concepts\n\n1. **Stratification**: The layering of sedimentary rocks, with each layer representing a different time period of deposition.\n\n2. **Sedimentary Rock**: Rock formed when sediments (sand, mud, shells) are compressed and cemented together over millions of years.\n\n3. **Deposition**: When particles carried by water, wind, or ice settle and build up in layers.\n\n<pedagogical-tip>\nCreate \"Sediment Jar\" demonstrations! Each student needs a clear jar with lid. Layer different materials representing different sediments: gravel (coarse particles), sand, soil, crushed leaves (organic matter), colored sand layers. Add water, shake vigorously, let settle overnight. Observe: Layers form with heaviest on bottom! Discuss: How is this like rock formation? What do different layers tell us? Students sketch and label their jars. This visible, hands-on model makes abstract sedimentary processes concrete!\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Layer Counting**: Count and measure different rock layers in samples or photos\n- **Color Analysis**: Identify what minerals create different layer colors\n- **Field Trip**: Visit locations with visible rock layers (road cuts, quarries, canyons)\n- **Timeline Connection**: Relate rock layers to time - bottom layers are oldest\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:4-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:2-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layering\n\n## 💬 Discussion Questions\n\n1. What do the different colored bands in this rock represent? (DOK 2: Skill/Concept)\n2. How did this layered rock form over millions of years? (DOK 2: Skill/Concept) \n3. If you found a fossil in one of these layers, what could it tell you about when that layer formed? (DOK 3: Strategic Thinking)\n4. Why are the oldest layers at the bottom and newest layers at the top? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Stratification**: The formation of layers in sedimentary rock\n- **Sedimentary rock**: Rock formed from compressed sediment layers\n- **Deposition**: When sediment particles settle and accumulate\n- **Layer**: A horizontal sheet of material\n- **Erosion**: The wearing away and transportation of Earth materials\n- **Mineral**: A natural, inorganic substance with a specific chemical composition\n\n## 🗻 Extension Activities\n\n- Research the Law of Superposition (older layers are on bottom)\n- Study famous layered rock formations (Grand Canyon, Badlands)\n- Investigate the three types of rocks and the rock cycle\n- Create cross-section diagrams showing rock layer formation over time",
    "grade4": "## 📸 Photo Description\n\nThis amazing photo shows a large slab of sedimentary rock with clearly visible horizontal layers of different colors and textures. The rock appears to be sitting on a gravel surface, perhaps near a road or construction site. The layers range from tan and cream to brown and gray, each with its own distinct thickness and hue. The overall layered structure of this rock tells a fascinating story about how it formed over millions of years!\n\n## 🔬 Scientific Phenomena\n\nThe layers you see in this sedimentary rock are the result of a process called stratification. Over a very long period of time, small particles of sand, mud, and other materials were slowly deposited in horizontal layers, one on top of the other. As more and more layers built up, the weight of the upper layers compressed the lower layers, cementing the sediments into solid rock. The different colors and thicknesses of the layers are caused by variations in the materials that were deposited - for example, layers with more iron-rich minerals appear reddish-brown, while layers with more calcium carbonate are lighter in color.\n\n## 📚 Core Science Concepts\n\n1. **Sedimentary Rock Formation**: Sedimentary rocks like this one are formed when small particles of sand, silt, and other materials are deposited in layers and gradually compressed over time.\n\n2. **Stratification**: The process of sedimentary layers building up one on top of another, creating a distinct banded or layered appearance in the rock.\n\n3. **Geological Time Scale**: The rock layers in this image represent a long timeline, with the oldest layers at the bottom and the newest layers at the top, in accordance with the Law of Superposition.\n\n<pedagogical-tip>\nTo help students better understand the process of sedimentary rock formation, consider doing a hands-on \"Sediment Jar\" demonstration. Have students create their own miniature sedimentary rock layers by filling a clear jar with different materials (sand, gravel, soil, etc.) and observing how the layers form as the materials settle. This can be a great way to make the abstract concept of stratification more concrete and engaging for 4th grade students.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Representation**: Encourage students to sketch or draw the layers they observe in the photo, labeling the different materials and colors.\n- **Tactile Exploration**: If possible, provide students with actual rock samples they can examine and feel the different textures and densities of the layers.\n- **Differentiated Instruction**: For students who may struggle with the concept of geological time, provide a visual timeline or scale to help them understand the vast timeframes involved in sedimentary rock formation.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layering\n\n## 💬 Discussion Questions\n\n1. What do you think the different colored layers in the rock represent? (DOK 2: Skill/Concept)\n2. Why do you think the layers in this rock are arranged in a horizontal pattern? (DOK 2: Skill/Concept)\n3. If a fossil was found in one of the layers, what information could it provide about when that layer formed? (DOK 3: Strategic Thinking)\n4. How do you think the layers in this rock were formed over time? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Stratification**: The process of forming layers in sedimentary rock\n- **Sedimentary Rock**: Rock formed from the compression and cementation of sediment layers\n- **Deposition**: The process of particles settling and accumulating\n- **Erosion**: The wearing away and movement of Earth materials\n- **Geological Time Scale**: The timeline of Earth's history, divided into eras, periods, and epochs\n\n## 🗻 Extension Activities\n\n- Research famous sedimentary rock formations, such as the Grand Canyon or the Badlands, and compare their layers to the ones in the photo.\n- Investigate the three main types of rocks (igneous, sedimentary, and metamorphic) and how they are related through the rock cycle.\n- Create a model or diagram showing the different stages of sedimentary rock formation, from deposition to compression and cementation.",
    "grade5": "## 📸 Photo Description\n\nThis photograph shows beautifully preserved sedimentary rock layers in a natural setting. The rock formation has distinct horizontal bands of different colors - tan, brown, white, and gray. Each layer appears to be of slightly different thickness, creating a distinct, repeating pattern. The edges of the rock are weathered and worn, revealing the layered structure. This layered appearance provides clues about how this rock formed over millions of years.\n\n## 🔬 Scientific Phenomena\n\nThe layered structure visible in this sedimentary rock is the result of a process called sedimentation. Over long periods of time, small particles of sand, silt, and other materials were gradually deposited in horizontal layers, one on top of the other. As newer layers were added, the weight compressed the lower layers, cementing them into solid rock. The different colors in the layers come from variations in the mineral content - for example, reddish-brown layers may contain more iron, while the white layers likely have more calcium carbonate. This layering provides a record of the environmental conditions that existed when each layer was formed, allowing geologists to \"read\" the history of the Earth from these rock formations.\n\n## 📚 Core Science Concepts\n\n1. **Sedimentary Rock Formation**: Sedimentary rocks like this one form when sediments (sand, silt, clay, and other materials) are deposited in layers and compressed over long periods of time.\n\n2. **Stratification**: The layering of sedimentary rocks, with each layer representing a different time period of sediment deposition.\n\n3. **Geological Time**: The immense span of time over which the Earth's features have formed, including the gradual accumulation of sedimentary layers.\n\n<pedagogical-tip>\nEngage students in hands-on activities to model sedimentary rock formation, such as creating \"sediment jars\" where they layer different materials (sand, gravel, soil, etc.) in a clear container, add water, and observe the layering that occurs. This can help students visualize the process of sedimentation and stratification. You can also have students examine real rock samples or photographs to practice identifying and describing the layered structures.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Representation**: Provide visual aids, such as diagrams and images, to support understanding of sedimentary rock formation.\n- **Flexible Grouping**: Allow students to work in pairs or small groups to analyze rock samples and share their observations.\n- **Varied Means of Engagement**: Incorporate hands-on activities, field trips, and discussions to keep students engaged and interested in the topic.\n- **Varied Means of Expression**: Encourage students to demonstrate their understanding through writing, drawing, or creating models of sedimentary rock layers.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-ESS1.C]]: The History of Planet Earth\n- [[NGSS:DCI:4-ESS2.A]]: Earth Materials and Systems\n- [[NGSS:CCC:Patterns]]: Recognizing patterns in rock layering\n\n## 💬 Discussion Questions\n\n1. What do the different colored layers in the sedimentary rock tell us about how it formed? (DOK 2: Skill/Concept)\n2. How do you think the environment (e.g., water, wind, or ice) may have influenced the deposition of the sediments that created this rock? (DOK 3: Strategic Thinking)\n3. If a fossil was found in one of the rock layers, what might that tell us about the environment at the time that layer was formed? (DOK 3: Strategic Thinking)\n4. Why are the oldest rock layers typically found at the bottom of a sedimentary rock formation? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Sedimentary Rock**: Rock formed from the compression and cementation of sediments, such as sand, silt, and clay.\n- **Sedimentation**: The process of sediment particles settling out of water, wind, or ice and accumulating in layers.\n- **Stratification**: The formation of distinct layers or bands in sedimentary rock, each representing a different period of deposition.\n- **Deposition**: The process by which sediment particles are laid down and accumulated.\n- **Erosion**: The wearing away and transportation of rock and soil by water, wind, or ice.\n- **Geological Time**: The immense span of time over which the Earth's features have formed, including the gradual accumulation of sedimentary layers.\n\n## 🗻 Extension Activities\n\n1. Investigate the \"Law of Superposition,\" which states that the oldest layers of sedimentary rock are at the bottom, and the youngest are at the top.\n2. Research famous examples of layered sedimentary rock formations, such as the Grand Canyon or the Badlands, and compare their features to the rock layers in the photo.\n3. Explore the rock cycle, which describes how rocks can transform from one type to another over geological time, and how sedimentary rocks fit into this cycle."
  }
}