{
  "title": "Rock",
  "category": "earth-space-science",
  "imageFile": "rock.jpeg",
  "imagePath": "images/earth-space-science/rock.jpeg",
  "content": "# Engineering Design Process Challenge: Protecting & Moving Layered Rock\n\n---\n\n### Visible Elements in Photo\n\n- **Stratified rock formation** – A large, tan-and-white layered stone sitting on a blue wooden platform, showing distinct horizontal bands of different materials\n- **Loose gravel and small stones** – Scattered around the base and platform, indicating a construction or landscaping site\n- **Blue wooden platform/pallet** – Appears to be a transport or display base for the rock\n- **Paved surface and gravel bed** – Suggests an active work zone or outdoor storage area\n- **Partial vehicle visible** – Upper left corner shows a dark car, indicating an urban or developed setting\n\n---\n\n### Reasonable Inferences\n\n1. **From layered rock structure** → This rock has been exposed to weathering; the soft bands (white layers) may be more fragile than the darker bands and could crumble or separate during movement or handling.\n\n2. **From blue platform placement** → Someone has already attempted to move or display this rock, suggesting it is heavy and requires a stable, flat base for transport or storage.\n\n3. **From construction/gravel site context** → This rock may be part of a geological survey, educational collection, or landscape project where it needs to be protected and relocated safely.\n\n---\n\n### Engineering Task\n\n#### **K-2 Version:**\n**\"Build a Safe Bed for a Special Rock\"**\n\nYou have a beautiful striped rock that is very delicate and needs to be moved. Your job is to design a **soft, safe resting place** so the rock doesn't get scratched or broken. Use pillows, foam, sand, or cloth to build a cozy nest. Test your design by gently placing a smaller rock on top and seeing if it stays safe. Can you make it so the rock doesn't roll around?\n\n---\n\n#### **3-5 Version:**\n**\"Engineer a Transport and Protection System for a Fragile Layered Rock\"**\n\nYour team has been given a rock with distinct soft and hard layers. The rock must be moved 10 meters across a gravel work site without damage to the softer white bands. Your challenge:\n\n**Constraints:**\n- Design a protective wrapping or cushioning system using available materials\n- Create a stable platform or container that prevents rolling and shifting\n- The system must weigh no more than twice the rock's weight\n- The rock must survive being tilted at a 30° angle (on a ramp) without pieces breaking off\n\n**Success Criteria:**\n- Zero visible damage to the layered bands after transport\n- Rock remains in place when platform is tilted\n- Protection system can be removed without leaving residue or damage marks\n- Design takes no more than 5 minutes to build\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\n*This photo shows a real-world object with an evident risk (fragile layering) and an existing attempted solution (the wooden platform). Students naturally begin by asking \"What could go wrong?\" and \"How can we protect it?\" rather than starting from a solution already visible. The layered structure immediately raises questions about material properties and failure modes—core to the Ask phase.*\n\n---\n\n### Suggested Materials\n\n- Foam sheets or foam packing peanuts\n- Cloth scraps, old towels, or burlap\n- Bubble wrap or plastic sheeting\n- Sand or soil in a shallow container\n- Wooden boards or plastic pallets\n- Duct tape or masking tape\n- Zip-lock bags (for smaller-scale testing)\n\n---\n\n### Estimated Time\n\n**45–60 minutes** (single session)\n- Design & planning: 10 minutes\n- Material selection & building: 25 minutes\n- Testing & iteration: 15 minutes\n- Debrief & documentation: 5–10 minutes\n\n*For extended learning, add a second 30-minute session for redesign based on test results.*\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A (Defining and Delimiting Engineering Problems)** by requiring students to identify material properties (brittleness, layering) as constraints and to prototype solutions that balance protection, weight, and accessibility.",
  "inputTokens": 2203,
  "outputTokens": 942,
  "cost": 0.006912999999999999,
  "generatedAt": "2026-02-15T06:18:55.783Z"
}