{
  "title": "Sedimentary Rock",
  "category": "earth-space-science",
  "imageFile": "rock.jpeg",
  "imagePath": "images/earth-space-science/rock.jpeg",
  "content": "### Visible Elements in Photo\n\n- A large, stratified rock formation with visible horizontal layers (tan, brown, and white bands) sitting on a blue wooden pallet\n- Surrounding gravel and small stones covering the ground\n- A vehicle (partial view) and paved surface in the background\n- Shadows cast by structures, indicating strong sunlight and outdoor location\n- Clear evidence of weathering and erosion on the rock's upper surface\n\n### Reasonable Inferences\n\n- **From layered rock structure**: The rock was formed over time by compressed sediment; different layers indicate different environmental conditions when each layer was deposited.\n- **From weathering patterns**: Exposure to weather, temperature changes, and moisture causes the rock's surface to break down and separate along weak points (the white mineral bands appear to be natural fracture zones).\n- **From placement on pallet**: This rock may have been transported or is being stored, suggesting it has value or purpose (educational specimen, landscaping material, or construction material).\n\n### Engineering Task\n\n**K-2 Version:**\nYou found a big rock that is breaking apart into layers. Design a **rock holder** using craft materials that will keep the rock from falling apart. Your holder must:\n- Wrap around or support at least two sides of the rock\n- Use only paper, tape, string, or cloth\n- Keep the rock safe when you gently lift it\n\n**3-5 Version:**\nStratified rocks like this one break apart along weak layer boundaries due to freezing, water infiltration, and weathering. **Design a protective sleeve or casing** that will slow down layer separation when the rock is exposed to repeated wetting and drying cycles (simulated in the classroom). Your design must:\n- Cover at least 50% of the rock's surface\n- Use only biodegradable or recyclable materials (burlap, kraft paper, twine, or cardboard)\n- Allow you to remove it without damaging the rock\n- Withstand at least 5 wet-dry cycles (each cycle: soak for 2 minutes, air dry for 10 minutes)\n- Test and measure how many layers separate after your protection is applied versus an unprotected control sample\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a *real-world problem*: natural rock deterioration due to weathering and layer separation. Students aren't looking at a finished solution; they're identifying *why* the rock is vulnerable and what protection it needs. The visible erosion and stratification invite students to ask, \"How can we prevent this from getting worse?\" before jumping to solutions.\n\n### Suggested Materials\n\n1. **Kraft paper or brown kraft tape** – wraps easily around irregular shapes and is biodegradable\n2. **Twine or natural jute string** – binds layers together without adhesive\n3. **Burlap fabric scraps** – breathable, allows drying, mimics historical preservation methods\n4. **Cardboard or foam sheets** – provides rigid support for fragile edges\n5. **Spray bottle with water** – simulates repeated wetting for durability testing\n\n### Estimated Time\n\n- **K-2**: 20–30 minutes (design and wrap) + 5–10 minutes (lift test)\n- **3-5**: Two 40-minute sessions (Session 1: design and build sleeve; Session 2: conduct wet-dry cycles, measure results, document layer separation)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-2** (*Generate and compare multiple possible solutions based on how well they meet the criteria and constraints of a design problem*) by requiring students to test whether their protective design actually slows weathering and then iterate based on real data.",
  "inputTokens": 2336,
  "outputTokens": 839,
  "cost": 0.006531,
  "generatedAt": "2026-02-09T13:26:23.886Z"
}