{
  "title": "Rock",
  "category": "earth-space-science",
  "imageFile": "rock.jpg",
  "imagePath": "images/earth-space-science/rock.jpg",
  "content": "# Engineering Design Challenge: Rock Weathering & Erosion Solution\n\n---\n\n### Visible Elements in Photo\n- One large, irregularly shaped rock with visible cracks, pits, and surface wear\n- Mixed coloration (tan, gray, rust-red) suggesting mineral composition and weathering\n- Green grass and low vegetation surrounding the rock on all sides\n- Lichen or moss patches (darker spots) on the rock surface\n- Scattered white gravel/crushed stone visible at the left edge\n\n---\n\n### Reasonable Inferences\n1. **From surface cracks and pits**: Water, ice, and plant roots have broken down this rock over time through natural weathering processes.\n2. **From vegetation contact**: Plants growing around the rock may contribute to further erosion by holding moisture and exerting pressure on the rock surface.\n3. **From lichen/moss patches**: The rock is in a moist outdoor environment where slow biological weathering is actively occurring.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Rock Jacket**\nYour rock is being broken apart by rain, freezing, and plant roots. Your job is to **design a protective cover** for a rock so that water and ice cannot crack it. Use materials to wrap or shield your rock. Test it by pouring water on it and checking if the rock stays dry underneath. Does your cover stay in place? Does water drip off or soak in?\n\n**3-5: Design a Weathering Prevention Barrier**\nThe rock in the photo is being damaged by weathering (water seeping into cracks, freezing and thawing, plant roots growing). **Your challenge**: Design and build a protective barrier system that can be placed around a similar rock to slow down or prevent three types of weathering damage:\n- Water infiltration (cracks filling with water)\n- Root penetration (plant growth into the rock)\n- Ice expansion (freezing/thawing cycles)\n\n**Success criteria**:\n- Barrier must stay attached to the rock for at least 2 weeks\n- Water cannot reach at least 60% of the rock surface\n- Design must allow air to flow (so it doesn't create other problems)\n- Cost less than $5 in materials\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real-world problem (rock weathering and erosion) occurring in nature. Students benefit from first identifying *why* this rock is breaking down and *what problem* needs solving, rather than jumping to a pre-designed solution. The visible damage motivates genuine questioning about causes and constraints.\n\n---\n\n### Suggested Materials\n1. Plastic sheeting or vinyl wrap\n2. Waterproof tape (duct tape or Gorilla tape)\n3. Burlap or landscape fabric\n4. Cardboard tubes or foam padding\n5. Rubber bands or twine for securing materials\n\n---\n\n### Estimated Time\n- **K-2**: 30–45 minutes (design, build, test in one session)\n- **3-5**: Two 40-minute sessions (Session 1: design and build; Session 2: test and iterate)\n\n---\n\n### Why This Works for Teachers\nThis task aligns with **NGSS ETS1.A** (defining and delimiting a problem) by having students identify real constraints and failure modes from an observable natural process, then apply materials science to design a solution within real-world limits.",
  "inputTokens": 2195,
  "outputTokens": 760,
  "cost": 0.005995,
  "generatedAt": "2026-02-11T23:04:40.224Z"
}