{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "sunrise.jpg",
  "imagePath": "images/earth-space-science/sunrise.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n\n- A straight, paved two-lane highway with yellow center line markings and white edge lines\n- Flat, open landscape with sparse grass and vegetation on both sides\n- Distant tree line silhouetted against the horizon\n- A tall structure (antenna or tower) visible near the horizon\n- Sky transitioning from orange/pink (sunrise) to gray clouds above\n\n## Reasonable Inferences\n\n- **From the flat terrain and sparse vegetation**: This landscape experiences weather exposure (wind, sun, rain) with minimal natural barriers for protection.\n- **From the road markings and straight design**: Engineers designed this road to accommodate vehicles traveling at varying speeds; the curve suggests attempts to manage visibility and safety.\n- **From the sunrise and open sky**: This area likely experiences significant changes in lighting and temperature throughout the day, which could affect material durability and visibility.\n\n## Engineering Task\n\n**K–2: Make a Straight Road**  \nImagine you are building a road across a big, flat field. Use tape and blocks (or paper and markers) to design a straight road with lines down the middle so pretend cars know where to drive. Can you make your road stay straight for at least 10 steps?\n\n**3–5: Design a Road System for a Flat Landscape**  \nDesign and build a 5-meter-long model road that safely guides vehicles across flat, open terrain. Your road must:\n- Include a center line and edge lines (using markers or tape)\n- Have at least one curved section to test visibility\n- Be stable enough for a toy car to roll straight without veering off\n- Include one safety feature (e.g., reflectors, a sign, a shoulder) appropriate for a remote area\n\nTest your road by rolling the toy car at different speeds. Record whether it stays on the road. Redesign the curve if needed.\n\n## EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real-world infrastructure challenge—how to safely guide vehicles across open, flat terrain with limited landmarks. Students observe the landscape and the road design choices visible in the photo, then define the problem: \"How can we mark and design a road so drivers can see it and stay safe?\" This naturally leads to identifying the *need* (safety, visibility, durability) before jumping into solutions.\n\n## Suggested Materials\n\n- Masking tape or painter's tape (for road lines)\n- Cardboard, foam board, or poster board (for the road base)\n- Toy cars or marbles (for testing)\n- Markers or paint (for line markings)\n- Small objects as reflectors (foil squares, glow sticks, or paint dots)\n\n## Estimated Time\n\n**K–2**: 20–30 minutes  \n**3–5**: 45–60 minutes (design, build, test, and one iteration)\n\n## Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting problems) and **ETS1.B** (developing possible solutions) by asking students to identify real constraints (flat, open terrain; visibility needs; durability) and test a design solution (road marking and geometry) with measurable criteria.",
  "inputTokens": 2328,
  "outputTokens": 717,
  "cost": 0.005913,
  "generatedAt": "2026-02-09T13:35:12.033Z"
}