{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "sunrise.jpg",
  "imagePath": "images/earth-space-science/sunrise.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Sunrise and Earth Systems\n\n### Core Science Concepts from Image Analysis\n\n- **Daily rotation of Earth and changing sunlight:** The photograph captures a sunrise, which occurs due to Earth's rotation. Students can observe how the sun's position changes throughout the day, creating patterns of light and shadow across the landscape.\n- **Interaction of atmosphere, geosphere, and energy from the sun:** The colorful sky (pink, orange, red gradations) demonstrates how the atmosphere scatters and filters sunlight, particularly at sunrise and sunset when light travels through more atmospheric layers.\n- **Patterns of shadow length and direction:** The long shadows visible on the road and landscape during sunrise illustrate how the angle of the sun affects shadow length and direction—a measurable pattern that changes predictably throughout the day.\n- **Earth systems connections:** The image shows the geosphere (land), atmosphere (sky with clouds and gases), and the energy source (sun) working together to create observable phenomena that can be tracked and predicted.\n\n---\n\n### Lesson Title\n\n**Sunrise Shadows: Tracking Earth's Rotation and Atmospheric Changes**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 50-minute sessions (or three 40-minute periods)\n- **NGSS Standards:** \n  - 5-ESS1-2: Represent data in graphical displays to reveal patterns of daily changes in length and direction of shadows, day and night, and the seasonal appearance of some stars in the night sky.\n  - 5-ESS2-1: Develop a model using an example to describe ways the geosphere, biosphere, hydrosphere, and/or atmosphere interact.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- **Observe and record** the relationship between the sun's position and shadow length and direction over time.\n- **Construct a data table and line graph** to show how shadow length changes throughout the school day, demonstrating patterns of Earth's rotation.\n- **Explain** how Earth's rotation, the sun's energy, and the atmosphere interact to create the visible phenomena in the sunrise photograph.\n- **Model** Earth's rotation and the sun's apparent movement to predict future shadow patterns.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about daily patterns and sunlight using the photograph.\n\n**Materials:**\n- Printed or projected image of the sunrise photograph\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or screen. Tell students: \"This photo was taken early in the morning on a road heading east. Look carefully at the sky, the shadows on the road, and the light.\"\n\n2. **Ask these discussion questions** to spark curiosity:\n   - \"Why do you think the sky has so many different colors—orange, pink, and blue—all at the same time?\"\n   - \"What would the shadows look like if we took this same photo at noon? What about at sunset?\"\n   - \"Why is the sun so bright and orange here compared to how it looks at other times of the day?\"\n   - \"If we stood on this road and measured the shadow of a stick or pole right now, how would that measurement change in one hour? In six hours?\"\n\n3. **Prediction prompt:** Ask students to draw and label a prediction: \"Draw what you think the sky, shadows, and sun would look like if we stood on this same road at 12 noon today. What would be different? What would be the same?\"\n\n4. **Record predictions** on chart paper to revisit at the end of the lesson.\n\n**Transition:** \"Today, we're going to become shadow scientists and track how the sun's movement changes shadows throughout the day—just like in this sunrise photo. We'll collect real data and look for patterns.\"\n\n---\n\n#### 2. EXPLORE (24 minutes)\n\n**Objective:** Students investigate shadow length and direction changes through direct observation and measurement.\n\n**Materials:**\n- One meter stick or measuring tape per group (or wooden dowel marked with cm measurements)\n- White paper or data collection sheet\n- Pencils\n- Outdoor space with direct sunlight (or a sunny window inside)\n- Protractor or angle measurer (optional, for advanced students)\n- Stopwatch or clock\n- Clipboard\n\n**Activity:**\n\n**Session 1: Initial Shadow Measurement (12 minutes)**\n\n1. **Set up observation stations:** Take students outdoors to a sunny area, or position them near a bright window. Each group places a meter stick or dowel upright (perpendicular to the ground) in a consistent, safe location.\n\n2. **Student task 1 - Measure shadow length:**\n   - Have students use the measuring tape to measure the length of the shadow cast by the meter stick.\n   - Record the measurement on their data sheet along with the time (e.g., \"9:15 AM: Shadow length = 145 cm\").\n   - Have students trace the shadow's outline on white paper to create a visual record.\n\n3. **Student task 2 - Measure shadow direction:**\n   - Using chalk (outdoors) or a marker on paper, have students mark where the shadow points. Is it pointing north, south, east, or west? (Use a compass or known direction if possible.)\n   - Record the direction on their data sheet.\n\n4. **Observation:** Ask students to observe and record the color and brightness of the sky near the sun compared to directly overhead. What do they notice?\n\n**Session 2 or Later: Repeat Measurements (12 minutes)**\n\n5. **Return to the same location** 2–3 hours later (ideally at solar noon for maximum contrast, or late afternoon if morning is not feasible).\n\n6. **Repeat measurements:** Students measure shadow length and direction again at this new time. They trace the new shadow on a different colored paper for comparison.\n\n7. **Record observations:** Students note any differences in sky color, air temperature, and shadow angle.\n\n**Teacher Role:**\n- Circulate among groups to ensure accurate measurements.\n- Ask guiding questions: \"Why do you think the shadow changed? What caused it to get shorter/longer?\"\n- Do not explain the cause yet—encourage students to make observations and wonder aloud.\n- Remind students to handle materials safely and stay in assigned outdoor areas.\n\n**Expected Student Outcomes:**\n- Accurate measurements of shadow length at two different times\n- Visual documentation (traced shadows on paper)\n- Direction observations recorded\n- Recognition that shadows changed between measurements\n- Initial curiosity about *why* the shadows changed\n\n---\n\n#### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts connecting observations to Earth's rotation and atmosphere.\n\n**Materials:**\n- Chart paper with student data compiled\n- Ruler and graph paper\n- Colored pencils\n- Globe or Earth model\n- Flashlight or lamp (to model Earth's rotation)\n- Projected sunrise photograph (reference image)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Call on each group to share their measurements. Record all data on a large class chart on the board.\n   - Have students observe: \"What pattern do you see? Did shadows get longer or shorter? Did the direction change?\"\n\n2. **Introduce key vocabulary with definitions (5 minutes):**\n\n   - **Earth's rotation:** Earth spinning like a top on an invisible axis. One full rotation takes 24 hours, which is one day. As Earth rotates, different parts of our planet face toward or away from the sun.\n   \n   - **Apparent motion of the sun:** It looks like the sun moves across the sky from east to west during the day, but actually, *Earth* is rotating. The sun seems to move because we're on a spinning planet.\n   \n   - **Shadow:** A dark area created when an object blocks sunlight. The sun's angle in the sky changes how long or short a shadow is.\n   \n   - **Atmosphere:** The blanket of air and gases surrounding Earth. It scatters sunlight differently at different times of day, making the sky appear different colors.\n   \n   - **Solar noon:** The time during the day when the sun is highest in the sky and shadows are shortest.\n\n3. **Direct instruction using the photograph and a model (6 minutes):**\n   - Show the sunrise photo again. Say: \"In this photo, the sun is low on the horizon in the east. Look at the long shadows on the road—they stretch far across the pavement. The sky is orange and pink because sunlight is passing through a thick layer of atmosphere (like shining light through colored glass), which scatters the blue light and lets red and orange through.\"\n   - Use a globe and flashlight to model: Tilt the globe slightly and shine a flashlight from one side. Rotate the globe slowly. Explain: \"As our Earth rotates, our location moves toward the sun (sunrise) and away from it (sunset). When we're facing toward the sun with it low on the horizon, shadows are very long. As Earth continues to rotate and the sun appears to climb higher in the sky, shadows get shorter.\"\n   - Point to the data: \"Look at our class measurements. When we measured at _____ AM, shadows were _____ cm. When we measured at _____ PM, shadows were _____ cm. That's a difference of _____ cm, and it happened because Earth rotated.\"\n\n4. **Check for understanding (2 minutes):**\n   - Ask: \"If we came back at sunset tonight, would shadows be long or short? Why?\"\n   - Ask: \"Why does the sunrise sky look different colors than the noon sky?\" (Accept responses that mention the sun being lower and light traveling through more atmosphere.)\n\n**Vocabulary:**\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Earth's rotation** | Earth spinning like a top. It takes 24 hours for one full spin, which is one day. |\n| **Apparent motion** | When something looks like it's moving, but it's actually you that's moving. The sun looks like it moves, but Earth is really spinning. |\n| **Shadow** | A dark place made when something blocks the sun's light. Shadows change size and direction as the sun moves across the sky. |\n| **Atmosphere** | All the air and gases around Earth. It bends and scatters light, which is why sunsets and sunrises have pretty colors. |\n| **Solar noon** | The time when the sun is highest in the sky and shadows point straight down and are shortest. |\n\n**Expected Student Outcomes:**\n- Students understand that Earth's rotation, not the sun's movement, causes shadows to change.\n- Students recognize that shadow length and direction follow predictable patterns tied to the sun's position.\n- Students begin to understand how the atmosphere affects how we see sunlight at different times of day.\n\n---\n\n#### 4. ELABORATE (16 minutes)\n\n**Objective:** Students apply and deepen understanding by graphing data and predicting future shadow patterns.\n\n**Materials:**\n- Student data collection sheets\n- Graph paper\n- Ruler, colored pencils\n- Optional: Digital graphing tools (spreadsheet program) or printed graph templates\n- Blank outline diagrams of clock faces (optional, for predicting shadow direction)\n\n**Activity:**\n\n**Part A: Create a line graph (8 minutes)**\n\n1. **Explain the task:** \"We're going to turn our measurements into a graph. A graph helps us *see* the pattern more clearly.\"\n\n2. **Guided graphing:**\n   - Draw a sample graph on the board with time (hours) on the x-axis and shadow length (cm) on the y-axis.\n   - Have students plot their two data points from the Explore phase.\n   - If time allows, show additional reference data collected by the teacher or from a previous year (e.g., shadow length at 8 AM, 10 AM, 12 PM, 2 PM, 4 PM) so students can see the complete pattern.\n\n3. **Interpret the graph together:**\n   - Ask: \"What does this graph show? Does the line go up or down? What does that mean about our shadows?\"\n   - Highlight: \"The shortest shadows happen around noon, and the longest shadows happen at sunrise and sunset.\"\n\n**Part B: Predict and model shadow direction (8 minutes)**\n\n1. **Draw a compass rose** on chart paper showing North, South, East, and West.\n\n2. **Use a clock diagram:** Give each student a blank clock face. Explain that they will predict where a shadow would point at different times.\n\n3. **Guided prediction:**\n   - Ask: \"If the sun rises in the east, which direction does the shadow point in the morning?\" (West, opposite the sun)\n   - Ask: \"At noon, when the sun is highest and in the south, which direction does the shadow point?\" (North)\n   - Ask: \"At sunset, when the sun is in the west, which direction does the shadow point?\" (East)\n   - Have students label arrows on their clock diagrams showing shadow direction at 6 AM, 12 PM, and 6 PM.\n\n4. **Connect to Earth systems:** Say: \"All of this happens because Earth is rotating, and the sun's energy keeps reaching different parts of our planet. The ground (geosphere), the air (atmosphere), and the sun's energy (energy) are all working together to create the patterns we see.\"\n\n**Teacher Role:**\n- Provide graph templates if students need support with scale and plotting.\n- Ask probing questions: \"How would this graph look different in summer versus winter?\" or \"How would this graph look different at the equator versus near the North Pole?\"\n- Encourage students to use their graphs to make real predictions they can verify during the next school day.\n\n**Expected Student Outcomes:**\n- Students produce a line graph showing shadow length changes over time with a clear downward-then-upward trend (or upward trend, depending on measurement times).\n- Students correctly predict shadow direction at various times of day.\n- Students articulate that predictable patterns in shadows result from Earth's rotation.\n- Students make connections between Earth's rotation, the sun's apparent movement, and observable shadows.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of Earth's rotation, shadow patterns, and atmospheric interactions.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation of group measurements:** Are students measuring accurately and recording data systematically?\n- **Questioning during Explain phase:** Listen for correct use of vocabulary (rotation, apparent motion, shadow, atmosphere).\n- **Graph interpretation:** Can students read and explain their graph? Do they recognize the pattern?\n- **Prediction accuracy:** Did students correctly predict shadow length and direction changes?\n\n**Summative Assessment - Exit Ticket (5 minutes at end of lesson):**\n\nDistribute an exit ticket (printed or digital) with the following prompts:\n\n1. **Draw and label:** Draw a diagram showing Earth rotating and the sun. Show where shadows would be longest and shortest during one day. Label your drawing with the times.\n\n2. **Explain in writing (2-3 sentences):** \"Why do shadows change length throughout the day? What causes this pattern?\"\n\n3. **Apply your thinking:** \"If you wanted to measure the shortest shadow possible, what time of day should you go outside? Explain your reasoning.\"\n\n4. **Reflection:** \"What surprised you most about shadows and Earth's rotation?\"\n\n**Success Criteria for Student Understanding:**\n\n✓ **Proficient (3 points per criterion):**\n- Student diagram correctly shows Earth rotating toward the sun (sunrise/long shadows) and away from the sun (sunset/long shadows), with shortest shadows at noon.\n- Student explanation mentions Earth's rotation AND the sun's position/angle affecting shadow length.\n- Student correctly identifies solar noon or midday as the time for shortest shadows and explains it using the concept that the sun is highest in the sky then.\n- Student reflects thoughtfully on an observation or misconception that changed.\n\n✓ **Approaching (2 points per criterion):**\n- Diagram shows some understanding but may lack labeling or have minor directional errors.\n- Explanation mentions one key concept (either rotation or sun's position) but not both clearly.\n- Student identifies midday as time for shortest shadows but reasoning is incomplete.\n- Reflection shows engagement but is superficial.\n\n✓ **Beginning (1 point per criterion):**\n- Diagram is unclear or does not show relationship between Earth's rotation and shadows.\n- Explanation does not address the cause of shadow changes.\n- Student cannot identify correct time for shortest shadows.\n- No reflection or minimal response.\n\n**Expected Student Outcomes:**\n\nStudents who meet proficiency demonstrate:\n- Clear mental models connecting Earth's rotation to shadow changes.\n- Accurate predictions of future shadow patterns.\n- Correct use of scientific vocabulary in explanations.\n- Understanding that Earth systems (geosphere, atmosphere, sun's energy) interact to produce observable phenomena.\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified measurement protocol:** Provide pre-made data collection sheets with guided questions (e.g., \"Is the shadow longer or shorter than the meter stick?\"). Allow students to use non-standard units (e.g., \"It's 3 pencil-lengths long\") before converting to cm.\n\n2. **Vocabulary anchor chart:** Create and post a visual anchor chart with pictures and simple definitions of key vocabulary terms (rotation, shadow, atmosphere, etc.) that students can reference throughout the lesson. Use icons or drawings alongside words.\n\n3. **Structured graphing template:** Provide pre-drawn axes with labeled intervals and fewer data points to plot. Consider having this student's group plot only morning and afternoon measurements (2 points) rather than a full day's data, then add more points as confidence grows.\n\n4. **Buddy system:** Pair struggling learners with a peer during the Explore phase. Assign roles (e.g., \"measurer\" and \"recorder\") so each student has a clear responsibility.\n\n**Challenge (For Advanced Learners):**\n\n1. **Angle and slope investigation:** Provide protractors or angle-measuring tools. Challenge advanced students to measure the angle between the sun, the ground, and the top of their meter stick/dowel at different times. Have them create a graph showing how this angle changes throughout the day and explain the relationship to shadow length using trigonometry concepts (tangent of angle = shadow length / height of object). Discuss: \"How could we use angles to predict exact shadow length?\"\n\n2. **Multi-day and seasonal data collection:** Engage advanced students in collecting shadow data over a week or month, then graphing and comparing. Ask: \"Do you think shadows would be different in December versus today in May? Why? How could we find out?\" Introduce the concept of Earth's tilt and its effect on the sun's altitude at different seasons.\n\n3. **Atmospheric color analysis:** Challenge students to research and document the colors in the sky at sunrise, noon, and sunset using RGB color values or Pantone color codes. Have them investigate *why* colors differ (wavelength, atmospheric scattering, and Rayleigh scattering) and present findings to the class.\n\n4. **Real-world application design:** Ask: \"Where could we use knowledge of shadow patterns? (Examples: Solar panel positioning, gnomon/sundial design, building architecture, photography.) Choose one application, research it, and design a simple solution or improvement.\"\n\n---\n\n### Extension Activities\n\n1. **Build a sun clock (sundial):** Students design and construct a simple sundial using a stick, a base, and marked time intervals. They place it in a consistent sunny location and verify the time accuracy by comparing it to a digital clock over several days. This reinforces shadow direction and angle patterns and introduces a historical technology based on Earth's rotation.\n\n2. **Sunrise and sunset data collection across seasons:** Assign students to track and record local sunrise and sunset times for one month (using a calendar, weather app, or internet source). Have them graph these times and identify patterns. Discuss: \"Why do sunrise and sunset times change throughout the year? How does Earth's tilt affect this?\" Connect to standard 5-ESS1-2.\n\n3. **Planet rotation comparison:** Research and compare Earth's rotation (24 hours) with the rotation periods of other planets (Venus ≈ 243 Earth hours, Jupiter ≈ 10 hours, Mars ≈ 24.6 hours). Create a bar graph or infographic showing rotation times. Predict: \"If you lived on Venus, how would your day/night cycle be different? What would shadows look like?\" Discuss how this relates to apparent sun movement.\n\n---\n\nThis lesson plan places students at the center of scientific discovery, moving from observation of the sunrise photograph to hands-on measurement, graphing, modeling, and prediction—all hallmarks of the 5E model. By the end, fifth graders will possess a robust understanding of Earth's rotation and its visible effects on shadows and daylight, fulfilling the requirements of 5-ESS1-2 and developing foundational knowledge for 5-ESS2-1.",
  "inputTokens": 288,
  "outputTokens": 4791,
  "cost": 0.0247708,
  "generatedAt": "2026-02-13T02:51:32.539Z"
}