{
  "title": "Sunrise",
  "category": "earth-space-science",
  "imageFile": "sunrise.jpg",
  "imagePath": "images/earth-space-science/sunrise.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 1st Grade Earth and Space Science Lesson: Sunrise Patterns\n\n### Core Science Concepts from Image Analysis\n\n- **Daily sun movement:** The sun rises in the east and moves across the sky, creating predictable patterns that we can observe and describe each day.\n- **Color changes during sunrise:** As the sun rises, the sky displays a sequence of colors (dark to orange to pink to blue), showing how light changes throughout the morning.\n- **Daylight and darkness:** The transition from darkness to daylight during sunrise helps students understand the pattern of day and night on Earth.\n- **Observable patterns over time:** By watching sunrises on different days and seasons, students can predict when the sun will rise and how the sky will look.\n\n---\n\n### Lesson Title\n\n**Watching the Sun Wake Up: Sunrise Patterns**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 30-minute sessions (one for classroom observations/discussion, one for hands-on activity and reflection)\n- **NGSS Standards:** 1-ESS1-1, 1-ESS1-2\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and describe the colors and patterns they see during a sunrise or sunrise photograph.\n- Explain that the sun rises in the same general place each day and that we can predict when it will happen.\n- Record observations about how the sky changes from dark to light during sunrise.\n- Recognize that sunrise happens at different times depending on the time of year.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student curiosity about sunrises and activate prior knowledge about day and night.\n\n- **Materials:**\n  - Large, clear photograph of the sunrise (provided image, projected or printed)\n  - Chart paper or whiteboard\n  - Markers (multiple colors, especially orange, pink, and yellow)\n\n- **Activity:**\n  1. Display the sunrise photograph where all students can see it clearly. Do not explain what it is yet.\n  2. Ask students to look carefully and think quietly for 10 seconds before answering: \"What do you see in this picture?\"\n  3. Ask these discussion questions in order:\n     - **\"What colors do you see in the sky?\"** (Listen for: orange, pink, yellow, blue, gray, white)\n     - **\"What do you think is happening in this picture? Is it morning or evening?\"** (Accept all answers; students will refine thinking)\n     - **\"When is your favorite time to see the sky? Have you ever seen the sky look like this?\"**\n     - **\"If the sun is rising, where do you think it's coming from, and where will it go?\"**\n  4. Write student observations and predictions on chart paper as they share. Circle any predictions about \"the sun coming up\" or \"darkness turning to light.\"\n  5. Tell students: \"This is called a sunrise. It happens every morning when the sun comes up and brings light to our world. Today, we're going to be sunrise detectives!\"\n\n- **Transition:** \"Let's do an activity to see how we can track and draw what we observe about sunrises.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate sunrise patterns through observation and recording activities.\n\n- **Materials:**\n  - Sunrise observation worksheet (teacher-created, see description below)\n  - Colored pencils or crayons (orange, yellow, pink, blue, purple, gray, black)\n  - White paper or pre-drawn sky template (half page white, half page for drawing)\n  - Optional: access to a window with eastern view, or photos of sunrises from different times of year\n  - Clipboard or hard surface for writing\n\n- **Activity:**\n  1. **Show multiple sunrise images** (or describe a sequence): Display 3-4 photos of sunrise progression—very dark sky transitioning to light sky with orange and pink colors near the horizon.\n  2. **Student observation task:** Give each student a \"Sunrise Observation Sheet\" with a blank sky template divided into three sections (left = start of sunrise, middle = middle of sunrise, right = end of sunrise/full daylight).\n  3. **Guided activity:**\n     - Say: \"Look at these sunrise pictures. Watch how the colors change. First, the sky is very dark. Then we see orange and pink. Finally, the sky is bright blue. Let's draw what we see.\"\n     - Students draw the sky colors they observe in each section using crayons or colored pencils.\n     - Encourage them to match colors to the photograph.\n  4. **Student recording:** Below each drawing, students write or dictate 1-2 words describing what they see (teacher scribe if needed): \"dark,\" \"orange,\" \"bright,\" \"light,\" etc.\n  5. **Optional live observation:** If possible during actual sunrise time, take students to a window or outside for 3-5 minutes to observe real sky changes and add observations to their sheet.\n  6. **Prediction activity:** Ask students: \"Look at your three drawings. If we watched tomorrow morning, what would we see first?\" Students circle or point to the first picture to show the pattern repeats.\n\n- **Teacher Role:**\n  - Circulate and ask: \"What color comes next?\" and \"How is the light changing?\"\n  - Avoid directly telling students what to draw; guide with questions.\n  - Scribe observations for non-writers.\n  - Take photos of student drawings for documentation.\n\n- **Expected Student Outcomes:**\n  - Students produce a three-part visual record showing sky color progression.\n  - Students use color and simple words to describe sunrise.\n  - Students recognize a repeating pattern: dark → colorful → bright.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce vocabulary and explain sunrise patterns after hands-on exploration.\n\n- **Materials:**\n  - Chart paper with vocabulary written in large, clear print\n  - Original sunrise photograph (displayed)\n  - Student observation sheets from Explore phase\n  - Markers\n\n- **Activity:**\n  1. **Group share-out:** Ask 4-5 students to show their observation sheet and describe one color they drew. Record their answers on a class chart titled \"Colors We See at Sunrise.\"\n  2. **Introduce key vocabulary** (write each on chart paper with a simple picture):\n     - **Sunrise:** When the sun comes up over the horizon in the morning, and darkness slowly changes to light.\n     - **Horizon:** The line where the sky meets the ground or water—this is where we first see the sun in the morning.\n     - **Pattern:** Something that happens the same way over and over again. At sunrise, the colors and light always change in the same order.\n     - **Daylight:** The time when the sun is up and it is light outside.\n     - **Predict:** To say what you think will happen next, based on what you have seen before.\n  3. **Connect back to photograph:** Point to the sunrise photo and say: \"Look at this picture. The sun is right at the horizon. The sky is orange and pink. This is a sunrise! Tomorrow morning, a sunrise will happen again. The colors might be a little different, but we can predict that the sun will come up again.\"\n  4. **Check for understanding:**\n     - Ask: \"What color is the sky during sunrise?\" (Accept: orange, pink, yellow, red)\n     - Ask: \"Where do we see the sun at sunrise?\" (Accept: at the horizon, coming up, in the east)\n     - Ask: \"Will the sun rise tomorrow? How do you know?\" (Accept: yes, because it happens every day, because it's a pattern)\n  5. **Write a class observation sentence together:** \"The sun rises every morning and brings light. The sky changes colors from dark to orange to blue.\"\n\n- **Vocabulary:**\n  - **Sunrise:** When the sun comes up in the morning and the sky gets lighter.\n  - **Horizon:** The place where the sky meets the land or water.\n  - **Pattern:** Something that happens the same way over and over.\n  - **Daylight:** The bright time of day when the sun is shining.\n  - **Predict:** To say what you think will happen next because you have seen it before.\n\n- **Expected Student Outcomes:**\n  - Students can name at least two colors visible during sunrise.\n  - Students understand that sunrise is a repeating daily pattern.\n  - Students can point to the horizon in a photograph or drawing.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply understanding of sunrise patterns to a new context and extend their thinking about seasonal changes.\n\n- **Materials:**\n  - Sunrise photographs from different times of year (winter sunrise, spring sunrise, summer sunrise, fall sunrise—or descriptions if photos unavailable)\n  - Chart paper titled \"Sunrise Times Change\"\n  - Markers\n  - Optional: simple sunrise prediction chart for each student\n\n- **Activity:**\n  1. **Seasonal sunrise exploration:** Show or describe sunrises from different seasons. Say: \"The sun always rises, but did you know it rises at different times during the year?\"\n  2. **Guided discussion:**\n     - Show a winter sunrise photo (very early, or very late depending on location) and a summer sunrise photo.\n     - Ask: \"In this picture, the sun is rising. What time do you think it is?\" (Accept all answers)\n     - Explain: \"In winter, the sun rises later. In summer, the sun rises earlier. But it always rises! We can predict it will happen.\"\n  3. **Student activity—prediction task:** Give each student a simple chart with four boxes labeled \"Winter,\" \"Spring,\" \"Summer,\" \"Fall.\" Students draw or dictate when they think the sun rises (early/late) or draw the sky colors they might see. Teacher or student scribe writes: \"Early sunrise\" or \"Late sunrise\" or copies student responses.\n  4. **Real-world connection:** Ask: \"Why is it important to know when the sun rises? What do we do when the sun comes up?\" (Listen for: wake up, go to school, eat breakfast, animals wake up)\n  5. **Document on class chart:** Create a \"Sunrise Pattern Chart\" showing that sunrise happens every day and at different times of year.\n\n- **Teacher Role:**\n  - Facilitate discussion without leading students to one \"correct\" answer.\n  - Celebrate observations: \"That's a great pattern you noticed!\"\n  - Encourage students to compare seasonal sunrises.\n  - Guide thinking with questions: \"What do you notice about the time in summer vs. winter?\"\n\n- **Expected Student Outcomes:**\n  - Students recognize that sunrise occurs at different times of year.\n  - Students apply the pattern they learned to a new scenario (seasons).\n  - Students make reasonable predictions about sunrise timing or appearance.\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of sunrise patterns and their ability to make predictions.\n\n- **Activity:**\n  1. **Formative assessment throughout lesson:**\n     - Listen to student responses during Engage phase discussions.\n     - Observe student drawings and descriptions in Explore phase.\n     - Check responses during Explain vocabulary and questioning.\n     - Note student predictions during Elaborate activity.\n\n  2. **Exit ticket (end of lesson):** Ask each student (individually or small group) to respond to one or more of these prompts. Students may draw, dictate to teacher, or write simple responses:\n     - **\"What color is the sky at sunrise?\"**\n     - **\"Where does the sun come up?\"** (Accept: east, over the horizon, in the morning)\n     - **\"Will the sun rise tomorrow? How do you know?\"**\n     - **\"Draw what you would see if you watched a sunrise.\"**\n\n  3. **Success criteria for student understanding:**\n     - ✓ Student can identify at least one color associated with sunrise (orange, pink, yellow, red, blue).\n     - ✓ Student can state that the sun rises every day.\n     - ✓ Student can make a simple prediction: \"Tomorrow, the sun will rise again.\"\n     - ✓ Student can point to or name the horizon in a picture.\n     - ✓ Student recognizes sunrise as a pattern that repeats.\n\n- **Expected Student Outcomes:**\n  - Most students will successfully identify colors and recognize the daily pattern.\n  - Students demonstrate emerging ability to predict sunrise occurrence.\n  - Student observations recorded on exit tickets align with lesson vocabulary and concepts.\n  - Teacher collects student observation sheets and exit tickets as documentation of learning.\n\n---\n\n### Differentiation\n\n- **Support (for struggling learners):**\n  1. **Simplified vocabulary:** Use simpler terms initially. Instead of \"horizon,\" say \"where the sun comes up\" or \"the bottom of the sky.\" Provide picture labels to support understanding.\n  2. **Guided drawing:** Provide pre-drawn sky templates with three distinct sections and sample color shown in first section. Students simply color each section, reducing fine motor and decision-making demands.\n  3. **Partner observation:** Pair students with a buddy during Explore. Buddy reads/describes photos while student draws, or vice versa. This ensures engagement even if reading/writing skills are limited.\n\n- **Challenge (for advanced learners):**\n  1. **Seasonal investigation:** Provide students with four sunrise images from different seasons or times of year (sunrise at 5 AM vs. 7:30 AM). Ask: \"Put these in order from earliest to latest. What pattern do you see?\" Students explain seasonal changes in more detail.\n  2. **Direction and location:** Ask advanced students: \"Which direction does the sun come from at sunrise?\" and provide a compass rose or simple direction diagram. Students identify east and predict where the sun will move (west) by end of day.\n  3. **Extended pattern thinking:** Ask: \"If sunrise is a pattern that repeats every day, what other patterns do you see every day? Can you predict those too?\" Students brainstorm other daily patterns (meals, playtime, sleep) and create a personal daily pattern chart.\n\n---\n\n### Extension Activities\n\n1. **Sunrise observation journal (1-2 weeks):** Give students a simple weekly chart or calendar page. Each morning (or once weekly), students draw or dictate what they observe about the sunrise or morning sky. At the end of the week, students look at all their drawings and identify patterns. Teacher collects as ongoing documentation of student learning about daily patterns.\n\n2. **Sunrise shadow activity:** On a sunny morning, take students outside and mark their shadow with chalk at sunrise (or use a flashlight to simulate early light). Mark the same shadow one hour later. Ask: \"Where did the shadow move? Why?\" Students discover that as the sun moves across the sky, shadows change—connecting sunrise to the sun's movement throughout the day.\n\n3. **Sunrise story or song:** Students create a simple story, poem, or song about sunrise using key vocabulary (sunrise, horizon, daylight, pattern, colors). Example: \"Sunrise, sunrise / Orange in the sky / Sun is coming up / Getting light, oh my!\" Students perform or share with class, reinforcing vocabulary and patterns in a creative format.",
  "inputTokens": 155,
  "outputTokens": 3481,
  "cost": 0.0180878,
  "generatedAt": "2026-02-13T02:48:18.827Z"
}