{
  "title": "Thawing Pond",
  "category": "earth-space-science",
  "imageFile": "thawing_pond.jpg",
  "imagePath": "images/earth-space-science/thawing_pond.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Thawing Pond and Seasonal Change\n\n### Core Science Concepts from Image Analysis\n\n- **Seasonal changes in water:** The photograph shows a frozen or partially thawed pond transitioning from winter to spring, illustrating how water changes state as temperatures warm throughout the year.\n- **Observable patterns in nature:** The bare trees and emerging vegetation demonstrate the predictable cycle of seasons that students can observe and describe.\n- **Sun's effect on the environment:** The melting ice and water visible in the pond reflect increased warmth from the sun during the transition from winter to spring, showing the sun's role in seasonal change.\n- **Time of year indicators:** The condition of trees (leafless), amount of visible water, and ground cover (sparse grass, brown vegetation) are natural clues that indicate a specific time of year and help predict what comes next.\n\n---\n\n### Lesson Title\n\n**The Thawing Pond: Watching Winter Turn to Spring**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 35-40 minute sessions\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** what they see happening to a pond as temperatures change during the transition from winter to spring.\n2. **Identify and explain** how the sun's warmth causes changes in water and the environment around a pond.\n3. **Predict what will happen next** in the pond and surrounding area based on patterns they observe in nature.\n4. **Relate changes in daylight** to seasonal patterns and make predictions about future seasonal changes.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about seasons and the sun's effect on water and the environment.\n\n**Materials:**\n- Large projection screen or printed copies of the thawing pond photograph\n- Chart paper and markers\n- Student observation notebooks or paper\n\n**Activity:**\n\n1. **Display the photograph** prominently on a screen or as a large printed image. Allow students to look at it silently for 30 seconds before speaking.\n\n2. **Ask students to \"turn and talk\"** to a partner about what they notice in the picture. Listen for and note comments about water, ice, trees, season, and weather.\n\n3. **Facilitate a whole-group discussion** using these specific questions:\n   - *\"What do you see in this picture that tells us what time of year it is?\"* (Expected responses: bare trees, some water visible, brown grass, cold-looking)\n   - *\"Do you see any ice or snow? What do you think is happening to it?\"* (Expected responses: melting, getting warmer)\n   - *\"What do you think made the ice start to melt?\"* (Expected responses: the sun, warm weather)\n   - *\"If we looked at this same pond in the summer, what would be different?\"* (Expected responses: more water, more plants, greener grass, trees with leaves)\n\n4. **Record student predictions** on chart paper: *\"What do you think will happen to this pond in the next few weeks?\"* Create a visible list of predictions to revisit later.\n\n5. **Wonder prompt:** *\"I wonder... what does the sun have to do with ice melting? Let's explore and find out!\"*\n\n**Transition:** \"Now we're going to do an experiment to see for ourselves how the sun's warmth changes water, just like in the picture.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how the sun's warmth affects ice and water through hands-on experimentation.\n\n**Materials:**\n- 2 small cups per student (or per pair)\n- Ice cubes (prepare in advance or use small plastic ice cubes if real ice unavailable)\n- Warm water (teacher-prepared, lukewarm, not hot)\n- Cold water (room temperature)\n- Spoons\n- Paper towels\n- Observation notebooks or recording sheets\n- Markers or crayons\n\n**Activity:**\n\n**Part 1: Ice Melting Investigation (15 minutes)**\n\n1. **Set up the experiment:** Give each pair of students two cups. Label one \"warm\" and one \"cold.\"\n\n2. **Add water:** Teacher adds warm water to the \"warm\" cup and cold water to the \"cold\" cup. Students place one ice cube in each cup at the same time.\n\n3. **Student directions (read aloud; display with pictures):**\n   - *\"Watch your ice cubes. Look carefully at what happens.\"*\n   - *\"In your notebook, draw a picture of your cups RIGHT NOW. Show where the ice is.\"*\n   - *\"Every minute, look at your ice and say what you see.\"*\n   - *\"Is the ice melting fast or slow in the warm water?\"*\n   - *\"Is the ice melting fast or slow in the cold water?\"*\n   - *\"Which cup looks more like the pond on a warm spring day?\"*\n\n4. **Observation period:** Allow 8-10 minutes for ice to melt noticeably. Circulate and ask probing questions:\n   - *\"What's happening to the ice in the warm cup?\"*\n   - *\"Is it the same in the cold cup?\"*\n   - *\"Why do you think that is?\"*\n\n5. **Final drawing:** Students draw their cups again showing how the ice looks now. They may draw arrows or write words (with teacher support) to label what happened.\n\n**Part 2: Connection to the Photograph (5 minutes)**\n\n1. **Ask students:** *\"How is what happened with our ice like what's happening in the pond picture?\"*\n2. **Guide responses:** The warmer spring sun acts like the warm water — it melts the ice in the pond. The cold winter sun couldn't melt the ice as fast.\n3. **Record observations:** *\"The sun warmed the water, and that warmed water melted the ice.\"*\n\n**Teacher Role:**\n\n- Circulate and observe student thinking without correcting.\n- Ask open-ended questions: *\"What do you notice?\" \"Why do you think that happened?\"*\n- Support students in recording observations through drawing, dictation, or labeling.\n- Affirm observations: *\"I see you noticed the warm water is clearer — the ice melted so fast!\"*\n\n**Expected Student Outcomes:**\n\n- Students observe that ice melts faster in warm water than cold water.\n- Students recognize that warmth (from the sun) causes ice to melt.\n- Students connect their experiment to the pond in the photograph.\n- Students record observations through drawings and simple labels.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and seasonal concepts; help students understand how sun and seasons are connected.\n\n**Materials:**\n- Chart paper with vocabulary words and pictures\n- Photograph displayed for reference\n- Year circle or seasonal calendar (teacher-made or printed)\n- Markers\n\n**Activity:**\n\n1. **Share observations from Explore:** Ask 3-4 student pairs to show their drawings and describe what they saw. Write key words they use on chart paper.\n\n2. **Introduce vocabulary** using student-friendly definitions and the photograph as reference:\n\n   **Vocabulary:**\n   - **Ice:** Frozen water that is hard and cold. The ice in our experiment melted when it got warm, just like ice in a pond melts in spring.\n   - **Melt:** To change from solid ice into liquid water because it got warmer. The sun's warmth makes ice melt.\n   - **Season:** A time of year with certain weather and daylight patterns. Spring is when ice melts and days get longer.\n   - **Spring:** The season after winter when the sun gets warmer, ice melts, and plants start to grow. This picture shows early spring.\n   - **Pattern:** Something that happens over and over in the same way. Every year, winter is cold and icy, then spring gets warmer and the ice melts.\n\n3. **Connect back to the photograph:**\n   - *\"The pond in the picture is in spring, just like our warm cup.\"*\n   - *\"The sun is higher in the sky now and warmer than in winter.\"*\n   - *\"That warmth is melting the ice, just like our warm water melted the ice.\"*\n   - *\"This happens every year — it's a pattern we can predict.\"*\n\n4. **Introduce the year circle:** Show or draw a simple circle divided into four sections (Winter, Spring, Summer, Fall). Point to where we are now (spring) and trace around to show the pattern.\n\n5. **Check for understanding:** Ask students to point to the warm cup experiment or the photograph and answer: *\"What made the ice melt in both of these?\"* (The warmth/sun). *\"What time of year was it in the picture?\"* (Spring, when it's getting warmer).\n\n**Expected Student Outcomes:**\n\n- Students understand that warmth from the sun melts ice.\n- Students identify spring as a season when this melting happens.\n- Students recognize that seasons follow a repeating pattern.\n- Students connect their experiment to real-world environmental change.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding to predict seasonal patterns and investigate the sun's role across seasons.\n\n**Materials:**\n- Four large sheets of paper labeled \"Winter,\" \"Spring,\" \"Summer,\" \"Fall\"\n- Crayons, markers, colored pencils\n- Student copies of the pond photograph (optional)\n- Chart paper showing sunrise/sunset times for different seasons (teacher-prepared, simple)\n\n**Activity:**\n\n**Option A: Seasonal Prediction Activity (Recommended for this grade)**\n\n1. **Show the thawing pond photograph again.** Ask: *\"We know this is spring because the ice is melting and the sun is getting warmer. Let's think about what will happen in the same spot in summer, fall, and winter.\"*\n\n2. **Create a class chart** with four sections (Winter, Spring, Summer, Fall). For each season, ask students:\n   - *\"Will there be ice on the pond?\"*\n   - *\"What will the trees look like?\"*\n   - *\"What will the sun be doing?\"*\n   - *\"How long will it be light outside?\"*\n\n3. **Record student predictions** on the chart with simple drawings and words.\n\n4. **Individual or pair drawing:** Students choose one season (other than spring) and draw what they think the same pond would look like. They label: *\"In [season], the pond will look like this because...\"* (with teacher scribing if needed).\n\n**Option B: Daylight Observation and Prediction**\n\n1. **Introduce daylight patterns:** *\"In spring, the sun is up longer each day. In winter, it's dark earlier. Let's see this pattern.\"*\n\n2. **Show or discuss a simple chart** of sunrise and sunset times for your location across the year (teacher-prepared—can be very simple).\n\n3. **Ask:** *\"Which season has the most daylight? Which has the least?\"* Guide students to see that spring and summer have longer days.\n\n4. **Connection to the pond:** *\"Because there's more sunlight in spring and summer, the sun warms the water more, and ice melts faster. That's a pattern!\"*\n\n5. **Student activity:** Students draw two clocks—one showing \"winter time\" (sun sets early) and one showing \"spring/summer time\" (sun sets late). Label with a simple sentence: *\"In spring, it stays light longer, so the sun warms the pond more.\"*\n\n**Teacher Role:**\n\n- Facilitate predictions without judgment; welcome all student ideas.\n- Ask probing questions: *\"Why do you think the trees will look that way?\" \"How will the sun be different?\"*\n- Support students in making connections between daylight, sun's warmth, and seasonal changes.\n- Record student thinking visibly so they see their reasoning valued.\n\n**Expected Student Outcomes:**\n\n- Students predict what the pond and surrounding environment will look like in other seasons.\n- Students connect daylight length to seasonal changes and warmth.\n- Students demonstrate understanding that seasons follow a predictable pattern related to the sun.\n- Students apply their knowledge of melting and warmth to explain seasonal differences.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of seasonal patterns, the sun's role, and ice melting.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- Observe student participation during Engage and Explore phases.\n- Listen to student explanations during group discussions.\n- Review drawings and labels from Explore and Elaborate activities.\n- Use teacher questioning to gauge understanding (e.g., *\"What made the ice melt?\" \"What season is shown in the picture?\" \"What will happen next?\"*).\n\n**Summative Exit Ticket (End of Session 2):**\n\nProvide each student with a simple recording sheet with these prompts (can be drawings, words, or both):\n\n1. **Draw or write:** *\"The ice in the pond melted because_______________.\"* (Expected response: the sun got warmer, it's spring, warmth melts ice)\n\n2. **Point to or circle:** Show a simple illustration with four scenes (winter ice, spring thawing, summer water, fall leaves). Ask: *\"Which picture shows spring?\"* (Expected response: the thawing pond)\n\n3. **Predict:** *\"What do you think will happen to the pond next?\"* (Expected responses: more water, trees will grow leaves, it will get warmer, no more ice)\n\n**Alternative Assessment (Observation-Based):**\n\nDuring Elaborate, observe student participation and use a simple checklist:\n- ☐ Student describes how the sun causes ice to melt\n- ☐ Student identifies the season shown in the photograph\n- ☐ Student predicts seasonal changes using reasoning\n- ☐ Student relates daylight to seasonal warmth\n\n**Success Criteria:**\n\nStudents meet learning objectives when they can:\n- **Objective 1:** Describe observations about the pond (bare trees, melting ice, water visible) and connect these to the season (spring).\n- **Objective 2:** Explain that the sun's warmth melts ice and causes the seasonal changes visible in the photograph.\n- **Objective 3:** Make reasonable predictions about what will happen to the pond in coming weeks or other seasons based on patterns.\n- **Objective 4:** Understand that daylight increases with warmer seasons and relate this to the sun's effect on the environment.\n\n**Expected Student Outcomes:**\n\n- Most first graders will recognize that the photograph shows spring because ice is melting.\n- Students will understand that warmth (from the sun) melts ice.\n- Students will predict at least one change that will occur in the same location during another season.\n- Students will make a simple connection between longer daylight and warmer weather.\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified vocabulary and visuals:** Use only the words \"ice,\" \"melt,\" \"warm,\" and \"sun.\" Pair vocabulary words with consistent, simple pictures. Provide a visual reference chart posted in the room throughout the lesson.\n\n2. **Hands-on continuation:** Allow students extra time with the ice melting experiment. Provide direct prompts: *\"Touch the water in the warm cup. Is it warm or cold? Is the ice melting fast or slow?\"* Avoid open-ended questions; use yes/no or either/or questions instead.\n\n3. **Supported drawing and recording:** Provide sentence starters for students to copy or circle: *\"The ice melted because the water was _____ (cold/warm).\" \"In spring, the pond has _____ (ice/water).\"* Allow students to draw without labels if writing is difficult.\n\n4. **Peer partnership:** Pair struggling learners with stronger observers during Explore. The partner can explain what they both see, reducing language demand.\n\n**Challenge (For Advanced Learners):**\n\n1. **Extended predictions and reasoning:** Ask students to predict what happens to the plants and animals around the pond as it thaws. *\"What animals might come to drink water? What plants might start to grow?\"* Have them draw or write explanations: *\"I think _____ will happen because...\"*\n\n2. **Data collection and tracking:** Have advanced students create a simple data table or tally chart tracking how long it takes ice to melt in different temperatures (warm, room temperature, cold). Extend to predict: *\"If we used even warmer water, what would happen?\"*\n\n3. **Sun position investigation:** Introduce the idea that the sun is higher in the sky in spring than winter. If possible, have students observe the sun's position during outdoor time on different days and mark it on a chart. Discuss: *\"Does the sun being higher make it warmer? Why?\"*\n\n4. **Seasonal connections across ecosystems:** Provide pictures of other places (forest, mountain, desert) and ask: *\"How would spring look different in these places? Would the pond look the same if it were in a desert?\"* Challenge students to think about climate and location.\n\n---\n\n### Extension Activities\n\n1. **Seasonal Photo Journal:** Over several weeks, take photos of the same outdoor location in your school or community (the school pond, a water fountain, a tree, a garden). Display photos in order of season and have students observe patterns: *\"What changed? What stayed the same? Why?\"* Have students draw or dictate predictions for the next season. (Connects to 1-ESS1-2: relating time of year to observable changes)\n\n2. **Moon and Stars Observation:** Extend the lesson to include 1-ESS1-1 by having students observe and record when the moon and stars appear during different seasons. Create a simple chart: *\"In spring, we see the moon rise at _____ (time). In winter, we see it at _____ (time).\"* Discuss how seasons affect what we see in the sky and when daylight ends.\n\n3. **Water Cycle in a Bag:** Create a simple water cycle model in a sealed plastic bag with water and markers for sun and rain. Display it in a sunny window and have students observe over days/weeks. Ask: *\"Where does the water go? Does it melt and evaporate like the ice in the pond?\"* This builds toward understanding that melted water becomes part of larger environmental cycles. (Foundational for future water cycle learning)\n\n---",
  "inputTokens": 159,
  "outputTokens": 4307,
  "cost": 0.0222218,
  "generatedAt": "2026-02-13T06:50:19.039Z"
}