{
  "title": "Weather",
  "category": "earth-space-science",
  "imageFile": "weather.jpg",
  "imagePath": "images/earth-space-science/weather.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Storm Clouds and Weather Patterns\n\n### Core Science Concepts from Image Analysis\n\n- **Weather observation:** Recognizing visible changes in weather conditions, such as dark storm clouds that indicate changing atmospheric conditions\n- **Pattern prediction:** Understanding that certain weather signs (dark, heavy clouds) often indicate that rain or severe weather is coming\n- **Seasonal and daily weather patterns:** Noticing how weather changes throughout the day and recognizing that some weather patterns can be observed and predicted\n- **Natural phenomena visibility:** Observing that weather changes are visible in the sky and environment, and learning to read these signs\n\n---\n\n### Lesson Title\n\n**Dark Clouds Coming: Learning to Predict Weather Changes**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** 1st Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 35-40 minute sessions (total 70-80 minutes)\n- **NGSS Standards:** \n  - 1-ESS1-1: Use observations of the sun, moon, and stars to describe patterns that can be predicted.\n  - 1-ESS1-2: Make observations at different times of year to relate the amount of daylight to the time of year.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and describe what the sky looks like when weather is changing\n- Predict that dark, heavy clouds often mean rain is coming\n- Make daily observations of weather and record simple patterns\n- Understand that weather changes are natural patterns that can be watched and predicted\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by examining the photograph of changing weather conditions.\n\n**Materials:**\n- Projected image of the photograph (large enough for all students to see clearly)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a screen or smartboard. Do not label or explain it yet. Give students 30 seconds to simply look and observe silently.\n\n2. **Ask students to turn to a partner** and answer: \"What do you notice in this picture? What is happening in the sky?\"\n\n3. **Facilitate a whole-group discussion** using these specific guiding questions:\n   - \"What color are the clouds in this picture?\" (dark gray/blue)\n   - \"Have you ever seen clouds that look like this before? When?\"\n   - \"What do you think happens after the sky looks like this?\" (Accept all predictions—rain, storms, wind, etc.)\n   - \"How do you think we could tell if rain is coming just by looking at the sky?\"\n\n4. **Create a class prediction chart** on the board:\n   - Write: \"What happens when we see dark, heavy clouds?\"\n   - Record student predictions in their own words\n   - Do not correct predictions yet—these will be revisited during Explain phase\n\n5. **Prediction prompt:** \"Today we're weather detectives. We're going to learn what dark clouds tell us about weather changes!\"\n\n**Transition:** \"Let's do an investigation to see what weather signs we can find and what they tell us.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate weather observations by examining the photograph closely and conducting a classroom weather observation activity.\n\n**Materials:**\n- Printed copies or projected image of the photograph (one per pair of students, if possible)\n- \"Weather Detective Observation Sheet\" (simple template with pictures of different cloud types and weather conditions)\n- Crayons or colored pencils\n- Chart paper with pre-drawn boxes labeled: \"Sunny Day,\" \"Cloudy Day,\" \"Rainy Day\"\n- Window access for live weather observation (if available)\n\n**Activity:**\n\n**Part 1: Photograph Investigation (10-12 minutes)**\n\n1. **Distribute the photograph** (printed or viewed together) to pairs of students.\n\n2. **Provide hands-on observation time.** Tell students: \"You are weather detectives. Look very carefully at the sky in this picture. What details do you notice?\"\n\n3. **Guided discovery questions** (ask one at a time, allowing think-pair-share time):\n   - \"How dark are the clouds? Are they light or very dark?\"\n   - \"Can you see the sun in this picture?\"\n   - \"What else is different about the sky compared to a sunny day?\"\n   - \"What do you notice about the buildings and road? How bright or dark do they look?\"\n   - \"If you were outside in this weather, what would you feel? (Wind? Cool air? Wetness?)\"\n\n4. **Have students draw or color** the sky from the photograph on their Weather Detective Observation Sheet, using dark colors for the clouds.\n\n**Part 2: Classroom Weather Observation (8-10 minutes)**\n\n1. **If possible, look out the classroom window** and have students observe the current weather: \"What does OUR sky look like right now?\"\n\n2. **Compare:** \"Is it like the picture we just looked at, or different? Why?\"\n\n3. **Sort sky images:** Using the chart paper, have students sort pictures or draw simple representations of different sky conditions into the three boxes (Sunny, Cloudy, Rainy).\n\n**Teacher Role:**\n- Circulate among student pairs during observation\n- Ask open-ended questions: \"What else do you see?\" \"Why do you think that is?\"\n- Encourage students to use descriptive language: dark, bright, gray, heavy, thick, light\n- Do NOT explain what clouds mean yet—let students observe and wonder\n- Document student observations on a clipboard for later reference\n\n**Expected Student Outcomes:**\n- Students can describe the color and appearance of storm clouds\n- Students notice differences between sunny skies and cloudy/dark skies\n- Students begin to connect dark clouds with potential weather changes\n- Students have made simple drawings or records of their observations\n\n---\n\n#### 3. EXPLAIN (15-18 minutes)\n\n**Objective:** Introduce formal vocabulary and formalize the concept that observable patterns in the sky can help predict weather.\n\n**Materials:**\n- Projected photograph (large display)\n- Large word cards with vocabulary terms\n- \"Weather Pattern\" poster or chart\n- Picture cards showing different cloud types (optional but helpful)\n\n**Activity:**\n\n1. **Group share-out from Explore phase (5 minutes):**\n   - Ask 3-4 students to share what they drew and what they observed\n   - Write key observations on chart paper: \"We noticed: dark clouds, no sun, gray sky, looks dark outside\"\n   - Affirm all observations: \"Great noticing! You are being real weather scientists!\"\n\n2. **Introduce key vocabulary (6-7 minutes):**\n   Present each term using the photograph as reference:\n\n   **Vocabulary Terms:**\n   - **Weather:** The conditions outside right now—is it sunny, rainy, windy, or cold?\n   - **Clouds:** The white or gray puffy things we see in the sky made of tiny water drops\n   - **Storm clouds (or heavy clouds):** Very dark, thick clouds that often bring rain or storms\n   - **Weather pattern:** Signs in nature that repeat and help us predict what will happen next\n   - **Predict:** Using what we observe to guess what will happen next\n\n3. **Make explicit connections (4-5 minutes):**\n   - Point to the photograph and say: \"Look at these storm clouds. They are very dark and heavy. When we see clouds that look like this, we can predict something: rain is coming!\"\n   - \"Did anyone predict this during our investigation? Great! You were using your observation skills just like real meteorologists!\"\n   - Revisit the prediction chart from Engage: \"Were our guesses right? Yes! Dark clouds often mean rain is coming.\"\n\n4. **Check for Understanding:**\n   - Ask: \"If you were outside and looked up at the sky and saw very dark clouds like in this picture, what would you predict?\"\n   - Have students show a thumbs up, sideways, or down to indicate confidence\n\n**Expected Student Outcomes:**\n- Students understand the connection between dark clouds and rain\n- Students can use vocabulary: weather, clouds, storm clouds, predict, pattern\n- Students recognize that observations help us predict weather\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by making real-world weather observations and creating a classroom weather prediction system.\n\n**Materials:**\n- Simple weather observation chart for the classroom (large, visible)\n- Pictures or symbols of different weather conditions (sun, cloud, rain, wind)\n- Crayons, markers, or colored pencils\n- Optional: tablet or camera for documenting daily sky observations\n- \"Weather Prediction Journal\" (simple template with boxes for drawing and a sentence starter)\n\n**Activity:**\n\n**Part 1: Create a Classroom Weather Observation Chart (8-10 minutes)**\n\n1. **Introduce the task:** \"We're going to be weather detectives every day. We'll look at the sky each morning and make predictions about our weather.\"\n\n2. **Create a chart together** on large paper or poster board with:\n   - A section for TODAY'S WEATHER (with space for drawing the sky)\n   - A section for OUR PREDICTION (will it be sunny, cloudy, or rainy?)\n   - A section for WHAT REALLY HAPPENED (to check predictions later)\n\n3. **Model this activity:** \"Watch me. I'm going to look at the sky right now (or in our photograph). I see dark clouds. My prediction is: rain is coming. Let me draw what I see and write my prediction.\"\n\n4. **Invite students to contribute:** Have 4-5 volunteers add their own weather observations and predictions to the chart using drawings and simple words.\n\n**Part 2: Weather Prediction Journal Start (5-7 minutes)**\n\n1. **Explain:** \"Each of you gets to be a weather detective with your own journal. Today, we'll draw what the sky looks like and write what we predict.\"\n\n2. **Provide the template** with a sentence starter: \"I see _____ clouds. I predict it will _____.\"\n\n3. **Students draw the current sky** and write or dictate their prediction.\n\n4. **Explain the ongoing activity:** \"Tomorrow, we'll check if our predictions came true! Weather scientists do this all the time.\"\n\n**Teacher Role:**\n- Circulate and support student drawings and writing\n- Ask: \"What colors do you need for your clouds?\" \"What is your prediction?\"\n- Help students write or scribe predictions for those who need support\n- Take photos of student work for documentation\n\n**Expected Student Outcomes:**\n- Students create a weather observation with a prediction\n- Students demonstrate understanding that weather can be observed and predicted\n- Students show excitement about becoming \"weather detectives\"\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of weather observation and simple weather prediction based on visible patterns.\n\n**Activity:**\n\n**Formative Assessment (ongoing during Elaborate):**\n- Observe student responses during discussions: Can they describe what they see in the photograph?\n- Check student drawings: Do they represent storm clouds with dark colors?\n- Listen to student predictions: Do they use reasoning based on observations? (\"Dark clouds mean rain\")\n\n**Exit Ticket/Summative Assessment (end of Lesson 1):**\n\n**Ask students to respond to (show pictures if needed for early readers):**\n\n1. \"Show me with your hand: Are storm clouds light or dark?\" (assess vocabulary comprehension)\n\n2. \"When you see dark, heavy clouds in the sky, what do you predict will happen?\"\n   - Acceptable answers: \"rain,\" \"storm,\" \"water,\" \"it will be wet\"\n\n3. \"If you looked outside right now and saw dark clouds, would you bring an umbrella? Why or why not?\"\n   - Assesses connection between observation and prediction\n\n**Success Criteria:**\n- Students can identify storm clouds as dark/heavy\n- Students can predict that dark clouds mean rain is likely coming\n- Students can explain their prediction using simple observation language (\"I see dark clouds, so I think it will rain\")\n\n**Expected Student Outcomes:**\n- At least 80% of students can identify dark storm clouds\n- At least 75% of students can make a reasonable weather prediction based on cloud observation\n- Students demonstrate understanding that weather patterns can be observed and used to predict what will happen\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified vocabulary:** Use only 2-3 key words (clouds, dark, rain) instead of full vocabulary list. Repeat these terms consistently and post them with pictures in the classroom.\n\n2. **Visual supports:** Provide picture cards showing different cloud types and weather conditions. During activities, let students point to pictures instead of drawing or writing if fine motor skills are a barrier.\n\n3. **Peer partnerships:** Pair students with stronger language/fine motor skills for Explore and Elaborate activities. Allow students to dictate observations to their partner or teacher rather than writing independently.\n\n4. **Reduced observation task:** During Explore, focus only on \"Is the sky dark or light?\" rather than multiple observation questions. Simplify the Weather Detective Observation Sheet to one or two elements.\n\n**Challenge (for advanced learners):**\n\n1. **Extended prediction:** Ask students: \"If we see dark clouds, what else might happen besides rain? Could there be wind? Thunder? Lightning?\" Have them research (with teacher support) and draw multiple weather outcomes.\n\n2. **Multi-day weather tracking:** Challenge students to make weather predictions for multiple days and create a chart showing: predicted weather vs. actual weather. Introduce the concept of \"patterns over time.\"\n\n3. **Weather comparison:** Provide photographs of different skies from different seasons or times of day. Ask: \"Compare these two skies. Which one shows storm clouds? How are they different?\"\n\n4. **Real-world connection:** Ask students to create a \"weather safety\" poster: \"When we see storm clouds, we should _____.\" Have them think about safety responses (go inside, bring umbrella, etc.).\n\n---\n\n### Extension Activities\n\n1. **Daily Sky Observer (On-going activity):** Establish a routine where students observe and record the sky each morning for 2 weeks. Create a simple bar graph showing sunny vs. cloudy vs. rainy days. Discussion: \"Did we predict the weather correctly? What patterns do we notice?\" This extends 1-ESS1-2 by relating weather observations over time.\n\n2. **Weather Storybook Creation:** Students work in small groups to create a simple 4-page storybook: \"The Day the Dark Clouds Came.\" Pages show: 1) sunny morning, 2) dark clouds appear, 3) rain comes, 4) sun returns. Students illustrate and dictate or write simple text for each page. Emphasize the sequence and pattern.\n\n3. **Family Weather Observation:** Send home a simple \"Weather Detective at Home\" worksheet where families observe and record the sky together each evening for one week. Students return with drawings and observations, which are compiled into a class \"Community Weather Journal.\" Share observations in a class meeting and discuss similarities and differences in what families observed.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 155,
  "outputTokens": 3445,
  "cost": 0.0179078,
  "generatedAt": "2026-02-13T04:12:25.738Z"
}