{
  "title": "Weather",
  "category": "earth-space-science",
  "imageFile": "weather.jpg",
  "imagePath": "images/earth-space-science/weather.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Stormy Skies and Weather Watching\n\n### Core Science Concepts from Image Analysis\n\n- **Weather observation and pattern recognition:** The photograph clearly shows dramatic storm clouds (dark, heavy clouds) approaching, which kindergarteners can observe and describe to identify weather changes and patterns over time.\n- **Severe weather awareness and safety:** The dark, threatening sky demonstrates conditions associated with storms, helping students understand why weather forecasting matters and how to prepare for changing weather conditions.\n- **Human-built structures and weather:** Power lines, utility poles, streetlights, and buildings in the photograph show how humans build infrastructure and modify the environment, which can be affected by severe weather.\n- **Sky observation as a tool for learning:** The photograph captures a striking, real-world moment that invites students to ask questions about why the sky looks this way and what happens before, during, and after storms.\n\n---\n\n### Lesson Title\n\n**Watching the Clouds: When Storms Come Our Way**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 30-minute sessions (can be split across two days or combined into one 60-minute block with a movement break)\n- **NGSS Standards:** K-ESS2-1, K-ESS3-2\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and describe what the sky looks like when a storm is coming (using words like dark, cloudy, grey).\n- Identify changes in weather conditions and explain why we need to know about storms.\n- Ask questions about why the sky changes and what we should do when storms come.\n- Share one way to stay safe when there is a big storm outside.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph while introducing the concept of observing weather changes.\n\n**Materials:**\n- Printed or displayed photograph of the stormy sky\n- Chart paper or whiteboard\n- Markers\n- Optional: A window with a view of the actual sky for comparison\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it large so all students can see clearly. Ask students to sit in a circle where they can all view it easily.\n\n2. **Introduce with curiosity:** Say: \"I have a special picture to show you. Look carefully at the sky. What do you notice? How does it look different from today?\"\n\n3. **Ask these specific discussion questions** (allowing time for responses after each):\n   - \"What colors do you see in the sky? Can you describe the clouds?\"\n   - \"Do the clouds look happy and fluffy, or dark and heavy? Why do you think that?\"\n   - \"Have you ever seen a sky that looks like this? What happened next?\"\n   - \"What do you think might happen soon in this picture?\"\n\n4. **Wonder prompt:** Say: \"I wonder... what is special about a sky that looks this dark and grey? I wonder what the people in this picture are doing to get ready.\" Write student wonderings on chart paper as they share.\n\n5. **Activate prior knowledge:** Ask: \"Has your family ever talked about a storm coming? What did people do to get ready?\"\n\n**Transition:** \"Today, we're going to be weather scientists! We're going to observe the sky, learn about storms, and find out how we can stay safe. Let's explore!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate weather patterns and storm safety through observation and questioning, using the photograph and classroom activities.\n\n**Materials:**\n- Photograph (still displayed or printed copies for small groups)\n- Sky observation chart (pre-made simple template with drawings of: sunny, cloudy, rainy, stormy skies)\n- White and dark grey crayons or colored pencils\n- Paper plates (4 per student)\n- Markers\n- Optional: Window access for real-world observation\n\n**Activity:**\n\n**Part 1: Photograph Investigation (10 minutes)**\n\n1. Distribute printed copies of the photograph to small groups (3-4 students per group), or have students gather close to the large display.\n\n2. **Provide student directions** in simple, observable language:\n   - \"Point to the clouds. What color are they? Are they light or dark?\"\n   - \"Look at the trees. Do they look still or are they moving?\"\n   - \"Can you see the sun? Where is it hiding?\"\n   - \"What do you think the people in this picture are feeling right now?\"\n\n3. **Teacher facilitation:** Circulate and ask open-ended questions without giving answers:\n   - \"What makes you say the sky looks dark?\"\n   - \"What do you think happens when clouds get this dark?\"\n   - Use a simple **\"I notice, I wonder\"** chart to record student observations and questions.\n\n4. **Student documentation:** Have each group draw what they see in the photograph on a large sheet of paper. Encourage them to show:\n   - The dark clouds\n   - The street and buildings\n   - The way the sky makes them feel (using colors and shapes)\n\n**Part 2: Weather Wheel Creation (10-15 minutes)**\n\n1. Distribute four paper plates to each student.\n\n2. **Student directions:**\n   - On each plate, draw a different type of sky: sunny, cloudy, rainy, and stormy.\n   - Use crayons to color each one: yellow for sunny, light grey for cloudy, blue for rainy, dark grey/black for stormy.\n   - Describe what you see: \"The stormy sky is very dark. The clouds are heavy and dark.\"\n\n3. **Connection to photograph:** Point out that the photograph shows the stormy plate we just made.\n\n4. **Teacher role:** Help students who need hand-over-hand support. Ask: \"Which plate looks like the picture we saw?\"\n\n**Expected Student Outcomes:** Students produce a weather wheel showing different sky conditions and can point to the stormy sky in the photograph.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to weather concepts and safety.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- Vocabulary cards with pictures (printed or drawn)\n- The photograph (still visible)\n- Optional: Picture cards showing storm preparation (people in shelters, indoors, etc.)\n\n**Activity:**\n\n1. **Group share-out:** Ask 2-3 groups or students to show their weather wheels and describe what they drew for the stormy sky. As they share, affirm their observations and use them as a springboard for teaching.\n\n2. **Introduce key vocabulary** with picture support and simple, concrete definitions:\n\n   **Vocabulary:**\n   - **Storm:** A time when the weather is very rough and dangerous, with dark clouds, rain, thunder, and sometimes wind. The sky gets very dark.\n   - **Weather:** What the sky and air are like outside (sunny, rainy, windy, snowy, stormy).\n   - **Clouds:** White or grey things floating in the sky made of tiny water drops. Dark clouds mean a storm might be coming.\n   - **Safe:** Protected from danger. Staying inside during a storm keeps us safe.\n   - **Weather forecast:** A person's job to watch the sky and tell people what the weather will be like so they can get ready.\n\n3. **Connections back to the photograph:**\n   - Point to the sky: \"Look at these dark clouds. This is what a stormy sky looks like. Can you see how dark it is?\"\n   - Point to the buildings and street: \"The people here need to be careful because a storm is coming. See how dark it is getting?\"\n   - Point to the power lines: \"Storms can be dangerous, so we need to know they're coming. That's why weather forecasters watch the sky.\"\n\n4. **Check for understanding** using think-pair-share:\n   - Say: \"Turn to a friend and tell them: What does the sky look like when a storm is coming?\"\n   - Listen to responses. Correct gently: \"Yes, it gets very dark and grey!\"\n\n**Expected Student Outcomes:** Students can use the words \"storm,\" \"clouds,\" and \"safe\" in simple sentences and can describe what a stormy sky looks like.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding of weather observation and storm safety to a real-world scenario.\n\n**Materials:**\n- Picture cards of various weather scenarios (sunny day at park, rainy day at home, dark sky approaching, people in a shelter, etc.)\n- Chart paper titled \"What Do We Do When a Storm Comes?\"\n- Magazines or printed pictures for a weather preparation collage\n- Glue, scissors, markers\n\n**Activity:**\n\n**Part 1: Storm Safety Scenarios (8-10 minutes)**\n\n1. Show picture cards one at a time and ask: \"Is this a safe time to go outside?\" or \"What should we do right now?\"\n\n2. For the dark/stormy sky picture: \"If the sky looks like this, what should we do? Where should we go to stay safe?\"\n\n3. Create a class chart titled **\"When a Storm is Coming, We...\"** and record student responses:\n   - Go inside a building\n   - Stay away from windows\n   - Stay with an adult\n   - Wait until the sky is light again\n   - Listen to grown-ups about weather\n\n**Part 2: Storm Preparation Collage (7-10 minutes)**\n\n1. **Explain the activity:** \"We're going to make a picture showing what people do to get ready when a storm is coming.\"\n\n2. **Student directions:**\n   - Look at pictures of things that help keep us safe in a storm (house, shelter, family together, etc.).\n   - Cut or tear pictures and glue them onto a large sheet of paper.\n   - Draw or write (with teacher help) one thing your family does when a storm is coming.\n\n3. **Teacher role:** Facilitate conversations about student experiences with storms. Normalize feelings: \"Sometimes storms are scary. It's okay to feel a little worried, and we know what to do to stay safe.\"\n\n**Expected Student Outcomes:** Students can identify safe behaviors during storms and create visual representations of storm preparation.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of weather observation, storm recognition, and safety.\n\n**Activity:**\n\n**Formative Assessment (ongoing during lesson):**\n- **Observation during Explore phase:** Did students accurately identify dark clouds and describe the stormy sky using descriptive words?\n- **Listen-in during Think-Pair-Share:** Can students describe a stormy sky using at least 2-3 descriptive words (dark, grey, cloudy, heavy)?\n- **Weather wheel examination:** Do all four sky types show distinct visual differences? Can students point to the stormy sky?\n\n**Exit Ticket / Summative Assessment:**\n\nUse one of these strategies:\n\n**Option A: Picture Identification (for non-readers)**\n- Show three pictures: sunny sky, rainy sky, stormy sky\n- Ask: \"Point to the stormy sky. How does it look?\"\n- Listen for responses using words like \"dark,\" \"grey,\" \"scary,\" \"clouds\"\n\n**Option B: Think-Aloud Reflection**\n- Gather students in a circle with the original photograph visible\n- Ask one-on-one: \n  - \"When you see a sky that looks like this, what do you do?\"\n  - \"Why is it important to watch the sky and know about storms?\"\n  - Accept responses like: \"Go inside,\" \"Stay safe,\" \"Tell a grown-up\"\n\n**Option C: Drawing Assessment**\n- Provide a blank paper with \"When a storm comes, I ___\" (with a picture of a dark sky)\n- Have students draw what they do to stay safe\n- Teacher scribes their explanation\n\n**Success Criteria:**\n- ✓ Student can identify a stormy sky (dark, grey) in the photograph\n- ✓ Student uses at least one descriptive word for stormy weather (dark, cloudy, scary, heavy)\n- ✓ Student can name one safe action to take when a storm is coming (go inside, stay with adult, stay away from windows)\n- ✓ Student demonstrates awareness that storms are important to know about\n\n**Expected Student Outcomes:** Students demonstrate understanding that dark, heavy clouds signal an approaching storm and that staying inside is a safe response. Most kindergarteners should meet 3 of 4 success criteria.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified picture sorts:** Instead of creating complex weather wheels, provide pre-drawn pictures of sunny and stormy skies. Students simply match them with words or point to \"dark\" or \"light.\"\n\n2. **Hand-over-hand guidance during drawing:** Sit with students who have fine motor delays and provide verbal prompts (\"Draw a dark cloud here\") while physically guiding their hand if needed.\n\n3. **Pre-taught vocabulary:** Before the lesson, practice the key words (storm, safe, clouds, dark) with these students using picture cards and repetition during transition times.\n\n4. **Concrete storm safety practice:** Use a classroom \"safe corner\" or designated spot where students practice going quickly and staying calm when you say \"Storm is coming!\" This builds procedural understanding without relying on abstract conversation.\n\n**Challenge (for advanced learners):**\n\n1. **Weather prediction:** After observing the dark sky in the photograph, ask: \"What do you think will happen next? Will it rain? Will there be wind? Why do you think that?\" Have students draw predictions and explain their thinking.\n\n2. **Multi-day observation chart:** Challenge students to observe and record the actual sky for 3-5 days using a simple chart (smiley face for sunny, frown for stormy, etc.). Compare their observations to a real weather forecast.\n\n3. **Interview extension:** Have students ask family members: \"How do you prepare for storms?\" and bring back one picture or short description to share with the class. Create a class \"Storm Safety Ideas\" poster from their interviews.\n\n4. **Connect to causes:** For curious students, introduce a simple explanation: \"Clouds get dark when lots of water is in them. That's when rain and storms happen.\" You can show how shaking a clear bottle with water droplets demonstrates this concept.\n\n---\n\n### Extension Activities\n\n1. **Storm Safety Role-Play Station:** Set up a classroom corner with props (toy house, stuffed animals, picture cards of outdoor vs. indoor). Students role-play what they would do if a storm warning was announced. Rotate students through this during choice time for several days.\n\n2. **Weather Journaling (Parent-Child Activity):** Send home a simple template with four boxes labeled: sunny, cloudy, rainy, stormy. Over one week, students and parents observe the sky each day and mark or draw what they see. Return to school and create a class graph of which weather occurred most often.\n\n3. **Read-Aloud Follow-Up:** Share an age-appropriate book about weather or storms, such as:\n   - *Come On, Rain!* by Karen Hesse (adaptation for K)\n   - *Listening Walk* by Paul Showers (to notice environmental changes before storms)\n   \n   After reading, discuss how the characters in the book noticed the changing sky and what they did to stay safe.\n\n4. **\"Storm Sounds\" Sensory Activity:** Play a short sound recording of thunder and rain in a safe, controlled setting. Discuss how we hear changes too, not just see them. Let students use instruments (drums, shakers) to make storm sounds while others listen with eyes closed.\n\n5. **Weather Forecast Role-Play:** Students take turns being the \"weather reporter\" using the photograph. They stand by a window or point to the photo and describe the sky to the class in their own words, practicing observation and communication skills.\n\n---\n\n## Implementation Notes for the Teacher\n\n**Classroom Management:**\n- Kindergarteners may have varied experiences with storms—some may feel anxious. Frame the lesson positively: \"Storms are part of nature, and we know how to stay safe.\"\n- If any student expresses fear, validate feelings and redirect to safety: \"Yes, storms can be loud and scary. And when we go inside, we are safe with our family.\"\n\n**Safety Consideration:**\n- If you have a severe weather event during this lesson, pause and practice your actual school shelter-in-place or safety procedures. This makes the learning concrete and meaningful.\n\n**Timing Flexibility:**\n- This lesson can span two days: Day 1 (Engage + Explore), Day 2 (Explain + Elaborate + Evaluate).\n- Or compress into one longer block with a movement break after Explore.\n\n**Connection to Home:**\n- Send a simple note to families: \"We learned about storms and how to stay safe. Ask your child what the sky looks like when a storm is coming!\" This bridges school and home learning.",
  "inputTokens": 263,
  "outputTokens": 3876,
  "cost": 0.0262405,
  "generatedAt": "2026-02-13T04:11:47.080Z"
}