{
  "title": "Weather",
  "category": "earth-space-science",
  "imageFile": "weather.jpg",
  "imagePath": "images/earth-space-science/weather.jpg",
  "content": "# Engineering Design Challenge: Severe Weather Infrastructure\n\n### Visible Elements in Photo\n\n- **Power lines and utility poles** – Multiple wooden and metal poles supporting numerous electrical cables running across the scene.\n- **Dark storm clouds** – Heavy cloud cover obscuring mountains/hills in the background, indicating severe weather approaching.\n- **Paved road with sidewalk** – A cleared, flat surface running straight through the scene with utility infrastructure alongside.\n- **Street light poles** – White poles designed to illuminate the area, positioned along the road.\n- **Industrial/commercial buildings** – Structures visible in the middle distance, suggesting an area of infrastructure and human activity.\n\n### Reasonable Inferences\n\n- **From power lines + storm clouds**: Electrical infrastructure in this location must withstand high winds and weather events. The visible sag and arrangement of cables suggest the system is designed for tension and load, but severe storms pose a risk to these structures.\n- **From multiple utility poles in one area**: This is a densely developed region where many services (power, communications) share infrastructure, making system failures more impactful.\n- **From flat, open landscape + approaching storm**: The area offers little natural wind protection, meaning structures must be engineered to resist severe weather loads directly.\n\n### Engineering Task\n\n**K-2 Version:**\nDesign a tall tower that can hold onto its wires and cables even when the wind blows hard. Use straws and string to build a tower that is at least 12 inches tall. Test it by gently blowing on it or using a fan. Can your tower keep standing? Can it hold 3-5 paper clips hanging from strings without bending over?\n\n**3-5 Version:**\nDesign a utility pole structure that can safely support electrical cables during severe wind events. Your structure must:\n- Be at least 24 cm tall\n- Support a hanging load of at least 200 grams (weights or washers) without tilting more than 15 degrees\n- Remain standing when exposed to wind from a desk fan on medium speed for 30 seconds\n- Use only: wooden dowels or straws, string, tape, and paper clips\n\nSuccess criteria: Structure stands upright, supports the load, and resists the fan test without toppling.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real-world infrastructure challenge (utility poles exposed to severe weather) without showing an existing solution or materials. Students must first understand *why* these structures matter and *what problem* severe weather creates for utilities before designing improvements. The visible storm clouds and poles naturally prompt the question: \"How do engineers keep these systems safe?\"\n\n### Suggested Materials\n\n- Wooden dowels or plastic straws (for pole structure)\n- String or twine (for cables and rigging)\n- Tape (masking or duct) and scissors\n- Paper clips, washers, or small weights (for load testing)\n- Desk fan or manual wind source (for testing)\n- Ruler or measuring tape (for constraint verification)\n\n### Estimated Time\n\n**K-2**: 40–50 minutes (design, build, and test with multiple trials)  \n**3-5**: Two 40-minute sessions (Session 1: design and build; Session 2: load testing and wind testing with redesign if needed)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.B (Developing Possible Solutions)** and **ETS1.C (Optimizing Design Solutions)** by asking students to design a structure that meets specific constraints and test it against realistic failure conditions, mirroring how real engineers evaluate infrastructure resilience.",
  "inputTokens": 2328,
  "outputTokens": 808,
  "cost": 0.006368,
  "generatedAt": "2026-02-09T13:38:48.298Z"
}