{
  "title": "Wind Turbines",
  "category": "earth-space-science",
  "imageFile": "wind_turbines.jpg",
  "imagePath": "images/earth-space-science/wind_turbines.jpg",
  "content": "# Engineering Design Challenge: Wind Turbines\n\n### Visible Elements in Photo\n\n- **Wind turbines** (multiple units of varying heights) with three rotating blades each\n- **Tall cylindrical towers** supporting the turbine structures\n- **Flat, open landscape** (agricultural field with crop rows visible)\n- **Power transmission lines** running horizontally across the scene\n- **Clear blue sky** with minimal cloud cover\n\n### Reasonable Inferences\n\n- **From turbine blades rotating in open landscape**: Wind is a consistent, available energy resource in this location; the blades are positioned high to capture stronger winds at elevation.\n- **From power transmission lines**: The electricity generated must be transported and distributed to homes and communities, requiring infrastructure connections.\n- **From flat terrain and spacing**: Large turbines require significant ground area and distance from each other to avoid wind interference and maximize energy collection.\n\n### Engineering Task\n\n#### K-2 Version\n**Design a Spinning Wind Catcher**\n\nMake a small wind spinner that can turn and light up a flashlight (or spin a pinwheel as fast as possible). You can use paper, straws, tape, and a battery. Test it in front of a fan or outside on a breezy day. Which blade shape spins the fastest?\n\n#### 3-5 Version\n**Design a Model Wind Turbine**\n\nBuild a tabletop wind turbine (using a motor, paper or plastic blades, a cardboard tower, and a cup to collect small pom-poms as \"energy collected\"). Your turbine must:\n- Stand at least 12 inches tall without tipping over\n- Spin smoothly when exposed to fan wind for at least 30 seconds\n- Collect at least 10 pom-poms in 2 minutes of fan exposure\n\nTest three different blade shapes (curved, flat, angled) and measure which design collects the most \"energy.\"\n\n### EDP Phase Targeted\n\n**Imagine / Plan**\n\nThe photo clearly shows a *working solution* (wind turbines generating energy), so students don't need to discover the problem—they can immediately begin imagining how to recreate and test a scaled version. This phase works best because students can observe the design features (blade angle, tower height, open location) and use those observations to plan their own model.\n\n### Suggested Materials\n\n- Paper plates or plastic cups (for blades)\n- Wooden dowels or straws (for tower structure)\n- Cardboard tubes or paper towel rolls (for column support)\n- Small motor or hand crank (optional; for K-2, fan provides wind)\n- Tape, glue, and markers\n- Small lightweight objects (pom-poms, beads) for measuring energy collection\n- Desk fan (to simulate wind)\n\n### Estimated Time\n\n**45–60 minutes** (one session for 3-5; can be split into design and testing for K-2)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a problem that can be solved with a given material or set of tools*) and **K-2-ETS1-1** (*Ask questions, make observations, and gather information about a situation*) by having students analyze a real renewable energy structure and prototype a miniature version using the engineering design process.",
  "inputTokens": 2331,
  "outputTokens": 745,
  "cost": 0.006056000000000001,
  "generatedAt": "2026-02-09T13:42:19.293Z"
}