{
  "title": "Wind_turbines",
  "category": "earth-space-science",
  "imageFile": "wind_turbines.jpg",
  "imagePath": "images/earth-space-science/wind_turbines.jpg",
  "content": "# Engineering Design Challenge: Wind Turbine Analysis\n\n### Visible Elements in Photo\n- Multiple white wind turbines of varying heights arranged across a flat landscape\n- Three-bladed rotor design on each turbine\n- Tall cylindrical tower structure supporting each turbine\n- Agricultural field (plowed rows visible in foreground)\n- Power transmission lines running horizontally across the scene\n- Blue sky with sparse clouds\n- Flat terrain with distant tree line\n\n### Reasonable Inferences\n- **From turbine blades and open field location**: Wind is a primary resource in this area; turbines are positioned to maximize exposure to wind currents.\n- **From power lines and multiple turbines**: These structures generate electricity that is distributed to communities through an energy grid.\n- **From agricultural setting**: Land use must balance farming and energy production, suggesting a design constraint around space efficiency.\n\n---\n\n### Engineering Task\n\n#### **K-2 Version:**\n**Build a Spinning Wind Catcher**\n\nYour job is to design and build a spinning blade that catches the wind. Use straws, paper, and tape to make three blades that stick out from a center point. Test your design by holding it up to a fan or blowing on it. Can you make it spin faster? Try different blade shapes and sizes. What works best?\n\n#### **3-5 Version:**\n**Design a Wind Turbine Rotor for Maximum Power**\n\nDesign a three-bladed rotor that generates the most rotational spin when exposed to consistent wind (fan). Your constraints:\n- Rotor diameter cannot exceed 12 inches\n- All blades must be identical in size and shape\n- Must spin freely on a dowel or pencil axle\n- Test conditions: fan speed set at one constant level\n\nSuccess criteria:\n- Rotor completes 50+ rotations per minute\n- Blades remain balanced (no wobbling)\n- Design can be reproduced by another team with the same results\n\n---\n\n### EDP Phase Targeted\n**Imagine / Plan** (with quick progression to Create / Test)\n\n**Why**: The photo clearly shows an existing, working solution (wind turbines in operation). Students don't need to ask \"what is the problem?\" — instead, they can observe the three-blade design, tower structure, and spacing, then imagine variations on this proven concept. This phase allows students to sketch, predict blade angles, and plan material choices before building.\n\n---\n\n### Suggested Materials\n- Straws or wooden dowels (8-12 inches)\n- Paper, cardstock, or foam sheets\n- Pencils or thin dowels (for axles)\n- Tape (masking or duct tape)\n- Small fan (for testing wind exposure)\n- Ruler or protractor (for measuring blade angles)\n- Markers (for tracking rotations or labeling designs)\n\n---\n\n### Estimated Time\n- **K-2**: 40–50 minutes (15 min. planning/observation, 20 min. building, 10 min. testing and tweaking)\n- **3-5**: Two 40-minute sessions (Session 1: research, sketch designs, gather materials; Session 2: build, test, measure rotations, redesign if needed)\n\n---\n\n### Why This Works for Teachers\nThis task directly supports **NGSS ETS1.B (Developing Possible Solutions)** by having students study a real-world energy structure, identify key design features (three-blade rotor, tower height, spacing), and apply those principles to prototype and test their own functional model.",
  "inputTokens": 2198,
  "outputTokens": 789,
  "cost": 0.006143000000000001,
  "generatedAt": "2026-02-12T06:48:14.511Z"
}