{
  "title": "Winter Seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "### Core Science Concepts from Image Analysis\n\n- **Seasonal changes and Earth's systems:** The photograph shows snow accumulation on evergreen trees and ground during winter, illustrating how seasonal temperature changes affect the state of water (solid ice/snow) and visible interactions between the atmosphere (cold air producing snow) and the biosphere (plant survival strategies).\n\n- **Water cycle and states of matter:** Snow covering vegetation demonstrates water in its solid state, which is part of the water cycle and shows how water exists in different forms in different Earth systems and reservoirs during winter.\n\n- **Geosphere, biosphere, and hydrosphere interactions:** The image reveals how evergreen plants (biosphere) interact with snow accumulation (hydrosphere in solid form) on land surfaces (geosphere), showing interdependence of Earth's systems.\n\n- **Seasonal patterns and energy from the sun:** The low angle and quality of sunlight visible in the image, combined with heavy snow coverage, reflects how the sun's position and energy change seasonally, affecting temperature, precipitation, and visible shadows on the landscape.\n\n---\n\n### Lesson Title\n\n**Winter's Web: How Earth's Systems Connect When Snow Falls**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** 5th Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions or 90 minutes total\n- **NGSS Standards:** 5-ESS2-1 (geosphere, biosphere, hydrosphere, atmosphere interactions); 5-ESS2-2 (water distribution and states); 5-ESS1-2 (seasonal patterns and sun's position)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n\n1. **Explain** how the atmosphere, hydrosphere, biosphere, and geosphere interact during winter using evidence from seasonal observations.\n\n2. **Identify and describe** water in different states (solid, liquid) and where it is found during winter months using a model or diagram.\n\n3. **Analyze** how the sun's position and energy during winter affect temperature, precipitation, and visible environmental changes.\n\n4. **Create a visual representation** (diagram, model, or graph) showing seasonal changes and connections between Earth's systems.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about winter and seasonal changes using the photograph as an anchor.\n\n**Materials:**\n- Large printed or projected photograph of snow-covered evergreens\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** prominently and allow 1–2 minutes of silent observation. Ask students to notice details without talking.\n\n2. **Pose opening discussion questions:**\n   - \"What do you see happening to the plants and the ground in this picture? Describe the white substance covering everything.\"\n   - \"Where do you think this white stuff (snow) comes from, and where does it go?\"\n   - \"Why do you think these evergreen trees still have green needles even though snow is piling up on them? What might help them survive winter?\"\n   - \"If we traced this snow all the way through spring and summer, where would it end up? Could it become a liquid again?\"\n\n3. **Create a class \"Winter Wonder Chart\"** on chart paper by recording student predictions and questions:\n   - \"What is snow made of?\"\n   - \"How does snow connect the air, water, land, and plants?\"\n   - \"Why does winter happen?\"\n\n4. **Prediction prompt:** \"Today we're detectives investigating how winter connects all parts of Earth—the air, water, land, and living things. What do you predict we'll discover?\"\n\n**Transition:** \"Let's explore snow, water, and Earth's systems by doing some investigations to discover how winter really works.\"\n\n---\n\n#### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate water states, seasonal patterns, and Earth system interactions through hands-on exploration.\n\n**Materials:**\n- Small containers of snow or ice (or crushed ice if snow unavailable; collect earlier or use freezer)\n- Clear containers or cups (one per pair/group)\n- Thermometers\n- Warm water (prepared ahead, kept in a warm pitcher)\n- Observation sheets/notebooks\n- Markers and labels\n- Optional: pictures of the same landscape in different seasons (spring, summer, fall, winter)\n- String or tape (to mark water levels on containers)\n\n**Activity:**\n\n**Investigation 1: States of Water During Winter (15 minutes)**\n\n1. **Distribute snow/ice and a clear container** to each pair or small group.\n\n2. **Give these student directions:**\n   - \"Place your snow or ice in the clear container and observe it closely for 2 minutes. Draw or describe what you see. Is it solid? Does it have a definite shape?\"\n   - \"Record the temperature of the snow/ice using a thermometer. Write this number down.\"\n   - \"Carefully add a small amount of warm water (teacher will provide) to your container. Observe what happens over the next 5 minutes. Does the snow/ice stay solid? What happens?\"\n   - \"As the snow/ice melts, record the temperature again. Did it change?\"\n   - \"In your observation sheet, write or draw: Where did the water go when the snow melted? Is it still water, just in a different form?\"\n\n3. **Students record observations** using drawings and written descriptions.\n\n**Investigation 2: Connecting Winter to Earth's Systems (optional, 10 minutes if time allows)**\n\n1. **Display 3–4 pictures** of the same outdoor location in winter, spring, summer, and fall (e.g., trees, landscape).\n\n2. **Ask students:** \"Compare the winter picture to the spring picture. What changed? Where did the snow go? How might the plants, air, water, and ground be connected?\"\n\n3. **Students sketch a simple arrow diagram** showing: Snow → Melts → Water Goes Where? (streams, soil, plants, air)\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: *\"What do you notice happening?\"* *\"Can you explain what you see?\"* *\"Where do you think the water goes next?\"*\n- Do **not** provide answers; guide observation.\n- Ensure safe handling of warm water.\n\n**Expected Student Outcomes:**\n- Students observe that solid snow/ice becomes liquid water when warmed.\n- Students recognize water exists in different forms.\n- Students begin to recognize connections between season, temperature, and water state.\n- Students document observations in pictures and words.\n\n---\n\n#### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce vocabulary and concepts about Earth's systems, water distribution, and seasonal change.\n\n**Materials:**\n- Chart paper or whiteboard\n- Colored markers\n- Simple diagram template (provided by teacher or drawn)\n- Vocabulary cards or anchor chart\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Ask 3–4 groups to share one observation: *\"What happened to the snow in your cup?\"*\n   - Record responses on chart paper.\n   - Ask: *\"Why did it change? What did we add?\"* (Answer: heat/warm water)\n   - Connect to real world: *\"In nature, what provides that heat?\"* (Answer: the sun)\n\n2. **Introduce and display key vocabulary (8 minutes):**\n\n   **Vocabulary:**\n\n   - **Geosphere:** The solid Earth, including rocks, soil, and land surfaces. In winter, the geosphere is covered with snow and frozen.\n   \n   - **Hydrosphere:** All water on Earth—oceans, lakes, rivers, ice, snow, and water vapor in the air. In winter, much water is frozen solid as snow and ice.\n   \n   - **Biosphere:** All living things, including plants and animals. In winter, plants like evergreens survive by adapting (staying green), and animals find shelter.\n   \n   - **Atmosphere:** The air that surrounds Earth. In winter, the atmosphere is cold and holds water vapor that forms snow.\n   \n   - **Seasonal change:** Patterns in weather and temperature that repeat each year, caused by Earth's position relative to the sun. Winter is the coldest season in many places.\n\n3. **Create a visual model (5–7 minutes):**\n   - Draw a simple winter landscape on chart paper showing: trees (biosphere), ground/rocks (geosphere), snow and ice (hydrosphere), sun in the sky (energy source), and cold air (atmosphere).\n   - Use arrows to show connections:\n     - Cold air + water vapor → snow (atmosphere and hydrosphere interact)\n     - Snow falls on plants and ground (hydrosphere + biosphere + geosphere interact)\n     - Sun provides energy (energy affects temperature, which affects snow)\n   - Label each system.\n\n4. **Check for understanding:**\n   - Ask: *\"Point to the biosphere in our picture. Point to the hydrosphere. Where is water in this winter scene?\"*\n   - Ask: *\"What might happen to the snow when the sun gets stronger in spring?\"*\n\n**Expected Student Outcomes:**\n- Students understand four key Earth systems and how they interact.\n- Students recognize water exists in different forms and is distributed across Earth's systems.\n- Students connect seasonal change to the sun's energy and position.\n- Students see winter as an interconnected system, not separate events.\n\n---\n\n#### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Apply understanding of Earth systems and water distribution to a new context or create a deeper model.\n\n**Materials:**\n- Large poster paper or digital template (e.g., Google Slides)\n- Colored pencils, markers, or digital drawing tools\n- Optional: photographs of winter in different regions (polar, temperate, desert)\n- Water cycle diagram templates (optional)\n\n**Activity:**\n\n**Choice 1: Create a \"Winter Systems Model\" (for most students)**\n\n1. Students work in pairs or individually to create a labeled diagram or poster showing a winter landscape.\n\n2. **Directions:**\n   - Draw or print a winter scene (use the photograph as inspiration).\n   - Label and color-code each Earth system:\n     - **Geosphere (brown):** ground, rocks, frozen soil\n     - **Hydrosphere (blue):** snow, ice, frozen water\n     - **Biosphere (green):** plants (evergreens), animals, humans\n     - **Atmosphere (light blue):** cold air, clouds\n   - Draw **at least 3 arrows** showing how systems interact:\n     - Example: \"Cold air in the atmosphere carries water vapor that becomes snow on the geosphere, which covers the biosphere.\"\n   - Write one sentence for each arrow explaining the interaction.\n\n3. Students share their models and explain one interaction to a peer or the class.\n\n**Choice 2: Seasonal Water Journey (for advanced learners)**\n\n1. Students trace where water is found in winter and predict where it goes in spring/summer.\n\n2. **Directions:**\n   - Create a \"Water in Winter\" graph or chart showing:\n     - Frozen water (snow, ice on ground and lakes)\n     - Liquid water (under snow, in soil)\n     - Water vapor (in cold atmosphere)\n   - Using the photograph and seasonal pictures, estimate percentages or amounts.\n   - Write predictions: *\"In spring, where will this water go first?\"*\n\n**Teacher Role:**\n- Circulate and ask: *\"How do your systems connect?\"* *\"Can you explain this arrow?\"*\n- Encourage students to reference the photograph and Explore observations.\n- Support labeling and writing as needed.\n\n**Expected Student Outcomes:**\n- Students create a visual model showing Earth systems and their interactions during winter.\n- Students use scientific vocabulary correctly.\n- Students demonstrate deeper understanding by explaining cause-and-effect relationships (e.g., cold air causes water to freeze; sun's energy will melt it).\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of Earth systems interactions, water states, and seasonal change.\n\n**Activity:**\n\n**Formative Assessment (during lesson):**\n- **Observation during Explore:** Did students accurately record that snow melted when heat was added? Did they attempt to explain why?\n- **Discussion during Explain:** Could students identify the four Earth systems and give examples from the winter scene?\n- **Model review (Elaborate):** Do student diagrams show at least 2–3 correct interactions between systems?\n\n**Summative Assessment - Exit Ticket (end of lesson, 5 minutes):**\n\nProvide each student with a small exit ticket or have them answer on a whiteboard/device. **Choose one or more:**\n\n**Question Set A (for all students):**\n\n1. \"Look at this picture of snow on trees. Name **two Earth systems** you can see, and explain how they interact.\"\n\n2. \"Snow is frozen water. Draw or write: What happened to the snow in our investigation when we added warm water? Why did it change?\"\n\n3. \"The sun provides energy to Earth. How does the sun affect snow in winter?\"\n\n**Question Set B (for advanced learners):**\n\n1. \"During winter, water is frozen as snow and ice. During summer, the same water is liquid in rivers and lakes. Explain how the sun's position and energy cause this change.\"\n\n2. \"Describe the path of one water molecule from the snow on the ground in January to where it might be by June.\"\n\n**Success Criteria:**\n\n✓ Students identify at least 2 of the 4 Earth systems (geosphere, hydrosphere, biosphere, atmosphere).\n\n✓ Students explain at least one interaction between systems (e.g., \"Cold air in the atmosphere freezes water, so it falls as snow\").\n\n✓ Students recognize that water exists in different states and that temperature/energy from the sun affects these states.\n\n✓ Students use vocabulary correctly: solid, liquid, snow, ice, seasonal change, or system names.\n\n**Expected Student Outcomes:**\n- Exit tickets reveal whether students can articulate connections between Earth systems.\n- Drawings and written responses show conceptual understanding of water states and seasonal change.\n- Class patterns in responses inform next steps: if many students struggle with \"systems,\" reteach with the visual model; if most succeed, move to water distribution (5-ESS2-2) in a follow-up lesson.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified diagram template:** Provide a pre-drawn winter landscape with blanks for students to label the four systems. Offer a word bank (geosphere, hydrosphere, biosphere, atmosphere) so students focus on placement rather than recall.\n\n2. **Sentence starters for explanations:** Provide frames such as: \"The _______ (system name) interacts with the _______ (system name) because _______. For example, _______.\"\n\n3. **Peer collaboration:** Pair struggling students with a peer mentor during the Explore and Elaborate phases. Assign the mentor to ask guiding questions rather than give answers (e.g., *\"What did you observe?\"* *\"Why do you think that happened?\"*).\n\n**Challenge (for advanced learners):**\n\n1. **Seasonal water distribution task:** Challenge students to research and graph how the percentage of water in different states (ice, liquid, vapor) changes across all four seasons in their region. Have them present findings to the class.\n\n2. **Polar and temperate comparison:** Provide images of winter in the Arctic and in a temperate forest. Ask: \"How do Earth's systems interact differently? Where is water found in each place during winter? How might the sun's position be different?\"\n\n3. **Energy and temperature investigation:** Have advanced students design a simple experiment predicting how different colored surfaces (dark soil, white snow, green plant) would affect snow melting rate. Connect this to the sun's energy and Earth's systems.\n\n---\n\n### Extension Activities\n\n1. **Seasonal observation journal:** Assign students to observe the same outdoor location (school yard, local park, or a picture) weekly throughout the winter and into spring. They sketch and describe changes in snow, plants, and visible water. In late April or May, they compare their January observations to April/May observations and write about how Earth's systems changed over time. This reinforces 5-ESS1-2 (seasonal patterns).\n\n2. **Community water protection project:** Research how the local community or city prepares for winter precipitation and protects water supplies during freezing temperatures (e.g., pipe insulation, salt on roads, water main maintenance). Students create a poster or infographic titled \"Our Community Protects Water in Winter\" that explains one practice and connects it to Earth systems. This addresses 5-ESS3-1 (how communities protect resources).\n\n3. **Water distribution around the world:** Provide a worksheet or interactive map showing where water is found on Earth (oceans, ice caps, groundwater, lakes, etc.) and have students calculate percentages. Then ask: \"In winter, what percentage of Earth's freshwater is frozen in snow and ice? How does this change by season?\" Students create a bar graph comparing water distribution in winter vs. summer, extending 5-ESS2-2 (water distribution).\n\n---",
  "inputTokens": 290,
  "outputTokens": 3924,
  "cost": 0.0203854,
  "generatedAt": "2026-02-13T03:36:26.158Z"
}