{
  "title": "Winter Seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "### Core Science Concepts from Image Analysis\n\n- **Seasonal Change:** Snow-covered evergreen trees and frozen landscape demonstrate how Earth's environment transforms during winter, a measurable seasonal pattern.\n- **Weather Patterns in Winter:** The accumulation of snow on branches and ground illustrates how water falls from the sky as precipitation during cold seasons.\n- **Daylight and Seasons:** The bright sunlight casting clear shadows suggests winter's shorter daylight hours and the sun's lower position in the sky compared to other seasons.\n- **Plant Adaptation to Winter:** Evergreen plants remaining green while deciduous trees are bare shows how different plants respond to seasonal changes and cold temperatures.\n\n---\n\n### Lesson Title\n\nSnow, Shadows, and Shorter Days: Discovering Winter Patterns\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** 1-ESS1-1, 1-ESS1-2\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how the environment changes during winter (snow, ice, bare branches).\n2. Make predictions about patterns they expect to see during different seasons based on winter observations.\n3. Record observations of daylight and darkness at different times of day during winter.\n4. Explain how winter is different from other seasons they have experienced.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about seasons and winter using the photograph.\n\n**Materials:**\n- Printed or projected image of snow-covered evergreen trees (winter_seasons.jpg)\n- Chart paper and markers\n- Optional: small samples of evergreen branches or pine needles (if available)\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or as a printed poster where all students can see clearly. Allow 1–2 minutes of silent observation.\n\n2. **Ask these discussion questions** (calibrated for first-grade listening comprehension):\n   - \"What do you see covering the trees in this picture?\"\n   - \"How do you think this tree feels with all that white stuff on it? Is it cold?\"\n   - \"Have you ever seen snow like this? When did you see it?\"\n   - \"Why do you think some trees still have green branches while other trees look bare and brown?\"\n\n3. **Wonder Prompt:** \"I wonder what happens to the trees and ground in winter. What do you wonder about?\" Record student responses on chart paper—these become inquiry anchors for the lesson.\n\n4. **Make a Prediction:** \"If we look outside our classroom window right now, what winter things might we see? Let's make a list of predictions.\"\n\n**Transition:** \"Today we're going to be winter observers! We'll look carefully at how winter changes our world, and we'll keep track of the sun and daylight, just like the sun in this snowy picture.\"\n\n---\n\n#### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate seasonal patterns and daylight through hands-on observation and simple documentation.\n\n**Materials:**\n- Chart paper or large poster board divided into two sections: \"Winter at Our School\" and \"What We Observe\"\n- Colored pencils, crayons, or markers\n- Picture cards showing the same outdoor location in different seasons (winter, spring, summer, fall) OR photographs of the school grounds in winter\n- Clipboards and paper for outdoor observation (if weather permits and safety protocols are met)\n- Hand lenses (optional, for observing snow crystals or frost patterns if available)\n- Simple observation recording sheets with spaces for drawings and checkboxes\n\n**Activity:**\n\n1. **Indoor Observation Station (if outdoor access is limited or unsafe):**\n   - Divide students into small groups (3–4 students each).\n   - Provide each group with season comparison cards or photos showing the same location in winter and another season.\n   - Direct students: \"Look at both pictures. Point to the winter picture. What is different? Circle or draw the things that show it's winter.\"\n   - Students use crayons to draw or mark things they notice (snow, bare branches, evergreens still green, shadows, etc.).\n\n2. **Outdoor Observation (if safe and feasible):**\n   - Take students outside for 5–10 minutes (bundle appropriately; check school weather safety protocols).\n   - Distribute clipboards with simple observation sheets.\n   - Directions: \"Walk around. Look for snow, ice, bare branches, and green plants. Draw or checkmark what you see. What feels cold? What is still growing?\"\n   - Have students observe shadows cast by trees and structures (relate to the bright shadows visible in the photograph).\n\n3. **Documentation:**\n   - Students draw and label their observations on the recording sheets.\n   - Encourage simple writing or teacher scribing: \"What did you see that was winter?\"\n   - Collect drawings and observations.\n\n4. **Daylight Observation:**\n   - Show students the photograph again, pointing to the bright sunlight and clear shadows.\n   - Ask: \"What time of day do you think this picture was taken? How do you know?\" (Bright sun, sharp shadows.)\n   - Have students note the time at the start of the lesson and check when they step outside or look out a window: \"Is it still light outside? Is it getting darker? In winter, the sun goes down earlier.\"\n\n**Teacher Role:**\n- Circulate among groups, asking open-ended questions: \"What do you notice? Why do you think that happens? What else do you see?\"\n- Do NOT provide answers; guide students to make their own observations.\n- Record interesting student comments to share during Explain phase.\n- Help students with pencil control and letter formation if needed; focus on the observation, not perfect writing.\n\n**Expected Student Outcomes:**\n- Drawings and written records showing winter characteristics (snow, bare branches, evergreens, cold, shadows).\n- Verbal descriptions of winter observations.\n- Recognition that daylight changes with the season.\n\n---\n\n#### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and science concepts, connecting observations back to the photograph and exploration.\n\n**Materials:**\n- Original photograph (winter_seasons.jpg)\n- Chart paper with winter vocabulary list\n- Picture cards or real samples: evergreen branch, bare branch, snow\n- Large calendar showing current month and season\n- Simple illustration of Earth's tilt and sun position in winter vs. summer (age-appropriate, stick-figure style acceptable)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2–3 students to show their drawings and describe one winter thing they observed or drew.\n   - Display several student drawings on the board to celebrate observations.\n\n2. **Introduce Vocabulary (7 minutes):**\n   Present these five terms using visuals, real objects, and the photograph:\n   - **Winter:** The coldest season of the year when snow can fall and days are shorter.\n   - **Snow:** Frozen water that falls from clouds in winter; it is cold and white.\n   - **Evergreen:** A plant that stays green all year long, even in winter (point to the green trees in the photograph).\n   - **Deciduous:** A plant that loses its leaves in fall and winter and grows new leaves in spring (point to the bare trees in the photo).\n   - **Daylight:** The time when the sun is up and it is light outside; in winter, there is less daylight than in summer.\n\n3. **Connect to Photograph (5 minutes):**\n   - Point to the snow-covered evergreen tree: \"Look at this evergreen. It's still green underneath the snow. That's one pattern we see in winter.\"\n   - Point to bare branches in the background: \"Those trees are deciduous. They lost their leaves. That's another winter pattern.\"\n   - Point to the bright sunlight and shadows: \"Notice the bright sun and dark shadows. But in winter, this bright sunshine happens earlier in the morning and ends earlier in the evening. There is less daylight.\"\n\n4. **Check for Understanding:**\n   - Ask quick questions: \"Which trees stay green all winter? Which trees lose their leaves?\" (Students point to the photograph or hold up fingers.)\n   - \"What is falling from the sky as snow?\" (Frozen water.)\n   - \"Is there more daylight in winter or summer?\" (Winter has less daylight.)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Winter** | The coldest season when it's cold outside, snow can fall, and the days are short. |\n| **Snow** | Cold, white frozen water that falls from the sky. |\n| **Evergreen** | A plant (like a pine or spruce tree) that stays green all year, even when it's cold and snowy. |\n| **Deciduous** | A plant (like an oak or maple tree) that loses all its leaves in fall and winter, and grows new leaves in spring. |\n| **Daylight** | The time when the sun is up and it is bright outside; winter has fewer daylight hours than summer. |\n\n**Expected Student Outcomes:**\n- Students understand and can identify evergreen vs. deciduous plants.\n- Students recognize snow as frozen water.\n- Students understand that winter has shorter days with less daylight.\n- Students can point to or verbally identify winter characteristics in the photograph.\n\n---\n\n#### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding of seasonal patterns to predict and compare seasons.\n\n**Materials:**\n- Four large poster sheets, each labeled with a season: Winter, Spring, Summer, Fall\n- Picture cards or photographs showing outdoor scenes for each season (or students may draw)\n- Markers, crayons, colored pencils\n- Index cards with simple season clues (e.g., \"Snow is on the ground,\" \"Flowers are blooming,\" \"Leaves are falling,\" \"The sun is high and bright\")\n- Optional: Seasonal sorting mats or simple Venn diagram (winter vs. summer)\n\n**Activity:**\n\n1. **Seasonal Comparison Activity (10 minutes):**\n   - Display four poster sheets for the four seasons in order: Winter, Spring, Summer, Fall.\n   - Show students a photograph of a winter landscape, then show one of the same location in spring, summer, and fall.\n   - Ask: \"How is spring different from winter? What do you see?\" (More daylight, flowers, rain instead of snow, trees growing new leaves.)\n   - Continue for summer and fall.\n\n2. **Winter vs. Summer Poster (optional, 7 minutes):**\n   - Divide the class into two groups: \"Winter Scientists\" and \"Summer Scientists.\"\n   - Winter group: Draws or collects pictures of winter things (snow, short days, evergreens).\n   - Summer group: Draws or anticipates summer things (warm sun, long days, flowers, no snow).\n   - Compare the posters: \"What is different? What does the sun do differently?\"\n\n3. **Prediction Challenge:**\n   - Show the winter photograph again and ask: \"If we come back to this same spot in three months, what will we see? What will be different?\"\n   - Have students draw or dictate their prediction and explain: \"In spring, the snow will melt. More plants will be green.\"\n\n**Teacher Role:**\n- Guide students to notice patterns: \"What do you see that only happens in winter? What might happen when spring comes?\"\n- Validate all predictions; this builds confidence in observational thinking.\n- Ask follow-up questions: \"Why do you think the snow melts? What happens to the sun?\"\n\n**Expected Student Outcomes:**\n- Students create visual or written comparisons showing seasonal differences.\n- Students make predictions about how the winter landscape will change.\n- Students recognize the pattern: Winter → Spring → Summer → Fall → Winter.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of seasonal patterns, winter characteristics, and daylight changes.\n\n**Activity:**\n\n**Formative Assessment (throughout the lesson):**\n- Observe student drawings during Explore phase; note if students identify snow, bare branches, and evergreens.\n- Listen to student responses during discussion questions in Engage and Explain; note accuracy and descriptive language.\n- Review student observation sheets to confirm they can identify winter characteristics.\n\n**Exit Ticket / Summative Assessment (end of Session 1 or Session 2):**\n\nProvide each student with a simple exit ticket (picture or oral response). Ask:\n\n1. **Picture Sort:** Show four pictures (snow scene, flower garden, rainy spring day, autumn leaves). Ask: \"Point to the winter picture. Why is it winter?\"\n\n2. **Oral Response (or simple writing with picture):** \"Tell me one thing you saw today that shows it is winter. What was it like?\" (Listen for: snow, cold, bare branches, short daylight, evergreens, shadows.)\n\n3. **Prediction Question:** \"We looked at this snowy tree today. In three months, what do you think will happen to the snow? Why?\"\n\n4. **Daylight Observation:** \"When did you come to school this morning, was it light outside? Is it still light when you leave school? Why is it darker earlier in winter?\"\n\n**Success Criteria:**\n- Student accurately identifies at least two winter characteristics (snow, cold, bare branches, short daylight, or evergreens).\n- Student can explain that winter is cold and has less daylight than summer.\n- Student makes a reasonable prediction about seasonal change (e.g., snow melts, trees grow leaves, days get longer).\n- Student demonstrates understanding that seasons follow a pattern.\n\n**Expected Student Outcomes:**\n- 80% of students will correctly identify the winter photograph and name at least one winter characteristic.\n- 75% of students will describe daylight as shorter in winter or note that darkness comes earlier.\n- 70% of students will make a logical prediction about spring or summer conditions.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified Vocabulary:** Use only three key terms instead of five (Winter, Snow, Daylight). Use repetition and visual supports (photographs, real snow or branch samples) for each term.\n\n2. **Scaffolded Observation Sheets:** Provide pre-drawn images of winter scenes with blanks to fill in or color. Example: \"The tree has _____ on its branches. Circle the snow.\" This supports students who struggle with fine motor skills or independent drawing.\n\n3. **Peer Partnerships:** Pair struggling students with a strong observer during Explore. Let the partner model observations; the struggling student can listen and contribute ideas without pressure to draw or write independently.\n\n4. **Shorter Outdoor Time:** If outdoor observation is challenging (sensory sensitivities, behavior, weather concerns), allow 3–5 minutes outside or observe from a window while the teacher narrates and points out details.\n\n**Challenge (for advanced learners):**\n\n1. **Multi-Year Pattern Observation:** Challenge advanced students to predict what will happen over an entire year. Provide a blank wheel divided into four sections (one for each season). Ask: \"Draw or label what you think will happen to this tree in winter, spring, summer, and fall. Explain the pattern.\"\n\n2. **Daylight Graphing:** Have advanced students keep a simple daylight chart for one week. Each day, note the time the sun rises and sets (or ask family members to help). Create a bar graph showing if daylight is increasing or decreasing. Discuss why.\n\n3. **Research Extension:** Ask: \"Which plants and animals in our area prepare for winter? How do they get ready?\" Provide picture books or simple fact sheets about hibernation, migration, or winter adaptations. Students draw and label an animal or plant's winter adaptation.\n\n4. **Comparison Writing:** Have students write or dictate a simple comparison sentence: \"Winter is different from summer because ___________.\" Encourage complete thoughts: \"Winter is different from summer because there is snow, it is cold, and the days are shorter.\"\n\n---\n\n### Extension Activities\n\n1. **Winter Shadows Investigation:** On a sunny winter day, take students outside to trace their shadows on paper or the ground using chalk. Compare shadow length to a shadow made on a sunny summer day (look at photographs if summer is not available). Discuss: \"Why are winter shadows longer? Where is the sun in the sky?\" This connects 1-ESS1-1 (sun observations) and introduces lower sun angle in winter.\n\n2. **Seasonal Photo Journal:** Create a class photo journal by taking a photograph of the same outdoor location (school courtyard, nearby tree, building entrance) on the first day of each season. At the end of the school year (or early next school year), compile the photos into a flip-book or poster showing how the environment changes. Students predict what the next winter photo will look like. (Extends 1-ESS1-2: observing over time.)\n\n3. **Evergreen vs. Deciduous Nature Scavenger Hunt:** During outdoor play or a nature walk in late fall/early winter, challenge students to collect or point out examples of both evergreen leaves/branches and deciduous bare branches. Create a class display labeled \"Trees That Stay Green\" and \"Trees That Rest in Winter.\" Students draw or glue samples. Discuss how different plants handle cold weather. (Extends understanding of plant adaptation to seasonal change.)\n\n---",
  "inputTokens": 157,
  "outputTokens": 3977,
  "cost": 0.0205174,
  "generatedAt": "2026-02-13T03:33:37.686Z"
}