{
  "id": 0,
  "title": "Winter_seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "gradeLevel": "First Grade",
  "content": "# Winter Seasons: Snow-Covered Plants\n\n## 📸 Photo Description\nThis image shows evergreen trees and shrubs covered in thick, fluffy white snow on a bright, sunny winter day. You can see the green needles and branches peeking out from underneath the heavy snow blanket. In the background, more snow-covered plants and a frozen landscape stretch across the snowy ground.\n\n## 🔬 Scientific Phenomena\n**Anchoring Phenomenon:** Snow accumulation on plants during winter.\n\nThis phenomenon occurs because water vapor in the air freezes into ice crystals when temperatures drop below 32°F (0°C). These ice crystals collect together to form snowflakes, which fall from clouds and land on trees, shrubs, and the ground. The snow sticks to the evergreen branches because the trees are still \"alive\" during winter and have sticky, waxy needles. The bright sunlight in the photo shows how snow reflects light, making it appear white and shiny—this is an important observable characteristic that helps First Graders understand why winter landscapes look different from other seasons.\n\n## 📚 Core Science Concepts\n\n* **Seasonal change:** Winter is a season when temperatures are very cold, and water freezes into snow instead of falling as rain.\n\n* **States of matter:** Water can be a liquid (rain), solid (ice and snow), or gas (water vapor). Snow is frozen water—a solid state.\n\n* **Plant adaptation:** Evergreen trees keep their needles all winter long, while other trees lose their leaves. The waxy coating on evergreen needles helps them survive cold temperatures.\n\n* **Weather patterns:** Snow is a type of precipitation that happens in winter when it is cold enough for water in clouds to freeze.\n\n<pedagogical-tip>\nUse this image as an anchor to help students distinguish between winter and other seasons. Ask students: \"What do you notice that tells us it's winter?\" This helps develop observational skills and connects abstract seasonal concepts to concrete, visible evidence they can see and relate to their own experiences.\n</pedagogical-tip>\n\n<udl-suggestions>\nProvide multiple means of engagement by offering a choice of response formats: students could draw what they observe, use physical manipulatives (cotton balls to represent snow), or dictate observations to you. For students with visual processing needs, describe the image aloud in detail, emphasizing the contrast between white snow and green plants. For kinesthetic learners, create a tactile activity using white fabric or cotton to \"cover\" toy plants.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n**Performance Expectation:** 1-ESS1-1 Use observations to describe patterns of the sun, moon, and stars. (Connections to [[NGSS:CCC:Patterns]] and seasonal observation)\n\n**Disciplinary Core Ideas:**\n- [[NGSS:DCI:1-ESS1.A]] Patterns of the sun, moon, and stars can be observed, described, and predicted. (Observable seasonal changes)\n- [[NGSS:DCI:K-PS1.A]] Matter can be described by observable properties, including color, texture, and state (snow as frozen water)\n\n**Crosscutting Concepts:**\n- [[NGSS:CCC:Patterns]] - Seasonal patterns of weather change\n- [[NGSS:CCC:Cause-and-Effect]] - Cold temperatures cause water to freeze into snow\n\n## 💬 Discussion Questions\n\n1. **What do you see in this picture that tells us it is winter?** (Bloom's: Remember | DOK: 1)\n\n2. **Why do you think the snow is sticking to the green branches instead of falling off?** (Bloom's: Infer | DOK: 2)\n\n3. **How is winter different from other times of year you have seen?** (Bloom's: Compare | DOK: 2)\n\n4. **What do you think will happen to the snow when the sun shines on it for a long time?** (Bloom's: Predict | DOK: 2)\n\n## 📖 Vocabulary\n\n* **Snow:** Frozen water that falls from clouds in cold weather; it is white and fluffy.\n\n* **Winter:** The coldest season of the year when it is very cold and snow often falls.\n\n* **Freeze:** When something cold turns from a liquid into a solid (like water turning into ice).\n\n* **Evergreen:** A tree or plant that keeps its green needles or leaves all year long, even in winter.\n\n* **Temperature:** How hot or cold something is.\n\n## 🌡️ Extension Activities\n\n1. **\"Winter Walk\" Observation Activity:** Take students outside or to a window to observe real plants in winter (if available in your climate). Have them use clipboards to draw or mark what they observe: snow on plants, bare branches, evergreen trees still being green, frost, or icicles. This builds observational skills and connects the anchor image to their real world.\n\n2. **\"Melting Snow\" Experiment:** Bring clean snow into the classroom (or use ice) in a clear container. Place it on a sunny windowsill and observe how it changes over time. Record observations with drawings and dictated notes. Ask: \"Where did the snow go? What happened to it?\" This demonstrates phase change and builds understanding of cause and effect.\n\n3. **\"Winter Plant Sort\":** Show pictures of different winter plants (evergreens vs. deciduous trees). Have students sort them into \"keeps leaves/needles\" and \"loses leaves\" categories. Create a simple chart together. This reinforces the concept that different plants have different adaptations for winter survival.\n\n## 📚 External Resources\n\n**Children's Books:**\n- *Snow* by Manya Stojic (explores snow in different environments)\n- *In the Snow: Who's Been Here?* by Lindsay Barrett George (winter animals and tracks)\n- *Winter* by Gerda Muller (seasonal observation and change)\n\n**YouTube Videos:**\n- **\"How Snowflakes Form\"** - National Geographic Kids (2:30) - Simple, engaging explanation of snow formation with clear visuals. [https://www.youtube.com/watch?v=qe_H6dKh3ek](https://www.youtube.com/watch?v=qe_H6dKh3ek)\n\n- **\"The Seasons for Kids\"** - Kids Learning Tube (3:45) - Covers all four seasons with clear examples, including winter snow accumulation and cold temperatures. [https://www.youtube.com/watch?v=JZasKf9Ugpg](https://www.youtube.com/watch?v=JZasKf9Ugpg)",
  "generatedAt": "2026-02-06T03:21:44.383Z"
}