{
  "title": "Winter Seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Winter's Blanket of Snow\n\n### Core Science Concepts from Image Analysis\n\n- **Seasonal weather patterns:** Snow is a form of precipitation that falls during winter, creating visible changes to the landscape and environment.\n- **Effects of cold temperature on the environment:** Snow accumulates on plants, ground, and other surfaces, demonstrating how weather changes the appearance of familiar places.\n- **Plant adaptation and survival in winter:** Trees and evergreen plants remain visible under snow, showing that living things persist through cold seasons.\n- **Observable weather conditions over time:** The photograph shows evidence of weather change—comparing snowy landscapes to other seasons helps children recognize weather patterns.\n\n---\n\n### Lesson Title\n\nSnow Tells a Story: Observing Winter Weather\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 30-minute sessions (or three 20-minute sessions)\n- **NGSS Standards:** K-ESS2-1, K-ESS2-2, K-ESS3-1\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and describe what snow looks like and where it appears in winter.\n- Identify plants and animals in the photograph and discuss how they survive in snowy weather.\n- Share observations about how winter weather changes the environment.\n- Discuss things people and animals do to stay safe and comfortable when it snows.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of snow-covered evergreen trees.\n\n**Materials:**\n- Large color printout or digital display of the photograph\n- Chart paper and markers\n- Optional: a small bowl of snow (if available) or crushed ice\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or poster board where all students can see it clearly. Allow 30-45 seconds of silent observation.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you see in this picture? What color is most of it?\"\n   - \"What is the white stuff covering the trees and ground? Has anyone seen this before?\"\n   - \"Where do you think the trees go when they're covered with snow? Are they still alive?\"\n   - \"If you were a small animal like a squirrel or bird, what would you need to find or do to stay warm and safe in this weather?\"\n\n3. **Prediction prompt:** \"I wonder... if we looked at this same spot in summer, what would be different? Let's think about what we'd see without the snow.\"\n\n4. **Record student responses** on chart paper using pictures and simple words. Celebrate all observations without correcting; this is about activating prior knowledge.\n\n5. **Optional sensory moment:** If safe snow or ice is available, pass it around quickly so students can touch it and feel how cold it is. Ask, \"How does this feel? Is it wet? Is it cold?\"\n\n**Transition:** \"Today we're going to be snow detectives! We're going to look very carefully at this snowy picture and discover how plants and animals live when everything is covered in snow.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover winter weather concepts through hands-on observation and role-play.\n\n**Materials:**\n- Printed photograph (one per pair or small group, or displayed image)\n- Binoculars or hand-held magnifying glasses (optional, to simulate \"detective\" observation)\n- Chart paper titled \"What We Notice\" with three columns: \"Snow,\" \"Plants,\" \"Animals/Tracks\"\n- Crayons, colored pencils, or markers\n- Optional: white blanket or sheet, small branches with leaves (if available), toy animals\n\n**Activity:**\n\n1. **Organize students into pairs or small groups.**\n\n2. **Distribute printed copies** of the photograph or ensure all can see the displayed image. Explain: \"You are snow detectives. Your job is to look very carefully and find three things: (1) where the snow is, (2) what plants you can see, and (3) signs of animals or what animals might do here.\"\n\n3. **Guide observations with prompts (not answers):**\n   - \"Point to a place where you see lots of snow. What is under it?\"\n   - \"Can you find a plant that is still green even with snow on it? What kind of plant is it?\"\n   - \"Look at the picture. Do you see any animals? What do you think animals eat or do in snow?\"\n\n4. **Record findings:** On the class chart, draw or write what students notice in each column. Keep responses simple and visual.\n\n5. **Optional role-play activity:** Lay a white blanket on the floor to represent a snowy field. Place small branches and toy animals on it. Have students act out: \"Show me how a rabbit moves through snow\" or \"Where would a bird find food under snow?\" Discuss why this is challenging.\n\n6. **Teacher role:** Circulate among groups, ask clarifying questions (\"Tell me more about that\"), and record observations without correcting. Prompt students to look at specific areas: \"What about that tree in the back? Can you see it under the snow?\"\n\n**Expected Student Outcomes:**\n- Students notice snow covers many things but some plants stay green.\n- Students identify that snow is cold and makes movement difficult.\n- Students wonder where animals go or how they find food.\n- Class chart shows 5-8 observations across the three categories.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to winter weather concepts.\n\n**Materials:**\n- Chart paper or whiteboard with vocabulary written and illustrated\n- Photograph displayed again\n- Picture cards showing four seasons (optional)\n- Simple props: a plant cutting in water, small toy animals\n\n**Activity:**\n\n1. **Group share-out:** Ask 2-3 pairs to share one thing they noticed. Ask follow-up questions: \"Why do you think that? What made you notice that?\"\n\n2. **Introduce key vocabulary:**\n\n   - **Snow:** Cold water that falls from clouds in winter. It is frozen and fluffy. (Point to the white covering in the photo. Have students repeat: \"Snow is frozen water.\")\n   - **Winter:** The coldest season of the year when snow often falls. (Show a picture or calendar marking winter months.)\n   - **Weather:** What it is like outside—hot, cold, sunny, snowy, rainy, windy. (Connect to today's weather and the snowy weather in the photo.)\n   - **Season:** A time of year with its own weather and changes. Winter is one season. (Show four season pictures if available; point to winter.)\n\n3. **Connect back to the photograph:**\n   - \"The snow in this picture is winter weather. It's very cold.\"\n   - \"The trees and plants are still alive under the snow, even though we can't see all of them.\"\n   - \"Animals need to find ways to stay warm and find food when it snows.\"\n\n4. **Check for understanding:** Ask students to stand if the answer is \"yes\":\n   - \"Is snow hot or cold?\" (Students sit and stand.)\n   - \"Does snow fall in winter?\" (Yes/no with thumbs up-down.)\n   - \"Are the plants under the snow dead?\" (No, let's look—they're still there!)\n\n**Vocabulary:**\n- **Snow:** Frozen water that falls from the sky during winter.\n- **Winter:** The coldest season of the year.\n- **Weather:** How the air and sky look outside (sunny, rainy, snowy, hot, cold).\n- **Season:** A time of year that has its own special weather and changes.\n\n**Expected Student Outcomes:**\n- Students use the word \"snow,\" \"winter,\" and \"weather\" correctly in sentences.\n- Students understand snow is cold water from the clouds.\n- Students recognize that plants and animals live in winter, even under snow.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply winter weather concepts to their own experiences and think about how living things adapt.\n\n**Materials:**\n- Picture cards or images of animals in winter (birds at feeders, squirrels with bushy tails, deer in snow, rabbits with white fur)\n- Large paper or poster board (one per group)\n- Crayons, markers, colored pencils, magazines for cutting (optional)\n- Optional: real or artificial evergreen branch for sensory exploration\n\n**Activity:**\n\n1. **Introduce adaptation concept simply:** \"When winter comes, plants and animals do special things to stay safe and warm. This is called adapting. Let's see how.\"\n\n2. **Show picture cards one at a time:**\n   - **Squirrel:** \"A squirrel finds lots of acorns in fall and stores them in winter. It has a big, fluffy tail to wrap around its body like a blanket. How does this help it survive?\"\n   - **Bird:** \"A bird eats from feeders people put out. It also fluffs up its feathers to stay warm. What feathers help you?\"\n   - **Rabbit:** \"In winter, a rabbit's fur turns white to match the snow. This helps it hide from animals that want to eat it.\"\n   - **Evergreen tree:** \"These trees (like the ones in our picture) keep their green leaves all winter. They don't need as much water as other trees.\"\n\n3. **Group activity—\"Winter Survival Poster\":**\n   - Assign each small group one animal (squirrel, bird, deer, rabbit) or the evergreen tree.\n   - Provide a large paper with the animal picture or name at the top.\n   - Students draw or collage (with pre-cut pictures) one way their animal/plant stays safe in winter.\n   - Write one simple sentence: \"[Animal] survives winter by ___.\"\n\n4. **Gallery walk:** Display posters. Have students walk around and point to something they learned.\n\n5. **Real-world connection:** \"When we see snow, we put on coats, hats, and boots. That's how we adapt to winter weather, just like animals do!\"\n\n**Teacher Role:** Facilitate by asking, \"How does this help keep it warm or safe?\" and encouraging students to think about what they see in their own winter experiences.\n\n**Expected Student Outcomes:**\n- Students recognize that animals and plants have special ways to survive in winter.\n- Students create a visual representation of one winter adaptation.\n- Students articulate one way they, personally, adapt to winter (putting on coats, etc.).\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of winter weather and how plants and animals survive.\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout lesson):**\n- Listen to student responses during Engage and Explore phases.\n- Observe whether students can identify snow in the photograph.\n- Note if students make connections between plants/animals and cold weather.\n- Check if students use vocabulary (snow, winter, weather, season) correctly during Explain and Elaborate.\n\n**Exit Ticket or Summative Assessment (choose one):**\n\n**Option 1—Picture Sort (most inclusive for kindergarten):**\n- Show students three pictures: a snowy scene, a sunny beach, a green spring meadow.\n- Ask: \"Which picture shows winter weather? Point to it.\"\n- Follow-up: \"What do you see that tells you it's winter?\"\n\n**Option 2—\"I See, I Wonder\" Sentence Stem:**\n- Return to the original photograph.\n- Ask each student (in small group or one-on-one): \"I see ___ in this snowy picture. I wonder how ___ stays safe in winter.\"\n- Record their responses. (Example: \"I see a tree. I wonder how it stays alive under the snow.\")\n\n**Option 3—Simple Checklist (for teacher observation):**\n\n| Learning Objective | Evidence (check if observed) |\n|---|---|\n| Student describes snow or winter weather | Yes / In Progress / No |\n| Student identifies a plant or animal in the photo | Yes / In Progress / No |\n| Student explains one way a living thing survives winter | Yes / In Progress / No |\n| Student uses at least one weather/season vocabulary word | Yes / In Progress / No |\n\n**Success Criteria:**\n- Students should be able to point to or describe snow in the photograph.\n- Students should name at least one plant or animal visible or inferable from the winter scene.\n- Students should share one observation or wonder about how living things survive in winter (with teacher prompting if needed).\n- Students should use words like \"snow,\" \"winter,\" \"cold,\" or \"weather\" with general accuracy.\n\n**Expected Student Outcomes:**\n- Most kindergarteners will identify the snow and recognize it's cold.\n- Many will name an animal and wonder where it goes.\n- Some will articulate a simple adaptation (e.g., \"The bird has feathers to stay warm\").\n- All will have engaged with winter weather concepts through observation and language.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners or those with limited winter experience):**\n\n1. **Reduce photo complexity:** If the full photograph is overwhelming, print or project smaller sections at a time (just the snow-covered tree, then just one animal or track, etc.). Focus on one element per observation.\n\n2. **Concrete objects and role-play:** Provide real snow or ice, a real evergreen branch to touch, and toy animals to manipulate. Kinesthetic learners will benefit from physically moving animals through \"snow\" (white blanket) and discussing what's hard about it.\n\n3. **Sentence starters with visuals:** Instead of open-ended questions, offer choices:\n   - \"Is the snow hot or cold?\" (show picture of cold and hot side by side)\n   - \"Do we see plants or trees under the snow?\" (yes/no with pictures)\n   - \"Is this winter or summer?\" (show both season pictures)\n\n**Challenge (for advanced learners):**\n\n1. **Comparison across seasons:** Provide photographs of the same landscape in spring, summer, fall, and winter. Ask: \"How is the winter picture different? If we follow this tree through all four seasons, what changes and what stays the same?\" Students can create a sequence or chart.\n\n2. **Deeper \"why\" questions:** Push beyond simple observation: \"Why do you think evergreen trees keep their leaves in winter but other trees lose theirs? What might be the advantage? The challenge?\" Students can draw and label a comparison tree.\n\n3. **Research and sharing:** Assign advanced students to find or draw one animal that lives in snowy places (polar bear, arctic fox, penguin). Have them prepare a one-minute \"fact\" to share: \"This animal lives in snow and winter. It survives by ___.\" Encourage use of reference books or reliable internet sources (teacher-previewed).\n\n---\n\n### Extension Activities\n\n1. **Winter Sensory Walk (if snow is available):**\n   - Take students outside to observe real snow (or simulate with crushed ice in a sensory bin indoors).\n   - Ask them to notice: How does snow feel? Does it make a sound? Are there any tracks? What happens when you touch it?\n   - Create a \"winter sensory poem\" together using descriptive words they observe.\n   - **Connection:** This deepens observation skills and connects abstract photo learning to real-world experience.\n\n2. **Sequence the Seasons Activity:**\n   - Provide four pictures (or simple drawings) of the same tree in spring (green leaves), summer (full green), fall (orange/red leaves), and winter (snow/bare).\n   - Have students arrange them in order and discuss what changes and what stays the same.\n   - Extend: \"What month is it now? Where is our tree in the seasons right now?\"\n   - **Connection:** This builds understanding of seasonal patterns (K-ESS2-1) and helps children see weather changes across longer time spans.\n\n3. **\"How Do YOU Stay Warm?\" Family Connection:**\n   - Send home a simple worksheet: \"In winter, I keep warm by ___. Draw or write three things.\"\n   - Students can draw pictures of winter clothes, activities inside, hot drinks, etc.\n   - Bring back drawings and create a classroom chart: \"Our Winter Strategies.\"\n   - Compare to animal and plant adaptations: \"Just like the squirrel fluffs its tail, we put on coats!\"\n   - **Connection:** This connects personal experience to the broader concept of how all living things adapt to weather, and involves families in learning (K-ESS3-1).\n\n---",
  "inputTokens": 265,
  "outputTokens": 3796,
  "cost": 0.0251875,
  "generatedAt": "2026-02-13T03:32:53.555Z"
}