{
  "title": "Winter Seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Winter Weather and Seasonal Changes\n\n### Core Science Concepts from Image Analysis\n\n- **Seasonal snow accumulation:** Snow collects on surfaces during winter, demonstrating how winter weather conditions differ from other seasons and how precipitation changes form and coverage in cold weather.\n- **Plant adaptation to cold weather:** Evergreen trees (visible in the photograph) retain their leaves/needles through winter, showing how some plants are specially adapted to survive harsh winter conditions.\n- **Temperature effects on the environment:** The heavy snow load on branches illustrates how cold temperatures cause water to freeze and accumulate, changing the appearance and structure of the landscape.\n- **Weather patterns and seasonal cycles:** The photograph captures a specific winter weather condition (heavy snow) that is typical and predictable for winter seasons in certain regions, demonstrating seasonal weather patterns.\n\n---\n\n### Lesson Title\n\nSnow Blankets: Exploring Winter Weather and Seasonal Patterns\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** 3-ESS2-1, 3-ESS2-2, 3-ESS3-1\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and describe typical winter weather conditions shown in photographs and recorded data\n- Create a table or graph showing weather patterns during winter compared to other seasons\n- Identify how plants and landscapes change during winter months\n- Propose and evaluate a design solution that helps protect people or objects from winter weather hazards (such as heavy snow or ice)\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about winter weather using the photograph.\n\n**Materials:**\n- Printed or projected photograph of snow-covered evergreen trees\n- Chart paper and markers\n- Optional: short video clip (30 seconds) of snow falling or trees bending under snow weight\n\n**Activity:**\n\n1. Display the photograph prominently where all students can see it clearly. Allow 30 seconds of silent observation before asking questions.\n\n2. Ask these targeted discussion questions:\n   - \"What do you notice covering the branches of these trees? Where does that come from?\"\n   - \"Have you ever seen trees look like this? When during the year might this happen?\"\n   - \"Why do you think so much snow is sticking to the branches instead of falling off?\"\n   - \"How do you think the trees feel when they have this much weight on them?\"\n\n3. Create a class \"Wonder Wall\" on chart paper. Record student observations and questions such as:\n   - \"I notice the snow is really thick and puffy on the branches...\"\n   - \"I wonder if the snow hurts the trees...\"\n   - \"I see that some trees still have their green needles showing...\"\n\n4. Prediction prompt: \"If we measured the temperature and amount of snow that falls during winter, how would it compare to summer? Let's find out by becoming weather scientists!\"\n\n**Transition:** \"Today, we're going to investigate what winter weather is really like by collecting and studying real weather data, just like meteorologists do.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate winter weather conditions through data collection and hands-on observation activities.\n\n**Materials:**\n- Large thermometer (class display)\n- Copies of a simple \"Winter Weather Recording Chart\" (see template below)\n- Photos or video clips showing different seasons (winter, spring, summer, fall)\n- Access to winter weather data (printed or on-screen):\n  - Temperature data for three consecutive winter months in your region\n  - Snowfall measurements (if applicable to your region)\n  - Hours of daylight data\n- Colored pencils\n- Rulers or measuring sticks\n\n**Activity:**\n\n1. **Part A: Winter Weather Observation (10 minutes)**\n   - Divide students into small groups of 3-4.\n   - Provide each group with 2-3 printed photographs showing the same location during different seasons (winter, spring, and summer).\n   - Students compare the photographs and record on their \"Winter Weather Recording Chart\":\n     - How much snow is visible?\n     - Are trees covered with snow? (Yes/No)\n     - What color are the trees? (green, brown, covered with white)\n     - How many animals can they see? (none, few, many)\n   - Students draw a quick sketch of what winter looks like in their chart.\n\n2. **Part B: Temperature and Snowfall Data Investigation (15 minutes)**\n   - Provide students with a simple data table showing winter temperatures and snowfall for three months (December, January, February) from your region or a comparable location.\n   - Model how to read the data table together as a class first (point to a month, identify the temperature, identify snowfall).\n   - Ask: \"Which month was the coldest? Which month had the most snow?\"\n   - Students use this data to create a simple bar graph or pictograph showing:\n     - Temperatures across winter months, OR\n     - Snowfall measurements across winter months\n   - Students may use colored pencils to color their graphs and should label the axes with your help.\n\n**Teacher Role:**\n- Circulate among groups and ask guiding questions: \"What pattern do you notice? Does snow fall more when it's colder? Which months had the most snow?\"\n- Do NOT provide answers; instead, prompt students to look at the data themselves.\n- Provide support with graph construction (drawing axes, counting by 5s or 10s) as needed.\n\n**Expected Student Outcomes:**\n- Students will create a visual representation (graph or table) of winter weather data showing temperature and/or snowfall patterns.\n- Students will identify that winter months are colder and snowier than other seasons.\n- Students will record observations comparing winter landscape features to other seasons.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect exploration findings to broader seasonal patterns.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- Printed vocabulary cards (optional: with pictures)\n- Copies of a simple seasonal weather comparison chart\n\n**Activity:**\n\n1. **Group Share-Out (8 minutes)**\n   - Invite 2-3 groups to share their graphs or observations briefly (1-2 minutes each).\n   - Ask the class: \"What patterns did you notice in the data? Were all winter months the same?\"\n   - Highlight that winter is a predictable season with certain weather patterns (cold, snowy, shorter days).\n\n2. **Introduce Key Vocabulary (7 minutes)**\n   - Write each term on chart paper with a simple definition. Use the photograph as reference for each term.\n\n   **Vocabulary:**\n   - **Season:** A time of year with a certain kind of weather and daylight. (Point to the winter photo: \"Winter is a season when it's cold and snowy in many places.\")\n   - **Temperature:** How hot or cold something is. We measure it with a thermometer. (Show class thermometer: \"Winter temperatures are very cold, often below freezing.\")\n   - **Precipitation:** Water falling from clouds as rain, snow, sleet, or hail. (Point to snow in photo: \"In winter, precipitation often falls as snow instead of rain.\")\n   - **Weathering:** How weather changes the Earth and objects around us. (Show snow-covered branches: \"Snow is so heavy it bends the branches down.\")\n   - **Adaptation:** A special feature that helps a living thing survive in its environment. (Show evergreen trees: \"These trees have needle-shaped leaves that help them survive cold, snowy winters.\")\n\n3. **Connection Back to Image (5 minutes)**\n   - Display the original snow-covered tree photograph again.\n   - Ask: \"Now that we know about winter weather, what's happening in this picture?\"\n   - Guide students to explain: \"The temperature is very cold, so rain has turned to snow (precipitation). The snow accumulated on the branches. The evergreen trees are still alive and green because they're adapted to survive winter.\"\n\n4. **Check for Understanding:**\n   - Ask: \"If I showed you a photo and the trees had no snow, would it be winter or summer? How do you know?\"\n   - \"Why do we call it a season? What makes winter a season?\"\n   - Listen for student use of key vocabulary.\n\n**Expected Student Outcomes:**\n- Students will use vocabulary terms to describe winter weather (cold, snowy, precipitation).\n- Students will understand that winter is a predictable season with patterns.\n- Students will recognize that plants have adaptations to survive winter.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of winter weather to a real-world design challenge.\n\n**Materials:**\n- Images of winter weather hazards (heavy snow on roofs, icy sidewalks, snow-laden tree branches breaking) — 3-4 printed images or slides\n- Design challenge worksheet (see template below)\n- Craft materials: popsicle sticks, cotton balls, small plastic cups, tape, construction paper, plastic wrap\n- Optional: small model trees made from branches or pipe cleaners\n\n**Activity:**\n\n1. **Introduce the Design Challenge (5 minutes)**\n   - Show images of winter weather problems:\n     - Snow accumulating so heavily on a roof that it might collapse\n     - Tree branches breaking under the weight of wet snow\n     - Icy sidewalks causing people to slip and fall\n   - Ask: \"What's the problem? How could we help people or trees survive heavy snow safely?\"\n   - Explain: \"Engineers design solutions to keep us safe during winter weather. Today, you'll be engineers!\"\n\n2. **Design Challenge (10-15 minutes)**\n   - Present one of these design scenarios (or rotate between groups):\n   \n   **Scenario A:** \"Design a roof or covering that prevents heavy snow from building up and damaging a structure.\"\n   - Students use popsicle sticks and plastic wrap to build a sloped roof structure, then test if \"snow\" (cotton balls) slides off it.\n   \n   **Scenario B:** \"Design a device that can shake trees to remove heavy snow before branches break.\"\n   - Students design a shaking mechanism using simple materials that can vibrate a model tree.\n   \n   **Scenario C:** \"Design a warning sign or system to keep people safe from falling ice and snow from trees and roofs.\"\n   - Students sketch or build a warning system using craft materials.\n\n3. **Test and Refine (5 minutes)**\n   - Students test their designs with \"snow\" (cotton balls or shredded white paper).\n   - Ask: \"Did your design work? What would you change?\"\n   - Encourage at least one modification based on test results.\n\n**Teacher Role:**\n- Ask guiding questions: \"Why did the snow stay in that spot? What could you change to make it slide/fall off?\"\n- Facilitate problem-solving without solving the problem for students.\n- Encourage students to explain their thinking: \"Why did you choose that material? How does that help?\"\n\n**Expected Student Outcomes:**\n- Students will design and test a solution to a winter weather hazard.\n- Students will explain their design choices using reasoning related to weather conditions.\n- Students will evaluate their designs and propose improvements.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of winter weather patterns and seasonal changes.\n\n**Activity:**\n\n**Formative Assessment Throughout Lesson:**\n- Listen to student explanations during Explore and Elaborate phases for use of vocabulary and understanding of patterns.\n- Review student graphs from Explore phase for accuracy in representing temperature and snowfall data.\n- Observe student design choices and reasoning in Elaborate phase.\n\n**Exit Ticket (End of Day 2):**\n\nProvide each student with a half-page exit ticket with these three prompts:\n\n1. **Draw and label:** Sketch what winter weather looks like. Label at least two things you see (snow, bare trees, cold, etc.).\n\n2. **Multiple choice:** Winter is different from summer because:\n   - A) Trees grow taller\n   - B) It's colder and there's more snow in many places\n   - C) There are more animals outside\n   - D) The sun is brighter\n\n3. **Short answer:** Name one way that plants or people stay safe during winter weather. (Drawings with labels are acceptable.)\n\n**Success Criteria:**\n- ✓ Student accurately describes winter weather using at least 2 vocabulary terms (cold, snow, precipitation, season).\n- ✓ Student correctly identifies winter as a predictable season with cold temperatures and snowfall.\n- ✓ Student proposes a reasonable solution to a winter weather hazard during Elaborate phase.\n- ✓ Student creates a graph or table showing winter weather data with labeled axes and at least 3 data points.\n\n**Expected Student Outcomes:**\n\nStudents who meet all criteria will:\n- Understand that winter is a season with predictable weather patterns (cold and snowy).\n- Represent weather data using graphs or tables.\n- Apply understanding of winter weather to design a simple solution to a winter hazard.\n- Use vocabulary terms accurately when discussing seasons and weather.\n\nStudents exceeding expectations will:\n- Compare winter weather patterns across multiple regions.\n- Explain the relationship between temperature and precipitation type (rain vs. snow).\n- Propose multiple solutions with specific reasons for each design choice.\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified Data:** Provide pre-made graphs or partially completed tables that students only need to read and label, rather than creating from scratch. Include a visual key (picture of snowflake = snow, picture of thermometer = temperature).\n\n2. **Vocabulary Anchor Chart:** Create and display a large chart with vocabulary words, pictures, and student-friendly definitions that remains visible throughout all lessons. Encourage students to point to or use the chart when speaking.\n\n3. **Peer Partnerships:** Pair students with stronger peers during Explore and Elaborate phases. Assign roles (e.g., \"data reader\" and \"data recorder\") so all students participate actively in the investigation.\n\n4. **Sentence Starters for Communication:** Provide frames like:\n   - \"Winter is when _______________.\"\n   - \"I notice the snow is _____________ because _______________.\"\n   - \"This design works because _______________.\"\n\n**Challenge (For Advanced Learners):**\n\n1. **Regional Climate Comparison:** Provide winter weather data from two contrasting regions (e.g., Colorado and Florida). Have students compare the data, create dual graphs, and explain why the regions have different winter weather. Question: \"Why does Florida stay warmer in winter than Colorado?\"\n\n2. **Extended Design Challenge:** Ask students to design a **multi-part solution** that addresses more than one winter weather hazard (e.g., protecting both trees AND sidewalks), or to design a solution for a specific real-world winter problem in your community. Have them present their design to peers.\n\n3. **Historical Weather Data Analysis:** Provide winter weather data from several past years (December–February temperatures and snowfall). Ask: \"Are some winter months more predictable than others? Can you see a pattern?\" Students can create graphs comparing multiple years and write a paragraph explaining whether winter weather is always the same.\n\n4. **Evaporation and Sublimation Exploration:** Introduce the concept that snow can disappear even without melting (sublimation). Have advanced students place a small amount of snow (if available) in a dish and observe it over several days, recording changes. They can graph the decrease over time and research why snow disappears in cold, dry conditions.\n\n---\n\n### Extension Activities\n\n1. **Seasonal Comparison Mobile or Poster (Individual or Small Group):**\n   - Students create a four-part poster or hanging mobile showing weather conditions in winter, spring, summer, and fall.\n   - Include temperature ranges, typical precipitation, what plants look like, and what clothes people might wear.\n   - Use the snow-covered tree photograph as the \"winter\" reference image.\n   - *Timeframe:* 30-45 minutes as a follow-up lesson or homework project.\n\n2. **Winter Safety Campaign Design (Small Group or Whole Class):**\n   - Students research real winter hazards in your community (heavy snow, ice, cold temperatures).\n   - They design a safety poster, social media message, or comic strip that teaches younger students how to stay safe during winter weather (e.g., \"Wear a coat!\" \"Watch out for ice!\").\n   - This connects to 3-ESS3-1 by having students make claims about solutions that reduce weather-related hazards.\n   - *Timeframe:* 45-60 minutes; can be shared with lower grades.\n\n3. **Weather Station Observation Journal (Ongoing Throughout Winter):**\n   - Students create a simple daily or weekly observation journal where they record the current weather outside (temperature, precipitation, sky conditions).\n   - They sketch what they see and write one sentence about the weather.\n   - After 4-6 weeks, they review their journal and identify patterns (\"Most days in December were cold and snowy\").\n   - This reinforces 3-ESS2-1 by having students continuously observe and represent seasonal weather patterns.\n   - *Timeframe:* 5 minutes per day or 15 minutes per week; ongoing throughout winter months.\n\n---\n\n### End of Lesson Plan",
  "inputTokens": 188,
  "outputTokens": 3984,
  "cost": 0.0205834,
  "generatedAt": "2026-02-13T03:34:58.653Z"
}