{
  "title": "Winter Seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Second Grade Earth and Space Science\n\n## Core Science Concepts from Image Analysis\n\n- **Water Changes States:** Snow is frozen water (solid state) that covers plants and land; students can observe that water exists in different forms depending on temperature.\n- **Seasonal Weather Patterns:** Winter brings cold temperatures that cause snow to fall and accumulate; this demonstrates how Earth events change landscapes over time.\n- **Environmental Impacts on Living Things:** Plants remain alive under snow cover, showing how organisms adapt to winter conditions; the heavy snow load demonstrates forces acting on the environment.\n- **Water Distribution on Earth:** Snow is a visible form of water found on Earth's surface during winter; it shows where water exists in solid form in different seasons.\n\n---\n\n## Lesson Title\n\n**Snow Scientists: Exploring Winter Water and How It Changes Our World**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Earth and Space Science)\n- **Time Allotment:** Three 45-minute sessions (approximately 135 minutes total)\n- **NGSS Standards:** \n  - 2-ESS2-3: Obtain information to identify where water is found on Earth and that it can be solid or liquid.\n  - 2-ESS1-1: Use information from several sources to provide evidence that Earth events can occur quickly or slowly.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n- Identify snow as a solid form of water and explain where it is found on Earth during winter.\n- Observe and describe how snow changes the appearance of landscapes and objects.\n- Explain that freezing water (caused by cold temperatures) happens over time and changes how things look.\n- Demonstrate understanding that water exists in different forms (solid and liquid) depending on temperature.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of snow-covered evergreen trees.\n\n**Materials:**\n- Displayed photograph (projected on screen or printed large poster)\n- Chart paper and markers\n- Optional: small cup of ice\n\n**Activity:**\n\n1. **Display the photograph** in a large, visible format. Ask students to sit comfortably where everyone can see clearly.\n\n2. **Ask these discussion questions to spark curiosity:**\n   - \"What do you see covering all the plants and ground in this picture? What is it?\"\n   - \"Why do you think there is so much white stuff on the trees? Have you ever seen this happen?\"\n   - \"If I told you that this white stuff is actually water, what would you say? How can water look like this?\"\n   - \"What season do you think this is? What clues in the picture tell you?\"\n\n3. **Wonder Prompt:** \"I wonder... if all that snow melted, where would all that water go? Let's find out!\"\n\n4. **Record student responses** on chart paper under \"What We Think We Know About Snow\" to reference later.\n\n**Transition:** \"Today, we're going to be snow scientists and discover how water changes into snow, where we find it on Earth, and how it changes the world around us.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate the properties of snow and how water changes state through hands-on observation and experimentation.\n\n**Materials:**\n- Real snow samples (collected just before lesson or kept in freezer; about 1-2 cups per small group)\n- Clear plastic cups or bowls (one per group)\n- Magnifying glasses\n- Thermometers\n- Paper towels\n- Chart paper for recording observations\n- Optional: ice cubes in a separate container for comparison\n\n**Activity:**\n\n1. **Divide the class into small groups** (3-4 students per group).\n\n2. **Distribute materials:** Give each group a cup of snow, a magnifying glass, and a thermometer.\n\n3. **Step-by-step student directions:**\n   - \"Look at your snow very carefully. Describe what it looks like. Does it look like water from a cup?\"\n   - \"Use the magnifying glass to look closely at the snow. What do you see? Are there tiny pieces? What shape are they?\"\n   - \"Touch the snow carefully (with the back of your hand or a pencil—don't use bare fingers). How does it feel? Is it cold?\"\n   - \"Place the thermometer in your snow. What does it say? Is it hot or cold?\"\n   - \"Now, leave your cup of snow in a warm place in the classroom (near a window or warm corner). Predict: What will happen to the snow? Will it stay the same or change?\"\n   - \"Check your snow every 10 minutes. Draw pictures or write words to show what's happening.\"\n\n4. **Connection to the photograph:** \"Just like the snow in our picture covering the trees, your snow is also frozen water. As it gets warmer in the classroom, let's watch what happens to it.\"\n\n5. **Recording:** Students draw or write in their science notebooks:\n   - What the snow looked like at the start\n   - What they felt and observed with the magnifier\n   - What the temperature was\n   - What they predict will happen\n   - What they observe every 10 minutes\n\n**Teacher Role:**\n- Circulate among groups, asking open-ended questions: \"What do you notice changing?\" \"Is the snow the same or different?\" \"Where is the water going?\"\n- Do NOT tell students the snow is melting; let them discover and describe it themselves.\n- Help students use magnifying glasses and thermometers correctly.\n\n**Expected Student Outcomes:**\n- Students will observe that snow is cold (low temperature).\n- Students will notice that snow changes into water (liquid) as it warms up.\n- Students will describe the transformation using their own words and drawings.\n- Students will begin connecting the idea that temperature affects the state of water.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts; connect exploration to the photograph and real-world winter events.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- Student notebooks or paper\n- Photographs or picture cards showing ice, liquid water, and snow\n- Optional: globe or world map\n\n**Activity:**\n\n1. **Group share-out from Explore phase:**\n   - Ask 2-3 groups to share what they observed: \"What happened to your snow?\"\n   - Collect observations on chart paper: melting, turning to water, getting smaller, etc.\n   - Celebrate observations: \"Great noticing! The snow DID change!\"\n\n2. **Introduce key vocabulary with student-friendly definitions:**\n\n   - **Snow:** Frozen water that falls from clouds when it is very cold. It is water in solid form.\n   - **Solid:** Something hard and firm that keeps its shape (like ice and snow).\n   - **Liquid:** Something wet that flows and takes the shape of its container (like water we drink).\n   - **Freezing:** When liquid water becomes solid ice or snow because it gets very, very cold.\n   - **Melting:** When solid snow or ice turns into liquid water because it gets warm.\n\n3. **Connection to the photograph:**\n   - \"Look at this picture again. All that white stuff on the trees is snow—which is frozen water. In winter, when it's very cold outside, water from the clouds falls as snow instead of rain.\"\n   - Point to different parts of the photo: \"See how the snow covers the ground and sticks to the trees? That's because it's solid—it keeps its shape.\"\n   - \"But what would happen if it got warm? Just like your snow in the cup, it would melt and turn into liquid water.\"\n\n4. **Check for understanding:**\n   - \"Is snow a solid or a liquid?\" (Solid)\n   - \"What happens to snow when it gets warm?\" (It melts and becomes water)\n   - \"Where else on Earth do you think we find snow?\" (Mountains, cold places, winter)\n   - Ask students to point to or draw one thing from the photo that shows water in solid form.\n\n**Vocabulary Display:** Create a word wall with the five vocabulary terms and simple illustrations. Keep this visible for the rest of the unit.\n\n**Expected Student Outcomes:**\n- Students understand that snow is frozen water (a solid form of water).\n- Students can explain that temperature causes water to change states.\n- Students recognize that snow is found on Earth during winter in cold places.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by exploring how snow and ice change landscapes and affect the world around us.\n\n**Materials:**\n- Modeling clay or playdough\n- Small toy trees, animals, or figurines\n- Trays or shallow boxes\n- White paper, tissue paper, or cotton balls (to represent snow)\n- Markers and labels\n- Optional: pictures of snowy landscapes and non-snowy landscapes\n\n**Activity:**\n\n1. **Introduction to the task:**\n   - \"Now that we know snow is frozen water, let's think about how it changes the places where it lands. When it snows, everything looks different!\"\n   - Show students the photograph again: \"Look at how different these trees and the ground look because of all the snow.\"\n\n2. **Student task - \"Build a Winter Landscape\":**\n   - In small groups, students create two landscape scenes using materials.\n   - **Scene 1:** A landscape with trees, ground, and animals (using clay, figurines, etc.) WITHOUT snow.\n   - **Scene 2:** The SAME landscape WITH snow (added using white paper, tissue, or cotton balls).\n\n3. **Guiding questions as students build:**\n   - \"How does the landscape look different with snow?\"\n   - \"Can you see the ground? Can you see the trees clearly?\"\n   - \"How might animals move differently in snow? How might snow change where animals can find food?\"\n   - \"If this snow melted, what would happen?\"\n\n4. **Documentation:**\n   - Students draw or photograph their two scenes.\n   - They label what is different between the snowy and non-snowy versions.\n   - They write or dictate one sentence: \"Snow changed the landscape by...\"\n\n**Teacher Role:**\n- Circulate and ask students to explain the differences they created.\n- Guide thinking: \"How do you think animals might behave differently in all this snow?\" (Connects to how Earth events affect living things)\n- Encourage students to think about real winter experiences.\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding that snow covers and changes how landscapes look.\n- Students begin to connect snow to real-world impacts (e.g., how it affects movement, visibility, habitats).\n- Students show that the same place looks completely different depending on whether snow is present.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of water states, snow as frozen water, and how snow affects Earth.\n\n**Formative Assessment (Throughout Lesson):**\n- Observation of student responses during Explore: Did they notice the snow changing?\n- Listen to explanations during group share-out: Can they describe melting in their own words?\n- Monitor Elaborate activity: Do students recognize how snow changes the landscape?\n- Review vocabulary checks from Explain phase: Can they identify solids and liquids?\n\n**Exit Ticket (Summative Assessment):**\n\nAdminister one of the following (choose based on student literacy levels):\n\n**Option A (Drawing + Words):**\n- \"Draw a picture showing what happens to snow when it gets warm. Label your picture with the words: SNOW, WATER, MELTING.\"\n\n**Option B (Multiple Choice + Explanation):**\n- \"Snow is a _____ form of water.\"\n  - A) Liquid   B) Solid   C) Hot\n  - **Correct answer: B (Solid)**\n- \"Why does snow turn into water in a warm room? Explain in 1-2 sentences.\"\n\n**Option C (Comparison):**\n- Draw or write to answer: \"How is snow different from the water you drink from a cup? How are they the same?\"\n\n**Success Criteria for Student Understanding:**\n\n✓ Students correctly identify snow as solid/frozen water.\n\n✓ Students explain that warm temperatures cause snow to melt into liquid water.\n\n✓ Students describe or show how snow changes the appearance of landscapes.\n\n✓ Students recognize snow as a form of water found on Earth.\n\n**Expected Student Outcomes:**\n- Most second graders should be able to identify snow as frozen water and describe simple cause-and-effect (cold → snow; warm → melting).\n- Students should demonstrate understanding through drawings, words, or explanations appropriate to their literacy level.\n- Students who exceed expectations may explain that snow comes from clouds, discuss where snow is found globally, or predict what happens to snow over longer time periods.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified vocabulary matching:** Provide picture cards with just two terms: SNOW (solid) and WATER (liquid). Have students sort pictures or objects into these categories with teacher guidance.\n\n2. **Hands-on demonstration:** Work with small groups during Explore phase. Offer direct questioning: \"Is this cold or warm?\" \"Is it hard like ice or wet like water?\" Help them notice changes rather than expecting independent observation.\n\n3. **Sentence frames for Exit Ticket:** Provide sentence starters:\n   - \"Snow is frozen ________.\"\n   - \"When snow gets warm, it turns into ________.\"\n   - \"In the picture, snow covers the ________.\"\n\n### Challenge (For Advanced Learners)\n\n1. **Extended inquiry:** Ask, \"What would happen if we left snow outside in the winter? Would it melt? Why or why not? How is that different from leaving it in a warm room?\" Have students predict and test (if weather permits or using a freezer).\n\n2. **Global exploration:** Show students a world map or globe. Ask, \"Where on Earth is it cold enough to have snow all year long? Where is it never cold enough for snow?\" Research and mark these places. Discuss why certain places always have snow and others never do.\n\n3. **Time and observation:** Challenge students to observe and document snow changes over a longer period (1-2 weeks) through daily drawings and temperature checks. Create a graph showing temperature versus how much snow remains.\n\n---\n\n## Extension Activities\n\n1. **Water Cycle Connection:** Once students understand snow as frozen water, introduce the water cycle. Read a simple book like *The Water Cycle* by Rebecca Olien. Have students create a circular diagram showing how snow is part of the bigger water cycle (evaporation, condensation, precipitation, collection). This prepares them for upper-grade ESS standards about weather and water systems.\n\n2. **Winter Animals Investigation:** Research and discuss how different animals survive winter with snow on the ground. Read books like *Animals in Winter* by Loretta Holland. Students can create a poster or presentation showing one animal's adaptations to snowy winters (thicker fur, hibernation, migration, etc.). This bridges to life science connections about how organisms respond to seasonal changes.\n\n3. **Snow Safety & Problem-Solving:** After a snowfall, discuss real-world challenges: \"How do people keep roads safe in snow? How do they get cars to move? How do they keep sidewalks clear?\" Have students design or draw a solution to a snow-related problem (e.g., a snow removal tool, a way to help people walk safely). This extends thinking to how humans respond to and work within Earth events.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 217,
  "outputTokens": 3548,
  "cost": 0.0184324,
  "generatedAt": "2026-02-13T03:34:15.898Z"
}