{
  "title": "Winter Seasons",
  "category": "earth-space-science",
  "imageFile": "winter_seasons.jpg",
  "imagePath": "images/earth-space-science/winter_seasons.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- Evergreen trees (conifers) with dense branching heavily laden with wet snow\n- Snow accumulation on horizontal and angled branches in large, cohesive clumps\n- Bare deciduous trees in background (without snow load)\n- Flat, snow-covered ground/landscape\n- Bright sunlight casting shadows, indicating clear weather during or after snowfall\n\n---\n\n### Reasonable Inferences\n1. **From heavy snow clumps on branches** → Wet, dense snow is adhering unevenly to the tree structure; the weight of accumulated snow is a mechanical stress that could damage or bend branches if it becomes too heavy.\n2. **From conifer shape (tapered, pyramidal)** → The tree's design naturally sheds loads; branches angle downward, which may help snow slide off rather than pile up indefinitely.\n3. **From bare trees without snow nearby** → Different tree shapes respond differently to identical weather; branch angle and spacing affect how snow collects.\n\n---\n\n### Engineering Task\n\n**K-2:**\n> **Build a Snow-Catching Stick Structure**\n> \n> Make a small tree or stick frame out of popsicle sticks or twigs that can hold as much \"snow\" (cotton balls or crumpled tissue) as possible without any pieces falling off. Test which branch angles work best—straight across or tilted down?\n\n---\n\n**3-5:**\n> **Design a Snow-Shedding Evergreen Canopy Model**\n> \n> Using cardstock, straws, or foam dowels, build a scale model of an evergreen tree (at least 20 cm tall) that can support wet snow loads. Your design must:\n> - Have at least 3 \"branch levels\" with varying angles (test 30°, 45°, and 60° from horizontal)\n> - Support a minimum of 500 grams of simulated snow (rice or sand in a container) without any branch breaking\n> - Shed at least 50% of the load within 10 seconds when tilted 15° to one side\n> \n> Test each angle separately and measure which design sheds snow most effectively while supporting the heaviest load.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem** — This phase fits best because students observe a real-world phenomenon (snow load damage risk on trees) and must identify *why* some tree shapes survive heavy snow better than others. The challenge asks them to first understand the problem before designing a solution.\n\n---\n\n### Suggested Materials\n1. **Popsicle sticks, dowels, or straws** (for branch structure)\n2. **Cardstock or foam sheets** (for canopy/frame)\n3. **Rice, sand, or small plastic beads** (to simulate wet snow load)\n4. **Cotton balls or crumpled tissue paper** (alternative, lighter snow simulant for K-2)\n5. **Protractor or angle ruler** (to set and measure branch angles precisely in 3-5)\n6. **Shallow container or tray** (to hold simulated snow on branches)\n\n---\n\n### Estimated Time\n- **K-2:** 30–40 minutes (20 min. build, 10–15 min. test variations)\n- **3-5:** Two 40-minute sessions (40 min. design & build, 40 min. test & iterate on angles)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1**: \"Define a simple design problem reflecting a need or a want\" by having students identify real-world snow load stress and engineer a structure that balances load capacity with shedding ability—core to engineering tradeoffs.",
  "inputTokens": 1806,
  "outputTokens": 859,
  "cost": 0.0061010000000000005,
  "generatedAt": "2026-02-09T13:37:03.147Z"
}