{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "55%",
      "label": "Recycled Bottle",
      "fact": "This bottle is being reused as a home for a plant! When we reuse materials instead of throwing them away, we help protect habitats and ecosystems for living things. Plants need containers to grow, and this shows how humans can use resources in ways that don't harm the environment.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "A habitat is the place where a plant or animal lives and finds food, water, and shelter."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "35%",
      "label": "Plant Seedling",
      "fact": "This young plant is growing from a seed! Plants start their life cycle as seeds, and when given water and sunlight, they grow roots and leaves. This seedling will continue to grow bigger and stronger over time, eventually becoming a full-grown plant.",
      "vocabulary": {
        "term": "Life Cycle",
        "definition": "A life cycle is the series of changes a living thing goes through, starting from birth and ending with death."
      }
    },
    {
      "id": 3,
      "x": "75%",
      "y": "20%",
      "label": "Green Leaves",
      "fact": "The leaves on this plant are bright green because they contain a special material called chlorophyll. Leaves use sunlight, water, and air to make food for the plant through a process called photosynthesis. This is how plants get the energy they need to grow!",
      "vocabulary": {
        "term": "Photosynthesis",
        "definition": "Photosynthesis is the process where plants use sunlight to turn water and air into food and energy."
      }
    },
    {
      "id": 4,
      "x": "10%",
      "y": "25%",
      "label": "Window & Sunlight",
      "fact": "This plant is growing near a sunny window, which is perfect for its survival! Plants need sunlight as one of their basic needs to live and grow healthy. The window lets light in so the plant can make its own food and develop strong leaves and stems.",
      "vocabulary": {
        "term": "Basic Needs",
        "definition": "Basic needs are the things all living things must have to survive, like food, water, air, and sunlight."
      }
    }
  ]
}