{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "35%",
      "label": "Fallen Leaf",
      "fact": "This leaf has fallen from a tree and is decomposing on the forest floor. When leaves and other dead plants break down, they return nutrients to the soil that help new plants grow. This process is called **decomposition** — that's when dead plants and animals break down into smaller pieces and return their nutrients back to the earth.",
      "vocabulary": {
        "term": "Decomposition",
        "definition": "The process where dead plants and animals break down and turn into soil, which helps new plants grow."
      }
    },
    {
      "id": 2,
      "x": "45%",
      "y": "25%",
      "label": "Decaying Log",
      "fact": "This rotting log is a home for many tiny organisms and insects that eat dead wood. The log provides food and shelter for these creatures, which helps them survive in the forest. This dead wood is an important part of the forest **habitat** — a place where animals and plants live and find everything they need.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "A place where an animal or plant lives and finds food, water, and shelter."
      }
    },
    {
      "id": 3,
      "x": "55%",
      "y": "50%",
      "label": "Forest Floor Debris",
      "fact": "All the leaves, twigs, and bark pieces on the forest floor create layers that protect soil and help seeds grow. Different plants and animals have **adaptations** that help them live on the forest floor, like insects with hard shells and plants with thick roots. This is called **camouflage** — many forest creatures have colors and patterns that match their environment so predators can't see them easily.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal or plant survive in its habitat."
      }
    },
    {
      "id": 4,
      "x": "35%",
      "y": "55%",
      "label": "Ecosystem Chain",
      "fact": "The forest floor is part of an **ecosystem** where all living and non-living things are connected. Dead plants feed decomposers like fungi and bacteria, insects eat the decomposing wood, and small animals eat those insects. This is called a **food chain** — energy moves from plants to animals in a connected sequence.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "All the living things (plants and animals) and non-living things (soil, water, air) in one area that work together."
      }
    }
  ]
}