{
  "hotspots": [
    {
      "id": 1,
      "x": "72%",
      "y": "45%",
      "label": "Insect Wings",
      "fact": "This cicada has special clear wings with lots of tiny lines running through them. These wings help the cicada fly and move around to find food and mates. The delicate structure you see is called **venation** — that's the pattern of veins in the wings that makes them strong but still light enough to fly.",
      "vocabulary": {
        "term": "Venation",
        "definition": "The pattern of veins or lines that run through an insect's wings to help them stay strong and flexible."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "35%",
      "label": "Compound Eyes",
      "fact": "The large eyes you see on the cicada's head are made up of thousands of tiny eye parts working together. This helps the insect see in many directions at once to spot predators and find plants to eat. These special eyes are called **compound eyes** — each one has many lenses instead of just one like human eyes.",
      "vocabulary": {
        "term": "Compound Eyes",
        "definition": "Eyes made up of many tiny lenses that help insects see movement and color very well."
      }
    },
    {
      "id": 3,
      "x": "35%",
      "y": "25%",
      "label": "Red Flowers",
      "fact": "The bright red flowers attract insects like this cicada to visit them. When the cicada lands on the flower to drink sweet nectar, pollen sticks to its body. This process is called **pollination** — that's when pollen is carried from one flower to another so plants can make seeds and reproduce.",
      "vocabulary": {
        "term": "Pollination",
        "definition": "When pollen moves from one flower to another, usually with help from insects or wind, so plants can make new seeds."
      }
    },
    {
      "id": 4,
      "x": "68%",
      "y": "58%",
      "label": "Strong Legs",
      "fact": "The cicada has six strong, spiky legs that help it grip branches and climb around plants. Each leg has special claws and sticky pads that work like tiny tools. These legs show how insects are **adapted** — their body parts are specially designed to help them survive and move in their habitat of trees and plants.",
      "vocabulary": {
        "term": "Adapted",
        "definition": "When a living thing's body parts or behaviors are specially designed to help it survive in its environment."
      }
    }
  ]
}