{
  "hotspots": [
    {
      "id": 1,
      "x": "68%",
      "y": "45%",
      "label": "Cicada Wings",
      "fact": "This insect has two pairs of wings that help it fly and move around to find food and mates. Wings are a special body part that help insects survive and live in their environment. This is called **adaptation** — a special feature that helps an animal survive and do the things it needs to do.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive and live in its environment."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "60%",
      "label": "Cicada Body Parts",
      "fact": "Insects like this cicada have six legs, antennae, and compound eyes that help them survive. Different body parts have different jobs — the legs help it climb and grip branches, while the antennae help it smell and sense the world around it. This is called **structure** — when different parts of a body work together to help an organism live.",
      "vocabulary": {
        "term": "Structure",
        "definition": "The way a body is organized, with different parts that have different jobs."
      }
    },
    {
      "id": 3,
      "x": "25%",
      "y": "35%",
      "label": "Red Flowers",
      "fact": "This cicada is visiting red flowers to drink the sweet juice called nectar from inside them. When insects like cicadas visit flowers, they help plants make seeds in a process called **pollination** — that's when pollen sticks to the insect's body and gets carried to the next flower. This shows how living things in an ecosystem depend on each other!",
      "vocabulary": {
        "term": "Pollination",
        "definition": "When pollen from one flower is carried to another flower, usually by insects, so plants can make seeds."
      }
    },
    {
      "id": 4,
      "x": "35%",
      "y": "25%",
      "label": "Plant Stem",
      "fact": "The gray branch the cicada is standing on is part of a plant that provides food and shelter for many animals. Plants make their own food using sunlight, water, and air, and then animals eat the plants or drink their nectar. This is called a **food chain** — the path that energy takes as one living thing eats another in nature.",
      "vocabulary": {
        "term": "Food Chain",
        "definition": "The order in which living things eat each other, starting with plants and moving to animals."
      }
    }
  ]
}