{
  "hotspots": [
    {
      "id": 1,
      "x": "65%",
      "y": "55%",
      "label": "Cow's Body Features",
      "fact": "Cows are living organisms that have special body parts to help them survive. They have a large body to store energy from the grass they eat, and their four stomachs help them digest plant food. This is called a **herbivore** — an animal that eats only plants to get the energy and nutrients it needs to live and grow.",
      "vocabulary": {
        "term": "Herbivore",
        "definition": "An animal that eats only plants, like cows, sheep, and deer."
      }
    },
    {
      "id": 2,
      "x": "20%",
      "y": "50%",
      "label": "Grazing Habitat",
      "fact": "These cows live in a pasture, which is their habitat — the place where they find everything they need to survive. The grass is their food source, the open field keeps them safe from predators, and the forest in the background provides shade on hot days. A **habitat** is like an animal's home that gives it food, water, shelter, and safety.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where an animal or plant lives and has everything it needs to survive, like food, water, and shelter."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "20%",
      "label": "Forest Ecosystem",
      "fact": "The tall trees in the background are part of a forest ecosystem where many living things depend on each other. Trees provide oxygen we breathe, food and homes for animals, and shade for grazing animals like these cows. All the plants and animals living together in one place create a community that relies on each other to survive. An **ecosystem** includes all the living things and non-living things in an area that work together.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "All the living organisms (plants and animals) and non-living things (soil, water, air) in one area that work together."
      }
    },
    {
      "id": 4,
      "x": "45%",
      "y": "65%",
      "label": "Food Chain Link",
      "fact": "Cows eat grass, which means they are consumers in this pasture's food chain. The grass is the producer because it makes its own food using sunlight. Humans are also part of this food chain because we eat beef from cows and use their milk. A **food chain** shows how energy moves from plants to animals in order.",
      "vocabulary": {
        "term": "Food Chain",
        "definition": "The order of who eats what in nature — plants make food, animals eat plants or other animals, and energy moves through this chain."
      }
    }
  ]
}