{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "35%",
      "label": "Long, Thin Legs",
      "fact": "This animal has four long, slender legs that help it run fast and jump high to escape from predators. The shape and structure of an animal's body parts help it survive in its environment. This is called **adaptation** — special features that help animals stay alive and do what they need to do.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive and live in its environment."
      }
    },
    {
      "id": 2,
      "x": "70%",
      "y": "60%",
      "label": "White Tail Patch",
      "fact": "The white patch on this animal's tail is a signal it uses to communicate with other animals in its group. Many animals use body parts and movements to send messages to each other about danger or to find mates. This visible marking helps other animals notice it quickly.",
      "vocabulary": {
        "term": "Communication",
        "definition": "The way animals send messages to each other using sounds, colors, movements, or body parts."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "25%",
      "label": "Head and Ears",
      "fact": "This animal has pointed ears and a long snout that help it sense danger from far away. Animals have different body structures that allow them to see, hear, smell, and feel their surroundings. These **sensory organs** help the animal know what is happening around it so it can stay safe.",
      "vocabulary": {
        "term": "Sensory Organs",
        "definition": "Body parts that help animals see, hear, smell, taste, and feel the world around them."
      }
    },
    {
      "id": 4,
      "x": "40%",
      "y": "50%",
      "label": "Lean, Muscular Body",
      "fact": "This animal's slim body and strong muscles help it move quickly across different habitats like grasslands and forests. Animals have different body plans that are suited to the way they live and the food they eat. A lean body helps this **herbivore** digest plants and stay active while searching for food.",
      "vocabulary": {
        "term": "Herbivore",
        "definition": "An animal that eats only plants and leaves for food."
      }
    }
  ]
}