{
  "hotspots": [
    {
      "id": 1,
      "x": "65%",
      "y": "35%",
      "label": "Deer in Habitat",
      "fact": "This deer is living in its natural home called a **habitat** — a place where an animal can find food, water, and shelter. Deer need open grassy areas like this to find plants to eat, and they stay near trees where they can hide from danger. This shows how animals depend on their environment to survive.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where a plant or animal lives and finds everything it needs to survive, like food, water, and shelter."
      }
    },
    {
      "id": 2,
      "x": "45%",
      "y": "25%",
      "label": "Dried Grasses",
      "fact": "The brown, dried grasses in this field are dead plants that were once alive and growing. When plants die, they become part of the soil and help new plants grow next year. This is part of nature's recycling system called the **food chain**, where nothing is wasted.",
      "vocabulary": {
        "term": "Food Chain",
        "definition": "The path that energy takes as it moves from plants to animals to other animals in a habitat."
      }
    },
    {
      "id": 3,
      "x": "60%",
      "y": "75%",
      "label": "Forest Trees",
      "fact": "The tall trees in the background are an important part of this **ecosystem** because they provide shelter and food for many animals. Different animals like birds, squirrels, and insects live in trees and depend on them to survive. Trees also give off oxygen that helps all living things breathe.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "A community of living things (plants and animals) and the non-living things (soil, water, air) that all work together in one area."
      }
    },
    {
      "id": 4,
      "x": "25%",
      "y": "50%",
      "label": "Field Transition Zone",
      "fact": "Where the open grass meets the forest trees, there is a special area where different types of plants and animals can live. Many animals like deer prefer this **transition zone** because they can eat plants in the open field and hide in the nearby trees when needed. This shows how animals adapt to use different parts of their habitat.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive and thrive in its habitat."
      }
    }
  ]
}