{
  "hotspots": [
    {
      "id": 1,
      "x": "65%",
      "y": "35%",
      "label": "Dark Red Flower",
      "fact": "This beautiful dark red flower is part of the plant's life cycle and helps it make seeds. Insects like grasshoppers are attracted to flowers to drink sweet liquid called nectar, and when they visit, they help the plant by spreading pollen. This is called **pollination** — that's when pollen is carried from one flower to another so plants can make seeds.",
      "vocabulary": {
        "term": "Pollination",
        "definition": "When pollen is carried from one flower to another, helping plants make seeds."
      }
    },
    {
      "id": 2,
      "x": "35%",
      "y": "55%",
      "label": "Grasshopper Body",
      "fact": "This green grasshopper has a body specially adapted for its environment! Grasshoppers have strong back legs for jumping, antennae on their head to sense food and danger, and eyes that help them see movement. Each of these body parts helps the grasshopper survive in its habitat among plants.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive in its environment."
      }
    },
    {
      "id": 3,
      "x": "55%",
      "y": "70%",
      "label": "Green Plant Stem",
      "fact": "The green stem holds up the flower and carries water and nutrients from the roots to all parts of the plant. Plants need water, sunlight, and nutrients from soil to grow strong and make flowers. This is how plants get the energy they need to live and grow, just like you need food for energy!",
      "vocabulary": {
        "term": "Stem",
        "definition": "The main part of a plant that holds up the leaves and flowers and carries water throughout the plant."
      }
    },
    {
      "id": 4,
      "x": "25%",
      "y": "35%",
      "label": "Grasshopper Antennae",
      "fact": "The long thin antennae on the grasshopper's head are like super-sensitive feelers! They help the grasshopper smell food, feel vibrations, and sense danger in its environment. Without antennae, grasshoppers wouldn't be able to find the plants they eat or know when a predator is nearby.",
      "vocabulary": {
        "term": "Antennae",
        "definition": "Long, thin sense organs on an insect's head that help it smell, touch, and feel its surroundings."
      }
    }
  ]
}