{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "45%",
      "label": "Hummingbird's Long Beak",
      "fact": "A hummingbird has a long, thin beak that is perfectly shaped to drink nectar from flowers. This special body structure helps the hummingbird get the food it needs to survive. This is called **adaptation** — that's when an animal's body has special features that help it live in its environment.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive and find food in its home."
      }
    },
    {
      "id": 2,
      "x": "75%",
      "y": "35%",
      "label": "Bright Pink Flower",
      "fact": "Hummingbirds are attracted to bright flowers like this one because they see the vivid pink color. When the hummingbird visits the flower to drink nectar, pollen sticks to its beak and head. This is called **pollination** — that's when pollen is carried from one flower to another so plants can make seeds.",
      "vocabulary": {
        "term": "Pollination",
        "definition": "The process where pollen from one flower moves to another flower so the plant can make new seeds."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "30%",
      "label": "Hummingbird Wings in Motion",
      "fact": "A hummingbird's wings beat super fast—up to 80 times per second! This fast wing movement lets the hummingbird hover in one spot while it eats from flowers. Hummingbirds need lots of food energy because their bodies work so hard to stay alive.",
      "vocabulary": {
        "term": "Energy",
        "definition": "The power that living things need to move, grow, and do all their activities."
      }
    },
    {
      "id": 4,
      "x": "30%",
      "y": "55%",
      "label": "Flower and Hummingbird Relationship",
      "fact": "The hummingbird and flower need each other to survive—this is called a **food chain**. The flower gives the hummingbird sweet nectar to eat, and the hummingbird helps the flower by spreading pollen. Both living things depend on each other in nature!",
      "vocabulary": {
        "term": "Food Chain",
        "definition": "The path that energy takes as it moves from plants to animals that eat the plants."
      }
    }
  ]
}