{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "35%",
      "label": "Black Beak",
      "fact": "This bird uses its beak to find and eat food from the ground, like insects and seeds. The beak is a special body part that helps the bird survive in its habitat. This is called **adaptation** — that's when a body part helps an animal live and find what it needs.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A body part or behavior that helps an animal survive and live in its environment."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "50%",
      "label": "Feathers and Coloring",
      "fact": "This bird's gray and brown feathers help it blend in with the ground and rocks around it. Having colors that match the environment helps the bird hide from predators and stay safe. This special matching is called **camouflage** — that's when an animal's colors help it blend into its surroundings.",
      "vocabulary": {
        "term": "Camouflage",
        "definition": "Colors or patterns on an animal's body that help it blend in with its environment to stay hidden."
      }
    },
    {
      "id": 3,
      "x": "65%",
      "y": "45%",
      "label": "Body Structure",
      "fact": "Birds have hollow bones, wings, and feathers that help them survive in different environments. All birds share these important body parts that make them different from other animals. Scientists look at shared body structures to understand how different animals are related to each other.",
      "vocabulary": {
        "term": "Body Structure",
        "definition": "The different parts that make up an animal's body, like bones, feathers, wings, and beaks."
      }
    },
    {
      "id": 4,
      "x": "40%",
      "y": "20%",
      "label": "Dark Eye",
      "fact": "Birds have large eyes that help them see their surroundings very well, which is important for finding food and avoiding danger. Eyes are a special trait that all birds and many other animals have to interact with their world. Having good eyesight helps this bird survive in its ground habitat where it must spot small insects and predators.",
      "vocabulary": {
        "term": "Trait",
        "definition": "A special characteristic or feature that an organism has, like eye color, feather type, or beak shape."
      }
    }
  ]
}