{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "45%",
      "label": "Dragonfly Wings",
      "fact": "Dragonflies have four long, clear wings that help them fly super fast and hover in place like a helicopter! These wings are made of a thin material called a membrane that stretches across tiny veins, kind of like the frame of a kite. This body structure helps the dragonfly catch insects while flying.",
      "vocabulary": {
        "term": "Wings",
        "definition": "Special body parts that help insects and birds move through the air by flapping or gliding."
      }
    },
    {
      "id": 2,
      "x": "45%",
      "y": "52%",
      "label": "Dragonfly Eyes",
      "fact": "Dragonflies have huge eyes that can see in almost every direction at once, which helps them spot tiny flying insects to eat! Their eyes are adapted to help them hunt for food and survive in their environment. Good eyesight is an important body structure that helps this predator catch prey.",
      "vocabulary": {
        "term": "Predator",
        "definition": "An animal that hunts and eats other animals for food."
      }
    },
    {
      "id": 3,
      "x": "65%",
      "y": "35%",
      "label": "Plant Habitat",
      "fact": "This dragonfly is sitting on green plant leaves near water, which is its perfect habitat! Dragonflies need water because they lay their eggs in ponds and streams, and their babies live in the water before they become adults. Plants and water are essential parts of where dragonflies live and grow.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where an animal or plant lives and finds food, water, and shelter."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "58%",
      "label": "Dragonfly Body",
      "fact": "A dragonfly's long, thin body is perfectly designed to help it move quickly through the air when hunting! This insect's body structure includes a head, thorax (middle section), and abdomen (long tail part) that work together to make it an amazing flyer. All insects have bodies made up of three main parts like this.",
      "vocabulary": {
        "term": "Insect",
        "definition": "A small animal with six legs, three body parts, and usually wings."
      }
    }
  ]
}