{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "35%",
      "label": "Eye and Vision",
      "fact": "This bird has a large, dark eye that helps it see its surroundings very well. Birds use their eyes to find food, spot danger, and move around their habitat safely. The eye is an important body part that helps this animal survive in nature.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive and thrive in its environment."
      }
    },
    {
      "id": 2,
      "x": "20%",
      "y": "45%",
      "label": "Beak and Mouth",
      "fact": "This bird has a long, pointed black beak that is specially shaped for picking up small food from the ground. Different birds have different beak shapes based on what they eat and where they live. This is called **structure and function** — the beak's shape matches what the bird needs to do to survive.",
      "vocabulary": {
        "term": "Structure and Function",
        "definition": "The way a body part is shaped helps it do its special job."
      }
    },
    {
      "id": 3,
      "x": "55%",
      "y": "55%",
      "label": "Feathers and Covering",
      "fact": "Feathers cover this bird's entire body and help keep it warm and dry. Each feather is made of special parts that work together like tiny pieces of armor. Feathers are one of the traits that make birds different from other animals, and this bird inherited its feather pattern from its parents.",
      "vocabulary": {
        "term": "Inherited Traits",
        "definition": "Characteristics that an animal gets from its parents, like feather color or beak shape."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "25%",
      "label": "Habitat: Ground Nester",
      "fact": "This bird is resting on rocky, dry ground with small plants around it, which is its natural habitat. Birds live in different habitats like forests, deserts, grasslands, and beaches, and each type of bird is specially adapted to survive in its own home. This bird's camouflaged coloring helps it blend in with the rocky ground to stay safe.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where an animal lives that has everything it needs to survive, like food, water, and shelter."
      }
    }
  ]
}