{
  "hotspots": [
    {
      "id": 1,
      "x": "65%",
      "y": "25%",
      "label": "Assassin Bug",
      "fact": "This insect is visiting the flower to find food and help the plant at the same time! When insects land on flowers to drink nectar, they pick up yellow powder called pollen on their bodies. As they move from flower to flower, they spread this pollen, which helps plants make seeds and grow new plants.",
      "vocabulary": {
        "term": "Pollination",
        "definition": "When pollen is carried from one flower to another by insects or wind, helping plants make seeds."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "50%",
      "label": "Yellow Center",
      "fact": "The bright yellow center of this flower is called the stamen, and it produces the pollen that insects need to carry. Different plants have different colors and shapes to attract different insects and animals. This is a special adaptation that helps living things survive and work together in nature.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special feature or behavior that helps a living thing survive and do well in its environment."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "70%",
      "label": "White Petals",
      "fact": "The white petals you see are like a landing pad for insects! Flowers use bright colors and patterns to signal to insects: 'Come here for food!' The shape and color of petals help insects find the flower and know it has nectar and pollen to eat.",
      "vocabulary": {
        "term": "Nectar",
        "definition": "A sweet liquid inside flowers that insects drink for energy, similar to how we drink juice."
      }
    },
    {
      "id": 4,
      "x": "70%",
      "y": "35%",
      "label": "Insect Legs",
      "fact": "The bug's long, thin legs help it grip the flower petals while it feeds. Insects have six legs, and their bodies are specially designed to move around different plants and flowers. These interactions between insects and plants are important because they help plants reproduce and create food for other animals.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "A community of living things (like plants and insects) and non-living things (like soil and water) that all depend on each other."
      }
    }
  ]
}