{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Snake's Scales",
      "fact": "This snake has colorful red, black, and yellow scales covering its body. Scales are special skin that protects the snake and helps it move smoothly. The pattern of stripes and colors helps scientists identify what type of snake this is!",
      "vocabulary": {
        "term": "Scales",
        "definition": "Hard, flat plates that cover a snake's body to protect it and keep it safe."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "55%",
      "label": "Snake's Body Structure",
      "fact": "Snakes have long, flexible bodies made of many small bones connected together like a chain. This body shape helps snakes squeeze into small spaces and move through different habitats like grass, trees, and soil. A snake uses its whole body to slither and explore!",
      "vocabulary": {
        "term": "Vertebrae",
        "definition": "Small bones that stack together to make up a snake's spine and allow it to bend and move."
      }
    },
    {
      "id": 3,
      "x": "40%",
      "y": "28%",
      "label": "Snake's Eyes",
      "fact": "This snake has dark eyes that help it see and hunt for food like small animals. Snakes use their eyes along with special sensors to find prey in their environment. Different types of snakes have eyes that are adapted to help them survive in their homes.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special feature or behavior that helps an animal survive and do well in its home."
      }
    },
    {
      "id": 4,
      "x": "45%",
      "y": "70%",
      "label": "Curled Position",
      "fact": "This snake is curled in the handler's hand, showing how snakes can coil their bodies. Coiling helps snakes stay warm, feel safe, and prepare to move quickly if needed. This is a natural behavior that snakes use to rest and protect themselves in their habitat.",
      "vocabulary": {
        "term": "Behavior",
        "definition": "The things an animal does, like moving, eating, or coiling up to stay safe."
      }
    }
  ]
}