{
  "hotspots": [
    {
      "id": 1,
      "x": "45%",
      "y": "35%",
      "label": "Eggshell Breaking",
      "fact": "These broken eggshells show that a baby bird or reptile has hatched! When animals are ready to be born, they break out of their eggs in a process called hatching. This is part of the **life cycle** — that's the series of changes that living things go through from birth to adulthood.",
      "vocabulary": {
        "term": "Life cycle",
        "definition": "The series of changes a living thing goes through from when it is born until it grows up and can have babies of its own."
      }
    },
    {
      "id": 2,
      "x": "55%",
      "y": "50%",
      "label": "Soil and Decomposition",
      "fact": "The dark soil and brown wood pieces around the eggs are made from things that have broken down over time. Dead leaves, branches, and other plant materials decay in the soil, which is called **decomposition**. This process returns nutrients back to the soil so new plants can grow strong and healthy.",
      "vocabulary": {
        "term": "Decomposition",
        "definition": "When dead plants and animals break down into smaller pieces and mix with soil, providing food for new plants to grow."
      }
    },
    {
      "id": 3,
      "x": "35%",
      "y": "65%",
      "label": "Habitat and Ecosystem",
      "fact": "This is a perfect example of a **habitat** — the place where an animal lives and finds everything it needs to survive. The soil, plants, and broken-down materials create an ecosystem where different living things interact with each other and their environment.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where a plant or animal lives that has everything it needs, like food, water, shelter, and the right temperature."
      }
    },
    {
      "id": 4,
      "x": "60%",
      "y": "25%",
      "label": "Green Plants Growing",
      "fact": "The green plant stems and leaves growing near the eggs need sunlight, water, and nutrients from the soil to survive. Plants are **living things** that grow and change, just like the baby animal that hatched from these eggs. Both plants and animals need the right conditions in their habitat to grow healthy.",
      "vocabulary": {
        "term": "Living things",
        "definition": "Plants and animals that are alive, can grow, need food and water, and can have babies to continue their species."
      }
    }
  ]
}