{
  "hotspots": [
    {
      "id": 1,
      "x": "48%",
      "y": "45%",
      "label": "Green Chrysalis",
      "fact": "This green chrysalis shows an insect in the middle stage of its life cycle, called the **pupa** stage. Inside this protective case, an amazing transformation is happening — the insect is changing from a caterpillar into a butterfly or moth! This complete change in body form is one of nature's most incredible life cycles.",
      "vocabulary": {
        "term": "Chrysalis",
        "definition": "A hard protective case where a caterpillar transforms into a butterfly or moth."
      }
    },
    {
      "id": 2,
      "x": "25%",
      "y": "40%",
      "label": "Empty Chrysalis",
      "fact": "This empty chrysalis is a clue that the insect has already completed its life cycle! The butterfly or moth has grown wings inside and pushed through the chrysalis to escape. This empty shell shows us one of the four stages all insects go through: egg, larva, pupa, and adult.",
      "vocabulary": {
        "term": "Life Cycle",
        "definition": "The series of changes a living thing goes through from birth to becoming an adult and making babies."
      }
    },
    {
      "id": 3,
      "x": "48%",
      "y": "28%",
      "label": "Yellow Spots",
      "fact": "The tiny yellow spots on the green chrysalis might be special structures that help the developing insect breathe and get oxygen inside its protective case. These spots are one way we can observe the **structures** of living things and how they help insects survive during their transformation.",
      "vocabulary": {
        "term": "Structure",
        "definition": "A body part or special feature of a living thing that helps it survive and do what it needs to do."
      }
    },
    {
      "id": 4,
      "x": "48%",
      "y": "65%",
      "label": "Habitat: Rock Surface",
      "fact": "These chrysalises are attached to a rocky surface, which is part of their **habitat** — the place where they live and grow. Insects choose safe spots like rocks and walls to hang their chrysalises because they are protected from wind, rain, and predators while they transform into adults.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The natural home or environment where a living thing lives and finds food, water, and shelter."
      }
    }
  ]
}