{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "20%",
      "label": "Ear Tufts",
      "fact": "This owl has special pointed feathers on its head that look like ears, but they're not really ears! These feathers help the owl blend in with tree branches and bark, which is called camouflage. This adaptation helps the owl hide from other animals and sneak up on prey.",
      "vocabulary": {
        "term": "Camouflage",
        "definition": "Colors, patterns, or shapes that help an animal blend in with its surroundings so it's hard to see."
      }
    },
    {
      "id": 2,
      "x": "20%",
      "y": "55%",
      "label": "Patterned Feathers",
      "fact": "The owl's feathers have a mottled gray and brown pattern with white spots that help it stay hidden on light-colored surfaces like this white wall or tree bark. Different owl species have different feather patterns suited to their specific habitats, showing how animals are adapted to their environments.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special trait or body part that helps an animal survive and do well in its environment."
      }
    },
    {
      "id": 3,
      "x": "35%",
      "y": "70%",
      "label": "Body Structure",
      "fact": "This owl has a compact, rounded body with soft feathers that make it look fluffy and help it stay warm. Owls are birds, which means they have feathers, wings, and lay eggs as part of their life cycle. Their body shape helps them fly silently through the air to hunt at night.",
      "vocabulary": {
        "term": "Feathers",
        "definition": "Special lightweight structures that cover a bird's body and help it fly, stay warm, and blend into its environment."
      }
    },
    {
      "id": 4,
      "x": "15%",
      "y": "40%",
      "label": "Forward-Facing Eyes",
      "fact": "This owl's large eyes face forward, which gives it special vision to see prey in the dark and judge how far away things are. Owls are nocturnal hunters, meaning they hunt at night, and their big eyes help them see much better than humans in dim light. This is an important adaptation for an owl's survival.",
      "vocabulary": {
        "term": "Nocturnal",
        "definition": "An animal that is active and hunts at night and rests during the day."
      }
    }
  ]
}