{
  "hotspots": [
    {
      "id": 1,
      "x": "45%",
      "y": "35%",
      "label": "Bright Stripes",
      "fact": "This caterpillar has bold yellow and black stripes that warn predators to stay away! These bright colors are a special defense that tells other animals, 'I might taste bad, so don't eat me.' This is called **warning coloration** — bright colors that animals use to communicate danger.",
      "vocabulary": {
        "term": "Warning Coloration",
        "definition": "Bright, bold colors on an animal's body that warn other animals to stay away because they might be poisonous or taste bad."
      }
    },
    {
      "id": 2,
      "x": "25%",
      "y": "55%",
      "label": "Body Segments",
      "fact": "If you look closely, you can see that this caterpillar's body is made up of many ring-like sections, or segments. Each segment helps the caterpillar bend and move in different directions. These segments are one of the features that make caterpillars special insects called **arthropods**.",
      "vocabulary": {
        "term": "Segments",
        "definition": "Ring-like sections that make up an animal's body, allowing it to move and bend."
      }
    },
    {
      "id": 3,
      "x": "60%",
      "y": "25%",
      "label": "Long Antennae",
      "fact": "Those two long, curly structures on the caterpillar's head are called antennae, and they help it sense its environment! The caterpillar uses its antennae to smell food and detect things around it. These special sensing structures help the caterpillar survive and find what it needs to eat.",
      "vocabulary": {
        "term": "Antennae",
        "definition": "Long, thin sensing organs on an insect's head that help it smell, touch, and feel its surroundings."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "65%",
      "label": "Host Plant",
      "fact": "This caterpillar is sitting on a plant, which is its **habitat** — the place where it lives and finds everything it needs to survive. Caterpillars eat leaves from specific plants and will only grow up healthy if they eat the right kind of plant for their species. This special relationship shows how living things depend on their environment.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where a living thing lives and finds food, water, and shelter to survive."
      }
    }
  ]
}