{
  "hotspots": [
    {
      "id": 1,
      "x": "60%",
      "y": "55%",
      "label": "Seeds Inside",
      "fact": "Inside this green pepper, you can see the pale, bumpy seeds! Seeds are made by plants and contain everything needed to grow a new plant. This is called **reproduction** — that's how plants make baby plants that are just like them.",
      "vocabulary": {
        "term": "Reproduction",
        "definition": "The process by which living things make new living things like themselves."
      }
    },
    {
      "id": 2,
      "x": "35%",
      "y": "30%",
      "label": "Green Outer Skin",
      "fact": "The thick, green skin of this pepper protects the seeds and soft parts inside, just like your skin protects your body! The pepper's color also tells animals when it's ready to be eaten and help spread the seeds. Different plant parts have different **structures**, or shapes and jobs.",
      "vocabulary": {
        "term": "Structure",
        "definition": "The shape and parts that make up a living thing and help it do its jobs."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "25%",
      "label": "Pepper Opening",
      "fact": "When you cut open a pepper like this, you can see how the plant is organized inside! Plants have different parts that work together to help the plant survive and grow. The **organ systems** in plants, like roots and leaves, help them get what they need to stay alive.",
      "vocabulary": {
        "term": "Organ System",
        "definition": "Different plant or animal parts that work together to do an important job."
      }
    },
    {
      "id": 4,
      "x": "45%",
      "y": "50%",
      "label": "White Inner Walls",
      "fact": "The white, spongy parts inside the pepper are special tissues that hold and protect the seeds until they're ready to grow somewhere new! All living things are made of tiny living parts called **cells** — and many cells work together to make tissues like these.",
      "vocabulary": {
        "term": "Cells",
        "definition": "The smallest living parts that make up all living things; they are so tiny you need a microscope to see them."
      }
    }
  ]
}