{
  "hotspots": [
    {
      "id": 1,
      "x": "65%",
      "y": "35%",
      "label": "Thorns on Branch",
      "fact": "These sharp thorns are a special body structure that helps protect the plant from animals that might eat it or damage it. Plants have different parts and structures that help them survive in their environment, which is called an **adaptation** — that's a special feature that helps a living thing survive.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps a living thing survive and live in its environment."
      }
    },
    {
      "id": 2,
      "x": "25%",
      "y": "25%",
      "label": "Tree Bark Texture",
      "fact": "The rough, bumpy bark you see is the outer covering of the tree that protects it from weather, bugs, and damage. Different plants have different textures and appearances that help us identify them and understand how they are suited to their habitat. This is called **biodiversity** — the many different kinds of plants and animals that live together.",
      "vocabulary": {
        "term": "Biodiversity",
        "definition": "The variety of many different living things in an area or on Earth."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "60%",
      "label": "Forest Floor",
      "fact": "The ground covered with leaves and soil is home to many tiny living things that help decompose dead plants and return nutrients to the soil. These organisms are part of the **ecosystem** — all the living things and the non-living things in an environment that work together.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "A community of living things (plants and animals) and the non-living things (soil, water, air) that all work together in one place."
      }
    },
    {
      "id": 4,
      "x": "45%",
      "y": "20%",
      "label": "Multiple Tree Branches",
      "fact": "Trees have many branches that spread out in different directions to help the plant catch as much sunlight as possible for making food. Plants need sunlight, water, and air to grow and survive. This branching structure shows how plants are organized to get what they need from their habitat.",
      "vocabulary": {
        "term": "Structure",
        "definition": "The way something is organized or built, like how a plant has roots, a stem, and leaves arranged in a specific way."
      }
    }
  ]
}