{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "35%",
      "label": "Raccoon's Face",
      "fact": "Raccoons have special markings on their faces that look like a black mask. These dark patches around their eyes help them see better at night when they are most active. Raccoons are nocturnal animals, which means they sleep during the day and hunt for food at night.",
      "vocabulary": {
        "term": "Nocturnal",
        "definition": "An animal that is active at night and sleeps during the day."
      }
    },
    {
      "id": 2,
      "x": "20%",
      "y": "50%",
      "label": "Raccoon's Paws",
      "fact": "Raccoons have sensitive front paws that help them feel and explore their environment. They use their paws to catch food, climb trees, and open things in their search for meals. A raccoon's body structure is specially designed for living in forests near water.",
      "vocabulary": {
        "term": "Body Structure",
        "definition": "The way an animal's body is built and shaped, which helps it survive in its environment."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "55%",
      "label": "Log Habitat",
      "fact": "This raccoon is resting on a fallen log near water. Fallen logs are important habitats where many living things, including raccoons, shelter and find food. This log is also home to insects, fungi, and plants that all depend on each other in this ecosystem.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where an animal lives that gives it everything it needs, like food, water, and shelter."
      }
    },
    {
      "id": 4,
      "x": "70%",
      "y": "40%",
      "label": "Water and Plants",
      "fact": "Raccoons live near water because they need it to survive and to find food like frogs and fish. The plants and water around this log make up the raccoon's ecosystem. All the living things here—plants, animals, insects, and fungi—work together to keep the environment healthy.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "A community of living things (animals and plants) and the nonliving things (like water and soil) that all interact together in one place."
      }
    }
  ]
}