{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "25%",
      "label": "Long Neck",
      "fact": "This egret has a long, curved neck that helps it catch fish in the water. The special shape of its neck lets it bend and move quickly to grab food. This is called **adaptation** — that's when an animal's body part helps it survive and find food in its home.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special body part or behavior that helps an animal survive and live in its environment."
      }
    },
    {
      "id": 2,
      "x": "75%",
      "y": "75%",
      "label": "Yellow Legs",
      "fact": "The egret's bright yellow legs help it walk through shallow water without sinking deep into the mud. These long, thin legs are perfect for living in wetlands where it hunts for food. This is an example of how an animal's **body structure** helps it live in a specific habitat.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "The place where an animal lives that has everything it needs, like food, water, and shelter."
      }
    },
    {
      "id": 3,
      "x": "40%",
      "y": "30%",
      "label": "Sharp Pointed Beak",
      "fact": "An egret uses its long, sharp beak like a spear to catch fish and other small animals in the water. The pointed shape makes it easy to grab slippery prey quickly. Different animals have different beaks and teeth based on what they eat — this is part of how each **organism** is designed to get its food.",
      "vocabulary": {
        "term": "Organism",
        "definition": "Any living thing, like an animal, plant, or tiny creature you can't see."
      }
    },
    {
      "id": 4,
      "x": "30%",
      "y": "55%",
      "label": "Water Habitat",
      "fact": "This egret lives in shallow water habitats like ponds, marshes, and rivers where it can find plenty of fish to eat. The water provides food and shelter for this bird and many other animals. Living things depend on their habitat to survive, and they also affect other organisms in their **ecosystem**.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "A community of living things (plants and animals) that live together in the same environment and affect each other."
      }
    }
  ]
}