{
  "hotspots": [
    {
      "id": 1,
      "x": "45%",
      "y": "35%",
      "label": "Long Green Pod",
      "fact": "This long green pod is a fruit that contains seeds inside! Plants make fruits to protect their seeds and help them spread to new places. This is called a **legume** — that's a type of fruit that grows as a long pod and splits open when it's ready.",
      "vocabulary": {
        "term": "Fruit",
        "definition": "The part of a plant that holds seeds and helps spread them to grow new plants."
      }
    },
    {
      "id": 2,
      "x": "55%",
      "y": "50%",
      "label": "Climbing Vines",
      "fact": "These vines are climbing up the wooden fence to reach sunlight, which they need to grow strong and healthy. Plants have different structures that help them survive in their environment, like these curly tendrils that help them climb and grip. This is called **adaptation** — that's a special feature that helps a plant or animal survive.",
      "vocabulary": {
        "term": "Tendrils",
        "definition": "Thin, curly parts of a climbing plant that wrap around things to help the plant climb up."
      }
    },
    {
      "id": 3,
      "x": "70%",
      "y": "25%",
      "label": "Green Leaves",
      "fact": "The green leaves use sunlight to make food for the plant through a process called photosynthesis. All plants need sunlight, water, and air to grow and stay healthy. The **chlorophyll** in these leaves is what makes them green and helps capture the sun's energy.",
      "vocabulary": {
        "term": "Photosynthesis",
        "definition": "The way plants use sunlight to turn water and air into food that helps them grow."
      }
    },
    {
      "id": 4,
      "x": "25%",
      "y": "20%",
      "label": "Yellow Flowers",
      "fact": "These bright yellow flowers will attract bees and insects that help make new fruits and seeds! Flowers are an important part of a plant's life cycle because they help create the next generation of plants. This process is called **pollination** — that's when pollen moves from one flower to another so plants can make seeds.",
      "vocabulary": {
        "term": "Pollination",
        "definition": "When pollen from one flower travels to another flower so that new seeds can form."
      }
    }
  ]
}