{
  "title": "Balanced And Unbalanced Forces",
  "category": "physical-science",
  "imageFile": "balanced_and_unbalanced_forces.jpg",
  "imagePath": "images/physical-science/balanced_and_unbalanced_forces.jpg",
  "content": "### Visible Elements in Photo\n\n- A backhoe loader (construction vehicle with articulated arm and bucket) demonstrating extended and retracted positions\n- Two people operating/standing near the equipment in an outdoor work setting\n- A grapple/claw attachment on the extended arm holding materials\n- A construction overhead gantry crane (\"Construction King\" sign visible) in the background\n- Gravel driveway and grass yard with trees; metal shed structure in background\n\n### Reasonable Inferences\n\n1. **From the backhoe's extended/retracted arm positions**: The machine must move its weight distribution and balance point as the arm extends outward, creating unbalanced forces that require counterweight or design strategy to prevent tipping.\n2. **From the grapple holding heavy materials**: The load held at the end of a long arm creates leverage and moment forces—the farther the load extends, the greater the turning force on the machine's pivot point.\n3. **From two operators present**: Real equipment operation requires understanding how to manage forces safely; this is a human-centered design problem about preventing failure.\n\n### Engineering Task\n\n**K-2:**\nDesign a \"grabber arm\" using a ruler, string, and tape that can pick up small objects (blocks, balls) from far away without your arm getting tired or the grabber falling over. Test which angle works best!\n\n**3-5:**\nDesign and build a stable lifting arm using craft sticks, straws, string, and a small bucket that can lift a 500g load horizontally 30 cm away from its base without tipping over. Your arm must remain stable when fully extended. Test two different counterweight positions and measure how heavy a load each design can hold before tipping.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows real equipment doing real work, but students must first *identify* what problem the backhoe solves (moving heavy things at a distance while staying stable). The visible forces and balance challenge are implicit—students need to ask \"Why doesn't this tip over?\" before they can imagine and test solutions.\n\n### Suggested Materials\n\n- Craft sticks or wooden rulers (for arm structure)\n- String or fishing line (for pivot joints and lifting mechanisms)\n- Masking tape and duct tape (for assembly)\n- Small bucket or cup (for load carrier)\n- Weights: washers, rocks, or modeling clay (for testing load capacity and counterbalance)\n- Blocks or small objects to \"grab\" (for function testing)\n\n### Estimated Time\n\n**K-2**: 45-60 minutes (one session: 10 min intro, 20 min build, 15 min test and adjust)  \n**3-5**: Two 40-minute sessions (Session 1: 10 min challenge intro + 30 min design/build; Session 2: 40 min testing, measurement, and redesign with counterweight variations)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (define simple design problems reflecting a need or want) and **K-2-ETS1-1** (ask questions, make observations about the world) by having students reverse-engineer the balance and leverage principles visible in working construction equipment, translating abstract forces into testable, hands-on prototypes.",
  "inputTokens": 2334,
  "outputTokens": 744,
  "cost": 0.006054,
  "generatedAt": "2026-02-09T13:40:59.778Z"
}