{
  "title": "Conductor",
  "category": "physical-science",
  "imageFile": "conductor.jpeg",
  "imagePath": "images/physical-science/conductor.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Let There Be Light! Circuits and Electricity\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Electrical circuits:** A complete path that allows electricity to flow, powering a light bulb (visible in the photograph as the illuminated bulb)\n- **Conductors vs. insulators:** Materials that allow electricity to pass through them (like the metal components) versus those that block it (like the plastic casing)\n- **Energy transformation:** Electrical energy converting into light energy, making the bulb glow\n- **Complete vs. broken circuits:** The importance of an unbroken path for electricity to flow and produce light\n\n---\n\n## Lesson Title\n\n**Lighting Up: How Electricity Travels Through Circuits**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90-120 minutes across two sessions (Session 1: Engage & Explore—50 minutes; Session 2: Explain, Elaborate, & Evaluate—40-70 minutes)\n- **NGSS Standards:** \n  - 3-PS2-3: Ask questions to determine cause and effect relationships of electric or magnetic interactions between two objects not in contact with each other\n  - 3-PS2-4: Define a simple design problem that can be solved by applying scientific ideas about magnets\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Identify** the parts of a simple circuit (battery, wires, bulb) and explain what each part does\n2. **Demonstrate** how to make a light bulb light up using a battery, wires, and a bulb\n3. **Explain** that electricity needs a complete path (circuit) to flow and make things work\n4. **Design** a simple circuit to solve the problem of lighting up a bulb using given materials\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n#### Objective\nCapture student interest and activate prior knowledge about electricity and light using the photograph.\n\n#### Materials\n- Photograph printed in full color (or displayed on smartboard/projector)\n- Chart paper and markers\n- Index cards (optional, for KWL activity)\n\n#### Activity\n\n**Display and Introduction:**\n1. Project or display the photograph prominently where all students can see it clearly.\n2. Give students 30 seconds of silent observation time. Instruct: *\"Look carefully at this picture. What do you see happening? Don't talk yet—just think about it.\"*\n3. After silent time, ask students to turn to a partner and describe what they notice in one sentence.\n\n**Discussion Questions (ask in this order, allowing think-time before responses):**\n1. *\"What is happening in this picture? What do you see that is glowing?\"* (Expected: A light bulb is lit up)\n2. *\"Do you see a battery or something that gives power? What might it be? Why would someone be holding it near the bulb?\"* (Expected: Students identify the battery as a power source; they may notice the metal components)\n3. *\"What do you think is inside those wires? How does it get from the battery to make the light bulb turn on?\"* (Expected: Electricity; answers should suggest movement or a path)\n4. *\"If the wires were cut or the battery fell out, what would happen to the light? Why?\"* (Expected: The light would go out; something would be broken)\n\n**Wonder Prompt:**\nDisplay this sentence starter on the board: *\"I wonder what would happen if...\"* Invite 2-3 volunteers to complete this sentence about circuits or electricity. Write their responses on chart paper to revisit later.\n\n#### Transition\n*\"Today, we're going to build our own circuits to make light bulbs light up, just like in this picture. Let's explore!\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n#### Objective\nStudents investigate how electricity flows through a circuit by building their own simple circuit with a battery, wires, and bulb.\n\n#### Materials\n**Per student pair or small group of 3:**\n- One AA or AAA battery (in a battery holder, if available; or students can hold it carefully)\n- One small light bulb (3.0V LED or incandescent bulb compatible with battery voltage)\n- Two 6-8 inch pieces of insulated copper wire with 1/2 inch of insulation stripped from each end\n- Optional: aluminum foil strips (1 inch × 3 inch) as an alternative conductor\n- Data recording sheet (provided below)\n- Flashlight or headlamp (for darkening the room observation, optional)\n\n**Teacher Setup (5 minutes before activity):**\n1. Strip the insulation from wire ends ahead of time (or demonstrate and have parent volunteers prepare)\n2. Test all batteries and bulbs beforehand to ensure they work\n3. Arrange station or desk setup with materials in clear containers\n4. Dim the classroom lights (or plan to move activity to a darker corner)\n\n#### Activity\n\n**Student Directions (read aloud and demonstrate as you speak):**\n\n1. **Observe the parts:** *\"First, look at your battery, wires, and bulb. Touch them gently and describe what each one feels like. Is it hard or soft? Shiny or dull? Write or draw what you see on your data sheet.\"*\n\n2. **Make a hypothesis:** *\"Do you think you can make the bulb light up using just the battery and wires? Write 'yes' or 'no' on your sheet, and explain why you think so.\"*\n\n3. **Build your circuit (the safe way):**\n   - *\"Hold the battery in one hand. The battery has two ends—a flat top (negative) and a bumpy top (positive). This is important!\"*\n   - *\"Take one wire. Touch one end to the flat (negative) end of the battery. Hold it there with one finger.\"*\n   - *\"Now touch the other end of that same wire to the bottom metal part of the bulb.\"*\n   - *\"Take your second wire. Touch one end to the bumpy (positive) top of the battery.\"*\n   - *\"Touch the other end of the second wire to the metal side (threading or contact) of the bulb.\"*\n   - *\"Watch what happens! Does the bulb light?\"*\n\n4. **Record observations:** *\"On your data sheet, draw what your circuit looks like. Draw circles where the wires connect. Did the bulb light? If it did, write or draw why you think it lit up. If it didn't, what might you change?\"*\n\n5. **Test breaking the circuit:** *\"Carefully pull one wire away from the battery. What happens to the light? Write down what you noticed.\"*\n\n6. **Try it again:** *\"Put the wire back. The light comes back on, right? That's because you made the path complete again!\"*\n\n#### Connection to Photograph\n*\"In the photograph, someone is holding a battery next to a light bulb, just like you did. The wires are connecting them so electricity can flow. When the path is complete, the light turns on!\"*\n\n#### What Students Should Record\n- **Drawing:** Simple circuit diagram with battery, wires, and bulb labeled\n- **Written/oral responses:** Whether the bulb lit, what happened when they broke the circuit, predictions about what would happen if they used more batteries or wires\n\n#### Teacher Role\n- **Circulate continuously.** Observe which students successfully complete the circuit and which struggle with connections.\n- **Ask guiding questions** (don't tell answers):\n  - *\"What happened when you moved that wire?\"*\n  - *\"Do you think the electricity can travel if the path is broken?\"*\n  - *\"What would you try next?\"*\n- **Offer gentle redirection:** If a student uses the bulb incorrectly, ask, *\"Where do you think the electricity needs to touch on the bulb?\"* and let them discover the metal parts.\n- **Be the cheerleader:** Celebrate \"aha!\" moments loudly so other students notice when circuits work.\n\n#### Expected Student Outcomes\n- Students successfully light at least one bulb during the 20-25 minute window (most will by minute 15)\n- Students understand that **the circuit must be complete** for electricity to flow\n- Students document their observations with drawings and simple explanations\n- Students can articulate (verbally or in writing) that \"breaking\" the circuit turns off the light\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n#### Objective\nIntroduce formal vocabulary and reinforce concepts after hands-on exploration.\n\n#### Materials\n- Chart paper or whiteboard with large drawings/labels\n- Photograph (displayed again)\n- Vocabulary cards with images (optional, for visual learners)\n- Picture of a simple circuit diagram (teacher-drawn or printed)\n\n#### Activity\n\n**Share-Out from Explore (5-7 minutes):**\n1. Invite 3-4 student pairs to show the class their circuit or drawings.\n2. Ask the class to point out where the battery, wires, and bulb are in each diagram.\n3. Ask: *\"Why do you think [Student A's] bulb lit up? What did they do?\"*\n\n**Introduce Vocabulary (6-8 minutes):**\nUsing the photograph and student circuits as reference points, explicitly teach these five terms. Write each on the board as you speak.\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Circuit** | A closed loop or complete path that electricity can travel through. Like a circle—it has to connect all the way around for electricity to move. |\n| **Conductor** | A material that lets electricity flow through it easily, like metal wires and the metal parts of the bulb. |\n| **Insulator** | A material that stops electricity from flowing through it, like the plastic coating on wires and the rubber in battery holders. |\n| **Battery** | A container that stores and gives electrical energy to power things. It has two ends—positive (bumpy) and negative (flat). |\n| **Complete Circuit** | When all the parts are connected so electricity can travel in a complete path from the battery, through the wires, through the bulb, and back to the battery. |\n\n**Make Connections (3-5 minutes):**\n1. Point to the photograph: *\"See how the person is holding the battery and the bulb? The wires and the person's hands are acting like conductors—they're letting electricity flow through to light up the bulb.\"*\n2. Ask: *\"If the wire was broken or the battery fell away, what would happen?\"* (Expected answer: The circuit would be broken; electricity couldn't flow.)\n3. Show a simple circuit diagram on the board (battery symbol, line wire, bulb symbol, line wire, back to battery). Trace your finger around the loop: *\"The electricity travels in a circle—that's why we call it a circuit!\"*\n\n#### Check for Understanding\n\nUse one of these strategies:\n- **Thumbs Up/Down:** *\"If I have a complete circuit with all parts connected, electricity will flow. Thumbs up if you agree; thumbs down if you disagree.\"*\n- **Quick Draw:** *\"Everyone, sketch a simple circuit on your whiteboard. Show me a battery, wires, and a bulb connected.\"* (Circulate quickly and assess.)\n- **Think-Pair-Share:** *\"Think about this: If I cut the wire in the middle, is it still a complete circuit? Turn to your partner and explain.\"*\n\n#### Expected Student Outcomes\n- Students can name the parts of a circuit (battery, wire, bulb)\n- Students understand that electricity needs a **complete path** to flow\n- Students can explain why a broken or incomplete circuit doesn't light the bulb\n- Students use the vocabulary terms (circuit, conductor, battery, complete) with appropriate prompting\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n#### Objective\nStudents apply circuit concepts to a new challenge and deepen understanding of how circuits work.\n\n#### Materials\n- All materials from Explore phase (batteries, wires, bulbs)\n- Additional materials for challenge: aluminum foil (1-inch wide strips), paper clips, plastic straws, rubber bands, small index cards or cardstock\n- Challenge card or written prompt (displayed or printed for each group)\n- Optional: a second bulb per group\n\n#### Activity\n\n**Challenge Scenario (presented enthusiastically):**\n*\"A classroom needs a light to turn on and off. We don't want to keep unplugging wires. Can you invent a way to turn your light on and off using just your battery, wires, bulb, and these new materials? Try it!\"*\n\n**Student Challenge Directions:**\n\n1. **Brainstorm:** *\"With your partner, talk about how you could turn the light on and off without moving the battery. What could you use to break and make the circuit quickly?\"*\n   - Expected ideas: A switch (using aluminum foil to touch/separate), a piece of cardstock to block conductors, moving a wire on and off\n\n2. **Design:** *\"Draw your idea on the data sheet before you try it.\"*\n\n3. **Build and Test:** *\"Now build it and test it. Can you turn the light on AND off using your invention?\"*\n\n4. **Refine:** *\"If it works, try it 5 times. Does it work every time? If not, what could you change?\"*\n\n**Extension for Faster Finishers:**\n- *\"Can you light up TWO bulbs with ONE battery? How many wires do you need? Try it!\"*\n- *\"Can you use aluminum foil instead of wire to make a circuit? Test it!\"*\n\n#### Teacher Role\n- **Facilitate experimentation** without providing answers.\n- **Ask discovery questions:**\n  - *\"What happens when you do that?\"*\n  - *\"Is your circuit complete right now?\"*\n  - *\"How could you make a break in the circuit on purpose?\"*\n- **Celebrate persistence:** If a student struggles, ask, *\"What do you think you should try next?\"* rather than suggesting solutions.\n\n#### Expected Student Outcomes\n- Students create a **simple switch** (by separating and reconnecting conductors) to control the light\n- Students articulate that **controlling the circuit** means controlling whether electricity flows\n- Students demonstrate increased confidence in building and troubleshooting circuits\n- Students explore alternative conductors and understand that different materials have different properties\n\n---\n\n### 5. EVALUATE\n\n#### Objective\nAssess whether students have met the learning objectives through formative checks and a culminating exit ticket.\n\n#### Activity\n\n**Formative Assessment (Ongoing During Lesson):**\n- **Observation Checklist** (teacher completes while circulating):\n  - ☐ Student can identify battery, wire, and bulb\n  - ☐ Student successfully builds a complete circuit\n  - ☐ Student predicts what happens when circuit is broken\n  - ☐ Student uses vocabulary terms (circuit, conductor, battery) appropriately\n  - ☐ Student can troubleshoot when their circuit doesn't work (asks questions, tries new connections)\n\n**Exit Ticket (Administered at end of Lesson, 5 minutes):**\nProvide one or more of the following options based on your students' literacy levels:\n\n**Option A: Drawing + Simple Labels**\n- *\"Draw a complete circuit. Label the battery, wires, and bulb. Draw an arrow showing which way you think the electricity travels.\"*\n\n**Option B: Multiple Choice**\n1. *\"Which statement is true?\"*\n   - A) Electricity can flow if the wire is broken ☐\n   - B) A complete circuit has all the parts connected in a loop ☐ **[correct]**\n   - C) The bulb is brighter if you don't use a battery ☐\n\n2. *\"What happens if you pull one wire away from the battery?\"*\n   - A) The light gets brighter ☐\n   - B) The light stays on ☐\n   - C) The light turns off ☐ **[correct]**\n\n**Option C: Short Answer (Verbal or Written)**\n- *\"Show me your circuit. Now break it. Tell me why the light turned off.\"*\n- *\"What are two materials you learned about today that let electricity flow?\"* (Expected: Metals, wires)\n\n#### Success Criteria\n\nStudents demonstrate mastery if they:\n- ✓ Build a working circuit in the Explore phase\n- ✓ Correctly identify parts of the circuit (battery, wires, bulb)\n- ✓ Explain that a **complete circuit** is necessary for electricity to flow\n- ✓ Accurately predict what happens when a circuit is broken\n- ✓ Use at least two vocabulary terms (circuit, conductor, battery, complete) correctly\n\n#### Expected Student Outcomes\n\n**Evidence of Met Objectives:**\n- Circuits that light up = students understand the concept\n- Drawings and labels = students can identify parts\n- Responses to exit ticket = students understand cause-and-effect (broken circuit → no light)\n- Students who troubleshoot without adult help = students taking ownership of learning\n\n**Data to Collect:**\n- Photos of student circuits (for documentation/assessment records)\n- Completed exit tickets\n- Anecdotal notes from observation checklist\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Pre-Connect Materials:**\n   - Before Explore, have an adult volunteer or aide pre-connect one wire to the battery so students only need to complete two connections. Gradually remove this scaffold in a second attempt.\n\n2. **Simplified Data Sheet:**\n   - Use a fill-in-the-blank format instead of open-ended writing:\n     - *\"The ________ gives the electricity.\"*\n     - *\"The ________ makes light.\"*\n     - *\"When I break the circuit, the light _________.\"*\n\n3. **Buddy System:**\n   - Pair struggling students with confident peers for the Explore phase. Assign roles: one holds the battery, one manages the wires, both observe together.\n\n4. **Vocabulary Picture Cards:**\n   - Provide visual cards with images of circuits, conductors, and batteries. Have students match words to pictures before the Explain phase.\n\n### Challenge (For Advanced Learners)\n\n1. **Multi-Bulb Circuit:**\n   - *\"Can you make a circuit with TWO light bulbs? Try connecting them in different ways. Do you get a brighter light or a dimmer light? Why?\"*\n   - (This introduces series vs. parallel circuits conceptually without formal terminology.)\n\n2. **Switch Design Challenge:**\n   - *\"Engineer a switch using materials from our classroom (paper clips, aluminum foil, cardstock). Your switch should be able to turn the light on and off at least 10 times without breaking. Sketch your design first, then build it.\"*\n\n3. **Conductivity Testing:**\n   - Provide a variety of materials (rubber, plastic, wood, coins, aluminum foil, graphite pencil) and ask: *\"Which of these materials do you think will let electricity flow through them? Test each one in your circuit. Record which ones are conductors and which are insulators.\"*\n\n4. **Design Task:**\n   - *\"A toy manufacturer needs to create a light that turns on when someone touches a metal plate. Using your circuit, can you design a solution? Sketch your idea and build it.\"*\n\n---\n\n## Extension Activities\n\n### 1. **Real-World Circuits Hunt (Home Activity)**\n- **Task:** *\"Find three things in your home that use circuits. Draw or photograph them. Bring them to class and explain to a partner why they need a circuit to work.\"*\n- **Examples:** Flashlight, remote control, toy, lamp, doorbell\n- **Connection:** Deepens understanding that circuits are everywhere and essential to modern life.\n\n### 2. **Conductivity Challenge Station (Follow-Up Lesson)**\n- **Materials:** Simple circuits (battery, wires, bulb) + test materials (copper penny, rubber eraser, plastic spoon, water, graphite from pencil, aluminum foil, etc.)\n- **Task:** *\"Test different materials in your circuit. If the bulb lights, it's a conductor. If it doesn't, it's an insulator. Make a chart and sort the materials.\"*\n- **Connection:** Transitions into material properties and deepen conductor/insulator understanding.\n\n### 3. **Series vs. Parallel Investigation (Intermediate Lesson)**\n- **Materials:** Two batteries, two bulbs, four wires\n- **Task:** *\"Make two different circuits: one where the bulbs are in a line (series), and one where they branch off (parallel). Which one makes the bulbs brighter? Why?\"*\n- **Connection:** Develops computational thinking and deeper circuit understanding without advanced terminology.\n\n---\n\n## Teacher Tips & Notes\n\n- **Safety First:** Before the lesson, go over these non-negotiables:\n  - *\"We do NOT touch the battery terminals to our skin for long periods (can cause minor irritation).\"*\n  - *\"Keep batteries away from water.\"*\n  - *\"If something feels hot, stop immediately and tell me.\"*\n  - (Standard batteries in this lesson are very low voltage and safe for elementary use.)\n\n- **Pre-Prep:** Wire prep is critical. Build 2-3 practice circuits yourself before teaching so you can troubleshoot quickly during the lesson.\n\n- **Low-Light Environment:** Circuits are much more visible in dim light. Consider pulling blinds or moving to a darker corner of your room for the Explore and Elaborate phases.\n\n- **Celebrate Failure:** Emphasize that if a student's circuit doesn't work, they're learning exactly what *not* to do. Ask, *\"What will you try differently?\"* rather than showing them the answer.\n\n- **Photograph Student Work:** Capture photos of student circuits and data sheets. These are powerful evidence for families during conferences and for your assessment portfolio.\n\n- **Connect to Standards:** While teaching, use language that mirrors NGSS 3-PS2-3: *\"You're asking great cause-and-effect questions: 'What causes the light to turn off?' 'What happens when I disconnect the wire?'\"* This reinforces that science is about asking **why** and **what happens if.**\n\n---\n\n**Total Lesson Time: 90–120 minutes across two sessions**  \n**Ready to engage your third graders in the power of circuits!**",
  "inputTokens": 2264,
  "outputTokens": 5178,
  "cost": 0.028154,
  "generatedAt": "2026-02-12T23:16:32.198Z"
}