{
  "title": "Conductor",
  "category": "physical-science",
  "imageFile": "conductor.jpeg",
  "imagePath": "images/physical-science/conductor.jpeg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Lighting the Way—Understanding Electric Circuits and Conductors\n\n---\n\n### Core Science Concepts from Image Analysis\n\n• **Electrical conductivity** — Some materials allow electric current to flow through them, while others block it (visible in the lit LED bulb demonstrating current flow through a conductor)\n\n• **Complete circuits** — Electricity requires an unbroken path from power source through a conductor back to complete the circuit (shown by the closed-loop connection with the battery and wires)\n\n• **Energy transfer** — Electrical energy is converted to light energy in the LED bulb (observable as the glowing filament/diode in the photo)\n\n• **Properties of materials** — Different materials have different abilities to conduct electricity based on their atomic structure (the copper coin conducts while other materials would not)\n\n---\n\n### Lesson Title\n\n**Conductors and Insulators: Building Circuits That Light Up**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or one 90-minute block)\n- **NGSS Standards:** \n  - 5-PS1-3: Make observations and measurements to identify materials based on their properties\n  - 5-PS3-1: Use models to describe that energy in animals' food (used for body repair, growth, motion, and to maintain body warmth) was once energy from the sun *(extended connection: electrical energy from sun through solar panels → battery → light)*\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- **Identify and classify materials as conductors or insulators** based on their ability to allow electricity to flow through them\n- **Build a simple series circuit** using a battery, LED bulb, wires, and a conductor to complete the circuit\n- **Explain why certain materials conduct electricity** by describing how electrons can move freely through some materials more easily than others\n- **Predict whether an unknown material will conduct electricity** based on properties they observe (e.g., metal vs. plastic appearance)\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of a lit LED bulb in a simple circuit with a coin conductor.\n\n**Materials:**\n- Printed or projected photograph of the LED circuit\n- Optional: one working LED circuit assembled (to show but not distribute yet)\n\n**Activity:**\n\n1. **Display the photograph.** Project it large on the screen or distribute printed copies. Give students 30 seconds of silent observation time.\n\n2. **Ask these specific discussion questions** (one at a time, allowing think-pair-share time):\n   - *\"What do you notice is happening in this picture? What is glowing, and what do you think is making it light up?\"*\n   - *\"The person is holding a shiny coin touching something. Why do you think the coin matters here? What could the coin be doing?\"*\n   - *\"If I removed the coin and held a plastic button in its place instead, what do you predict would happen to the light?\"*\n   - *\"What path do you think the electricity takes to make the light work?\"*\n\n3. **Wonder prompt:** *\"Today, we're detectives trying to figure out which materials are 'electricity helpers' and which are 'electricity blockers.' By the end of this lesson, you'll be able to build your own light-up circuit and predict which things in your classroom would work like that coin.\"*\n\n**Transition:** \"Let's investigate which materials electricity can travel through and which ones stop it.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity by testing materials in a simple circuit.\n\n**Materials:** (Per student pair or small group)\n- 1 AA or 9V battery (with holder or using tape to secure)\n- 2 insulated copper wires (12-18 inches each, stripped 1/2 inch at each end)\n- 1 red LED bulb (with long leads, or attach leads with tape)\n- Test materials in a pile: penny, aluminum foil, plastic button, rubber eraser, wooden stick, brass screw, paper clip, pencil (graphite), glass bead\n- Masking tape\n- Recording sheet (see below)\n\n**Activity: \"Testing the Electricity Helpers\"**\n\n**Step-by-step student directions:**\n\n1. *Build your circuit:* Tape one wire to the positive terminal (+) of the battery. Tape the other wire to the negative terminal (−) of the battery. This is your \"electricity pathway.\"\n\n2. *Connect the LED:* Hold both LED leads gently against the free ends of your two wires. (Tip: If the light doesn't turn on, try reversing which lead touches which wire—the longer lead usually goes to the positive side.) You should see a faint glow. **Record:** \"This is a complete circuit with an LED that works.\"\n\n3. *Test each material:* One at a time, disconnect one wire. Insert a test material between the two wire ends (so electricity must travel through the material to light the LED). Does the LED light up?\n\n4. *Record results* on your sheet:\n   - Material name\n   - Does it light the LED? (Yes/Bright / Yes/Dim / No)\n   - What does the material feel like? (Is it shiny? Hard? Flexible? Cold to touch?)\n\n5. *Complete all materials,* then look for patterns in your results.\n\n**How the activity connects to the photograph:**\nStudents are recreating the same circuit shown in the photo—testing whether materials can complete the path electricity travels. The coin in the photo lit up the LED; now students find what else works the same way.\n\n**What students should record:**\n- Completed testing table with all materials\n- Written observation: *\"Materials that lit the LED were _____ and _____. Materials that didn't light it were _____.\"*\n- Pattern they notice: *\"I think materials that _____ are electricity helpers.\"*\n\n**Teacher Role:**\n- Circulate and **ask, don't tell:** *\"What do you notice about the materials that worked? What do they look like or feel like?\"*\n- If an LED doesn't light: *\"Let's check your connections. Are both wires touching the battery?\"* or *\"Try flipping the LED leads—which way glows?\"*\n- Encourage students to test all materials before drawing conclusions.\n- Do **not** say \"that's a conductor\" yet—let them observe first.\n\n**Expected Student Outcomes:**\nStudents discover that metals (penny, aluminum foil, brass screw, paper clip) light the LED, while non-metals (rubber, plastic, glass, paper, wood) do not. They produce a completed data table and written observation of the pattern.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper or whiteboard\n- Marker\n- Photograph of the circuit (displayed again)\n- Simple diagram of a conductor vs. insulator (teacher-drawn or printed)\n\n**Activity:**\n\n1. **Group share-out:** Ask 2-3 student pairs to share one material they tested and whether it worked. Record answers on a visible chart titled \"What We Discovered.\"\n\n2. **Introduce vocabulary with student-friendly definitions:**\n\n   - **Conductor:** A material that lets electricity flow through it easily, like a pathway electricity loves to travel. (Examples: metals like copper, aluminum, silver)\n   - **Insulator:** A material that stops electricity from flowing through it, like a wall electricity cannot pass. (Examples: rubber, plastic, wood, glass)\n   - **Circuit:** A closed loop that electricity travels around. It needs a power source (battery), a path (wires and conductors), and something to light up (like an LED).\n   - **Electron:** A tiny particle that carries the electrical energy and travels through conductors (students don't need to memorize, but knowing something is moving helps them visualize).\n   - **Complete circuit:** When the pathway is unbroken, electricity can flow and make something work.\n\n3. **Connections back to the photograph:**\n   - *\"In the photo, the coin is a conductor. That's why the LED lights up. The coin lets electricity travel from the wire, through itself, to the other wire. The circuit is complete.\"*\n   - *\"If that person had held a rubber button instead, we wouldn't see any light because rubber is an insulator—it blocks the electricity.\"*\n\n4. **Check for understanding strategy:** \n   - **Thumbs up, sideways, or down:** *\"Show me: Do you feel good about what a conductor is? Thumbs up if yes, sideways if you're not sure, down if you're confused.\"*\n   - **Quick poll:** *\"Raise your hand if you think copper wire is a conductor... if you think plastic is an insulator.\"*\n   - **Think-pair-share:** *\"Why do you think the wires in this circuit are covered in plastic but have bare metal at the ends?\"* (Students infer the plastic is an insulator protecting them, while bare metal is the conductor.)\n\n**Vocabulary List:**\n\n| Term | Student-Friendly Definition |\n|------|--------------------------|\n| **Conductor** | A material that lets electricity flow through it easily (like metal). |\n| **Insulator** | A material that stops electricity from flowing (like rubber or plastic). |\n| **Circuit** | A closed loop that electricity travels around—it needs a battery, wires, and something to power. |\n| **Complete circuit** | When the path for electricity is unbroken so electricity can flow and do work (like light up an LED). |\n| **Energy transfer** | When energy changes from one form to another (like electrical energy becoming light energy in the LED). |\n\n**Expected Student Outcomes:**\nStudents can name materials as conductors or insulators and explain in simple terms that conductors let electricity travel while insulators block it. They understand why the circuit in the photograph works.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding by building their own functional circuit and making predictions.\n\n**Materials:** (Per student pair)\n- 1 AA battery and holder (or secured with tape)\n- 2 insulated copper wires, stripped at ends\n- 1 LED bulb\n- 1 \"mystery material\" (unknown to students beforehand): examples could be copper washer, aluminum can piece, plastic spoon, rubber band, pencil eraser, or graphite from a pencil\n- Masking tape\n- Optional: small paper clip or switch made from paper and fasteners (for introducing switches)\n\n**Activity: \"Engineer a Circuit with a Challenge Material\"**\n\n1. **Introduce the challenge:** *\"I've given each pair one mystery material. Your job is to predict: Will this be a conductor or insulator? Then build it into your circuit and test it.\"*\n\n2. **Students predict first** (record prediction before testing):\n   - *\"I think this material is a _____ because it looks/feels _____.\"*\n\n3. **Students build** their circuit using the mystery material, just like they did in Explore, but this time **intentionally placing it in the circuit** to test.\n\n4. **Record results:**\n   - *\"My prediction was _____ . The actual result was _____ . I was correct / incorrect.\"*\n   - *\"This happened because _____.\"*\n\n5. **Extension challenge (if time allows):** *\"Can you make the LED light up AND turn it off without removing wires?\"* (This introduces the idea of a switch—a conductor that can be moved to break the circuit.)\n\n**Teacher Role:**\n- Circulate with affirming questions: *\"Why did you make that prediction? What would happen if we swapped this for a plastic spoon?\"*\n- Push thinking: *\"If this material is a conductor, what does that tell us about its properties?\"*\n- If students struggle, ask: *\"Does this look more like the materials that worked before, or the ones that didn't?\"*\n\n**Expected Student Outcomes:**\nStudents make and test a prediction about an unknown material, build a functional circuit, and explain their results using the vocabulary of conductors and insulators. They deepen understanding by applying prior knowledge to a new material.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of conductors, insulators, and circuits.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- Observation during Explore: Are students systematically testing materials? Are they making reasonable predictions?\n- Check-in during Explain: Thumbs poll, quick verbal responses to yes/no questions.\n- Observation during Elaborate: Do students' predictions match reasonable logic? Do they test properly?\n\n**Exit Ticket (End of Session 1 or Session 2) — Choose one based on your class:**\n\n**Option A (Drawing + Writing):**\n*\"Draw a simple circuit. Label the battery, wires, LED, and the conductor that completes the circuit. Write one sentence: Why does electricity need a conductor to light up the LED?\"*\n\n**Option B (Multiple Choice + Explanation):**\n1. *Which material is a conductor?* \n   - A) Rubber eraser   B) Aluminum foil   C) Plastic button   D) Glass bead\n\n2. *Why doesn't the LED light up when you put a plastic stick in the circuit?*\n   - A) Plastic is an insulator that stops electricity   B) The battery died   C) The LED is broken   D) Plastic is too heavy\n\n3. *In your own words, explain what a \"complete circuit\" means.*\n\n**Option C (True/False + Justification):**\n- *A circuit only needs a battery and a light to work. True or False? Explain why.*\n- *All shiny materials are conductors. True or False? Explain why.*\n\n**Success Criteria for Understanding:**\n- ✓ Student correctly identifies at least 2 conductors and 2 insulators\n- ✓ Student explains that a complete circuit requires an unbroken path\n- ✓ Student uses the words \"conductor,\" \"insulator,\" or \"circuit\" correctly in at least one sentence\n- ✓ Student can predict whether an unknown material will conduct electricity based on observable properties\n\n**Expected Student Outcomes:**\nMost students will demonstrate understanding that conductors allow electricity to flow and insulators block it. Students should be able to identify metals as conductors and non-metals as insulators, and explain why the photograph's circuit works. Some students may struggle with why insulators \"block\" electricity; these students benefit from the analogy: *\"Insulators are like walls electricity can't pass through.\"*\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified testing table:** Instead of writing properties, use a picture-based chart where students circle whether each material is shiny/dull, hard/soft. This helps them notice patterns without written recording burden.\n\n2. **Pre-circuit check:** Before Explore, build and test one material together as a whole class (e.g., \"Let's test the penny together first so you see how it's done\"). Troubleshoot any LED/battery orientation issues before students work independently.\n\n3. **Vocabulary anchor chart:** Create a large, visual anchor chart with a picture of a conductor (shiny metal) and insulator (rubber/plastic) displayed during all phases. Students can point to it instead of retrieving words from memory.\n\n4. **Pair strategically:** Place a student who struggles with a confident peer during Explore and Elaborate so they can model testing steps and explain thinking aloud.\n\n**Challenge (For Advanced Learners):**\n\n1. **Test conductivity predictions with graphite:** Challenge students to test pencil graphite (the \"lead\" in a pencil). Ask: *\"Graphite is not a metal, but some materials that aren't metals can conduct. What do you notice about graphite's properties?\"* This introduces the idea that conductivity isn't limited to metals and deepens material property understanding.\n\n2. **Design a switch:** Ask advanced students to create a switch using foil, a pencil, paper fasteners, and a paper base. Challenge: *\"Make a switch where moving the foil breaks and completes the circuit to turn the LED on and off.\"* This requires deeper understanding of how conductors complete circuits and introduces practical engineering.\n\n3. **Extend to insulators as safety:** *\"Wires are wrapped in plastic. Why is this important? Design a test showing what might happen if someone touched bare copper wire.\"* (Discuss safely—do not perform.) Students explain that insulators protect us from electricity.\n\n4. **Research connection:** Ask advanced students to find images of real-world uses of conductors and insulators (power lines, phone chargers, appliance plugs) and create a poster explaining why each material is used where.\n\n---\n\n### Extension Activities\n\n1. **Series vs. Parallel Circuits (Follow-up Lesson):**\n   Students build two circuits: one with LEDs in a line (series—sharing brightness) and one with LEDs branching (parallel—each bright). They observe how conductors behave differently in different circuit designs. This prepares them for later electricity standards.\n\n2. **Conductive and Non-Conductive Household Hunt:**\n   Students take home a checklist of 10 household items (spoon, plastic fork, aluminum can, rubber toy, wire, glass cup, keys, pencil, ceramic mug, sponge) and predict conductor/insulator before testing with a simple circuit (or just sorting by material type). They bring results back to create a class chart of findings beyond the classroom.\n\n3. **Design a \"Conductivity Detective\" Poster or Infographic:**\n   Students create a visual guide titled *\"How to Spot a Conductor\"* showing 3-4 observable properties (shiny, metal, hard, heavy) and use photos or drawings of examples. This reinforces property observation and communication of science ideas.\n\n---\n\n## Summary\n\nThis 5E lesson uses the photograph of a working LED circuit to ground students' discovery of conductors and insulators. Through systematic testing in Explore, students develop their own conclusions before formal vocabulary is introduced. By the Elaborate phase, they apply learning to predict unknown materials and even begin engineering switches. The lesson honors student-centered inquiry while building toward Fifth Grade NGSS expectations for material properties and energy transfer.\n\nThe hands-on nature and low-cost materials (batteries, LEDs, wire) make this lesson repeatable and adaptable across classrooms. Students leave with both conceptual understanding (why the circuit in the photo works) and practical experience (they've built working circuits themselves).",
  "inputTokens": 2330,
  "outputTokens": 4288,
  "cost": 0.02377,
  "generatedAt": "2026-02-12T23:18:13.968Z"
}