{
  "title": "Conductor",
  "category": "physical-science",
  "imageFile": "conductor.jpeg",
  "imagePath": "images/physical-science/conductor.jpeg",
  "content": "# Engineering Design Challenge: Lighting Up the Darkness\n\n### Visible Elements in Photo\n\n- A human hand holding a small transparent dome/bulb containing what appears to be a glowing filament or LED light source\n- A battery (labeled \"+D 2013\") positioned beneath the bulb\n- Metal wires (red and possibly black/dark colored) connected to the battery\n- A metal spoon or conductor being used to bridge or complete a circuit\n- A wooden table surface as the work area\n\n---\n\n### Reasonable Inferences\n\n- **From the glowing bulb + battery + wires**: The circuit is incomplete or being tested—the spoon is likely being used as a switch or connector to complete the electrical path and light the bulb.\n- **From the battery label and hand positioning**: This is a hands-on electrical demonstration showing how electricity flows through different materials (the metal spoon conducts; the wood table does not).\n- **From the dome shape of the bulb**: The design protects the filament/LED while allowing light to shine through, suggesting durability and function were considered.\n\n---\n\n### Engineering Task\n\n**K–2 Version:**\nYou have a battery, a light bulb, and some wires. Build a way to make the light turn on and off using things you find in the classroom (like a spoon, a coin, or a pencil). What materials let the light work? What materials don't?\n\n**3–5 Version:**\nDesign a simple light switch using a battery, bulb, wires, and a conductive material (metal spoon, paper clip, or aluminum foil). Your switch must (1) complete the circuit to light the bulb when pressed or touched, (2) break the circuit to turn it off when released, and (3) work at least 10 times without breaking. Test different metals and materials to find which ones work best as switches.\n\n---\n\n### EDP Phase Targeted\n\n**Create / Test** — This photo shows an active electrical setup with visible components already assembled. Students will immediately see a working (or partially working) circuit and naturally want to experiment with different conductors, test what happens when they change materials, and iterate on the design. The hands-on, investigative nature of the photo makes prototyping and testing the logical entry point.\n\n---\n\n### Suggested Materials\n\n1. **AA or D batteries** (flashlight or alkaline)\n2. **Insulated copper wire** (22–24 gauge, stripped at ends)\n3. **Small LED bulbs or incandescent mini-bulbs** with holders\n4. **Metal conductors**: paperclips, aluminum foil, spoons, coins, brass fasteners\n5. **Non-conductors for comparison**: rubber erasers, wooden popsicle sticks, plastic spoons, paper\n\n---\n\n### Estimated Time\n\n**35–50 minutes**\n- Introduction & circuit assembly: 10 minutes\n- Testing different materials as switches: 15–20 minutes\n- Documenting results & refining design: 10–15 minutes\n\n(Can extend to a second session if students design their own creative switch enclosures.)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly supports **NGSS 3-5-ETS1-1** (*Define a simple design problem*) by asking students to identify which materials conduct electricity and design a working switch—connecting physical properties of materials to engineering function in a hands-on, low-cost activity.",
  "inputTokens": 1691,
  "outputTokens": 765,
  "cost": 0.005516,
  "generatedAt": "2026-02-09T13:26:43.558Z"
}