{
  "id": 0,
  "title": "Engineering",
  "category": "physical-science",
  "imageFile": "engineering.jpg",
  "imagePath": "images/physical-science/engineering.jpg",
  "gradeLevel": "First Grade",
  "content": "# First Grade Science Lesson: Engineering with LEGO\n\n## 📸 Photo Description\n\nThis image shows LEGO structures that students have built, including two bird-like figures standing on platforms and a wheeled vehicle with moving parts. The structures demonstrate how different colored blocks can be stacked and connected to create objects that move and stand up. Students are using simple tools like a mouse and computer to interact with their designs.\n\n## 🔬 Scientific Phenomena\n\n**Anchoring Phenomenon:** Students are designing and building structures using engineering materials (LEGO blocks) to solve problems and create objects that work.\n\n**Why This Happens:** When we stack and connect blocks in certain ways, they support each other and stay standing. The wheels on the vehicle spin because they are attached with a rod that allows them to turn. This is **engineering**—using science and materials to build things that do what we want them to do. Students are discovering that how you arrange materials affects whether something works.\n\n## 📚 Core Science Concepts\n\n* **Structures and Stability:** Blocks stay standing when stacked in a balanced way. Wide bases help structures not tip over.\n\n* **Movement and Wheels:** Objects with wheels can roll and move in different directions when pushed or connected to moving parts.\n\n* **Problem-Solving with Materials:** Different building materials can be combined in many ways to create the same object.\n\n* **Design Process:** Builders plan, create, test, and sometimes change their designs to make them work better.\n\n<pedagogical-tip>\nFirst graders learn best through hands-on exploration. Allow extended time for building without predetermined outcomes. Celebrate creative solutions and \"productive failures\"—when something doesn't work, it's an opportunity to investigate why and redesign. Resist the urge to fix structures for students; instead, ask guiding questions like \"What happens if we add another block here?\"\n</pedagogical-tip>\n\n<udl-suggestions>\nProvide multiple means of representation by offering: (1) visual building instruction cards with pictures only (no words), (2) verbal descriptions and demonstrations, and (3) peer modeling. Allow students with different motor abilities to participate by offering larger building blocks as an alternative and permitting partners to assist with fine motor tasks. Create a \"building inspiration board\" with photos of various structures so students with limited prior experience can see possibilities.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n**Performance Expectation:** K-2-ETS1-1. Ask questions, make observations, and gather information about a situation people want to change to define a simple problem that can be solved through the development of a new or improved object or tool.\n\n**Disciplinary Core Ideas:**\n- [[NGSS:DCI:K-2-ETS1.A]] Students recognize that people design and make things to solve problems.\n- [[NGSS:DCI:K-2-ETS1.B]] Students understand that before building, people imagine what they want to make and plan it.\n\n**Crosscutting Concepts:**\n- [[NGSS:CCC:Structure and Function]] The shape and materials of an object determine what it can do.\n- [[NGSS:CCC:Systems and System Models]] Parts of a structure work together to make the whole thing function.\n\n## 💬 Discussion Questions\n\n* **\"What happens when you stack the blocks in a tall, thin tower versus a short, wide tower? Which feels more steady?\"** (Bloom's: Analyze | DOK: 2)\n\n* **\"Why do you think the wheels help the vehicle move? What would happen if we used blocks instead of wheels?\"** (Bloom's: Evaluate | DOK: 3)\n\n* **\"If you wanted to build a bridge that goes across the table, what would you need to think about before you start building?\"** (Bloom's: Evaluate | DOK: 3)\n\n* **\"Can you tell me the story of how you built your structure? What did you try first? What changed?\"** (Bloom's: Remember/Understand | DOK: 1)\n\n## 📖 Vocabulary\n\n* **Structure:** Something that is built or put together, like a building or a tower made of blocks.\n\n* **Stable:** When something is steady and doesn't tip over or fall down easily.\n\n* **Engineer:** A person who designs and builds things using science and materials.\n\n* **Wheel:** A round object that spins to help something move.\n\n* **Design:** A plan for how to build or make something.\n\n* **Balance:** When weight is spread out evenly so something doesn't tip to one side.\n\n## 🌡️ Extension Activities\n\n* **Build a Tower Challenge:** Provide students with different LEGO pieces and challenge them to build the tallest tower that doesn't fall over. Ask them to measure their towers and compare which shapes were most stable. Discuss why.\n\n* **Vehicle Race Track:** Create a simple ramp or track and have students build wheeled vehicles, then test which designs roll the fastest or farthest. Students can adjust their designs based on what they observe.\n\n* **Problem-Solving Story:** Present a scenario like \"The birds need a nest to rest in\" or \"We need to build a wall to keep the toys safe.\" Have students design and build solutions, then explain their choices.\n\n## 📚 External Resources\n\n**Children's Books:**\n* *Rosie Revere, Engineer* by Andrea Beaty (celebrates creative problem-solving and perseverance)\n* *The Little Blue Truck* by Alice Schertle (simple vehicles and movement)\n* *DK Findout: Simple Machines* (introduces basic engineering concepts with pictures)\n\n**YouTube Videos:**\n* **\"LEGO Engineering for Kids\"** by Simple Engineering (3:45) — Shows first graders building simple structures and testing them. https://www.youtube.com/results?search_query=lego+engineering+for+kids+elementary\n* **\"What is Engineering?\"** by SciShow Kids (4:12) — Age-appropriate introduction to what engineers do and why their work matters. https://www.youtube.com/watch?v=IM2LP0-WjV0",
  "generatedAt": "2026-02-06T22:15:52.654Z"
}