{
  "title": "Force And Motion",
  "category": "physical-science",
  "imageFile": "force_and_motion.jpg",
  "imagePath": "images/physical-science/force_and_motion.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Forces and Motion in Action\n\n### Core Science Concepts from Image Analysis\n\n- **Push and pull forces** — The child's leg muscles create a pushing force against the ground that launches their body into the air, demonstrating how forces cause motion.\n- **Direction and speed of motion** — The child's body moves upward and forward; different amounts of force applied through the legs result in different heights and distances traveled.\n- **Balance and stability** — The child's arms spread out for balance while airborne, showing how body position affects movement and control.\n- **Observable motion patterns** — By jumping over the cone repeatedly, students can observe and measure how consistent forces produce consistent results, creating predictable patterns.\n\n---\n\n### Lesson Title\n\n**Jumping Over Obstacles: Exploring Push Forces and Motion**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions\n- **NGSS Standards:** K-PS2-1 (Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object); K-PS2-2 (Analyze data to determine if a design solution works as intended to change the speed or direction of an object with a push or a pull)\n\n*Note: While second-grade PS standards focus on materials properties, the photograph depicts forces and motion concepts from K-PS2. This lesson is designed to build foundational understanding of pushes and pulls—critical prerequisites for later motion standards—using second-grade-appropriate inquiry methods and language.*\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Describe how a push force from their legs makes their body move upward and forward\n- Compare how using more force or less force changes how high or far they jump\n- Predict whether they will jump successfully over an obstacle based on the amount of force they use\n- Record and discuss what they observe about their jumping motion in drawings and simple words\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about movement and forces by exploring the photograph of a child jumping over a cone.\n\n**Materials:**\n- Photograph displayed on whiteboard, smart board, or printed poster (large enough for all students to see)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** in a prominent location. Ask students to sit together on the carpet facing the image.\n\n2. **Introduce with excitement:** \"Look at this picture! What do you notice about what the person is doing?\" Allow 2-3 students to share observations (they're jumping, there's a cone, their feet are off the ground, etc.).\n\n3. **Ask these specific discussion questions to spark curiosity:**\n   - \"How did this person's body get up in the air? What part of their body made that happen?\"\n   - \"Do you think they could jump over that cone without using a push? Why or why not?\"\n   - \"What if they pushed with less force with their legs—would they jump just as high?\"\n   - \"Can you show me with your arm what a 'big push' or 'little push' looks like?\"\n\n4. **Wonder prompt:** \"I wonder... if we all tried to jump over a cone like in the picture, who could jump the highest? What would make some people jump higher than others?\" Write 2-3 student predictions on chart paper titled \"What Makes a Big Jump?\"\n\n**Transition:** \"Today, we're going to be scientists and explore jumping and pushing. We'll discover what makes objects move through the air and how we control those movements!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how different amounts of pushing force affect jumping height and distance.\n\n**Materials:**\n- 4-6 orange traffic cones (or substitute with stacked paper cups, small boxes, or pool noodles standing upright)\n- Masking tape to mark a starting line on the floor\n- Measuring tape or meter sticks\n- Chart paper to record results\n- Optional: simple diagram paper for each student to draw before/after their jump\n\n**Activity:**\n\n1. **Set up the outdoor or gymnasium space:** Create a jumping station with a clear starting line marked with tape. Place one cone approximately 1.5 feet in front of the line. Ensure a clear, safe landing area.\n\n2. **Introduce the investigation:** \"We're going to be jump scientists! Each person will jump over the cone THREE times. Each time, we'll try a different kind of push:\n   - Jump 1: A SMALL push with your legs\n   - Jump 2: A MEDIUM push with your legs\n   - Jump 3: A BIG push with your legs\"\n\n3. **Model the activity first:** Demonstrate all three jumps yourself, exaggerating the leg bend (small push = barely bending knees; medium push = normal bend; big push = deep squat before launch). Narrate as you go: \"Watch my legs. See how they bend a lot for a big push? That's more force!\"\n\n4. **Student turns:** Call students up one at a time (or in pairs if space allows). Before each student jumps:\n   - Ask them to predict: \"Will you make it over the cone with a small push? A medium push?\"\n   - Have them complete their three jumps\n   - After they land, ask: \"Did you go higher or farther with the big push? How do you know?\"\n\n5. **Recording:** Create a simple class chart on the board:\n\n   | Student Name | Small Push | Medium Push | Big Push |\n   |---|---|---|---|\n   | | Made it? / Didn't make it | Made it? / Didn't make it | Made it? / Didn't make it |\n\n   Alternatively, have students draw three simple stick figures showing their body in each jump position (with legs bent different amounts) and circle which one got them over the cone.\n\n6. **Teacher role during exploration:**\n   - Observe and ask follow-up questions: \"How did your legs feel different? Where did you feel the push coming from?\"\n   - Prompt students to compare their jumps: \"You made it with a big push but not a small push. What's different?\"\n   - Do NOT tell students the answer; let them discover that more force = higher/farther jumps.\n\n**Expected Student Outcomes:**\n- Students observe and discuss that larger leg pushes result in successfully clearing the obstacle more often\n- Students notice their own body positions (leg bend) correspond to jump height\n- Class data shows a pattern: bigger pushes = better success at jumping over the cone\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to the concepts of push forces and motion.\n\n**Materials:**\n- Class chart from Explore phase (displayed)\n- Chart paper with vocabulary terms\n- Photograph of the jumping child (displayed again)\n- Optional: video clip (15-30 seconds) of someone jumping if available\n\n**Activity:**\n\n1. **Group share-out:** Gather students. Point to the class data chart:\n   - \"Look at our results. What happened when people used a bigger push with their legs?\"\n   - \"Did everyone jump higher and farther with a big push?\"\n   - Have 3-4 students share one thing they discovered.\n\n2. **Introduce key vocabulary with definitions (write terms on chart paper):**\n\n   - **Push:** A force that makes something move away from you or move faster. You use your leg muscles to push off the ground when you jump.\n   - **Force:** A push or pull that makes something move or change direction.\n   - **Motion:** The way something moves. When you jump, your body is in motion.\n   - **Stronger force:** Using more effort or muscle power to push. A stronger force makes you jump higher or farther.\n   - **Weaker force:** Using less effort or muscle power to push. A weaker force makes you jump lower or not as far.\n\n3. **Connect back to the photograph:**\n   - Display the original photograph again.\n   - \"The person in this picture is using a BIG push force with their legs. That push force is making their body move up and over the cone. The stronger the push, the higher and farther they go!\"\n   - Point to the cone: \"This is the obstacle, just like in our experiment.\"\n\n4. **Check for understanding:**\n   - Ask: \"If I want to jump really high, should I use a big push or a little push?\" (Expect: big push)\n   - Ask: \"What body part gives the push when we jump?\" (Expect: our legs)\n   - Ask one student to show a \"strong push\" motion with their legs and another to show a \"weak push\" motion. Discuss the differences.\n\n**Vocabulary:**\n- **Push:** A force that moves something away from you or makes it move faster\n- **Force:** A push or a pull that causes something to move or change direction\n- **Motion:** The way something moves from one place to another\n- **Stronger force:** Using more power or effort; creates more movement\n- **Weaker force:** Using less power or effort; creates less movement\n\n**Expected Student Outcomes:**\n- Students use the words \"push,\" \"force,\" and \"motion\" to describe their jumping experiences\n- Students recognize that bigger pushes (stronger forces) result in greater motion (higher/farther jumps)\n- Students can predict jump success based on the amount of force they plan to use\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of push forces to new jumping scenarios and real-world contexts.\n\n**Materials:**\n- Cones at different heights (stack 2 or 3 cones; create variations)\n- Tape for marking different starting distances (closer and farther from the obstacle)\n- Chart paper for recording new predictions and results\n- Optional: small weighted balls or beanbags for students to throw at different targets (alternative motion application)\n\n**Activity:**\n\n1. **Introduce a new challenge:** \"Now that we understand that stronger pushes make bigger jumps, we have a new question: If the cone is HIGHER, do we need a stronger push?\"\n\n2. **Set up variations:**\n   - Station 1: Single cone (original height)\n   - Station 2: Double-stacked cones (higher obstacle)\n   - Station 3: Different starting line (farther away from the cone)\n\n3. **Guided exploration:**\n   - Have students rotate through stations or choose a challenge\n   - Before each jump, ask: \"Do you think you'll need a stronger push for this one? Why?\"\n   - Students attempt the challenge and observe results\n   - Record on a chart: \"What push did you need to succeed?\"\n\n4. **Apply to a real-world context:**\n   - Ask students: \"Where else do people use big pushes to move through the air or make things move?\"\n   - Guide discussion toward: running and jumping in sports, jumping rope, kicking a ball, pushing a friend on a swing\n   - Show pictures or briefly discuss one example: \"Basketball players use a BIG push from their legs to jump high and make baskets!\"\n\n5. **Teacher role:**\n   - Facilitate station rotations smoothly\n   - Ask guiding questions: \"Is this obstacle higher or lower? What do you predict?\"\n   - Help students connect their jumps to real situations: \"How is this like jumping to catch a basketball?\"\n\n**Expected Student Outcomes:**\n- Students apply the push-force concept to new situations (higher obstacles, different distances)\n- Students predict and test whether they need stronger or weaker pushes for different challenges\n- Students recognize push forces in real-world activities and sports\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of push forces, motion, and the relationship between force and movement.\n\n**Activity:**\n\n1. **Formative assessment throughout the lesson:**\n   - Observe student responses during Engage discussion questions\n   - Listen to predictions and explanations during Explore phase\n   - Monitor vocabulary use during Explain phase\n   - Review student recordings (charts and drawings) from Explore and Elaborate\n\n2. **Exit ticket (administered at the end of Session 2):**\n   Provide each student with a simple sheet with two tasks:\n\n   **Task 1 (Drawing + Words):**\n   - \"Draw yourself making a BIG push jump and a SMALL push jump. Label which one goes higher.\"\n\n   **Task 2 (Verbal or Written Response — choose one method for your class):**\n   - Ask: \"What happens when you use a stronger push with your legs when you jump?\"\n   - Expected responses should include words like: \"go higher,\" \"jump farther,\" \"move more,\" \"bigger motion,\" \"stronger force makes me jump higher\"\n   - Accept simplified language like: \"Big push = high jump\" or drawings showing the relationship\n\n3. **Success criteria for student understanding:**\n   - Students can demonstrate the difference between small and big pushes (physical or verbal)\n   - Students explain that bigger/stronger pushes result in higher or farther jumps\n   - Students use at least one vocabulary term (push, force, motion) when describing their jumps\n   - Students accurately predict jump success based on the size of their push\n\n4. **Summative assessment:**\n   - Collect exit tickets and student drawings\n   - Use the class data chart from Explore phase as evidence\n   - Review anecdotal notes from your observations\n   - Students successfully meeting criteria: can describe, predict, and explain the relationship between push force and jumping motion\n   - Students not yet meeting criteria: provide re-teaching in small groups using the same jumping activity with more guided questioning\n\n**Expected Student Outcomes:**\n- At least 80% of students can demonstrate and explain that stronger pushes produce higher/farther jumps\n- Students use target vocabulary in context (push, force, motion)\n- Student drawings show clear understanding of the small-push vs. big-push difference\n- Students make at least one accurate prediction about jump outcomes based on force\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified vocabulary and exaggerated demonstrations:** Use only the core terms (push, big, small, jump high, jump far). Model very obvious contrasts between small and big pushes; have the student repeat the movements with you before attempting independently.\n\n2. **Hands-on force exploration before jumping:** Have students practice push movements with lighter, more controllable objects first (e.g., pushing toy cars across a table with different amounts of force, pushing a ball gently vs. hard). This builds understanding before the more complex motion of jumping.\n\n3. **One-on-one data recording:** Pair struggling students with a peer or teaching assistant who records their jump results on the chart. Remove the cognitive load of writing/drawing so they can focus on the physical exploration and verbal explanation.\n\n4. **Visual supports:** Use picture cards or drawn examples showing small-push and big-push positions. Point to the pictures as you discuss vocabulary, and have the student match their jump to the picture.\n\n**Challenge (for advanced learners):**\n\n1. **Introduce the concept of \"fair testing\":** Ask: \"Does the height of your jump change if you land on a softer or harder surface? Let's test!\" Have advanced students design and conduct a mini-experiment jumping on carpet vs. tile, recording results. Discuss how different surfaces might affect jumping.\n\n2. **Multiple variables investigation:** Challenge students to explore: \"What if you use a big push BUT you also lean forward or backward? Does that change how far you jump?\" Have them test different body positions with the same push force and record whether direction matters.\n\n3. **Measurement and graphing:** Provide measuring tapes and have advanced students measure the distance of their jumps with small, medium, and big pushes. Create a simple bar graph showing \"Distance Jumped\" on the y-axis and \"Size of Push\" on the x-axis. Discuss patterns in the data.\n\n4. **Peer teaching:** Ask advanced students to explain to a classmate why bigger pushes make higher jumps, using the vocabulary terms and examples from the lesson.\n\n---\n\n### Extension Activities\n\n1. **Jumping Animals Investigation:** Read a picture book about animals that jump (e.g., \"Jump, Kangaroo, Jump!\" or \"Why Do Frogs Jump?\"). Discuss: \"Why do you think kangaroos jump so high? What big pushes do their strong legs make?\" Have students compare human jumping to animal jumping using pictures and drawings.\n\n2. **Push-Force Sports Exploration:** Investigate different sports that use push forces. Bring in or show images of: basketball (vertical jump), long jump (horizontal jump), volleyball (jump and hit), ballet (jump and leap). Have students watch short video clips (1-2 minutes each) and discuss: \"Where is the big push? Why does the athlete need a strong push?\" Create a class poster titled \"Sports That Use Strong Pushes.\"\n\n3. **Design a Jumping Game:** Have small groups design their own jumping obstacle course or game using cones, hula hoops, lines on the floor, or other safe materials. Groups create rules that require different amounts of push force (e.g., \"Jump the small hoop with a tiny push; jump the large hoop with a big push\"). Groups test each other's games and give feedback: \"Did we need the force you predicted?\"\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 229,
  "outputTokens": 3946,
  "cost": 0.020434400000000002,
  "generatedAt": "2026-02-13T03:38:28.125Z"
}