{
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Frozen Fountain Investigation\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Water as a material with changing properties:** The ice icicles show water frozen into a solid form, different from liquid water.\n- **Effects of temperature on matter:** Cold temperatures have caused the water to change state from liquid to solid (ice).\n- **Gravity and motion:** Water flows downward from the fountain basins due to the downward pull of gravity.\n- **Energy transfer through heat:** Sunlight (visible in the photo) can warm surfaces and melt ice, affecting the fountain's appearance.\n\n---\n\n### Lesson Title\n\n**Chilly Water: Exploring Ice and Frozen Fountains**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total) — Session 1 focuses on Engage & Explore; Session 2 covers Explain, Elaborate, & Evaluate\n- **NGSS Standards:** \n  - K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface\n  - K-PS2-1: Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object (water flow application)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how water can freeze into ice when it gets very cold.\n2. Make predictions about what happens when ice melts in sunlight or warm air.\n3. Identify that water moves downward due to gravity and in different directions through fountain basins.\n4. Explain that cold temperatures change water into ice (a solid).\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Spark curiosity about frozen water and fountains using the photograph.\n\n**Materials:**\n- Printed color photograph of the frozen fountain (or large screen display)\n- Chart paper or whiteboard for recording wonder statements\n\n**Activity:**\n\n1. **Display the photograph** where all students can see it clearly. Keep it covered with a sheet initially for dramatic reveal.\n\n2. **Uncover and ask:**\n   - \"What do you see hanging from this fountain?\" (Pause for responses — accept all observations: icicles, ice, cold water, sparkly things)\n   - \"Why do you think these icy things grew on the fountain?\" (Listen for any reasoning about cold)\n   - \"Have you ever seen ice before? Where did you see it?\" (Relate to students' experiences: ice cream, freezer, winter)\n   - \"What would happen if we touched that ice? What would feel different than touching water?\" (Prompt thinking about temperature and hardness)\n\n3. **Wonder Prompt:** \n   \"I wonder... if we left water outside on a very, very cold night, would it turn into ice like this fountain? What do you think will happen?\"\n\n4. **Record 2-3 student predictions on chart paper.** Use simple drawings or words. Post this for comparison later.\n\n**Transition:** \"Let's do our own experiment to see what happens to water when it gets very cold, just like what happened to the fountain!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how water becomes ice through a hands-on freezing experiment.\n\n**Materials (per small group of 3-4 students):**\n- Small plastic cups (8 oz)\n- Water\n- Food coloring (optional, for visual appeal — 1-2 drops per cup)\n- Masking tape and markers (to label cups)\n- Access to a freezer (or cooler with ice packs prepared ahead of time)\n- Observation sheets with simple drawn boxes for \"before\" and \"after\" states (or blank paper for drawing)\n- Crayons or colored pencils\n\n**Activity:**\n\n**Teacher Preparation (before lesson):**\n- Set freezer to coldest setting\n- Prepare one \"control\" cup of water that's been frozen overnight to show the final product\n- Have ice packs in a cooler as backup if freezer access is limited\n\n**Student Directions (given orally and demonstrated):**\n\n1. \"Fill your cup halfway with water. Watch how the water moves and wiggles when you pour it.\"\n\n2. \"Add one drop of food coloring if you want to see your water more clearly.\"\n\n3. \"Use masking tape to write your name on your cup with the marker.\"\n\n4. \"On your observation sheet, draw what your water looks like RIGHT NOW. Draw it in the 'Before' box. Use the blue crayon because water is blue.\"\n\n5. \"Now, we're going to put your cup in the freezer (or cooler with ice). The freezer is very, very cold — colder than any place you've been!\"\n\n6. \"Leave your cup in the cold place for [10-15 minutes during this session, OR overnight if doing a full 24-hour freeze].\"\n\n7. \"When we bring it out, we'll draw what it looks like in the 'After' box. Did the water change?\"\n\n**Teacher Role:**\n- Circulate and ask: \"What does the water feel like? Is it hard or soft? Can you move it around?\" (Before freezing)\n- Guide students to pour gently and observe liquid movement\n- After the cold treatment, facilitate careful observation: \"Does it look the same? Feel different? Is it still wiggly or is it solid?\"\n- Use open-ended questions: \"What changed? How do you know?\"\n- Avoid explaining — let students discover the hardness and stability of ice\n\n**Expected Student Outcomes:**\n- Students will observe that water is liquid and flows (before)\n- After cold exposure, students will discover that water becomes solid ice that doesn't move the same way\n- Drawings will show progression from liquid (loose, flowing depiction) to solid (harder, defined shape)\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce vocabulary and formalize the concept of water changing states.\n\n**Materials:**\n- Chart paper with vocabulary words and simple drawings\n- The frozen cup from Explore (or your pre-made frozen control cup)\n- A small cup of room-temperature water\n- Optional: ice cube from freezer for pass-around (in small bag to prevent immediate melting)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Gather students in a circle with their observation sheets visible\n   - Ask 2-3 volunteers to show their \"before\" and \"after\" drawings\n   - Ask: \"What did we discover? What happened to the water?\"\n   - Accept and affirm all observations: \"It got hard!\" \"It's not liquid anymore!\" \"It looks like ice!\"\n\n2. **Introduce Vocabulary (8 minutes):**\n\n   Create a simple poster with each term and an accompanying picture/icon:\n\n   - **Water:** The clear liquid that fills our cups, the ocean, and rain. (Show the room-temperature water cup)\n   - **Ice:** Water that is frozen solid. It's hard and doesn't pour like water. (Show the frozen cup)\n   - **Cold/Freezing:** When the temperature is very, very low. Cold is what makes water turn into ice. (Point to freezer or ice pack)\n   - **Solid:** Something hard and firm that keeps its shape. Ice is a solid. (Tap the frozen cup; have students feel the outside of the bag with ice if available)\n   - **Liquid:** Something wet that flows and takes the shape of its container. Water is a liquid. (Pour a little water into a cup to show movement)\n\n3. **Make Connections (5 minutes):**\n   - Return to the fountain photograph\n   - Point to the icicles: \"These are ice. They formed because water from the fountain froze in very, very cold weather.\"\n   - Point to water still flowing in the basins (if visible): \"This water is still liquid because it's moving and warmer.\"\n   - \"When it gets warmer, the ice will melt back into water. It will drip down, just like at the fountain!\"\n\n4. **Check for Understanding:**\n   - Ask: \"Is ice a solid or a liquid?\" (Solid)\n   - Ask: \"What makes water turn into ice?\" (Cold/freezing temperatures)\n   - Ask: \"Can you point to something in this room that is a solid?\" (Students point to chairs, tables, their shoes, etc.)\n\n**Vocabulary:**\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Water** | The clear, wet liquid we drink and use to wash. It pours and flows. |\n| **Ice** | Frozen water. It's hard, cold, and solid. |\n| **Cold** | Very low temperature; a freezing feeling. |\n| **Solid** | Something hard and firm that keeps the same shape. |\n| **Liquid** | Something wet that flows and pours, like water. |\n\n**Expected Student Outcomes:**\n- Students can identify water as liquid and ice as solid\n- Students understand that cold causes water to become ice\n- Students can use the word \"ice\" and \"solid\" in simple sentences\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting and testing what happens when ice meets warmth.\n\n**Materials:**\n- Pre-frozen ice cubes (2-3 per student in small cups or bags)\n- Warm (not hot) water in a shallow dish\n- Ice cubes left at room temperature in separate dish\n- Observation chart: two columns labeled \"Ice in Warm Water\" and \"Ice at Room Temperature\"\n- Optional: hand warmers or sunny windowsill exposure\n\n**Activity:**\n\n1. **Set Up Two Stations:**\n   - **Station A (Warm Water):** Shallow dish with warm (not boiling—about 100–110°F) water\n   - **Station B (Room Temperature):** Shallow dish on a table away from heat\n   - Optionally add a **Station C (Sunlight):** If available, place ice cubes on a windowsill in direct sun (connects to K-PS3-1)\n\n2. **Student Task:**\n   - Distribute one ice cube to each student in a small cup\n   - **At Station A:** Students carefully place their ice cube in the warm water and observe for 3-5 minutes\n   - **At Station B:** Students leave their ice cube in the room-temperature dish to observe over time\n   - **Observation:** \"What is happening to the ice? Is it changing? Can you see water appearing? Can you hear any sounds?\"\n\n3. **Group Observation & Discussion:**\n   - Gather after 5 minutes and ask:\n     - \"What happened to the ice in the warm water?\" (It melted faster / turned back into water)\n     - \"What happened to the ice at room temperature?\" (It melted more slowly or not at all, depending on room temperature)\n     - \"Why do you think warm water made the ice melt?\" (Warmth is the opposite of cold; it changes ice back to water)\n\n4. **Connect to Fountain:**\n   - \"In spring, the sun warms up the frozen fountain. The ice melts back into water, and the fountain can flow again!\"\n\n**Teacher Role:**\n- Facilitate safe handling of warm water (teacher controls heating and placement)\n- Ask guiding questions without revealing the answer\n- Point out the progression: \"Watch the ice. What's changing about its shape? Size?\"\n\n**Expected Student Outcomes:**\n- Students observe that warm conditions make ice melt into water\n- Students understand that temperature (hot vs. cold) affects whether water is liquid or solid\n- Students can explain in simple terms: \"Warm water makes ice melt\"\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of water states and temperature effects.\n\n**Formative Assessment (Ongoing throughout lesson):**\n- Observe during Explore: Do students notice the change from liquid to solid?\n- Listen during Explain: Can students answer vocabulary questions correctly?\n- Watch during Elaborate: Do students accurately predict and describe ice melting?\n\n**Exit Ticket (Summative Assessment):**\n\nProvide each student with a simple one-page assessment with three tasks (orally administered or completed with teacher support for Kindergarten):\n\n**Task 1 – Identification:**\nShow a picture of a glass of water and a picture of an ice cube. Ask: \"Which one is ice? Which one is water? How do you know?\"\n- **Success Criterion:** Student correctly identifies both and gives a simple reason (e.g., \"Ice is hard,\" \"Water pours\")\n\n**Task 2 – Cause & Effect:**\nAsk: \"What happens to ice when it gets warm?\" \n- **Success Criterion:** Student responds, \"It melts\" or \"It turns into water\" or \"It becomes liquid\"\n\n**Task 3 – Application:**\nShow the fountain photograph again. Ask: \"Why do you think ice formed on this fountain? What made the water freeze?\"\n- **Success Criterion:** Student mentions cold, freezing, or winter (understanding that cold causes water to freeze)\n\n**Success Criteria:**\n- Student correctly identifies ice as solid and water as liquid\n- Student explains that cold makes water freeze and warmth makes ice melt\n- Student applies this understanding to the fountain scenario\n\n**Expected Student Outcomes:**\n- 80% of students will successfully identify ice and water\n- 75% of students will correctly state that cold freezes water and warmth melts ice\n- 70% of students will apply the concept to explain the frozen fountain\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified Vocabulary Focus:** Use only two terms in initial instruction — \"water\" (liquid) and \"ice\" (solid). Delay introduction of \"freeze,\" \"solid,\" and \"liquid\" for later lessons. Reinforce frequently with visuals.\n\n2. **Hands-On Freezing Trial:** Pair struggling students with a peer during Explore. Provide more frequent check-ins and encourage tactile exploration (feeling the cold cup, touching the solid ice through a bag) before abstract discussion.\n\n3. **Visual Observation Sheets:** Provide pre-drawn observation sheets with unlabeled boxes for \"before\" and \"after\" to reduce fine-motor demands. Students can simply color or use stickers to indicate changes rather than draw details.\n\n**Challenge (For Advanced Learners):**\n\n1. **Predict Melting Rates:** Ask advanced students to predict which melts faster: ice in warm water, ice at room temperature, or ice in sunlight. Have them observe multiple ice cubes and rank them by melting speed. Introduce the idea that temperature differences affect how fast change happens.\n\n2. **Introduce Reversibility:** Ask: \"If ice melts into water, can water turn back into ice?\" Provide multiple freeze-thaw cycles with their cup of water (freeze overnight, observe melting during warm day, re-freeze that night). Students draw or discuss the cycle.\n\n3. **Explore Other Materials:** Provide butter, chocolate, or crayons. Ask: \"Which other things can freeze and melt like ice?\" Students compare and contrast properties with ice, discovering that many materials respond to temperature.\n\n---\n\n### Extension Activities\n\n1. **Freezing Artwork (Cross-Curricular Art & Science):**\n   Provide plastic cups filled with water mixed with food coloring and small objects (beads, sequins, leaves). Freeze overnight. The next day, students observe their \"ice sculptures\" and predict/test melting on a sunny windowsill or with warm water. Display the melting progression with photos or drawings. *Connects to K-PS3-1: effects of sunlight.*\n\n2. **Ice Sensory Station:**\n   Set up a small tub with ice cubes, water, and funnels. Students explore how ice feels, how it floats in water, and what happens to ice over 15-20 minutes. Provide simple sentence frames: \"The ice is ___. The water is ___. When they mix, ___.\" *Encourages extended observation and language development.*\n\n3. **Frozen Water in Nature Scavenger Hunt (If Season-Appropriate):**\n   On a cold day, take students outside to find ice, frost, or frozen puddles. Students sketch or photograph examples and share: \"Where did we find ice? Why did ice form there?\" Bring findings back indoors to compare melting rates. *Connects to K-PS3-1 and real-world applications.*\n\n---\n\n## Implementation Notes for the Teacher\n\n- **Timing Flexibility:** If a full 24-hour freeze is necessary, conduct Engage & Explore on Day 1, then Explain & Elaborate on Day 2 after ice has fully formed and partially melted.\n- **Safety:** Ensure warm water is supervised by adults only. Pre-heat water outside the classroom or use hand warmers if direct heating is unavailable.\n- **Accessibility:** This lesson is highly visual and tactile, supporting diverse learners. Pair verbal descriptions with physical exploration for students with varied learning needs.\n- **Cultural Relevance:** If your region rarely experiences freezing, emphasize that freezers and ice packs create the same cold as winter does in other places, making the science universally relatable.\n\n---\n\n**Total Lesson Time:** 60 minutes across two sessions\n**Standards Alignment:** K-PS3-1 (effects of temperature), K-PS2-1 (motion of water/liquids)",
  "inputTokens": 2882,
  "outputTokens": 4025,
  "cost": 0.023007,
  "generatedAt": "2026-02-12T23:18:57.048Z"
}