{
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Frozen Fountain\n\n## Core Science Concepts from Image Analysis\n\n- **States of Matter and Phase Changes:** Water in the fountain exists in multiple states (liquid flowing, solid ice coating the structures), demonstrating how temperature affects matter.\n- **Properties of Materials:** Ice and water have different observable properties (appearance, texture, hardness, transparency) that make them suited for different purposes.\n- **Effects of Temperature:** Freezing is a physical change caused by cooling that can be reversed when temperature increases, making this a reversible change.\n- **Gravity and Water Flow:** The fountain's design shows water moving downward due to gravity, collecting in the basin below in a predictable pattern.\n\n---\n\n## Lesson Title\n\n**The Frozen Fountain: How Cold Changes Water**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90–120 minutes over two sessions (Session 1: Engage & Explore, approximately 60 minutes; Session 2: Explain, Elaborate, & Evaluate, approximately 45–60 minutes)\n- **NGSS Standards:** \n  - **2-PS1-1:** Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n  - **2-PS1-4:** Construct an argument with evidence that some changes caused by heating or cooling can be reversed and some cannot.\n\n---\n\n## Learning Objectives\n\nStudents will be able to...\n\n1. **Observe and describe the properties of water in two states** (liquid and solid/ice) and explain how they look and feel different.\n2. **Predict and investigate what happens to water when it gets very cold** using materials in the classroom.\n3. **Use evidence to explain that freezing is a change caused by cold** that can be reversed by warming.\n4. **Compare the properties of ice and water** and identify which properties make ice useful or challenging in specific situations.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n#### Objective\nCapture student interest using the frozen fountain photograph and activate prior knowledge about water and cold.\n\n#### Materials\n- Printed color photograph of the frozen fountain (one copy per pair of students, or display on screen)\n- Chart paper and markers\n- Optional: Image on interactive board or printed handouts\n\n#### Activity\n\n**Display & Introduction:**\nDisplay the photograph prominently on the board or give each pair of students a printed copy. Allow 30 seconds of silent observation before beginning discussion.\n\n**Guiding Questions (ask in sequence, pausing for student responses):**\n\n1. **\"What do you see in this picture? What is the fountain made of?\"** (Listen for: water, ice, frozen, cold, white, sparkly)\n2. **\"Why do you think the fountain looks different from a regular fountain? What changed?\"** (Nudge toward: it's frozen, icy, cold weather made it different)\n3. **\"Where have you seen ice before? What does ice feel like compared to water?\"** (Personal connections: ice cubes, puddles, water)\n4. **\"Do you think we could turn this icy fountain back into a regular water fountain? What would we need to do?\"** (Foreshadow warming/melting)\n\n**Wonder Prompt:**\n\"I wonder what happens to water when it gets super, super cold. Let's find out together!\"\n\n#### Transition\n\"Today, we're going to do an experiment to watch water turn into ice, just like in this frozen fountain, and we'll see if we can change it back.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n#### Objective\nStudents conduct a hands-on investigation to discover the properties of water and ice and observe freezing and melting.\n\n#### Materials\n- Small clear plastic cups (one per student, or one per pair)\n- Water (room temperature and ice water)\n- Ice cubes in a small bowl\n- Thermometers (optional, but helpful)\n- Paper towels\n- Craft sticks or plastic spoons for stirring\n- Small trays or shallow containers to contain spillage\n- Observational data sheet (prepared by teacher—see below)\n- Colored pencils or crayons\n\n#### Activity\n\n**Setup (Teacher Preparation):**\nArrange stations or distribute materials so each student or pair has access to:\n- A cup of room-temperature water\n- A small bowl of ice cubes\n- A thermometer (if available)\n\nPrint or write the observation sheet on chart paper or handout:\n\n---\n\n**\"Watching Water Change\" Observation Sheet**\n\n**What does the water look like before ice?**\n- Color: _______________\n- Texture (feel): _______________\n- Can you see through it? YES / NO\n\n**What does the ice look like?**\n- Color: _______________\n- Texture (feel): _______________\n- Can you see through it? YES / NO\n\n**What happened when we waited?**\n- Did the ice stay the same? YES / NO\n- Did the water change? YES / NO\n- Draw or describe what you see.\n\n---\n\n**Student Directions (Read aloud, post visually):**\n\n1. **\"Look at your cup of water. What does it look like? Draw and write what you observe.\"** (Spend 2–3 minutes observing and recording.)\n2. **\"Now, carefully place 2–3 ice cubes into your water cup. What happens right away?\"** (Students record observations: water gets colder, ice floats, etc.)\n3. **\"Look at an ice cube without putting it in water. How is it different from water? Feel it (carefully—it's cold!). Write or draw what you notice.\"** (Texture, hardness, transparency, temperature)\n4. **\"Now, let's wait and watch. Every few minutes, look inside your cup. Is the ice changing? Is the water changing? What do you see?\"** (Teacher sets a timer; students observe over 10–15 minutes as ice begins to melt.)\n5. **\"At the end, draw or describe: Is there still ice? Is there more water? What do you think happened?\"**\n\n#### Teacher Role\n\n- Circulate and ask clarifying questions: *\"What do you notice about the ice cube now?\" \"Is it the same as before?\" \"Why do you think that happened?\"*\n- **Do not provide answers.** Guide observation with questions.\n- Help students with thermometers if using them; explain that numbers show how hot or cold something is.\n- Ensure all students have time to observe and record.\n- Prompt students who finish early to compare: *\"How is melting ice different from frozen water?\"*\n\n#### Expected Student Outcomes\n\n- Students observe and describe properties of water (clear, flows, cold when ice is added).\n- Students observe and describe properties of ice (solid, hard, cold, melts into water).\n- Students record that ice changes into water over time.\n- Students begin to connect cooling (ice) with a change in water.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n#### Objective\nIntroduce formal vocabulary and concepts based on student discoveries; connect to the frozen fountain photograph.\n\n#### Materials\n- Chart paper and markers\n- Large labeled pictures: water, ice, freezing, melting, liquid, solid\n- The frozen fountain photograph (revisit)\n- Student observation sheets from Explore phase\n\n#### Activity\n\n**Group Share-Out (5 minutes):**\n\nGather students on the carpet with their observation sheets.\n\n- **Ask:** *\"Who wants to share what you discovered? What did you see happen to the water?\"*\n- Create a simple two-column chart on chart paper:\n\n| **What We Saw About Water** | **What We Saw About Ice** |\n|---|---|\n| Flows | Stays in one shape |\n| Clear/see-through | Clear/see-through |\n| Felt cold | Felt very cold |\n| (students add) | (students add) |\n\n**Introduce Vocabulary (5 minutes):**\n\nUse student-friendly definitions and point to the photographs and materials as you explain:\n\n1. **Water (Liquid):** The clear, wet stuff that flows. It takes the shape of its container. It's one *state* (or form) that water can be in.\n2. **Ice (Solid):** Frozen water. It's hard and keeps its own shape. It's another state that water can be in.\n3. **Freezing:** When water gets so cold that it becomes ice. This is a **change** caused by cooling.\n4. **Melting:** When ice gets warmer and becomes water again. This is the opposite of freezing.\n5. **Reversible Change:** A change that can be undone. Freezing and melting are reversible—water can become ice, and ice can become water again.\n\n**Connect to the Photograph (5 minutes):**\n\nDisplay the frozen fountain again.\n\n- **Say:** *\"Look at this fountain in winter. The water got so cold that it froze into ice, just like what happened in our cups! See how the ice coats the fountain? That's because the water was freezing.\"*\n- **Ask:** *\"Do you think if the weather got warm, the ice would melt back into water? Why?\"*\n- **Explain:** *\"Yes! If we warmed up that fountain, the ice would melt, and the water would flow again, just like before. Freezing and melting are changes that can be reversed.\"*\n\n#### Vocabulary List\n\n| **Term** | **Student-Friendly Definition** |\n|---|---|\n| **Water** | The clear, wet liquid that flows and takes the shape of its container |\n| **Ice** | Frozen water; it's hard and solid |\n| **Freezing** | When water gets very cold and turns into ice |\n| **Melting** | When ice gets warm and turns back into water |\n| **Reversible** | A change that can be undone or changed back |\n\n#### Check for Understanding\n\nUse a **quick show-of-hands strategy:**\n\n- *\"Raise your hand if freezing is when water turns into ice.\"* (Should be all hands)\n- *\"Raise your hand if melting is when ice turns into water.\"* (Should be all hands)\n- *\"Can we reverse freezing? Thumbs up if yes, thumbs down if no.\"* (Should be thumbs up)\n\n#### Expected Student Outcomes\n\n- Students understand water can be a liquid (water) or a solid (ice).\n- Students know freezing is caused by cold and melting is caused by warmth.\n- Students recognize that freezing and melting are reversible changes.\n- Students can apply these concepts to the fountain photograph.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n#### Objective\nStudents apply concepts to a new, real-world scenario and deepen understanding of properties and reversible changes.\n\n#### Materials\n- Ice cubes (pre-made or from Explore activity)\n- Small containers (paper cups or shallow trays)\n- Warm water (in a pitcher—teacher controls)\n- Food coloring (optional: blue or clear)\n- Thermometers (optional)\n- Pictures or examples: ice skating, ice cream, icicles, frozen puddles\n- \"Ice or Water?\" sorting chart (pre-drawn on chart paper)\n\n#### Activity\n\n**Scenario-Based Investigation: \"Can We Melt the Ice?\"**\n\nPresent a real-world scenario:\n\n*\"The fountain in our picture is frozen. If we want to use the fountain again, we need to melt the ice. Let's try different ways to melt our ice cubes and see what works!\"*\n\n**Setup:**\n- Give each student or small group an ice cube in a cup.\n- Provide options: leave it in the cold room, sit it in the sun (windowsill), place it in warm water, or cover it with a blanket.\n\n**Student Activity (guided exploration):**\n\n1. *\"Make a prediction: Which way do you think will melt the ice fastest? Why?\"*\n2. *\"Place your ice in one of these spots. Observe every 5 minutes. What's happening?\"*\n3. *\"Draw or write what you see. Is the ice changing? How?\"*\n4. **After 10–15 minutes:** Gather and discuss results.\n   - *\"Which method melted the ice the fastest?\"*\n   - *\"What do all the fastest methods have in common?\"* (Heat/warmth)\n   - *\"What does this tell us about melting?\"* (Heat makes ice melt.)\n\n**Real-World Connection:**\n\nShow pictures of ice skating rinks, icicles, and frozen puddles.\n\n- *\"Ice skaters use ice to play. If the weather gets warm, the ice melts. Then they can't skate anymore.\"*\n- *\"In spring, icicles on houses melt and drip because the air gets warmer.\"*\n- *\"This fountain is pretty when it's frozen, but people probably wanted it to work again when it warmed up!\"*\n\n**Sorting Activity:**\n\nCreate a simple sorting chart:\n\n| **Things Made of Ice or Water** | |\n|---|---|\n| **Ice** | **Water** |\n| Ice cubes | Rain |\n| Icicles | Puddles |\n| (Students add) | (Students add) |\n\nAsk students to add examples based on their experiences.\n\n#### Teacher Role\n\n- Ask guiding questions without giving answers: *\"What changed in your cup?\" \"Why do you think that happened?\" \"What does this tell us about heat?\"*\n- Ensure safe handling of warm water; do this part or closely supervise.\n- Encourage students to make connections: *\"Remember our fountain? This is what's happening when it melts!\"*\n\n#### Expected Student Outcomes\n\n- Students discover that **warmth/heat melts ice** more effectively than cold.\n- Students apply the concept of reversible change to a new situation.\n- Students understand the real-world relevance of freezing and melting.\n- Students can predict outcomes based on observations.\n\n---\n\n### 5. EVALUATE\n\n#### Objective\nAssess student understanding of freezing, melting, properties of water and ice, and reversible changes.\n\n#### Formative Assessment (Throughout the Lesson)\n\nUse these informal check-ins:\n\n- **During Explore:** Observe student drawings and listen to descriptions. Do they describe ice and water differently?\n- **During Explain:** Use the show-of-hands vocabulary checks. Re-teach any concepts where many hands don't go up.\n- **During Elaborate:** Listen to predictions and reasoning. Do students explain *why* warmth melts ice?\n\n#### Exit Ticket / Summative Assessment\n\nProvide each student with a simple **\"Freezing & Melting\" Exit Ticket** (can be drawn or written, depending on writing ability):\n\n---\n\n**Exit Ticket: Freezing & Melting**\n\n**1. Draw or write: What happens when water gets very cold?**\n\n(Expected: Students draw or write about freezing, ice forming, or water turning into ice.)\n\n**2. Look at this picture of a frozen fountain. If the weather got warm, what would happen to the ice?**\n\n(Expected: Students say or draw that the ice would melt into water, the fountain would work again, etc.)\n\n**3. True or False: Once water freezes into ice, it stays ice forever and can never be water again.**\n\n(Expected: False—with explanation that it can melt back into water)\n\n---\n\n#### Alternative Assessment: Quick Interview\n\nIf students struggle with written/drawn responses, ask verbally:\n\n- *\"Show me an ice cube. Now tell me: If I leave this here on a warm day, what will happen?\"*\n- *\"Can we change ice back into water? How?\"*\n- *\"What's one difference between water and ice?\"*\n\n#### Success Criteria\n\nStudents demonstrate understanding when they:\n\n✓ Describe at least **two properties of water** (e.g., flows, clear, cold when ice is added)  \n✓ Describe at least **two properties of ice** (e.g., hard, solid, very cold, clear)  \n✓ Explain that **freezing is caused by cold** and **melting is caused by warmth**  \n✓ Recognize that **freezing and melting are reversible** (water ↔ ice)  \n✓ Apply concepts to the **frozen fountain scenario** (can predict it will melt if warm)\n\n#### Expected Student Outcomes\n\n- **Most students (80%)** will successfully complete the exit ticket, demonstrating understanding of freezing/melting and reversibility.\n- **Some students** may need a verbal interview or drawing-only response but will show understanding through observations.\n- **All students** will have engaged in hands-on investigation and vocabulary introduction, building foundational knowledge.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified Vocabulary:** Use primarily *water* and *ice* in Grades 2. Reserve *liquid* and *solid* for brief mentions; rely heavily on visual and tactile examples.\n\n2. **Sentence Starters for Observation:** Provide written sentence frames for students who struggle with recording:\n   - \"The ice looks ___________.\"\n   - \"The water is ___________.\"\n   - \"When the ice got warm, it ___________.\"\n\n3. **Visual Supports:** Use labeled pictures of water and ice throughout the lesson. Point to the actual materials as you introduce vocabulary. Allow students to touch ice (briefly) and water to build understanding through tactile experience.\n\n4. **Partner Pairing:** Pair students who struggle with recording with a peer or provide one-on-one teacher check-ins during Explore to scribe their observations.\n\n### Challenge (for advanced learners)\n\n1. **Extended Investigation:** Ask: *\"What if we froze something else, like juice or salt water? Would it freeze the same way as plain water? Let's test!\"* Have them design and conduct a simple comparison.\n\n2. **Temperature Exploration:** If using thermometers, ask advanced students to **read and record temperatures** (e.g., room temp water vs. ice water vs. warm water). Introduce the idea that different temperatures cause different rates of melting. Create a simple line graph of temperature over time.\n\n3. **Design Challenge:** *\"How could we keep an ice cube frozen on a warm day? What materials would work best?\"* Have students brainstorm and test ideas (insulation, shade, salt, etc.), then explain their results using the concepts of heating and cooling.\n\n---\n\n## Extension Activities\n\n### 1. **Ice Melt Race (At-Home or Follow-Up Lesson)**\n\nStudents take a small ice cube home (in a sealed bag) with instructions to **observe what melts it fastest:** sitting in sun, in a warm room, in ice water, or covered with a blanket. They draw or describe their findings and bring them back to share. This reinforces that **heat causes melting** and extends learning beyond the classroom.\n\n### 2. **Frozen Art Project: Make Ice Cube Creations**\n\nStudents **freeze water with food coloring, glitter, or small objects** inside cups overnight (requires prep). The next day, they observe the frozen creations and then place them in warm water to watch them melt. Discuss: *\"What's happening? Why is it melting?\"* This makes freezing/melting hands-on and creative while reinforcing reversibility.\n\n### 3. **Winter/Spring Comparison: Exploring Seasonal Changes**\n\nShow photographs of **fountains, ponds, or landscapes in winter (frozen) and spring (melted).** Have students sort images into \"Freezing\" and \"Melting\" categories. Discuss: *\"When do puddles freeze? When do they melt? Why does this happen in different seasons?\"* This builds toward understanding cause-and-effect and introduces seasons as a context for freezing/melting.\n\n---\n\n## Notes for Teacher Implementation\n\n- **Safety:** Emphasize gentle handling of ice; ensure warm water is tested by the teacher before students use it. Always supervise.\n- **Preparation:** Pre-make ice cubes the night before. Have thermometers ready (even if not using temperature data, they help students see that cold has a measurable quality).\n- **Timing:** This lesson works well split across two days: Engage/Explore on Day 1, Explain/Elaborate/Evaluate on Day 2. This allows observation of ice melting to occur naturally during the lesson.\n- **Photograph Revisit:** Return to the frozen fountain photograph multiple times throughout the lesson. Second graders benefit from seeing the connection between the \"big picture\" (a real fountain) and their small investigation repeatedly.",
  "inputTokens": 2881,
  "outputTokens": 4749,
  "cost": 0.026626000000000004,
  "generatedAt": "2026-02-12T23:20:30.489Z"
}