{
  "id": 55,
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "fifth-grade",
  "content": "## 📸 Photo Description\n\nThis frozen fountain shows water that has turned into solid ice formations called icicles. The water normally flows down from each level of the fountain, but cold temperatures have caused it to freeze in place. Long, pointed ice shapes hang from each tier, creating a winter sculpture where flowing water used to be.\n\n## 🔬 Scientific Phenomena\n\nThe anchoring phenomenon here is **phase change from liquid to solid due to temperature drop**. When the ambient temperature falls below 32°F (0°C), the kinetic energy of water molecules decreases significantly. The molecules slow down enough that attractive forces between them become stronger than their motion, causing them to arrange into a rigid crystalline structure we call ice. The flowing water freezes as it moves, creating the dramatic icicle formations we observe.\n\n## 📚 Core Science Concepts\n\n1. **States of Matter and Phase Changes**: Water exists in three states - solid (ice), liquid (water), and gas (water vapor). Temperature changes cause molecules to gain or lose energy, resulting in phase transitions.\n\n2. **Molecular Motion and Temperature**: As temperature decreases, water molecules move more slowly. When they move slowly enough, they lock into place forming ice crystals.\n\n3. **Heat Transfer**: The fountain water loses thermal energy to the colder surrounding air through conduction and convection, causing the temperature to drop below the freezing point.\n\n4. **Crystalline Structure Formation**: Ice forms in specific geometric patterns as water molecules arrange themselves in hexagonal structures, which is why ice has different properties than liquid water.\n\n<pedagogical-tip>Use this image as a \"Notice and Wonder\" activity starter. Have students list what they notice scientifically, then what they wonder about the process. This builds observation skills and generates authentic questions for investigation.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to express their understanding: allow them to draw the molecular arrangement, act out molecular motion with their bodies, or create digital presentations about phase changes to accommodate different learning preferences.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In**: At the molecular level, water molecules (H₂O) are slowing down and forming hydrogen bonds with neighboring molecules. These bonds create the rigid, hexagonal crystal lattice structure of ice, where each water molecule connects to four others in a specific pattern.\n\n2. **Zoom Out**: This fountain represents part of the larger water cycle system. The frozen water will eventually melt when temperatures rise, potentially evaporating into the atmosphere, condensing in clouds, and returning as precipitation - demonstrating how water continuously moves through different states in Earth's systems.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"Ice is colder than liquid water\" \n   **Clarification**: Ice and liquid water can be the same temperature. Ice forms when water reaches 32°F, but both ice and water can exist at this temperature simultaneously.\n\n2. **Misconception**: \"Freezing makes things shrink\"\n   **Clarification**: Water actually expands when it freezes because the crystal structure takes up more space than liquid water molecules, which is why ice floats.\n\n3. **Misconception**: \"Only pure water freezes at 32°F\"\n   **Clarification**: The fountain water may contain dissolved minerals or chemicals that can lower the freezing point, which is why some fountains might freeze at slightly different temperatures.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 5-PS1-3 - Make observations and measurements to identify materials based on their properties\n- **Disciplinary Core Ideas**: \n  - [[NGSS:DCI:5-PS1.A]] - Matter of any type can be subdivided into particles that are too small to see\n  - [[NGSS:DCI:2-PS1.A]] - Different kinds of matter exist and many of them can be either solid or liquid\n- **Crosscutting Concepts**:\n  - [[NGSS:CCC:Patterns]] - Patterns can be used as evidence to support an explanation\n  - [[NGSS:CCC:Cause and Effect]] - Cause and effect relationships are routinely identified and used to explain change\n\n## 💬 Discussion Questions\n\n1. What evidence do you see that tells you the temperature dropped below freezing? (Bloom's: Analyze | DOK: 2)\n\n2. How might the shape and size of these icicles give us clues about how long it has been freezing? (Bloom's: Evaluate | DOK: 3)\n\n3. What do you predict will happen to this fountain when the temperature rises above 32°F? (Bloom's: Apply | DOK: 2)\n\n4. Why do you think some parts of the fountain have more ice formation than others? (Bloom's: Analyze | DOK: 3)\n\n## 📖 Science Vocabulary\n\n* **Phase change:** When matter transforms from one state to another, like liquid water becoming solid ice\n* **Freezing point:** The specific temperature at which a liquid becomes a solid (32°F for water)\n* **Crystalline structure:** The organized, repeating pattern that molecules form when they become a solid\n* **Kinetic energy:** The energy that molecules have when they are moving\n* **Thermal energy:** Heat energy that can transfer from warmer objects to cooler objects\n* **Molecule:** The tiny particles that make up all matter, too small to see without special equipment\n\n## 📚 External Resources\n\n**Children's Books:**\n- Water Is Water by Miranda Paul\n- The Magic School Bus: Wet All Over by Joanna Cole\n- Ice Is Nice by Robin Nelson\n\n**YouTube Videos:**\n- \"States of Matter for Kids\" - Simple explanation of solids, liquids, and gases with animations (https://www.youtube.com/watch?v=ZjjAXVYWPzE)\n- \"How Do Icicles Form?\" by SciShow Kids - Kid-friendly explanation of ice formation (https://www.youtube.com/watch?v=qBLhbODCzJE)",
  "generatedAt": "2026-02-04T03:48:11.850Z"
}