{
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Frozen Fountain — Forces, Motion, and Freezing Water\n\n## Core Science Concepts from Image Analysis\n\n- **Gravity and Motion:** Water flows downward through the fountain's tiers due to gravitational force pulling it down, demonstrating motion caused by an unbalanced force.\n- **States of Matter and Temperature:** The ice coating shows how water changes from liquid to solid when temperatures drop below freezing, a physical change in matter.\n- **Force and Direction:** The flowing water demonstrates how forces act in specific directions—downward and outward—and create patterns of motion.\n- **Energy Transfer:** The water's movement and the freezing process both involve energy changes—kinetic energy in moving water and thermal energy loss during freezing.\n\n---\n\n## Lesson Title\n\n**Chasing the Flow: How Water Moves and Freezes**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (approximately 90 minutes total)\n- **NGSS Standards:** \n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object.\n  - 3-PS2-2: Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Describe how gravity causes water to move downward in a fountain using evidence from observations.\n2. Predict how water will move when affected by gravitational force in different fountain designs.\n3. Explain what happens to water when temperature changes, using the frozen fountain as an example.\n4. Demonstrate understanding of balanced and unbalanced forces by designing a simple water flow system.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Large printed color photograph of the frozen fountain (at least 11\" × 14\")\n- Projection device (optional, for displaying to whole class)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** to the entire class. Ask students to look carefully for 30 seconds without talking, then turn to a partner and describe what they see.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you think this white, icy stuff is covering the fountain? Where did it come from?\" *(Activate prior knowledge about water and ice)*\n   - \"How do you think the water got to the top of this fountain? Did it go up or down?\" *(Introduce directionality and gravity)*\n   - \"Why is there so much ice on this fountain when we usually see water running through fountains?\" *(Introduce temperature and state changes)*\n   - \"If you could turn this fountain back on right now, which way would the water go?\" *(Activate prediction skills)*\n\n3. **Wonder Prompt:** \"I wonder what FORCES are making the water move in fountains, and why ice stops it. Let's investigate!\"\n\n4. **Record student predictions** on chart paper: \"Where do you think the water in a working fountain wants to go?\"\n\n**Transition:** \"Today, we're going to do an experiment with water that will help us understand what makes fountains work—and what happens when they freeze!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials (per group of 3-4 students):**\n- One clear plastic cup (12 oz)\n- One clear plastic straw\n- One small bottle of water\n- Food coloring (2-3 colors)\n- Ruler\n- Paper towels\n- Shallow plastic tray or baking sheet (to contain spills)\n- Tape\n- Masking tape and markers for labels\n- Pencil\n\n**Activity:**\n\n1. **Setup Instruction (Teacher demonstrates):** \"We're going to build a simple water system that works like a tiny fountain. The water will show us something amazing about FORCES.\"\n\n2. **Step-by-Step Student Directions:**\n   - \"Fill your cup about 3/4 full with water.\"\n   - \"Add a few drops of food coloring to make the water easier to see.\"\n   - \"Tape your straw to the inside of the cup so it goes almost to the bottom. Use the tape to hold it firmly.\"\n   - \"Now, here's the important part: Gently blow through the straw. Watch what happens to the water!\"\n   - \"Record what you observe: Does the water go UP or DOWN? How high does it go? Draw a picture.\"\n   - \"Try blowing harder. Does the water go higher? Softer? Does it go lower? Measure with your ruler.\"\n   - \"What do you think is PUSHING or PULLING the water?\"\n\n3. **Connection to Photograph:** \"In the frozen fountain, a pump pushes water UP to the top. Gravity pulls it DOWN. The water falls from tier to tier, just like your water falls in this cup!\"\n\n4. **What Students Should Record:**\n   - Drawings of water movement (up vs. down)\n   - Measurements of water height with different blow strengths\n   - Written observations: \"When I blew hard, the water _____.\" \"When I blew soft, the water _____.\"\n   - A labeled diagram showing the force (their breath) and the direction (up/down)\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What made the water move? Where did the force come from? Can you predict what will happen if you blow even harder?\"\n- Do NOT explain the concept; let students observe and wonder.\n- Ensure water stays in trays to minimize mess.\n- Prompt students to use directional language: \"up,\" \"down,\" \"pushed,\" \"falls.\"\n\n**Expected Student Outcomes:**\n- Students will observe that force (their breath) causes water to move upward.\n- Students will recognize a pattern: stronger force = higher water movement.\n- Students will begin to understand that water naturally falls DOWN (gravity).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with vocabulary words\n- Photographs of the frozen fountain (same image as Engage)\n- Simple diagram showing water flow (teacher-prepared or drawn during discussion)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3-4 groups to share their observations: \"What did your water do? What made it move?\"\n   - Record key observations on chart paper: \"pushed,\" \"went up,\" \"came down,\" \"higher with more breath,\" \"lower with less breath.\"\n\n2. **Teacher-Led Explanation (8 minutes):**\n   - \"Great scientists! You discovered something important. Let me show you how this connects to our frozen fountain.\"\n   - **Point to the fountain photograph:** \"In a real fountain, a pump is like your breath—it PUSHES water up to the top.\"\n   - \"But there's another FORCE in the photograph. Does anyone notice the ice? That's not a force—that's what happens when water gets REALLY cold. But GRAVITY is the force we see in both your cup and this fountain.\"\n   - \"Gravity is an invisible force that PULLS everything downward. It pulled your water down when you blew into your straw. It pulls the water down in the fountain, from tier to tier, just like you predicted!\"\n\n3. **Visual Connection:**\n   - Draw or show a simple labeled diagram:\n     - Pump/Force pushing UP (or show the straw experiment)\n     - Arrow showing water going DOWN\n     - Label: \"GRAVITY pulls water DOWN\"\n   - Point to the frozen fountain: \"See how the water froze while falling? That tells us the weather was VERY cold—cold enough to change water from liquid to solid ice.\"\n\n4. **Check for Understanding:**\n   - \"Show me with your hand which way gravity pulled the water in your experiment.\" *(Students point downward)*\n   - \"In our fountain picture, gravity is pulling the water...\" *(Say downward together)*\n   - \"What FORCE did you use to make the water go UP in your straw?\" *(Your breath/force)*\n\n**Vocabulary:**\n\n- **Force:** A push or pull that makes something move or changes how it moves. *Example: Your breath was a force that pushed the water up.*\n- **Gravity:** An invisible force that pulls everything downward, toward the Earth. *Example: Gravity pulled your water down when it fell out of the straw.*\n- **Motion:** The way something moves. It can go up, down, fast, slow, or in different directions. *Example: The water's motion was upward when you blew, and downward after.*\n- **Freeze/Frozen:** When a liquid (like water) gets so cold it becomes solid (like ice). *Example: The fountain is covered with frozen water—ice!*\n- **Direction:** Which way something is going (up, down, left, right, forward, backward). *Example: Gravity pulls in the DOWN direction.*\n\n**Expected Student Outcomes:**\n- Students can name gravity as the force pulling water downward.\n- Students understand the connection between their straw experiment and how real fountains work.\n- Students recognize that direction matters when describing motion.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials (per group):**\n- Three clear plastic cups\n- Three straws\n- Masking tape\n- Food coloring and water\n- Ruler\n- Shallow trays\n- Additional materials: funnels (optional), small containers, blocks or books for elevation\n- Paper and pencils for predictions\n\n**Activity:**\n\n**Challenge: \"Can you design a BETTER fountain?\"**\n\n1. **Setup:** \"Now you're going to be fountain engineers! You've learned about GRAVITY and FORCES. Your job is to design a way to make water travel in a pattern—maybe down in steps, or in a different direction.\"\n\n2. **Student Directions:**\n   - \"Use your three cups to create a new structure. Can you tape them so water flows from one cup to another?\"\n   - \"Think about gravity: Which way do you want water to flow?\"\n   - \"Predict: If I pour water into the TOP cup, where will it go? Will gravity pull it down to the next cup?\"\n   - \"Test your design. Pour water carefully into the top cup. Did the water go where you predicted?\"\n   - \"Can you redesign it to make the water flow in a different pattern?\"\n   - \"Draw a picture of your fountain design and label where GRAVITY is pulling the water.\"\n\n3. **Real-World Application:** \"Real fountain designers use what you just learned! They have to know where gravity will pull the water so they can design beautiful fountains. Your frozen fountain in the picture was designed by someone who understood these forces!\"\n\n**Teacher Role:**\n- Ask guiding questions: \"Why did the water stop at that cup? Where is gravity pulling it? How could you tilt your cup to change the direction?\"\n- Encourage prediction before testing.\n- Celebrate creative designs and reinforce the science: \"Look how gravity pulled that water right through your design!\"\n- Allow time for students to iterate and test new designs.\n\n**Expected Student Outcomes:**\n- Students create a working water flow system based on understanding gravity.\n- Students predict and test, then refine their predictions.\n- Students articulate why water moves the way it does (\"because gravity pulls it down\").\n- Students apply force and motion concepts to design.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding through multiple measures.\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation during Explore:** Do students recognize directional motion (up/down)? Do they describe forces causing motion?\n- **Check for Understanding questions during Explain:** Can students point to the direction gravity pulls? Can they connect the straw experiment to the fountain?\n- **Elaborate observation:** Do student designs show understanding that gravity pulls downward? Can they predict water flow before testing?\n\n**Exit Ticket (Summative Assessment) — Administer at end of Session 2:**\n\n*Provide each student with a simple diagram showing a fountain with three tiers and water at the top.*\n\n**Exit Ticket Questions:**\n\n1. **\"Draw an arrow showing which way GRAVITY will pull this water.\"** *(Expect downward arrows)*\n\n2. **\"What FORCE makes water go UP to the top of a fountain like the one in our picture?\"** *(Accept: pump, push, force from the pump, etc.)*\n\n3. **\"Why is the fountain in our picture covered with ice?\"** *(Accept: It's cold, temperature is very low, water froze because it was freezing outside, etc.)*\n\n4. **\"If you blow into a straw in water, which way does the water move first?\"** *(Expect: UP or upward)*\n\n**Success Criteria:**\n- ✓ Student correctly identifies downward direction for gravity (Question 1)\n- ✓ Student names a force that pushes water upward (Question 2)\n- ✓ Student connects freezing to temperature (Question 3)\n- ✓ Student describes directionality of motion (Question 4)\n\n**How to Determine if Students Met Learning Objectives:**\n- **Objective 1 (Describe gravity's effect):** Exit Ticket Q1 and Q4; Explore observations of downward water motion\n- **Objective 2 (Predict water movement):** Elaborate designs; predictions before testing\n- **Objective 3 (Explain freezing):** Exit Ticket Q3; observations of ice in photograph\n- **Objective 4 (Demonstrate force and motion):** Elaborate designs; ability to identify forces in diagram (Explain phase Check for Understanding)\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Provide a sentence frame during Explore:**\n   - \"When I blew [soft/hard], the water went [up/down] because a [force/push] made it move.\"\n   - This scaffolds both observation and vocabulary use.\n\n2. **Pre-teach vocabulary with images:**\n   - Before Explain phase, show pictures of \"up,\" \"down,\" \"gravity,\" \"freeze\" using simple icons or clipart.\n   - Have students sort picture cards by direction or state of matter.\n\n3. **Pair during Elaborate:**\n   - Assign struggling learners to work with a peer who demonstrated solid understanding during Explore.\n   - Provide a template for their fountain design with cups already outlined; focus on prediction and testing rather than building.\n\n### Challenge (for advanced learners):\n\n1. **Design Challenge with Constraints:**\n   - \"Can you make water flow UP first, then DOWN? What forces would you need?\"\n   - Provide additional materials (tubing, additional straws, funnels) and ask: \"How could you use gravity AND another force together?\"\n\n2. **Prediction with Variables:**\n   - \"If you used a wider straw instead of a narrow one, how do you think the water motion would change? Why?\"\n   - Have students predict, test, and explain the difference (exploration of force transmission).\n\n3. **Connect to Temperature:**\n   - \"The frozen fountain can't flow. Write or draw: What would happen to water in your fountain if the temperature dropped below freezing? How would gravity change?\"\n   - Extend thinking about state changes and energy.\n\n---\n\n## Extension Activities\n\n1. **\"Fountain Photo Scavenger Hunt\"**\n   - Provide images of 4-5 different fountains (urban fountains, water features, waterfalls).\n   - Students identify and mark with arrows where gravity is pulling water downward in each photo.\n   - This reinforces pattern recognition across multiple contexts and prepares for 3-PS2-2 (predicting motion patterns).\n\n2. **\"Design a Fountain for Winter\"**\n   - Challenge: \"This fountain froze because it was too cold. How could we design a fountain that DOESN'T freeze?\"\n   - Students draw or build a solution (e.g., heated water, covered, indoors, faster-moving water so it doesn't have time to freeze).\n   - Connects to problem-solving and real-world engineering design (3-PS2-4 foundation).\n\n3. **\"Gravity Investigation: Which Falls Faster?\"**\n   - Set up two straws of different widths or two cups with different-sized holes.\n   - Students predict which water stream will fall faster or farther.\n   - Test and measure using a ruler.\n   - Connects to 3-PS2-2 (patterns in motion based on measurable differences).\n\n---\n\n## Teacher Notes\n\n- **Safety Reminder:** Supervise water activity closely. Have paper towels available. Keep water away from electrical outlets and materials that may be damaged by moisture.\n- **Timing:** If students are particularly engaged in the Elaborate phase, you may extend to a second day. The core concepts can be assessed in either session.\n- **Connection to Frozen Fountain:** Repeatedly return to the photograph throughout the lesson. Students should leave understanding that the frozen fountain demonstrates BOTH the concepts they explored (gravity, force, motion) AND a change in the state of matter (liquid to solid) caused by temperature.\n- **NGSS Alignment Note:** This lesson emphasizes 3-PS2-1 (effects of forces on motion) and 3-PS2-2 (patterns in motion). The water motion is observable, measurable, and directly tied to forces students can identify and manipulate.",
  "inputTokens": 2875,
  "outputTokens": 4067,
  "cost": 0.02321,
  "generatedAt": "2026-02-12T23:21:13.525Z"
}