{
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Frozen Fountain Forces\n\n## Core Science Concepts from Image Analysis\n\n- **Gravity and Motion:** Water flows downward from the fountain basin due to gravitational force pulling it toward Earth, which is visible in how the water would normally cascade through the structure.\n- **States of Matter and Temperature:** The ice coating on the fountain demonstrates what happens when liquid water freezes into a solid state due to cold temperature—a physical change in matter.\n- **Energy and Heat Transfer:** The frozen fountain illustrates the concept that heat energy moves from warmer objects to cooler surroundings, causing water to change states.\n- **Properties of Materials:** The photograph shows how materials (water, metal, brick) have different properties and respond differently to cold temperatures.\n\n---\n\n## Lesson Title\n\n**Gravity, Water, and Ice: What Happens When a Fountain Freezes?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 75–90 minutes (two 45-minute sessions, or one extended science block)\n- **NGSS Standards:** \n  - 5-PS2-1: Support an argument that the gravitational force exerted by Earth on objects is directed down.\n  - 5-PS1-2: Measure and graph quantities to provide evidence that regardless of the type of change that occurs when heating, cooling, or mixing substances, the total weight of matter is conserved.\n  - 5-PS1-3: Make observations and measurements to identify materials based on their properties.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Explain** how gravity affects the motion of water in a fountain and why water falls downward.\n2. **Describe** the physical change that occurs when liquid water freezes into solid ice and how temperature causes this change.\n3. **Compare** the properties of water in different states (liquid and solid) and predict how materials respond to extreme cold.\n4. **Support an argument** using observations from the photograph that gravity pulls objects toward Earth.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about the frozen fountain and activate prior knowledge about water, gravity, and cold.\n\n**Materials:**\n- Photograph of the frozen fountain (projected on screen or printed)\n- Chart paper and markers\n- Optional: video clip (15–30 seconds) of a functioning fountain if available\n\n**Activity:**\n\n1. **Display the Photograph:** Project or show the frozen fountain image. Allow students 30 seconds of silent observation. Ask them to notice details without speaking.\n\n2. **Guided Discussion Questions:**\n   - \"What do you see coating the fountain? What do you think it is?\" (Guide to: ice, frost, frozen water)\n   - \"Why do you think the fountain froze? What had to happen to the water?\" (Activate prior knowledge about cold and water)\n   - \"If this fountain usually has water flowing, which direction does the water move? Why does it move that way?\" (Prepare for gravity discussion)\n   - \"What would happen if you put a cup of water outside on a freezing night? Would it still look like water the next morning?\" (Connect to personal experience)\n\n3. **Wonder Prompt:** \n   - \"I wonder: Does the amount of water change when it freezes? Is frozen water still water, just in a different form?\"\n   - Write student wonderings on chart paper to revisit later.\n\n4. **Transition:** \"Today, we're going to investigate what happens to water when it gets really cold, and we'll discover why water always falls downward in fountains.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students conduct hands-on investigations to discover how temperature changes water and how gravity affects water motion.\n\n**Materials:**\n- 1 clear plastic cup per pair of students\n- 1 ice cube or small amount of crushed ice per pair\n- Warm water (teacher-prepared in pitcher)\n- Cold water (from the tap or cooler)\n- Food coloring (optional, for visibility)\n- Thermometer (1 per pair)\n- Ruler or meter stick\n- Paper towels\n- Recording sheet (provided below)\n- Small plastic ball or marble (per pair)\n\n**Activity:**\n\n**Part A: Investigating Freezing Water (12–15 minutes)**\n\n1. **Setup:** Distribute materials to each pair. Give students this task card:\n\n   > **Investigation Task: What Happens to Frozen Water?**\n   > \n   > 1. Observe your ice cube closely. Describe its appearance, texture, and color on your recording sheet.\n   > 2. Gently touch the ice. How does it feel different from liquid water?\n   > 3. Pour warm water (from teacher's pitcher) into your cup about halfway.\n   > 4. Place the ice cube into the warm water. Watch what happens for 2–3 minutes.\n   > 5. Measure and record the temperature of the water before and after the ice melts (if time allows).\n   > 6. Observation question: Is the melted ice still water? How do you know?\n\n2. **Teacher Role:** Circulate and ask guiding questions:\n   - \"What changes are you observing?\"\n   - \"Do you think the ice was always a solid, or did it become solid?\"\n   - \"Where do you think the cold is coming from in the ice?\"\n\n3. **What to Record:** Students sketch the ice before and after, note temperatures, and write 2–3 sentences describing the changes.\n\n**Part B: Investigating Gravity (8–10 minutes)**\n\n1. **Setup:** Students stay in pairs. Distribute a plastic ball or marble and a ruler.\n\n2. **Task Card:**\n\n   > **Investigation Task: How Does Gravity Work?**\n   > \n   > 1. Hold the ball at arm's height above the desk.\n   > 2. Let go without throwing it. Where does it fall? Record the direction.\n   > 3. Drop it from different heights (shoulder height, above your head). Does it always fall the same direction?\n   > 4. Try to make it fall sideways or upward without throwing it. What happens?\n   > 5. Draw arrows on your paper showing the direction the ball falls every time.\n\n3. **Connection:** \"In the fountain photograph, imagine the water falling from the top. What force makes it fall down instead of up or sideways?\"\n\n4. **Teacher Role:** Ask: \"Which direction did it always fall? What do you think pulls it down?\"\n\n**Expected Student Outcomes:**\n- Students observe that ice melts into liquid water (phase change) and that the water is still water, just in a different form.\n- Students measure and notice that temperature changed during melting.\n- Students discover that dropped objects always fall downward—they do not fall sideways, upward, or in random directions.\n- Students predict that gravity is the force making water fall downward in the fountain.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to the science concepts.\n\n**Materials:**\n- Chart paper and markers\n- Vocabulary cards (printed or written)\n- Photograph of frozen fountain (to reference throughout)\n- Digital thermometer or class thermometer (optional, for demonstration)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2–3 pairs to share their observations from Part A and Part B.\n   - Ask: \"What surprised you?\" and \"What stayed the same in your observations?\"\n   - Record key observations on chart paper.\n\n2. **Introduce Vocabulary (8–10 minutes):**\n\n   Teach these five terms with student-friendly definitions and examples:\n\n   | **Term** | **Student-Friendly Definition** | **Example from Lesson** |\n   |----------|--------------------------------|------------------------|\n   | **Gravity** | An invisible force that pulls objects downward toward Earth. | The ball falling straight down when you dropped it; water falling down in the fountain. |\n   | **Freezing** | A physical change when a liquid becomes a solid because it gets very cold. | Ice cubes forming from water; the fountain freezing during winter. |\n   | **Melting** | A physical change when a solid becomes a liquid because it gets warm. | Ice cubes turning back into water in warm water. |\n   | **Physical Change** | A change in how something looks or feels, but it is still the same material. | Water freezing into ice—still water, just in a different form. |\n   | **States of Matter** | The different forms that materials can take: solid (like ice), liquid (like water), or gas. | Ice is solid, water is liquid, and steam (from boiling water) is gas. |\n\n3. **Connect Back to the Photograph (4–5 minutes):**\n   - Point to the fountain. \"The water in this fountain is frozen solid. That means gravity is still pulling down on it, but instead of flowing like liquid water, the ice stays frozen in place.\"\n   - \"When it gets warmer, the ice will melt back into liquid water, and gravity will pull it down through the fountain again.\"\n   - \"The water hasn't gone away—it just changed forms!\"\n\n4. **Check for Understanding:**\n   - Ask students: \"If I freeze a cup of water, is it still water?\" (Yes, it's just in a different state.)\n   - \"Why does water in a fountain flow downward and not upward?\" (Gravity pulls it down.)\n   - \"What do we call it when ice turns into water?\" (Melting)\n\n**Expected Student Outcomes:**\n- Students can name and define gravity, freezing, melting, physical change, and states of matter.\n- Students can explain that gravity causes water to fall in fountains.\n- Students understand that freezing is a physical change and water is still water when frozen.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply concepts to a new scenario and deepen their understanding of gravity and phase changes.\n\n**Materials:**\n- Small plastic bottles with spray tops (1 per pair)\n- Water\n- Food coloring (optional)\n- Measuring cups\n- Freezer access (or pre-prepared frozen bottles brought from home/prepared earlier)\n- Paper and colored pencils for design\n- Optional: images of real fountains in different climates\n\n**Activity:**\n\n**Option A: Design a Fountain for Different Climates (recommended for most classes)**\n\n1. **Scenario Setup:** \n   - \"Scientists and architects design fountains for cities around the world. Some cities are very cold in winter, and some are very hot. How would gravity and freezing affect a fountain in Alaska compared to a fountain in Florida?\"\n\n2. **Student Task:**\n   - Provide students with images or descriptions of fountains in cold vs. warm climates.\n   - Pairs design a fountain for either a cold place OR a warm place.\n   - On paper, they sketch their fountain and write:\n     - \"In my location, the temperature is ______ (hot/cold).\"\n     - \"I predict that the water in my fountain will _____ (freeze/stay liquid) because ______.\"\n     - \"Gravity will pull the water _____ (direction and why).\"\n     - \"To keep my fountain working in winter/summer, I would ______.\"\n\n3. **Teacher Role:** Facilitate by asking:\n   - \"What would prevent a fountain from freezing in winter?\"\n   - \"How does gravity work the same way everywhere on Earth?\"\n   - \"Would a fountain work differently on a very hot day?\"\n\n**Option B: Freeze a Fountain in a Bottle (if freezer time permits)**\n\n1. Students fill a small spray bottle with colored water (if available).\n2. Teacher places bottles in freezer during lunch or earlier in the day.\n3. Students observe the frozen water in the bottle and predict: \"If we sprayed this frozen water, what would happen? Could it flow like a fountain?\"\n4. As it melts, students observe gravity pulling the water downward.\n\n**Expected Student Outcomes:**\n- Students apply understanding of gravity and freezing to a real-world scenario.\n- Students predict how temperature affects fountain function.\n- Students demonstrate that gravity works the same way everywhere (PS2-1).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of gravity, freezing/melting, and matter conservation.\n\n**Activity:**\n\n**Formative Assessment (ongoing, during lesson):**\n- Observe students during Explore phase—do they correctly identify that ice is frozen water?\n- Listen to their explanations of why the ball falls downward.\n- Check recording sheets for accurate descriptions and measurements.\n\n**Exit Ticket (Summative Assessment):**\nProvide each student with this exit ticket to complete independently:\n\n---\n\n**EXIT TICKET: Frozen Fountain**\n\n**Name: ___________________________     Date: _______________**\n\n**1. Look at this picture of the frozen fountain. Draw an arrow showing the direction gravity pulls the water.** (Provide a simple sketch of the fountain.)\n\n**2. True or False (circle one): When ice melts, the water disappears.** \n   - TRUE / FALSE\n   - Explain your answer: _______________________________________________\n\n**3. Why do you think the fountain froze in the photograph?**\n   - A) The water evaporated.\n   - B) The temperature got very cold.\n   - C) Gravity stopped working.\n   - D) Someone turned off the fountain.\n\n**4. If you left a cup of water outside on a freezing night, what would happen to it? Why?**\n   ________________________________________________________________\n\n**5. On a scale of 1–4, how well do you understand what gravity is?**\n   - 1 = Not at all     2 = A little     3 = Pretty well     4 = Very well\n\n---\n\n**Success Criteria:**\n- **Mastery:** Student correctly identifies gravity's direction, explains that ice is frozen water (not disappearing), and provides reasoning using temperature.\n- **Proficient:** Student answers 3–4 questions correctly and shows understanding of freezing as a physical change.\n- **Developing:** Student shows some understanding but confuses freezing with disappearance or cannot identify gravity's direction.\n\n**Expected Student Outcomes:**\n- Students demonstrate that they can identify gravity's downward direction.\n- Students understand that freezing is a reversible physical change.\n- Students explain temperature's role in phase changes.\n- Students apply learning to predict real-world outcomes.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified Vocabulary Cards:** Provide students with visual vocabulary cards showing ice/water with simple labels. Allow them to reference these during discussion and exit ticket.\n\n2. **Sentence Frames:** During share-outs and exit ticket, provide sentence starters:\n   - \"Gravity pulls the water ___________.\"\n   - \"When the ice melted, ___________.\"\n   - \"The fountain froze because ___________.\"\n\n3. **Paired Investigation with Teacher Check-In:** Pair struggling students with more confident peers during Explore. Check in every 2–3 minutes to verify understanding and redirect observations (\"Look at the ice—is it still there or gone? What changed?\").\n\n### Challenge (for advanced learners):\n\n1. **States of Matter Deep Dive:** Challenge students to investigate all three states: solid (ice), liquid (water), and gas (steam from warm water). Ask: \"Can you predict what will happen if we heat water very hot? What is that gas called?\" (Introduce evaporation/condensation if appropriate.)\n\n2. **Gravity Investigation Extension:** Provide different objects (feather, rock, paper, penny) and ask students to drop them simultaneously. Ask: \"Does gravity pull different objects at different speeds? Why do some seem to fall slower?\" (Introduce air resistance as a complication factor.)\n\n3. **Design Challenge:** \"If you were an engineer hired to build a fountain in Canada, where it snows, what special features would you design to keep it working in winter?\" Students sketch and explain (heating system, different materials, drainage system, etc.).\n\n---\n\n## Extension Activities\n\n1. **Fountain Building Project:** Students design and build a small working fountain using a plastic bottle, cup, and water pump (or gravity flow). They must explain how gravity makes their fountain work and predict what would happen if they froze the water.\n\n2. **Temperature and Freezing Investigation:** Students test how long it takes water in different containers (wide vs. narrow, thick vs. thin walls) to freeze, measuring temperature every 10 minutes. They graph results and explain why some containers freeze faster (relate to surface area and heat transfer).\n\n3. **Water Cycle Connection:** Connect to the water cycle by having students trace what happens to fountain water year-round: evaporation on hot days, freezing in winter, melting in spring. Create a diagram showing how gravity, temperature, and the water cycle work together in real fountains across seasons.\n\n---\n\n## Teacher Notes\n\n- **Safety:** If using warm water from a kettle, handle it yourself and allow it to cool slightly before distributing to students. Have a clear cooling station away from walking paths.\n- **Thermometer Safety:** If thermometers are glass, demonstrate proper handling and supervise closely during use.\n- **Freezer Access:** Pre-freeze bottles of colored water the day before if your school has limited freezer access, so the elaboration activity can proceed smoothly.\n- **Photograph Discussion:** The frozen fountain is visually striking and developmentally appropriate for Fifth Graders. Use it repeatedly throughout the lesson to anchor discussions back to real-world application.\n\nThis lesson grounds physical science concepts in an observable, engaging phenomenon and builds from exploration to formal understanding.",
  "inputTokens": 2941,
  "outputTokens": 4077,
  "cost": 0.023326,
  "generatedAt": "2026-02-12T23:22:43.490Z"
}