{
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Frozen Water Science\n\n## Core Science Concepts from Image Analysis\n\n- **Water changes state:** The fountain shows water that has frozen into ice (solid state) due to cold temperatures, demonstrating changes in matter.\n- **Light and shadows:** Ice on the fountain reflects and refracts light differently than liquid water, creating visible details and shadows that help us see the frozen structure.\n- **Properties of materials:** Ice is hard and brittle (unlike liquid water), showing how the same material has different properties in different states.\n- **Gravity and motion:** Water flows downward through the fountain layers due to gravitational force, and frozen water remains in the position where it was when it solidified.\n\n---\n\n## Lesson Title\n\n**The Frozen Fountain: How Cold Changes Water**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or one 75-90 minute block)\n- **NGSS Standards:** \n  - 1-PS4-2 (Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated)\n  - 1-PS4-3 (Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light)\n  - *Implicit connection to properties of matter through exploration of ice vs. water*\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Observe and describe how ice looks different from liquid water and explain that cold temperature changes water into ice.\n2. Compare how light passes through or reflects off ice, liquid water, and other materials.\n3. Investigate how objects can be seen differently depending on whether they are made of ice, water, or other materials.\n4. Use sensory observations (sight, touch, and careful listening) to gather evidence about the properties of frozen water.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of the frozen fountain.\n\n**Materials:**\n- Printed or projected color photograph of the frozen fountain (8x10\" minimum, or classroom projector)\n- Chart paper and markers\n- Optional: small cup of ice cubes for students to hold briefly\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or wall at student eye level. Allow 30-40 seconds of silent observation before speaking.\n\n2. **Introduce with wonderment:** \"Today we're looking at a very special fountain. But something unusual has happened to it! Let's look carefully and see what you notice.\"\n\n3. **Ask these specific discussion questions one at a time, allowing 10-15 seconds of think-time before calling on students:**\n   - \"What do you see covering the fountain? What color is it?\"\n   - \"Have you ever seen water like this before? When or where?\"\n   - \"This fountain usually has water running down it like rain. What do you think happened to the water?\"\n   - \"Why do you think the water looks hard and pointy instead of wet and flowing?\"\n\n4. **Record student observations on chart paper.** Use student language exactly as they say it (e.g., \"It looks like it's sleeping,\" \"It's cold,\" \"It turned into something white and hard\").\n\n5. **Prediction/Wonder prompt:** \"I wonder what happens when water gets very, very cold. Let's find out together. You're going to become water scientists today!\"\n\n**Transition:** \"In the next part of our lesson, you're going to do an experiment where you freeze water just like the fountain, and we'll discover what happens.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover how cold changes water through hands-on freezing and observation.\n\n**Materials (per student pair or small group):**\n- Small clear plastic cup or container (4-6 oz)\n- Tap water (room temperature, pre-measured in a pitcher)\n- Freezer access (teacher pre-freezes samples OR students place cups in freezer and return after 10-15 minutes)\n- Ice cubes from home freezer (backup/immediate use)\n- Observation recording sheet (simple picture chart—see below)\n- Crayons or colored pencils\n- Optional: plastic spoon for safe touching/handling of ice\n\n**Activity:**\n\n**Student Directions (delivered orally and posted as picture cards):**\n\n1. \"Pour water into your cup until it's about half full. Look at the water carefully. Draw or color what it looks like on your paper. Is it clear? What color is it?\"\n\n2. \"Now, hold an ice cube in your hand (teacher models with a spoon for safety). How does it feel? Is it cold? Is it hard or soft? Draw what the ice looks like. Is it clear like water or white?\"\n\n3. \"Compare: Put your cup of water next to the ice cube. How are they different? Draw both pictures on your paper.\"\n\n4. \"Prediction: What do you think will happen if we put the water in the freezer for a long time?\"\n\n5. **Teacher facilitates freezing:** Place cups in freezer. While waiting, students draw predictions. Return to frozen samples after 10-15 minutes.\n\n6. \"Now look at your water again. What changed? Draw a picture of what you see now. Does it look like the ice cube? Does it look like the fountain in our photograph?\"\n\n7. **Observation recording:** Students complete simple three-box chart:\n   - Box 1: \"Water before freezing\" (drawn)\n   - Box 2: \"Water after freezing\" (drawn)\n   - Box 3: \"How they are different\" (drawn or dictated to teacher/aide)\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What do you notice?\" \"Is it still wet?\" \"Can you move it?\" \"Is it harder than before?\" \"Does it look like our fountain?\"\n- Do NOT say \"This is ice\" or explain concepts. Let students discover through observation.\n- Support safe handling of ice and freezers.\n- Scribe student observations on their sheets as needed.\n\n**Expected Student Outcomes:**\n- Students will draw or sketch the transformation from liquid water to ice.\n- Students will use words like \"hard,\" \"cold,\" \"white,\" \"clear,\" \"pointy,\" \"shiny,\" \"changed.\"\n- Students will make a connection: \"The water became like the fountain!\"\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after hands-on exploration.\n\n**Materials:**\n- Chart paper with vocabulary written in large print\n- Photograph of frozen fountain (displayed again)\n- Two clear containers: one with water, one with ice\n- Flashlight or lamp (for Part 2 of this phase)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):** \n   - Ask volunteers to show their observation sheets to the class.\n   - Ask: \"What did you discover? What happened to the water?\"\n   - Record key words students used on chart paper.\n\n2. **Introduce vocabulary (5-7 minutes):**\n   - Display each term on chart paper one at a time. Use the photograph and the water/ice containers to illustrate.\n\n3. **Connect back to fountain:** \n   - \"Look at our fountain picture again. We now know that the water in this fountain froze, just like your water in the cup. The cold made the water turn hard. The water is the same water, but it changed shape and how it feels.\"\n\n4. **Light exploration with ice (3-5 minutes):**\n   - Shine a flashlight through the clear container with water. Observe how light passes through.\n   - Shine the same light through the ice. Ask: \"What do you see? Does the light go through the same way? Can you see through it as clearly?\"\n   - Note: This bridges to 1-PS4-3 (light interacting with different materials).\n\n5. **Check for understanding:**\n   - \"Turn to a partner and whisper: What happened to the water when it got very cold?\"\n   - Watch for responses like: \"It froze,\" \"It got hard,\" \"It turned to ice,\" \"It became cold.\"\n\n**Vocabulary:**\n\n| Term | First Grade Definition |\n|------|----------------------|\n| **Freeze** | When water gets so cold that it becomes hard and turns into ice. |\n| **Ice** | Water that has become hard and cold. It's still water, but in a different form. |\n| **Solid** | Something hard that keeps its shape, like ice or a rock. |\n| **Liquid** | Something wet that can pour and spread, like water. |\n| **Temperature** | How hot or cold something is. |\n\n**Expected Student Outcomes:**\n- Students can name the process: \"freezing\" or \"water freezes.\"\n- Students understand that water and ice are the same material in different states.\n- Students recognize that ice forms when water gets very cold.\n- Students begin to observe how light behaves differently with ice vs. water.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen understanding by exploring how ice properties affect light and visibility.\n\n**Materials (per student or pair):**\n- Flashlight or small lamp\n- Clear cup with ice cubes\n- Clear cup with water\n- Clear cup with crushed ice\n- Dark-colored construction paper (black or dark blue)\n- Optional: plastic wrap or clear plastic sheet\n\n**Activity:**\n\n**\"Ice Light Detective\" Investigation:**\n\n1. **Teacher sets up three stations or demonstrates whole-group:**\n   - Station A: Flashlight shining through water\n   - Station B: Flashlight shining through ice cube\n   - Station C: Flashlight shining through crushed ice\n\n2. **Student task:** \n   - \"You are a light detective. Your job is to figure out: Which one lets light through the clearest? Which one makes the light bouncy or scattered? Which one is the hardest to see through?\"\n   - Students observe and use picture cards to record: ✓ (light goes through clearly), △ (light bounces around), ✗ (can't see light through it).\n\n3. **Guided discovery questions:**\n   - \"Can you see the flashlight's light through the water?\"\n   - \"What about through the ice cube? Is it the same or different?\"\n   - \"Look at the crushed ice. What happens to the light?\"\n   - \"Why do you think the fountain made the ice look all sparkly and bright in our photograph?\"\n\n4. **Connection to fountain:** \n   - Display the photograph again. \"When light hit the frozen fountain, it didn't go straight through like water. It bounced around and made it shine and sparkle. That's why the ice fountain looks so bright and shimmery!\"\n\n**Teacher Role:**\n- Facilitate investigations without explaining results.\n- Ask: \"What do you notice?\" \"Is it the same as before?\" \"Why do you think that happened?\"\n- Help students see the connection between their small-scale ice and the real fountain's ice.\n\n**Expected Student Outcomes:**\n- Students observe that ice and water interact with light differently.\n- Students use evidence from their observations to explain what they see.\n- Students understand that the fountain looks sparkly because of how light bounces off ice.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of water freezing, ice properties, and how light interacts with different materials.\n\n**Activity:**\n\n**Formative Assessment (Ongoing throughout lesson):**\n- **Observation checklist during Explore phase:** Can students describe water vs. ice using sensory language? Do they make the connection to the fountain?\n- **Listen to partner conversations during Explain phase:** Do students use vocabulary correctly (ice, freeze, cold)?\n- **Observation during Elaborate phase:** Can students make predictions about light behavior and explain their observations?\n\n**Exit Ticket/Summative Assessment (5-7 minutes at lesson end):**\n\n**Option A: Picture-Based Exit Ticket**\nProvide a simple sheet with three pictures:\n1. A cup of liquid water\n2. An ice cube\n3. The frozen fountain\n\nAsk students (orally, teacher scribes, or student points): \n- \"Point to the one that is frozen water.\" (Should point to 2 and 3)\n- \"When water gets very cold, what happens?\" (Listen for: \"It freezes,\" \"It turns to ice,\" \"It gets hard.\")\n- \"Why does the fountain in our picture look shiny and bright?\" (Listen for: \"Light bounces off the ice,\" \"The ice is sparkly,\" \"Light goes off it.\")\n\n**Option B: One-Question Conversation Exit Ticket**\nTeacher asks individual students: \"If we left water outside in the freezing cold all night, what would happen to it?\"\n\n**Success Criteria for Student Understanding:**\n✓ Student can identify the difference between water and ice.\n✓ Student can explain that cold causes water to freeze.\n✓ Student can describe ice using words like \"hard,\" \"cold,\" \"shiny.\"\n✓ Student connects the frozen fountain to the freezing process they observed.\n✓ Student shows evidence of observing how light interacts with ice (optional, more advanced).\n\n**Expected Student Outcomes:**\n- At least 80% of students will correctly identify that ice is frozen water.\n- At least 75% of students will explain that \"cold makes water hard\" or similar language.\n- At least 60% of students will make a connection to the fountain photograph.\n\n---\n\n## Differentiation\n\n### Support (for students needing scaffolding):\n\n1. **Simplified vocabulary cards:** Use picture + word cards (water, ice, cold, freeze) students can hold and reference during discussions.\n\n2. **Guided observation sheet:** Instead of drawing, provide a sheet with labels and blanks to fill in with teacher support:\n   - \"Water is _____ (wet/clear/cold).\"\n   - \"Ice is _____ (hard/cold/clear).\"\n   - \"Cold makes water turn into _____.\"\n\n3. **Hands-on manipulation:** Allow extra time handling ice and water; sit near the teacher during demonstrations for close support and oral processing.\n\n4. **Pre-teaching:** Show ice and water 1-2 days before the lesson so the concepts are familiar.\n\n### Challenge (for advanced learners):\n\n1. **Deeper light investigation:** Ask: \"Can you think of other materials that light goes through? What about plastic wrap? Wax paper? How is ice like or different from these?\" Provide materials to test and compare.\n\n2. **Predict and explain:** \"If we left the ice cup in the classroom (not the freezer) for one hour, what would happen? Why? Draw and explain your prediction.\"\n\n3. **Three-state exploration:** Introduce the idea of steam/water vapor: \"We learned water can be liquid and solid (ice). Can water be something else? What happens if we boil water?\" (Teacher demonstrates with supervision; students observe steam and discuss safely.)\n\n4. **Real-world connection:** \"Why would a fountain freeze outside in winter but not inside your house? What's different?\" (Introduces idea of temperature and environment.)\n\n---\n\n## Extension Activities\n\n1. **Freezing Art Project:** \n   - Provide small cups with water, food coloring, and items to freeze (sequins, small plastic toys, leaves).\n   - Students create frozen art and observe how items look inside ice.\n   - Connect: \"How is this like the fountain? What's the same and different?\"\n\n2. **Ice Cube Race:**\n   - Students place ice cubes on different surfaces (sunny windowsill, shaded table, in water, outside).\n   - Predict and observe which melts fastest and why.\n   - Record daily observations over 3-5 days.\n   - Discuss: \"What made the ice go back to water?\"\n\n3. **Winter Water Hunt:**\n   - On a winter day (or simulate with photos), take students outside to look for frozen water: puddles, frost, icicles, snow.\n   - Ask: \"Where is the frozen water? Why did it freeze there?\"\n   - Create a class \"Ice Found\" map or chart.\n\n4. **Sensory Description Game:**\n   - Play \"Freeze Dance\" or a game where students become ice cubes (frozen, hard to move, solid).\n   - Compare to \"water dancing\" (flowing, moving freely).\n   - Debrief: \"How did your body feel frozen vs. moving like water?\"\n\n5. **Home Connection:**\n   - Send home a simple observation sheet: \"Freeze water at home in the freezer. Draw what you see. Bring it back to show the class.\"\n   - Or: \"Find things that are frozen or cold at home (ice from the freezer, frost on windows). Draw them and bring pictures.\"\n\n---\n\n## Teacher Notes for Success\n\n- **Timing:** If using a freezer, plan ahead. Pre-freeze backup ice cubes the night before in case you need them for immediate exploration.\n- **Safety:** Model safe handling of ice and freezer access. Use spoons or tongs if students are sensitive to extreme cold.\n- **Photograph engagement:** The frozen fountain is visually striking—let students' wonder drive the lesson. Their observations are data.\n- **Vocabulary reinforcement:** Repeat freeze/ice/cold consistently. Create a classroom word wall that stays up throughout winter.\n- **Real-world connection:** This lesson is perfect for winter weather. If it's not cold outside, the contrast between the icy fountain photo and warm classroom makes the concept more concrete.\n- **Assessment notes:** First graders are not expected to understand state changes fully; focus on observation and description. The ability to say \"cold makes water hard\" is success at this level.",
  "inputTokens": 2879,
  "outputTokens": 4080,
  "cost": 0.023279,
  "generatedAt": "2026-02-12T23:19:40.791Z"
}