{
  "title": "Fountain",
  "category": "physical-science",
  "imageFile": "fountain.jpeg",
  "imagePath": "images/physical-science/fountain.jpeg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Frozen Fountain Investigation\n## Fourth Grade Physical Science\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Energy Transfer:** Water in the fountain continuously moves and cycles, demonstrating how energy causes motion and change in matter (the freezing of moving water creates the icy formations visible in the photograph).\n- **Phase Change and Heat Energy:** The ice coating on the fountain shows what happens when thermal energy is removed from water—a dramatic visible example of how temperature affects matter's state.\n- **Force and Motion:** The fountain's water jets create movement, and students can observe how gravity pulls water downward while the pump's force pushes it upward—opposing forces in action.\n- **Properties of Materials:** Ice has distinctly different properties (solid, brittle, reflective) compared to liquid water, making this an ideal observable example of how matter changes when energy conditions change.\n\n---\n\n### Lesson Title\n\n**Freezing Fountains: How Cold Changes Moving Water**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 75-90 minutes (can be split into two 45-minute sessions)\n- **NGSS Standards:** \n  - 4-PS3-2: Make observations to provide evidence that energy can be transferred from place to place by sound, light, heat, and electric currents.\n  - 4-PS3-1: Use evidence to construct an explanation relating the speed of an object to the energy of that object.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** how temperature affects the state of water (liquid to solid).\n2. **Explain** that removing thermal energy causes water to freeze and change its properties.\n3. **Predict and test** what happens to moving water when it becomes very cold.\n4. **Use evidence** from their investigation to show how energy changes matter.\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about the frozen fountain and activate prior knowledge about water and cold.\n\n**Materials:**\n- Projected or printed photograph of the frozen fountain\n- Chart paper and markers\n- Ice cube (brought to room temperature or slightly melted to show it's frozen water)\n\n**Activity:**\n\n1. **Display the photograph** of the frozen fountain on a projector or large printout. Let students observe silently for 20-30 seconds before asking questions.\n\n2. **Ask these engagement questions:**\n   - \"What do you notice about this fountain? What looks different about it compared to a regular fountain?\"\n   - \"That white, crusty stuff—what do you think it is? Where did it come from?\"\n   - \"Why would a fountain in a warm place like this get frozen? What would have to happen?\"\n   - \"If you touched this fountain, how would it feel different from a regular wet fountain?\"\n\n3. **Show an ice cube** and ask: \"This is frozen water, just like what's on that fountain. What do you already know about ice? How is it different from the water we drink?\"\n\n4. **Prediction Prompt:** \"I'm going to show you how water can freeze on something moving. Before we do that, predict: What do you think happens to water when it gets really, really cold? Does it still move the same way?\"\n\n5. **Record predictions** on chart paper. Save this to revisit in the Explain phase.\n\n**Transition:** \"Today, we're going to do an experiment where we freeze water on something moving—just like what happened to this fountain—and discover what happens to water and energy when it gets cold.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate firsthand how cold affects moving water through a hands-on experiment.\n\n**Materials (per pair or small group):**\n- Small battery-operated fan (or hand fan)\n- Spray bottle filled with water\n- Shallow tray or cookie sheet\n- Thermometer (optional, for advanced observation)\n- Paper towels\n- Small cups of water (room temperature) for comparison\n- Observation worksheet (see below)\n\n**Activity: \"Freezing Water in Motion\" Investigation**\n\n**Step-by-Step Student Directions:**\n\n1. **Set up:** Place your spray bottle, fan, and shallow tray at your investigation station.\n\n2. **Observation 1 - Room Temperature Water:** \n   - Spray water from your bottle into the air while the fan is OFF. \n   - Watch the water fall. Describe: Does it move fast or slow? Does it stay in one place or spread out? Record on your worksheet.\n\n3. **Observation 2 - Testing Cold Water:**\n   - **Teacher has pre-prepared:** Put spray bottles in a freezer for 30-45 minutes before the lesson so the water is very cold (but not yet frozen—around 32-35°F).\n   - Spray the very cold water from the frozen bottle into the air while the fan is OFF.\n   - Describe: Does it move the same way? What looks different?\n\n4. **Observation 3 - Creating Frost:**\n   - Place your shallow tray on a table.\n   - Spray the very cold water onto the tray's surface using multiple sprays.\n   - Use the fan on LOW setting to blow the spray across the tray.\n   - Watch what happens to the water on the cold surface. Does it stick? Does it look different?\n\n5. **Observation 4 - Recording:**\n   - Every 30 seconds, spray more cold water while the fan blows.\n   - After 2-3 minutes, observe closely: Has anything changed? Does the tray feel cold? Can you see ice crystals forming?\n   - Record or sketch what you see.\n\n**Connection to the Photograph:**\n- Ask: \"Remember the fountain photo? Water was spraying into the air, and it was very cold outside. What do you think happened to that water as it sprayed?\"\n\n**Student Documentation:**\n- Provide an **Observation Worksheet** with sections for:\n  - Comparison drawings (room-temp water vs. cold water)\n  - Descriptions of how water moved differently\n  - Predictions about where the ice came from\n  - Sketches of crystal formations (if visible)\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What do you notice about how the cold water behaves? Is it the same as room-temperature water? Where is the water getting energy from? Where is the energy going?\"\n- Do NOT explain the concept yet; instead, ask students to describe what they observe.\n- Ensure safe handling of cold water; have paper towels ready.\n\n**Expected Student Outcomes:**\n- Students observe that very cold water sprays differently than room-temperature water.\n- Students notice frost or ice crystals beginning to form on cold surfaces.\n- Students record visual evidence and descriptions of changes in water's behavior and appearance.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to energy concepts.\n\n**Materials:**\n- Chart paper and markers\n- Observation worksheets from Explore phase\n- Photograph of the frozen fountain\n- Thermometer showing temperature scale\n- Optional: animation or short video clip (30-60 seconds) showing water freezing\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3-4 student pairs to share one observation from their worksheet.\n   - Create a list on chart paper: \"What We Noticed About Cold Water\"\n   - Affirm observations like: \"It moved slower,\" \"It got stuck to the tray,\" \"It looked frosty,\" \"It spread differently.\"\n\n2. **Introduce Key Vocabulary (8 minutes):**\n   - Use student observations to introduce each term naturally.\n\n   **Vocabulary with Student-Friendly Definitions:**\n   - **Thermal Energy (or Heat Energy):** The energy that makes things warm or cold. When thermal energy leaves water, it gets colder.\n   - **Freezing:** What happens when water gets so cold that it changes from a liquid (can pour and flow) into a solid (ice, hard and fixed shape).\n   - **Phase Change:** When matter changes from one state to another—like water changing into ice. The matter is still water, but it looks and acts completely different.\n   - **Energy Transfer:** When energy moves from one place to another. In our investigation, thermal energy left the water, and the water changed from liquid to solid.\n   - **State of Matter:** The form something is in—solid (ice), liquid (water), or gas (steam).\n\n3. **Connection to the Photograph (5 minutes):**\n   - Display the frozen fountain photo again.\n   - Explain: \"Outside the building, the temperature dropped below freezing (below 32°F). The thermal energy left the moving water in the fountain. Without that warmth, the water's state changed from liquid to solid—it froze. That's why we see all that ice and frost on the fountain. The water is still water, but now it's in solid form!\"\n   - Point to specific parts of the photo: \"See how the water froze while it was spraying? The ice stuck to the fountain's shape because the water froze mid-motion.\"\n\n4. **Check for Understanding:**\n   - Ask: \"If we brought that frozen fountain inside where it's warm, what would happen to the ice?\"\n   - Ask: \"Where did the ice on the fountain come from? Was it always there, or did it change?\"\n   - Have students turn to a partner and explain: \"What has to happen to water to turn it into ice?\"\n\n**Expected Student Outcomes:**\n- Students can define freezing and thermal energy in their own words.\n- Students can explain that ice is frozen water, not a different substance.\n- Students understand that removing thermal energy causes water to freeze.\n- Students can connect their experiment to the frozen fountain.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Apply energy and freezing concepts to a new scenario; deepen understanding through prediction and testing.\n\n**Materials:**\n- Pre-made popsicle sticks or craft sticks\n- String or yarn\n- Cups of water at various temperatures (ice water, room temp, warm water—labeled 1, 2, 3)\n- Food coloring (optional, for visual interest)\n- Freezer access or pre-frozen containers\n- Timer\n- Thermometers (if available)\n- Student Recording Sheet: \"Freezing Rate Challenge\"\n\n**Activity: \"Which Water Freezes Fastest?\"**\n\n1. **Scenario Introduction:**\n   - \"If someone wanted to make ice pops using different temperatures of water, which one would freeze the fastest? Let's predict and test!\"\n\n2. **Student Prediction (3 minutes):**\n   - Show three cups labeled with temperatures: \"Ice Water (very cold),\" \"Room Temperature (medium),\" and \"Warm Water (hot)\"\n   - Students predict which will freeze fastest and explain their reasoning.\n   - Record: \"I think _____ will freeze fastest because _____.\"\n\n3. **Setup (2 minutes):**\n   - Place a stick in each cup.\n   - Add food coloring if desired.\n   - Place all three in a freezer (or use pre-frozen setup if time is limited).\n\n4. **Observation & Recording (8 minutes):**\n   - Check every 2 minutes and record which one shows signs of freezing first.\n   - Observe the order: Does ice form at the top or bottom? What does it look like?\n   - Record observations: \"After 2 minutes: _____ has started to freeze.\"\n\n5. **Discussion (2 minutes):**\n   - \"Why did the coldest water freeze fastest? What does that tell us about thermal energy?\"\n   - Connect back: \"The water that already had less thermal energy didn't need to lose as much to freeze. The warm water had to give up much more thermal energy, so it took longer.\"\n\n**Teacher Role:**\n- Facilitate observations without leading answers.\n- Ask: \"What patterns do you see? Which cup is changing first? Why might that be?\"\n- Help students link their observations to the concept of energy transfer.\n\n**Expected Student Outcomes:**\n- Students predict and observe that water with lower initial temperature freezes faster.\n- Students recognize that more thermal energy must leave warm water before it freezes.\n- Students apply the energy transfer concept to a new situation.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student mastery of learning objectives through formative and summative strategies.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- Monitor **Think-Pair-Share responses** throughout Elaborate phase.\n- Review **Observation Worksheets** for evidence of understanding state changes.\n- Observe **student explanations** when they connect the frozen fountain to thermal energy loss.\n- Listen to **predictions and reasoning** to gauge depth of understanding.\n\n**Summative Assessment - Exit Ticket (5 minutes):**\n\nProvide each student with an index card and ask them to respond to **ONE of the following** (teacher selects based on class level):\n\n**Version A (Standard):**\n- \"Draw or write: What happens to water when thermal energy leaves it? Use the word 'freeze' or 'frozen' in your answer.\"\n\n**Version B (With Scaffolding):**\n- \"Fill in the blanks: When water gets very _____, thermal energy _____ it. The water changes from a _____ into a _____ (ice).\"\n\n**Version C (Challenge):**\n- \"Explain: Why does water freeze faster in cold temperatures than in warm temperatures? Use the term 'thermal energy' in your explanation.\"\n\n**Success Criteria:**\n\nStudents demonstrate mastery if they:\n- ✓ Correctly identify that freezing is water changing from liquid to solid.\n- ✓ Use the term \"thermal energy\" or \"cold\" to explain the cause of freezing.\n- ✓ Connect their observation from the experiment to the frozen fountain photograph.\n- ✓ Provide evidence-based reasoning (e.g., \"The water froze because it got too cold\").\n\n**Expected Student Outcomes:**\n- 80% of students should correctly identify what freezing is and why it occurs.\n- Most students should make a connection to thermal energy being removed.\n- Exit tickets provide clear evidence of whether students met the learning objectives.\n\n---\n\n### Differentiation\n\n**SUPPORT (For Struggling Learners):**\n\n1. **Sentence Starters & Word Banks:**\n   - Provide sentence frames for observations: \"When the water got cold, it became _____. The ice looked _____ because _____.\"\n   - Offer word choices: liquid/solid, fast/slow, smooth/bumpy, energy/cold.\n\n2. **Reduce Observation Load:**\n   - Pair struggling students with advanced peers during Explore.\n   - Have them focus on one observation task (e.g., \"Watch if the water sticks to the tray\") rather than all four steps.\n   - Provide a simplified worksheet with pictures to label instead of write.\n\n3. **Concrete Comparisons:**\n   - Keep an ice cube and a cup of water side-by-side throughout the lesson.\n   - Have students touch both (safely) to feel the difference in texture and temperature.\n   - Use a thermometer to show the temperature difference visually.\n\n**CHALLENGE (For Advanced Learners):**\n\n1. **Deepen the Energy Investigation:**\n   - Ask: \"If we kept removing thermal energy from ice, what would happen? Can ice become even colder?\" (Introduction to absolute zero and states of matter beyond ice.)\n   - Task: \"Design an experiment to see if freezing happens faster at different freezer temperatures.\"\n\n2. **Apply to Real-World Scenarios:**\n   - Provide scenarios: \"Why do icicles form on roofs? Why does frost appear on grass on cold mornings? Why do frozen pipes burst?\"\n   - Have students write or draw explanations using energy vocabulary.\n\n3. **Quantitative Analysis:**\n   - Have advanced students record exact temperatures using thermometers before, during, and after the Elaborate investigation.\n   - Task: \"Create a graph showing how temperature changes over time. At what temperature does ice form?\"\n\n---\n\n### Extension Activities\n\n**Extension 1: \"Energy Transfer in Winter\" (Cross-Disciplinary)**\n- **Connection to Geography/Life Science:** Research how animals and plants survive in freezing temperatures. Why don't animals freeze solid? How do plants protect themselves?\n- **Activity:** Students create an informational poster: \"How Living Things Handle Cold and Freezing.\"\n- **Time:** 20-30 minutes or homework.\n\n**Extension 2: \"Design a De-Icing Solution\" (Engineering & PS4-4 Connection)**\n- **Scenario:** \"Your school parking lot is covered with ice. You need to melt it. What could you do to add thermal energy back to the ice?\"\n- **Activity:** Students brainstorm solutions (salt, heat lamps, hot water, sand, friction) and predict which would work fastest. Test one solution if time/materials allow.\n- **Connection to NGSS 4-PS3-4:** Design a device or solution to change energy forms.\n- **Time:** 30-40 minutes.\n\n**Extension 3: \"Freezing Point Depression\" (Advanced Science)**\n- **Investigation:** \"Does adding salt to water change its freezing point? Predict, then test.\"\n- **Materials:** Water, salt, ice, thermometers, cups.\n- **Activity:** Students observe that salt lowers the freezing point of water (why roads are salted in winter).\n- **Time:** 25-35 minutes.\n\n---\n\n## Teacher Notes\n\n- **Timing Flexibility:** This lesson can be taught in one 75-90 minute block or split across two days (Engage/Explore on Day 1; Explain/Elaborate/Evaluate on Day 2).\n- **Freezer Prep:** Pre-freeze spray bottles or water samples 30-45 minutes before class to save instructional time.\n- **Safety:** Ensure all water handling is supervised. Cold water is safe but use paper towels to prevent spills.\n- **Accessibility:** The frozen fountain photograph provides a real-world anchor for all subsequent explanations. Revisit it frequently to maintain connection to authentic science.\n- **Standards Alignment:** This lesson directly addresses 4-PS3-2 (energy transfer) and 4-PS3-1 (relating object properties to energy) by providing observable evidence that thermal energy transfer changes water's state and behavior.\n\n---\n\n**Lesson developed with Fourth Grade readiness, NGSS alignment, and 5E instructional rigor in mind. Ready to teach!**",
  "inputTokens": 2957,
  "outputTokens": 4300,
  "cost": 0.024457,
  "generatedAt": "2026-02-12T23:22:01.821Z"
}