{
  "title": "Ice Ball",
  "category": "physical-science",
  "imageFile": "ice_ball.jpg",
  "imagePath": "images/physical-science/ice_ball.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Ice Ball Investigation\n\n## Core Science Concepts from Image Analysis\n\n- **States of Matter and Phase Change:** Water transitions from liquid to solid (freezing), demonstrating how matter changes form while maintaining its identity.\n- **Properties of Materials:** Ice exhibits distinct physical properties (hardness, transparency, brittleness) that differ from liquid water, making it identifiable by its characteristics.\n- **Heat Energy Transfer:** The process of freezing requires removal of thermal energy; melting or sublimation of ice demonstrates energy absorption from the environment.\n- **Conservation of Matter:** The mass of water remains constant before freezing and after—it simply changes form, not quantity.\n\n---\n\n## Lesson Title\n\n**Frozen Water Detective: Exploring Ice and Its Properties**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes (two 45-minute sessions, or one block period)\n- **NGSS Standards:** \n  - 5-PS1-3 (Make observations and measurements to identify materials based on their properties)\n  - 5-PS1-2 (Measure and graph quantities to provide evidence that the total weight of matter is conserved)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Identify and describe the physical properties of ice** using observations (color, texture, transparency, hardness, shape).\n2. **Measure and compare the mass of ice and liquid water** to demonstrate that matter is conserved during state change.\n3. **Explain how freezing changes the properties of water** while the material itself remains water.\n4. **Predict how ice behaves when exposed to different conditions** (heat, pressure, time) based on their observations.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about the ice ball and activate prior knowledge about water in different forms.\n\n**Materials:**\n- Projected image of the ice ball photograph (or printed copies)\n- Blue trays (as shown in image) or observation containers\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on a projector or document camera. Allow 30 seconds of silent observation where students simply look without talking.\n\n2. **Ask these discussion questions** (write them on board as you ask):\n   - \"What do you notice about what's inside the clear ball? What does it remind you of?\" *(Students should observe the white, crystalline appearance)*\n   - \"How do you think this ice ball was made? What had to happen to water to turn it into this shape?\"\n   - \"Do you think the ice weighs the same as the water did before it froze? Why or why not?\" *(Activate prior thinking about conservation)*\n   - \"What happens to ice when you leave it sitting in a warm place? Where does it go?\"\n\n3. **Wonder Prompt:** \"I wonder what will happen if we freeze water in different shapes and then measure them...\" Write student wonderings on chart paper.\n\n**Transition:** \"Today, we're going to become ice detectives. We'll make our own ice balls, measure them carefully, and discover the secrets of frozen water.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate the properties of ice and gather data about mass conservation through hands-on exploration.\n\n**Materials:**\n- Balloons (small to medium, 1 per pair; recommend pre-filling with water before class)\n- Bowls of water (room temperature)\n- Kitchen scales or digital balances (accurate to 0.1 oz or 1-2 grams)\n- Measuring cups\n- Trays (as shown in photograph)\n- Thermometers\n- Paper towels\n- Observation recording sheets (template provided below)\n- Ice cubes (from regular freezer, 1-2 cups per group)\n\n**Student Directions (Provide as printed handout or read aloud):**\n\n1. **Before Freezing:** \n   - Measure exactly 1 cup of room-temperature water in a measuring cup.\n   - Pour the water into a clear balloon and tie it securely.\n   - **Measure and record:** The mass of the water-filled balloon using a kitchen scale. Write this number in the \"Before Freezing\" column on your sheet.\n   - Measure the temperature of the water with a thermometer. Record it.\n\n2. **Freezing Process (Teacher completes overnight or during lunch):**\n   - Teacher places all water-filled balloons in the freezer at least 12 hours in advance.\n   - Balloons freeze solid into ice balls.\n\n3. **After Freezing (Exploration Day):**\n   - Remove the balloon from the frozen ice ball carefully (teacher may do this in advance).\n   - Place the ice ball on a blue tray (as shown in the photograph).\n   - **Observe carefully:** \n     - What does the surface feel like? (Rough? Smooth? Bumpy?)\n     - Can you see through it? Where is it clearest? Where is it cloudiest?\n     - What color is it? Is it all the same color?\n     - What happens when you touch it? (Cold? Slippery?)\n   - **Draw a detailed picture** of the ice ball on your observation sheet. Label any interesting features.\n   - **Measure the mass** of the ice ball (without the balloon). Record this number in the \"After Freezing\" column.\n   - Measure the temperature. Record it.\n   - **Place the ice ball back in the tray** and observe it for 10 minutes. Note: Does it start to change? Does water form around it?\n\n4. **Compare Your Data:**\n   - Look at the mass numbers you recorded. Are they the same or different?\n   - Why do you think this happened?\n\n**Observation Recording Sheet Template:**\n\n| | **Before Freezing (Water)** | **After Freezing (Ice)** |\n|---|---|---|\n| **Mass (weight)** | _____ oz/grams | _____ oz/grams |\n| **Temperature** | _____ °F/°C | _____ °F/°C |\n| **Drawing/Sketch** | (water in cup) | (ice ball—label features) |\n| **Observations (describe using adjectives)** | Transparent? Color? Temperature? | Texture? Color? Appearance? |\n\n**Teacher Role:**\n- Circulate to groups and ask probing questions: \"What do you notice about the surface of the ice? Why do you think it looks like that?\"\n- Encourage students to use descriptive words: crystalline, opaque, translucent, hard, smooth, bumpy.\n- **Do not explain** the concepts yet—guide observation only.\n- Ensure careful measurement and recording of data.\n- Have students compare their \"before\" and \"after\" masses aloud (but don't explain why yet).\n\n**Expected Student Outcomes:**\n- Detailed drawings and descriptions of ice ball properties (clarity, texture, shape, color variations)\n- Recorded mass and temperature measurements\n- Recognition that the ice ball is much colder than water\n- Observation that ice has a different appearance (cloudier in center, crystalline texture) than liquid water\n- Many students will notice the masses are approximately the same (or close)\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce vocabulary and scientific explanations for observations, connecting exploration data to physical science concepts.\n\n**Materials:**\n- Chart paper and markers\n- Vocabulary poster or display (see list below)\n- Computer/projector for showing simple state-change diagram\n- Student observation sheets from Explore phase\n- Whiteboard and markers\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2-3 pairs to share their observations: \"What did your ice ball look like? What was different from water?\"\n   - Record key adjectives on chart paper: *hard, cold, clear in some spots, cloudy in center, slippery, smooth, bumpy texture*.\n   - Ask: \"Did anyone notice their ice ball weighed about the same as the water? Why do you think that is?\"\n\n2. **Introduce Key Vocabulary (10 minutes):**\n   \n   Display and define these terms using student-friendly language:\n\n   - **Freezing:** When a liquid cools down so much that it becomes a solid. Water freezes at 32°F (0°C). *(Point to thermometer readings from Explore phase)*\n   \n   - **Solid:** A material that has a definite shape and takes up a definite amount of space. Ice is solid water. *(Hold up the ice ball; note how it keeps its ball shape)*\n   \n   - **Liquid:** A material that has no definite shape but takes up a definite amount of space. Water is a liquid. *(Show a cup of water)*\n   \n   - **Physical Property:** A characteristic of a material that you can observe with your senses—like color, texture, temperature, or hardness. *(Point to student descriptions: \"bumpy,\" \"cold,\" \"clear\")*\n   \n   - **Conservation of Matter:** The idea that matter doesn't disappear or get created—it just changes form. When water freezes, it becomes ice, but it's still the same amount of \"stuff.\" *(Hold up ice ball and say: \"This ice was water. The water turned into ice, but nothing disappeared. Same amount, different form.\")*\n\n3. **Connect to the Photograph (3 minutes):**\n   - Display the original ice ball photo again.\n   - \"This is exactly what happened in our investigation. The water froze into a solid ice ball. The ice ball looks different from water—it's hard, cold, and has that cloudy appearance in the middle—but it's still water, just in a different form.\"\n\n4. **Check for Understanding:**\n   - Ask: \"If I weighed that water before freezing and weighed the ice ball after freezing, would the weight be the same?\"\n   - Ask: \"What physical properties changed when water became ice? What stayed the same?\" *(Properties changed: hardness, shape, transparency. What stayed: the amount of matter, it's still water.)*\n   - Students give thumbs up/sideways/down to show confidence.\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|---|---|\n| **Freezing** | When something cold becomes so cold it turns from a liquid into a solid. Water freezes at 32°F. |\n| **Solid** | Something that keeps the same shape and doesn't flow. Ice is solid. |\n| **Liquid** | Something that flows and takes the shape of its container. Water is a liquid. |\n| **Physical Property** | Something you can see or feel about a material, like its color, texture, or temperature. |\n| **Conservation of Matter** | The amount of \"stuff\" (matter) doesn't change—it just changes form. Water and ice are the same amount of matter. |\n\n**Expected Student Outcomes:**\n- Students can define freezing and identify water as a liquid and ice as a solid.\n- Students understand that physical properties (appearance, texture, hardness) changed, but the material is still water.\n- Students begin to grasp that the mass stayed the same (or nearly the same) because matter is conserved.\n- Students use vocabulary in their explanations.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting and testing how ice behaves under different conditions, deepening their grasp of properties and state change.\n\n**Materials:**\n- Ice balls or large ice cubes (1 per group)\n- Blue trays\n- Warm water (not boiling; ~100-120°F)\n- Ice water (very cold)\n- Thermometers\n- Paper towels\n- Rock salt (optional, for advanced groups)\n- Timers or stopwatches\n- \"Prediction & Observation\" sheets (template below)\n- Pencils/markers\n\n**Activity:**\n\n**Scenario:** \"We know ice is solid water. But what happens when we change the temperature around the ice? Will it stay a solid forever, or does the heat affect it?\"\n\n**Student Task:**\n\n1. **Make Predictions (5 minutes):**\n   - Divide students into three groups. Assign each group one condition:\n     - **Group A:** Ice in warm water\n     - **Group B:** Ice in ice-cold water\n     - **Group C:** Ice sitting in a room-temperature tray (control)\n   - On the \"Prediction Sheet,\" students write: \"What do you think will happen to the ice in [warm/cold/room temperature] water? Draw and explain.\"\n\n2. **Conduct the Investigation (10 minutes):**\n   - Each group places their ice in their assigned condition.\n   - Every 2 minutes, students **observe and record:**\n     - Does the ice look different? (Smaller? Smoother? Rougher?)\n     - Is there water forming around it?\n     - Use a thermometer to measure the temperature of the water or air around the ice.\n   - Students draw what they see at each time interval (0, 2, 4, 6, 8 minutes).\n\n3. **Compare Results (5 minutes):**\n   - Groups share observations.\n   - Class discusses: \"Why did the ice melt faster in warm water? Why did the ice in cold water barely change?\"\n   - Teacher guides: \"Heat is energy. Warm water has more heat energy than cold water. Heat energy makes the ice change from a solid back into a liquid.\"\n\n**Prediction & Observation Sheet:**\n\n| Time | Group A: Warm Water | Group B: Cold Water | Group C: Room Temperature |\n|---|---|---|---|\n| **Prediction:** What will happen? | (drawing & description) | (drawing & description) | (drawing & description) |\n| **0 minutes** | Observe & sketch | Observe & sketch | Observe & sketch |\n| **2 minutes** | Observe & sketch | Observe & sketch | Observe & sketch |\n| **4 minutes** | Observe & sketch | Observe & sketch | Observe & sketch |\n| **What we learned:** | Why did this happen? | Why did this happen? | Why did this happen? |\n\n**Teacher Role:**\n- Facilitate observations without explaining the results.\n- Ask: \"Why do you think this group's ice changed more than that group's ice?\"\n- Help students notice the connection between temperature and rate of melting.\n- Use the term **melting** (opposite of freezing) when ice turns back to liquid.\n\n**Expected Student Outcomes:**\n- Students observe that ice melts faster in warm water, slower in cold water.\n- Students make the connection: Heat energy causes ice to melt.\n- Students apply the concept of physical properties: ice has a shape and hardness, but when melted, water is a liquid with no fixed shape.\n- Students deepen understanding of conservation: the ice mass becomes water mass.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of properties, state change, and conservation of matter.\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation during Explore:** Did students accurately measure and record data? Could they describe ice properties using adjectives?\n- **Check-for-Understanding Questions in Explain:** Thumbs up/down responses and verbal answers to: \"Would the weight be the same?\" and \"What changed? What stayed the same?\"\n- **Elaborate Predictions:** Did students make reasonable predictions about melting based on temperature?\n\n**Exit Ticket (Summative Assessment):**\n\nProvide each student with a half-sheet. They have 5-7 minutes to respond:\n\n**Exit Ticket Questions:**\n\n1. **Draw or write:** What are three physical properties of ice that are different from water?\n   \n2. **Answer:** A student froze 2 cups of water into an ice ball. Now it's an ice ball. Is there still the same amount of matter (stuff)? Circle one: **YES / NO**. Explain why in 1-2 sentences.\n\n3. **Predict:** If you left an ice ball on a sunny windowsill, what would happen to it? Why?\n\n**Success Criteria:**\n\nStudents demonstrate understanding if they:\n- ✓ Name at least 2-3 accurate physical properties of ice (hard, cold, transparent/cloudy, solid, smooth/bumpy, etc.)\n- ✓ Correctly identify that mass is conserved (same amount of matter before and after freezing)\n- ✓ Explain freezing or melting using the idea that temperature/heat affects whether water is a liquid or solid\n- ✓ Use at least one vocabulary term (freezing, solid, liquid, physical property, conservation) correctly\n\n**Expected Student Outcomes:**\n\nStudents should demonstrate:\n- Ability to identify and describe physical properties of ice\n- Understanding that matter is conserved during freezing (mass stays the same)\n- Recognition that freezing and melting are reversible physical changes\n- Understanding that temperature/heat energy affects state of matter\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Provide a Word Bank:** During Explore and Explain phases, offer a pre-made list of descriptive words (hard, cold, clear, cloudy, rough, smooth, slippery, frozen, solid, ice, water). Students select words instead of generating their own.\n\n2. **Simplified Recording Sheet:** Reduce the number of observations required. Instead of detailed drawings, allow students to use a checklist of properties: \"Is it hard? ☐ Yes ☐ No\" \"Is it cold? ☐ Yes ☐ No.\"\n\n3. **Paired Data Collection:** Pair struggling students with a peer or assign the teacher/paraprofessional to help them measure and record mass. Provide a step-by-step photo guide showing where to place the scale, how to read the number.\n\n### Challenge (For Advanced Learners)\n\n1. **Investigate Sublimation:** Provide dry ice (with proper safety precautions and supervision) or frozen dry items. Have students research and explain what happens when a solid \"disappears\" without becoming a liquid first. Create a Venn diagram comparing melting and sublimation.\n\n2. **Graph Melting Data:** Have students plot temperature vs. time for each group (warm water, cold water, room temperature) on a line graph. Ask: \"Why does the line for warm water drop faster?\" Introduce the concept of rate of change.\n\n3. **Design an Experiment:** Challenge students to design an experiment testing whether different shapes of ice (ice cube, ice ball, crushed ice) melt at different rates. Predict, test, and explain their results using data.\n\n---\n\n## Extension Activities\n\n1. **Freezing Point & Boiling Point Research:** Students investigate and create a poster showing the freezing and boiling points of water in both Fahrenheit and Celsius. Include real-world examples: \"At what temperature do ice cream trucks close? When does the lake freeze?\"\n\n2. **States of Matter Sorting Game:** Provide picture cards of materials (ice, steam, puddle, rock, air, cloud, snow). Students sort into categories: Solid, Liquid, or Gas. Discuss edge cases (snow = solid water; steam = gas water; clouds = tiny liquid water droplets).\n\n3. **Design a Container to Keep Ice Frozen:** Students sketch or build a prototype container designed to keep an ice ball frozen for as long as possible. They test their design and measure how long the ice lasts compared to ice left in an open tray. Graph and compare results.\n\n---\n\n**Teacher Notes:**\n\n- **Timing:** Pre-freeze water-filled balloons the night before (or 12-24 hours in advance). This ensures solid ice balls for exploration.\n- **Safety:** Ensure students handle ice carefully to avoid minor cuts. Provide paper towels. Advise not to touch ice directly for extended periods to prevent cold-related discomfort.\n- **Real-World Connection:** Discuss why freezing is important: food preservation, ice skating, winter safety (roads freezing).\n- **Photography:** Document student investigations with photos or video for a classroom display or digital portfolio.\n\nThis lesson directly uses the photograph as the hook and anchors all exploration and explanation back to observable ice ball properties. Students move from concrete observation to abstract understanding of physical properties and conservation of matter.",
  "inputTokens": 2967,
  "outputTokens": 4699,
  "cost": 0.026462000000000003,
  "generatedAt": "2026-02-13T01:16:11.684Z"
}