{
  "title": "Ice Ball",
  "category": "physical-science",
  "imageFile": "ice_ball.jpg",
  "imagePath": "images/physical-science/ice_ball.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Ice Ball Investigations\n\n## Core Science Concepts from Image Analysis\n\n- **States of Matter & Temperature:** Water changes from liquid to solid (ice) when frozen, demonstrating how temperature affects matter. The ice ball in the photo shows the solid state.\n- **Energy Transfer & Melting:** Heat energy causes ice to melt, visible as the water droplets and textured surface of the melting ice ball, showing energy in action.\n- **Properties of Materials:** Ice has observable properties (hard, cold, transparent/translucent, smooth surface) that are different from liquid water, demonstrating how the same material can have different properties in different states.\n- **Forces & Motion:** The ice ball sitting in the tray shows that gravity and balanced forces keep objects in place; unbalanced forces (like heat or pushing) could change the ice ball's motion or state.\n\n---\n\n## Lesson Title\n\n**Melting Mystery: Investigating Ice and Heat Energy**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 3-PS2-1 (Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on motion)\n  - 3-PS2-2 (Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe the properties of ice and identify how temperature affects whether ice melts or stays frozen.\n2. Predict how different conditions (heat, air temperature, placement) will affect how fast ice melts.\n3. Measure and record changes in ice over time to identify a pattern in melting.\n4. Explain that heat energy causes ice to change from a solid to a liquid.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of the ice ball.\n\n**Materials:**\n- Digital display (projector, interactive board, or printed large copy of photograph)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the Photograph:** Project the ice ball image on the board or pass around a printed copy. Let students observe for 30 seconds in silence, then ask:\n\n2. **Discussion Questions:**\n   - \"What do you see in this picture? Describe it using words like bumpy, smooth, wet, cold, or clear.\"\n   - \"Do you think this is ice or water? How can you tell?\"\n   - \"What do you think is dripping off the ice ball? Why might that be happening?\"\n   - \"If we left this ice ball sitting in this tray all day in a warm classroom, what would happen to it?\"\n\n3. **Prediction Prompt:** Say, \"I wonder if we can make ice balls in our classroom and watch what happens to them. Some might melt quickly, and some might melt slowly. What do you think will make ice melt faster—putting it in the sun or keeping it in the shade?\"\n\n   Record student predictions on chart paper with their names.\n\n**Transition:** \"Let's find out by making our own ice balls and testing them!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how different conditions affect ice melting through hands-on observation and measurement.\n\n**Materials:**\n- Pre-made ice balls (prepare 2-3 days ahead by freezing water in balloons, then removing balloon; or use round containers to freeze water)\n- Blue plastic trays or shallow containers (2-3 per group)\n- Ruler or measuring tape (one per group)\n- Thermometers (one per group, optional but recommended)\n- Paper towels\n- Observation recording sheet (prepared by teacher; see template below)\n- Timer or clock visible in classroom\n- Access to different locations: sunny windowsill, shaded area, and room-temperature shelf\n\n**Student Directions:**\n\n1. **Set Up:** \"Each group will choose one ice ball. Place it gently in your blue tray. You will watch your ice ball in one location for 20 minutes.\"\n\n2. **Measure the Starting Size:** \"Use your ruler to measure around your ice ball at the widest part. Record this on your sheet under 'Start Time.' Draw what your ice ball looks like right now.\"\n\n3. **Choose Your Location:** Groups choose where to place their tray: sunny windowsill, shaded corner, or regular classroom shelf. Record the location.\n\n4. **Observe Every 5 Minutes:** \"Every 5 minutes, go back to your ice ball. Draw what it looks like now. Is there water in the tray? Is the ice ball smaller? Write down what you see.\"\n\n5. **Measure Again:** At 10 minutes and 20 minutes, measure around the ice ball and record the measurement.\n\n6. **Clean Up:** Dispose of ice and water safely; dry the tray.\n\n**Teacher Role:**\n- Circulate among groups; ask open-ended questions: \"What do you notice about the water? Is your ice ball getting smaller? How do you know?\"\n- Avoid saying \"it's melting\"—let students discover the language.\n- Help students with measurements without providing answers about why melting is happening.\n- Ensure all groups measure and record data consistently.\n\n**Expected Student Outcomes:**\n- Students complete observation sheets showing measurements and drawings from start, middle, and end.\n- Groups notice that ice balls in sunny locations melt faster or show more visible water.\n- Students record concrete observations: \"The ice ball is smaller,\" \"There's more water now,\" \"It's dripping.\"\n\n**Observation Recording Sheet Template:**\n\n| Time | Ice Ball Size (measurement) | Picture of Ice Ball | Observations |\n|------|---------------------------|---------------------|---------------|\n| Start (0 min) | _____ | [Draw] | |\n| 5 min | _____ | [Draw] | |\n| 10 min | _____ | [Draw] | |\n| 15 min | _____ | [Draw] | |\n| 20 min | _____ | [Draw] | |\n\n**Our location was:** ☐ Sunny window   ☐ Shaded area   ☐ Regular shelf\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to physical science concepts.\n\n**Materials:**\n- Chart paper with vocabulary words written large\n- Student observation sheets from Explore phase\n- Optional: simple diagram showing ice → water transition with sun/heat arrows\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):** \n   - Ask each group: \"What location was your ice ball in? How much did it change from start to finish?\"\n   - Record findings on chart: \"Sunny window: 3 cm smaller,\" \"Shaded: 1 cm smaller,\" etc.\n   - Facilitate: \"What do you notice? Which ice balls melted the most? Why do you think that happened?\"\n\n2. **Introduce Key Vocabulary (8 minutes):**\n\n   Define each term using the ice ball example:\n\n   - **Solid:** \"Ice is a solid. It has a shape you can hold and measure. It doesn't change shape unless it gets warm.\"\n   - **Liquid:** \"Water is a liquid. It can be poured and spilled. It takes the shape of whatever holds it—like water in your tray.\"\n   - **Melt:** \"To melt means to change from a solid to a liquid. Heat energy makes ice melt into water.\"\n   - **Heat Energy:** \"Heat is energy that makes things warm. The sun has heat energy. Heat energy made your ice balls change into water.\"\n   - **Temperature:** \"Temperature tells us how hot or cold something is. Hot places have higher temperature. Cold places have lower temperature.\"\n\n3. **Connect Back to Observations (5-7 minutes):**\n   - Point to chart: \"The ice balls by the sunny window melted faster because the sun gave them more heat energy than the shaded ice balls.\"\n   - \"The ice ball in the shade melted slower because it had less heat energy.\"\n   - Show photo again: \"This ice ball is starting to melt. We can see water dripping from it. That's heat energy at work!\"\n\n4. **Check for Understanding:**\n   - Ask: \"Raise your hand if you can tell me: What happened to the water that came from the melted ice?\" (It went into the tray, it evaporated into the air.)\n   - \"Is an ice ball a solid or a liquid?\" (Solid.)\n   - \"What made the ice balls melt?\" (Heat/the sun.)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Solid** | Something hard and cold that keeps the same shape, like ice. |\n| **Liquid** | Something wet and runny that can be poured, like water. |\n| **Melt** | When a solid (ice) gets warm and turns into liquid (water). |\n| **Heat Energy** | The warm power that comes from things like the sun or a heater. It makes ice melt. |\n| **Temperature** | How hot or cold something is. |\n\n**Expected Student Outcomes:**\n- Students use vocabulary words (solid, liquid, melt, heat energy) to describe what they observed.\n- Students can explain that heat energy made the ice melt.\n- Students understand that the sunny location had more heat energy, so the ice melted faster.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding by predicting and testing how to speed up or slow down melting.\n\n**Materials:**\n- 1-2 fresh ice balls per group\n- Blue trays\n- Various materials to test: salt, paper towels, plastic wrap, dark cloth, aluminum foil, ice bucket filled with ice\n- Ruler\n- Recording sheet (same format as Explore)\n\n**Activity:**\n\n1. **Introduce Challenge (2 minutes):** \"Now you're going to become ice scientists! We found that sun and heat make ice melt. Your challenge: pick one idea to test. Can you SLOW DOWN melting or SPEED UP melting?\"\n\n2. **Student Choices (students pick one):**\n   - **Speed It Up:** Wrap ice ball in dark cloth (absorbs more heat) or add salt to the water around it.\n   - **Slow It Down:** Wrap ice ball in aluminum foil or plastic wrap, or place it in a cup of ice.\n   - **Advanced:** Test two conditions at once (e.g., \"Will ice melt slower if we wrap it AND put it in ice?\").\n\n3. **Predict and Test (10 minutes):**\n   - Students draw and write their prediction: \"I think ___ will make the ice melt (faster/slower) because ___.\"\n   - Set up the test with their chosen material.\n   - Measure and observe for 15 minutes, recording every 5 minutes (same sheet as Explore).\n\n4. **Report Findings (3 minutes):**\n   - Groups share: \"We thought wrapping the ice in foil would slow it down. Did it? How do we know?\"\n\n**Teacher Role:**\n- Prompt thinking: \"Why do you think dark cloth would speed up melting?\" (Dark colors absorb heat.)\n- Ask: \"How is this test the same as the first one? How is it different?\"\n- Ensure fair testing (same starting ice size, same time frame, similar room temperature).\n\n**Expected Student Outcomes:**\n- Students predict cause-and-effect: \"Dark cloth will speed up melting because it catches more heat from the sun.\"\n- Students measure data showing their test did or didn't work as predicted.\n- Students explain results using vocabulary: \"The foil slowed down melting because it blocked the heat energy from reaching the ice.\"\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of ice melting, heat energy, and cause-and-effect relationships.\n\n**Formative Assessment (During Lesson):**\n- Observe students during Explore: Do they measure accurately? Do they record observations consistently?\n- Listen during small-group discussions: Are students using vocabulary correctly? Can they explain why ice melts?\n- Check observation sheets for completeness and accuracy.\n\n**Exit Ticket / Summative Assessment:**\n\nProvide each student with a written or oral exit ticket (teacher reads aloud; students respond individually on paper or verbally to a partner).\n\n**Exit Ticket Questions:**\n\n1. **Draw and Label:** \"Draw an ice ball and show where heat energy is coming from. Label the ice, the water, and the heat.\"\n\n2. **Multiple Choice:** \"What made the ice balls melt faster in the sunny window?\"\n   - A) The sunny window was smaller\n   - B) The sun gave heat energy to the ice\n   - C) The blue tray was warmer\n   - D) Ice always melts at the same speed\n\n   *(Correct answer: B)*\n\n3. **Short Answer:** \"If you left an ice ball outside on a hot summer day, would it melt faster or slower than in the classroom? Why?\"\n   - *(Expect: Faster, because it's hotter outside / more heat energy / higher temperature)*\n\n4. **Explain with Vocabulary:** \"Use the words 'solid,' 'liquid,' and 'melt' in one sentence about what happened to the ice ball.\"\n   - *(Expect: \"The ice ball was a solid, but heat energy made it melt into a liquid.\")*\n\n**Success Criteria:**\n\nStudents demonstrate understanding if they:\n- ✓ Accurately measure and record observations across time\n- ✓ Use vocabulary (solid, liquid, melt, heat energy) correctly in explanations\n- ✓ Identify the sun/heat as the cause of melting\n- ✓ Predict cause-and-effect relationships (e.g., \"More heat = faster melting\")\n- ✓ Explain that ice is a solid and water is a liquid\n\n**How to Determine if Learning Objectives Were Met:**\n- Review observation sheets: Did students measure consistently? Did measurements show decreasing size over time?\n- Listen to explanations: Can students say, \"Heat energy made the ice melt\"?\n- Evaluate predictions: Did students predict patterns (sunny = faster) based on evidence?\n- Check exit tickets: Can students apply vocabulary and explain cause-and-effect?\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Pre-measure Ice Balls:** For students who struggle with measuring, pre-mark the measurement lines on the ice ball with tape or marker so they only need to measure again and compare.\n\n2. **Simplified Recording Sheet:** Provide a one-column sheet with just pictures to draw (no writing). Sentence starters: \"I see _____. The ice got _____.\"\n\n3. **Partner Assignments:** Pair struggling readers/writers with strong communicators. One student draws; one records words. Teacher scribes for group if needed.\n\n### Challenge (For Advanced Learners)\n\n1. **Temperature Measurement:** Provide thermometers. Have advanced students record the temperature of their location at each measurement time and graph the relationship: \"Does the air temperature affect how fast ice melts?\"\n\n2. **Predict & Explain:** Challenge: \"What if we put an ice ball in the freezer while the other groups test in the sun? Predict what will happen. Why?\" Have them test and explain.\n\n3. **Design Your Own Test:** \"Invent a new way to make ice melt faster or slower. Predict what will happen. Test it. Write a conclusion explaining why your idea worked or didn't work.\"\n\n4. **Calculate Surface Area Loss:** (Approaching 4th-grade math) Have advanced students calculate how much the ice ball's circumference decreased: \"The ice ball was 15 cm around and now it's 12 cm. How much did it shrink?\"\n\n---\n\n## Extension Activities\n\n1. **Freezing Investigation:** \"Reverse the problem! Instead of melting ice, let's make it. Freeze water in different locations (freezer, cold windowsill, room temperature) and predict which freezes fastest. This tests the opposite of melting: solidification.\"\n\n2. **Real-World Connection—Glaciers:** Show photos of glaciers and explain, \"Glaciers are huge mountains of ice. Scientists worry that heat energy from Earth is making them melt. If ice melts in the ocean, what might happen?\" Connect to climate and environmental science concepts.\n\n3. **Ice Sculpture Design Challenge:** \"Artists make ice sculptures that melt over time. Using your understanding of heat, design an ice sculpture and predict how long it would last in different places. Draw your design and explain where you'd display it.\"\n\n4. **States of Matter Song/Poem:** Students create a short song or poem using vocabulary: \"Solid ice, hard and cold / Heat comes and takes its hold / Melts to liquid, water flows / That's the change that science knows!\"\n\n5. **Take-Home Investigation:** \"Freeze water in a small balloon at home. Place it in one location in your house for a week. Draw pictures every day. Bring back your findings. What melted fastest? Why?\"\n\n---\n\n## Teacher Notes & Tips\n\n- **Prep:** Freeze water in balloons 2-3 days ahead. Once frozen, cut away the balloon. Ice balls should be roughly 2-3 inches in diameter for easy handling by third graders.\n- **Safety:** Ensure ice balls are handled over trays to catch water. Dry floors after activity to prevent slipping.\n- **Timing:** If you're short on time, combine Sessions 1 & 2 by doing Engage, Explore, and brief Explain in one 45-minute block, then save Elaborate and Evaluate for Session 2.\n- **Classroom Management:** Assign group \"location scouts\" ahead of time so transitions to sunny window/shaded area happen smoothly.\n- **Vocabulary Anchor Chart:** Leave the vocabulary chart displayed for the rest of the unit. Students will reference it for other lessons on matter and energy.\n\nThis lesson directly addresses NGSS 3-PS2-1 and 3-PS2-2 by having students plan an investigation (predicting ice melting), conduct it systematically (measuring over time), make observations, and identify patterns (faster melting in sun = pattern of heat's effects). The cause-and-effect connection between heat energy and melting is the core physical science concept.",
  "inputTokens": 2901,
  "outputTokens": 4277,
  "cost": 0.024286000000000002,
  "generatedAt": "2026-02-13T01:14:40.895Z"
}