{
  "title": "Ice Ball",
  "category": "physical-science",
  "imageFile": "ice_ball.jpg",
  "imagePath": "images/physical-science/ice_ball.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Frozen Water Exploration\n\n## Core Science Concepts from Image Analysis\n\n- **Change of State (Freezing):** Water transforms from liquid to solid when cooled, becoming ice with a different appearance and texture.\n- **Observable Properties of Materials:** Ice has specific physical properties—it is hard, cold, smooth/crystalline on the surface, and transparent or translucent.\n- **Reversibility of Change:** Ice (solid) can melt back into water (liquid) when warmed, demonstrating a reversible physical change.\n- **Heat Energy and Temperature:** Cooling causes water to freeze; warming causes ice to melt—showing how heat energy affects matter.\n\n---\n\n## Lesson Title\n\n**Ice Ball Magic: Watching Water Change**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 2-PS1-1: Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n  - 2-PS1-4: Construct an argument with evidence that some changes caused by heating or cooling can be reversed and some cannot.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** the physical properties of ice (color, texture, temperature, hardness) using sensory language.\n2. **Predict and test** what happens to ice when it is warmed, and record observations.\n3. **Explain** that ice is frozen water and that melting is a change that can be reversed by freezing again.\n4. **Compare** the properties of ice and water, identifying how they are the same and different.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about ice and water using the photograph.\n\n**Materials:**\n- Photograph of ice ball printed or displayed on screen/whiteboard\n- Blue plastic tray and white paper (optional: recreate the setup)\n\n**Activity:**\n\n1. **Display the photograph** on the board or screen. Ask students to sit where everyone can see it clearly.\n\n2. **Introduce with curiosity:** Say, \"Look carefully at this picture. What do you see? I'm wondering what this clear, bumpy ball is made of!\"\n\n3. **Ask these discussion questions** (pause after each for think-pair-share):\n   - \"What do you think this ball is made of? How do you know?\"\n   - \"Why is it sitting in that blue tray? What do you think might happen to it?\"\n   - \"Have you ever seen ice? What did it feel like?\"\n   - \"What happened the last time you touched ice or a popsicle? Did it change?\"\n\n4. **Wonder prompt:** \"I wonder... if we could feel this ice ball right now, what would it feel like? Would it be hard or soft? Warm or cold?\"\n\n5. **Record** student predictions on a chart: \"What do you think will happen to the ice ball?\"\n\n**Transition:** \"Let's do an experiment to see what actually happens to ice. You're going to become ice scientists!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate ice properties and observe changes caused by heat through hands-on exploration.\n\n**Materials (per student or pair):**\n- 1 small ice cube or frozen water ball (prepare in advance by freezing water in balloons or ice molds)\n- 1 small plastic cup or container\n- Paper towels\n- 1 craft stick or popsicle stick\n- 1 thermometer (optional, for advanced learners)\n- Observation sheet (see below)\n- Crayons or colored pencils\n\n**Activity:**\n\n1. **Distribute ice** to each student/pair in a cup. Say, \"This is YOUR ice. You are going to be scientists and watch what happens to it.\"\n\n2. **Part A – Observing Cold Ice (5 minutes):**\n   - \"Touch the ice gently. What does it feel like?\"\n   - \"Look at it closely. Describe what you see. Is it clear? Rough? Smooth?\"\n   - \"Can you move it easily or does it feel hard?\"\n   - Students record on observation sheet: Draw the ice and write 1-2 words describing it (cold, hard, clear, bumpy, slippery, wet, etc.).\n\n3. **Part B – Warming the Ice (15 minutes):**\n   - Say, \"Now we're going to warm the ice slowly by leaving it in this warm room. Watch what happens!\"\n   - Students place ice on their paper towel (to catch drips).\n   - **Every 3-4 minutes, have students:**\n     - Look at the ice and describe changes\n     - Touch it (if still icy)\n     - Draw what they see on their observation sheet\n     - Write or draw what's changing\n   - **Teacher prompt** at each observation: \"What's different from last time? Is it still the same? What do you see?\"\n\n4. **Document observations** on a simple chart:\n   - **Start:** (drawing + words)\n   - **Middle:** (drawing + words)\n   - **End:** (drawing + words)\n\n**Teacher Role:**\n- Circulate with genuine curiosity: \"Tell me what you notice.\" (Don't provide answers.)\n- Ask open questions: \"What changed? How do you know?\"\n- Encourage students to touch and observe safely.\n- Point out liquid water if melting is occurring: \"Is that water? Where did it come from?\"\n- Prompt predictions: \"What do you think will happen next?\"\n\n**Expected Student Outcomes:**\n- Students observe ice gradually becoming softer, smaller, or melting into liquid water.\n- Students notice water pooling or dripping.\n- Students record observable changes through drawings and words.\n- Students identify that ice is changing into something else (water).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to ice/water concepts.\n\n**Materials:**\n- Chart paper or whiteboard\n- Images of ice and water\n- Photograph from Engage phase (displayed again)\n- Students' observation sheets\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask students to share 1 observation: \"What did you see happening to your ice?\"\n   - Record words on a chart: \"Changes We Noticed\"\n   - (Expected words: smaller, wet, liquid, water, melting, cold, warm, disappearing)\n\n2. **Introduce Vocabulary (8 minutes):**\n   Teach these terms with Second Grade-friendly definitions:\n\n   - **Ice:** Frozen water. It is hard and very cold. *(Point to ice photo.)*\n   - **Melt:** When ice gets warm and turns into liquid water. *(Demonstrate with a piece of remaining ice.)*\n   - **Liquid:** Water that flows and takes the shape of its container. *(Show water in cup.)*\n   - **Freeze:** When liquid water gets very cold and turns into ice.\n   - **Change:** When something becomes different.\n\n3. **Make Connections (5 minutes):**\n   - \"The ice ball in the picture looks just like the ice you explored. It was made of frozen water.\"\n   - \"When we left the ice in our warm room, it started to melt. It turned from solid ice into liquid water.\"\n   - \"This is a **change**—the ice changed into water because it got warmer.\"\n\n4. **Check for Understanding:**\n   - Ask: \"If I leave an ice cube on the table in our classroom, what will happen? Why?\"\n   - Ask: \"Is melting a change? What's changing?\"\n   - Have students thumbs up/sideways/down: \"Do you know what melting is?\"\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Ice** | Frozen water that is hard and very cold. |\n| **Melt** | When ice gets warm and turns into water you can pour. |\n| **Liquid** | Something wet that flows, like water. |\n| **Freeze** | When water gets very cold and turns hard like ice. |\n| **Change** | When something becomes different from how it was before. |\n\n**Expected Student Outcomes:**\n- Students use the word \"melt\" correctly to describe what happened to their ice.\n- Students understand that melting is a type of change.\n- Students connect the ice ball photograph to the concept of freezing water.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding by exploring reversibility and predicting changes in new scenarios.\n\n**Materials:**\n- Small cups with water (at room temperature)\n- Freezer or access to ice from earlier activity\n- Ice cubes\n- Paper\n- Crayons\n\n**Activity: Can We Reverse the Change? (Reverse Melting/Re-freezing)**\n\n1. **Pose a Question:** \"We watched ice melt into water. Can we turn water back into ice? Let's think about it!\"\n\n2. **Prediction Drawing (5 minutes):**\n   - Show students a cup of liquid water.\n   - Say, \"I'm going to put this water in the freezer where it's very cold. Draw a picture of what you think will happen.\"\n   - Students draw prediction.\n\n3. **Real-World Application Scenario (8 minutes):**\n   - \"Popsicles are made from liquid juice. How do you think popsicles are made?\"\n   - \"What has to happen to turn juice into a frozen popsicle?\" (Freezing!)\n   - Show picture of popsicles if available.\n   - \"Freezing is the opposite of melting. When we freeze water, it becomes ice again.\"\n\n4. **Comparative Thinking (5 minutes):**\n   - Create a simple chart on board:\n\n   | What's the Same? | Ice vs. Water | What's Different? |\n   |---|---|---|\n   | Both are made of H2O | | Ice is hard; water flows |\n   | | | Ice is cold; water can be warm |\n\n   - Students contribute observations.\n\n5. **Predict a New Scenario:**\n   - \"If I leave a glass of water outside on a very cold night, what might happen?\"\n   - Discuss freezing and how cold temperatures reverse melting.\n\n**Teacher Role:**\n- Guide thinking with questions, not answers: \"What has to happen for water to freeze?\"\n- Celebrate predictions: \"That's a smart prediction because...\"\n- Connect to student experiences: \"Have you ever seen ice form in a puddle?\"\n\n**Expected Student Outcomes:**\n- Students understand that freezing reverses melting (reversibility).\n- Students apply the concept to real-world items (popsicles, ice cubes in drinks).\n- Students predict outcomes in new scenarios involving heating and cooling.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of ice properties, melting, and reversible changes.\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation sheets:** Check drawings and descriptions for evidence of observing change.\n- **Discussion responses:** Listen for use of vocabulary (melt, ice, freeze, change, liquid).\n- **Thumbs up/sideways/down checks:** Use during Explain phase to gauge understanding.\n- **Questioning:** Notice which students can explain *why* ice melts (gets warm).\n\n**Summative Assessment – Exit Ticket (5-7 minutes):**\n\n**Option A – Draw and Write:**\nProvide each student with a simple template:\n\n```\n---MELTING ICE---\nDraw: The ice ball at the start\nDraw: The ice ball after it got warm\nWrite or tell: What happened?\nAnswer: Did the ice change? YES / NO\n```\n\n**Option B – Verbal Response (for non-writers):**\nAsk each student individually:\n- \"What happened to the ice when it got warm?\"\n- \"Is melting a change? How do you know?\"\n- \"Can we turn water back into ice? How?\"\n\n**Option C – Three-Picture Sequence:**\nProvide three images (ice, melting ice, water). Students arrange in order and label each stage.\n\n**Success Criteria:**\n\nStudents demonstrate understanding if they:\n✓ Correctly describe observable changes to ice (melting, getting smaller, becoming liquid)\n✓ Use the word \"melt\" appropriately\n✓ Identify that melting is a **change** caused by warming\n✓ Can explain or show what ice and water are\n✓ Predict what happens when ice is warmed in a new situation\n\n**Expected Student Outcomes:**\n- 80% of students correctly identify melting as a change caused by heat.\n- 75% of students use the vocabulary term \"melt\" accurately.\n- 70% of students can predict melting will occur when ice is left in a warm room.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners):\n\n1. **Pre-teaching Vocabulary:** Before Engage, show real ice and water side by side. Label clearly. Have students repeat words.\n\n2. **Observation Checklist:** Instead of open-ended recording, provide a checklist students mark:\n   - ☐ Ice is hard\n   - ☐ Ice is cold\n   - ☐ Ice is clear\n   - ☐ Ice is getting smaller\n   - ☐ Water is dripping\n   - ☐ Ice turned into water\n\n3. **Sentence Starters:** During explanations, provide frames:\n   - \"The ice is ________.\"\n   - \"When the ice got warm, it ________.\"\n   - \"Melting means ________.\"\n\n### Challenge (For Advanced Learners):\n\n1. **Thermometer Recording:** Provide thermometers for advanced students to record temperature changes as ice melts. Compare initial temperature to room temperature.\n\n2. **Reverse Engineering:** Ask, \"How long did it take your ice to melt completely? Can you predict how long it would take a bigger piece of ice to melt? Why?\"\n\n3. **Write a Prediction & Explanation:** \"Draw and write: What happens to snow in springtime? Is that melting too? Why?\"\n\n4. **Comparative Materials:** Provide other cold objects (popsicle, frozen play dough) and ask, \"Which will melt first if we warm them? Why?\"\n\n---\n\n## Extension Activities\n\n1. **Freezing Water Experiment (Follow-Up Lesson):**\n   - Students fill small cups with water, add food coloring, and place in freezer overnight.\n   - Next day: Compare frozen water to liquid water. Discuss how freezing reverses melting.\n   - **Connection:** Re-teaches reversibility with student-made ice.\n\n2. **Real-World Melting Hunt:**\n   - Read-aloud: *The Mitten* by Jan Brett or *Snowy Day* by Ezra Jack Keats.\n   - Students identify melting happening in the story.\n   - Discuss: \"When does ice melt in winter and spring?\"\n   - **Connection:** Connects to seasonal science and real-world applications.\n\n3. **Ice Sensory Exploration & Art:**\n   - Provide ice in various forms (ice cubes, shaved ice, ice ball).\n   - Students explore safely (with adult supervision) and describe textures.\n   - Create \"ice sculptures\" by letting ice melt in droppers onto paper to make drip art.\n   - **Connection:** Engages multiple senses and deepens observational skills.\n\n---\n\n## Teacher Notes & Tips\n\n- **Preparation:** Freeze water in balloons or in round containers 24 hours before Explore phase. Balloons create the \"ice ball\" effect seen in the photograph.\n- **Timing:** Melting takes 15-20 minutes at room temperature. If your room is cold, move ice to a warmer location or place near a window.\n- **Safety:** Remind students ice is cold and can cause temporary numbness; limit contact time to 10-15 seconds at a time.\n- **Engagement:** The tactile nature of this lesson (touching ice) is highly motivating for Second Grade. Emphasize the \"scientist\" role throughout.\n- **Vocabulary Repetition:** Use new words (melt, freeze, liquid, ice, change) consistently throughout both days to build retention.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 2907,
  "outputTokens": 3828,
  "cost": 0.022047,
  "generatedAt": "2026-02-13T01:13:53.870Z"
}