{
  "id": 80,
  "title": "Ice Ball",
  "category": "physical-science",
  "imageFile": "ice_ball.jpg",
  "imagePath": "images/physical-science/ice_ball.jpg",
  "gradeLevel": "kindergarten",
  "content": "## 📸 Photo Description\n\nA big ball of ice sits in a blue tray. The ice ball has white lines that look like cracks. Water is around the ice ball where some ice melted.\n\n## 🔬 Scientific Phenomena\n\nThis image shows the **melting phenomenon** - the phase change from solid ice to liquid water. The anchoring phenomenon occurs because thermal energy from the warmer air temperature is being transferred to the ice, causing the molecular structure to change from the rigid crystalline arrangement of ice to the more fluid arrangement of liquid water. The cracked appearance shows the internal stress as different parts of the ice sphere warm at different rates.\n\n## 📚 Core Science Concepts\n\n1. **States of Matter**: Ice is the solid form of water, and when it gets warm, it changes to liquid water\n2. **Temperature and Heat**: Warm air makes ice melt by giving it energy\n3. **Observable Changes**: We can see and feel when things change from solid to liquid\n4. **Properties of Materials**: Ice is hard and cold, while water is wet and flows\n\n<pedagogical-tip>Use concrete, hands-on experiences with ice cubes in different containers to help kindergarteners make direct observations about melting. Let them touch, observe, and describe what they see happening over time.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to document their observations - drawing pictures, using simple words, acting out the melting process with their bodies, or using digital tools to take before/after photos.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** Inside the ice, tiny water molecules are packed tightly together like people holding hands. When it gets warm, they start moving faster and let go of each other's hands, becoming liquid water.\n\n2. **Zoom Out:** This melting happens everywhere in nature - icicles on houses, snow on mountains, and ice on ponds all melt when spring comes, providing water for plants and animals.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception:** \"The ice disappears when it melts\"\n   **Clarification:** The ice changes into water - it's still there, just in a different form\n\n2. **Misconception:** \"Only fire can melt ice\"\n   **Clarification:** Anything warmer than freezing temperature can melt ice, including warm air, warm hands, or sunshine\n\n3. **Misconception:** \"Melting happens instantly\"\n   **Clarification:** Melting takes time and happens gradually as the ice gets warmer\n\n## 🎓 NGSS Connections\n\n**Performance Expectation:** K-PS1-3: Make observations to determine the effect of sunlight on Earth's surface\n\n**Disciplinary Core Ideas:**\n- [[NGSS:DCI:K-PS1.A]]: Matter and Its Properties\n- [[NGSS:DCI:K-ESS2.D]]: Weather and Climate\n\n**Crosscutting Concepts:**\n- [[NGSS:CCC:Patterns]]\n- [[NGSS:CCC:Cause and Effect]]\n\n## 💬 Discussion Questions\n\n1. What do you think will happen to this ice ball if we leave it here for one hour? (Bloom's: Predict | DOK: 2)\n\n2. How does this ice ball feel different from the water around it? (Bloom's: Analyze | DOK: 1)\n\n3. Where have you seen ice melting in your everyday life? (Bloom's: Apply | DOK: 2)\n\n4. What could we do to make this ice ball melt faster or slower? (Bloom's: Evaluate | DOK: 3)\n\n## 📖 Science Vocabulary\n\n* **Melt:** When something solid becomes liquid because it gets warm\n* **Solid:** Something that keeps its shape, like ice or a rock\n* **Liquid:** Something that flows and takes the shape of its container, like water\n* **Temperature:** How hot or cold something is\n* **Change:** When something becomes different than it was before\n\n## 📚 External Resources\n\n**Children's Books:**\n- The Magic School Bus: Wet All Over by Joanna Cole\n- Water Is Water by Miranda Paul\n- Ice Is Nice by Robin Hill\n\n**YouTube Videos:**\n- \"States of Matter for Kids\" - Simple explanation of solid, liquid, and gas with animations (https://www.youtube.com/watch?v=ZjNs8fglK7k)\n- \"What Happens When Ice Melts?\" - Real-time observation of ice melting with kid-friendly narration (https://www.youtube.com/watch?v=XslcgQJMZaY)",
  "generatedAt": "2026-02-04T18:04:27.155Z"
}