{
  "title": "Ice Ball",
  "category": "physical-science",
  "imageFile": "ice_ball.jpg",
  "imagePath": "images/physical-science/ice_ball.jpg",
  "content": "# Engineering Design Challenge: Ice Ball\n\n### Visible Elements in Photo\n\n- A clear plastic dome or hemisphere filled with water and ice crystals\n- A blue plastic tray or container serving as a base\n- White crystalline ice formations inside the dome, radiating outward\n- Classroom workspace with paper towels nearby\n- Small materials (flashlight, batteries, toy vehicle) in the background\n\n### Reasonable Inferences\n\n1. **From ice crystal patterns** – The radiating ice formations suggest rapid freezing or directional heat loss, implying that water freezes differently depending on temperature and cooling speed.\n2. **From dome placement on tray** – The tray is designed to catch meltwater, indicating that students are observing and managing phase change and liquid runoff.\n3. **From classroom context** – The presence of towels and contained setup suggests this is an active experiment where students need to observe, measure, and troubleshoot melting or freezing conditions.\n\n### Engineering Task\n\n**K–2 Version:**  \n\"Your ice ball is melting! Design a way to keep it frozen for as long as possible using blankets, boxes, or other materials. Test your design and see which one works best to slow down the drips.\"\n\n**3–5 Version:**  \n\"Design an insulated container that slows the melting of a frozen water dome by at least 50% compared to an uninsulated dome. Your container must allow observation of the ice inside and fit on a standard tray. Test two different insulation materials and measure the time it takes for meltwater to drip. Which material works better and why?\"\n\n### EDP Phase Targeted\n\n**Create / Test**\n\nThis photo captures an *active experiment*, making it ideal to start in the Create/Test phase. Students can immediately iterate on insulation designs, collect meltwater data, and compare real results. The visible ice dome is already a prototype, so jumping to construction and testing builds momentum and engagement.\n\n### Suggested Materials\n\n- Bubble wrap, foam sheets, or craft foam\n- Paper towels and absorbent cloth\n- Small plastic or shoebox containers\n- Ice packs, newspaper, or crumpled paper for stuffing\n- Measuring cups and timers\n\n### Estimated Time\n\n**Two 30-minute sessions:**  \n- Session 1: Insulation design and setup (15 min), initial testing (15 min)\n- Session 2: Data collection, observation, and redesign or comparison (30 min)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Ask and define a problem*) and **3-5-ETS1-2** (*Plan and conduct fair tests*) because students must identify the cooling problem, propose insulation solutions, and gather measurable evidence to evaluate their designs against a clear success criterion (50% slower melting).",
  "inputTokens": 2328,
  "outputTokens": 639,
  "cost": 0.005523,
  "generatedAt": "2026-02-09T13:31:29.265Z"
}