{
  "title": "Infrared Thermometer",
  "category": "physical-science",
  "imageFile": "infrared_thermometer.jpg",
  "imagePath": "images/physical-science/infrared_thermometer.jpg",
  "content": "# NGSS EDP Challenge: Infrared Thermometer Photo\n\n### Visible Elements in Photo\n- An infrared (non-contact) thermometer with orange housing and digital display showing 119.5°F\n- A human hand holding the device\n- Concrete paved surface (appears to be a driveway or sidewalk) with gray mortar lines\n- Sunlight casting shadows from overhead structures (likely a roof or overhang)\n- Temperature reading displayed on LCD screen with Celsius/Fahrenheit toggle buttons\n\n### Reasonable Inferences\n- **From the high temperature reading (119.5°F) + sunlit concrete:** The surface is absorbing significant solar heat, suggesting this measurement was taken in direct sunlight on a warm day.\n- **From the infrared thermometer's presence:** Someone is investigating heat differences in outdoor materials, implying a need to measure or compare surface temperatures.\n- **From the concrete surface + visible shadows:** Some areas receive direct sun while others are shaded, meaning temperature varies depending on exposure.\n\n### Engineering Task\n\n**K-2:**\n> *Build a sun shield to keep things cool! Use materials like paper, cloth, or leaves to create a cover that blocks sunlight. Test it on a warm spot outside. Does your shield make the ground feel cooler in the shade it creates? Try different materials and see which one works best.*\n\n**3-5:**\n> *Design a passive cooling structure that reduces surface temperature by at least 15°F compared to an exposed control surface. You may use only natural materials (leaves, branches, cardboard, cloth, or sand). Your structure must be no larger than 12 inches × 12 inches and must stand on its own for at least 10 minutes in direct sunlight. Measure surface temperature under your structure and in open sun using a thermometer. Which materials worked best and why?*\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows evidence of a real-world observation (measuring heat differences on concrete) without showing an existing solution. Students need to first identify *why* we care about temperature differences in outdoor spaces (shade comfort, material durability, heat management), then design a cooling strategy. Starting with \"Ask\" allows students to observe, measure, and articulate the problem before jumping to design.\n\n### Suggested Materials\n1. Cardboard, newspaper, or kraft paper\n2. Cloth scraps, old t-shirts, or burlap\n3. Natural materials: leaves, branches, straw, grass\n4. Sand or soil in shallow containers\n5. A simple dial thermometer or infrared thermometer (if available for comparison)\n\n### Estimated Time\n**45–60 minutes** (one extended session or two 30-minute blocks)\n- Discuss & plan: 10 minutes\n- Build structures: 15–20 minutes\n- Test & measure: 15 minutes\n- Compare results & reflect: 10–15 minutes\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.B (Developing Possible Solutions)**, requiring students to test different material properties and select designs that meet a specific performance criterion (temperature reduction), while grounding the challenge in observable, measurable real-world phenomena.",
  "inputTokens": 2330,
  "outputTokens": 714,
  "cost": 0.005900000000000001,
  "generatedAt": "2026-02-09T13:32:12.920Z"
}