{
  "title": "Infrared Thermometer",
  "category": "physical-science",
  "imageFile": "infrared_thermometer.jpg",
  "imagePath": "images/physical-science/infrared_thermometer.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Heat from the Sun\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Heat and Temperature:** The infrared thermometer detects thermal energy; sunny surfaces absorb and radiate heat differently than shaded surfaces.\n- **Effect of Sunlight on Earth's Surface:** Different materials and locations exposed to the sun experience different amounts of warming.\n- **Energy from the Sun:** Sunlight carries energy that warms objects and the ground we walk on.\n- **Observation and Measurement:** Tools help us notice and describe changes in temperature that our senses alone might miss.\n\n---\n\n## Lesson Title\n\n**Warm and Cool: Finding Heat from the Sun**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 60–75 minutes (can be split into two 30–40 minute sessions)\n- **NGSS Standards:** \n  - K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface.\n  - K-PS3-2: Use tools and materials to design and build a structure that will reduce the warming effect of sunlight on an area.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how sunlight makes some places warmer than others using their senses and simple tools.\n2. Identify sunny and shady areas in their environment and compare how warm they feel.\n3. Use a thermometer to record temperature data from sunny and shady spots.\n4. Design and test a simple structure (sunshade) to keep an area cooler.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about heat and sunlight through the photograph, activating prior knowledge about warm and cool places.\n\n**Materials:**\n- Photograph displayed on interactive board, document camera, or printed large-format\n- Optional: actual infrared thermometer (if available for students to observe closely)\n\n**Activity:**\n\n1. **Display the Photograph:** Show students the image of the infrared thermometer in sunlight against a brick surface with shadow stripes. Say: \"Look at this special tool! It's called a thermometer. It tells us how warm things are.\"\n\n2. **Guided Looking (2 minutes):**\n   - \"What do you notice about this picture? Can you see the sun?\"\n   - \"Look at the ground — some parts look light and some look dark. What might that mean?\"\n   - \"Why do you think someone is using this tool?\"\n\n3. **Spark Curiosity with Discussion Questions:**\n   - \"Have you ever felt warm sunshine on your skin? Where? Show me with your hands.\"\n   - \"If you go outside on a sunny day, where do you feel warmer — in the sun or under a tree in the shade?\"\n   - \"Do you think the sunny part of this brick wall is warmer or cooler than the shady part?\"\n   - \"How could we find out which is warmer without just touching it?\"\n\n4. **Wonder Prompt:**\n   - \"I wonder what this thermometer would show if we checked the sunny ground and the shady ground at our school. Let's find out!\"\n\n**Transition:** \"Let's go outside and be scientists. We're going to find sunny and shady spots, and we'll see which ones are warmer!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate how sunlight affects temperature in different locations by comparing sunny and shady areas.\n\n**Materials:**\n- Infrared thermometer (or standard classroom thermometer if IR is unavailable)\n- Chart paper or whiteboard for recording observations\n- Markers\n- Optional: hand-held thermometers (one per group or pair)\n- Camera or tablet to document observations\n- Clipboards with blank paper for drawing\n\n**Activity:**\n\n**Outdoor Investigation (15–20 minutes):**\n\n1. **Setup (Teacher-Led):** \n   - Divide class into 2–3 small groups.\n   - Assign each group a \"sunny spot\" and a nearby \"shady spot\" (e.g., sunny sidewalk vs. under the playground equipment, sunny wall vs. shaded side of the building).\n   - Give groups the thermometer or assign a teacher/aide to help with readings.\n\n2. **Student Directions (Read aloud clearly):**\n   - \"First, find your sunny spot. Look for a place where lots of sun is shining.\"\n   - \"Feel the ground or wall with your hand. Is it warm? Hot? Cool?\"\n   - \"Now use the thermometer. Point it at the sunny spot. Watch the number on the screen. What do you see?\"\n   - \"Write or draw the number on your paper.\"\n   - \"Now find your shady spot — a place where the sun is NOT shining directly.\"\n   - \"Feel it with your hand. Is it different?\"\n   - \"Use the thermometer on the shady spot. Write or draw that number.\"\n   - \"Draw a picture: Is the sunny spot warmer or cooler than the shady spot?\"\n\n3. **Documentation:**\n   - Students record by drawing or with teacher assistance (writing numbers).\n   - Teacher takes photos of the two spots for later discussion.\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What number do you see? Is that higher or lower than the other spot?\"\n- Do NOT tell students which is warmer; let them discover it.\n- Help manage the thermometer safely and ensure all students get a turn.\n- Use open-ended prompts: \"What do you notice? Tell me more about that.\"\n\n**Expected Student Outcomes:**\n- Students will observe and record (through drawing or numbers) that sunny areas have higher temperatures than shady areas.\n- Students will articulate in simple words that the sun makes places warmer.\n- Evidence: drawings, thermometer readings, verbal descriptions.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Build shared understanding of heat and the sun's warming effect through guided discussion and introduction of vocabulary.\n\n**Materials:**\n- Chart paper with pre-drawn two columns (one labeled with sun symbol, one with cloud/shade symbol)\n- Markers\n- Photos or sketches from Explore phase\n- Photograph displayed again\n\n**Activity:**\n\n1. **Group Share-Out (7–10 minutes):**\n   - Gather students in a circle. Show photos from the outdoor investigation.\n   - \"Which spots were warmer?\" Listen to student responses.\n   - \"How do you know? What did you see on the thermometer?\"\n   - Write or draw responses on chart paper under the two columns.\n   - Reinforce: \"Every group found the same thing! The sunny places were warmer!\"\n\n2. **Introduce Vocabulary (5–7 minutes):**\n   Use Kindergarten-friendly language and lots of pointing/demonstration:\n\n   - **Heat:** \"Heat is warmth. We feel heat from the sun. It makes things hot.\"\n   - **Temperature:** \"Temperature tells us how warm or cool something is. The thermometer shows the temperature.\"\n   - **Sunlight:** \"Sunlight is energy from the sun. It travels all the way to us and makes things warm.\"\n   - **Shade:** \"Shade is a place where sunlight is blocked, like under a tree or a roof. It stays cooler.\"\n\n3. **Connection Back to Photograph:**\n   - Redisplay the thermometer photo.\n   - \"Look at those dark stripes on the ground — that's shade! The lighter parts have more sun. That's why someone used the thermometer here — to measure the difference!\"\n   - \"The sun's energy is so strong, it can make bricks warm up!\"\n\n4. **Check for Understanding:**\n   - Ask students to point to the sunny area in the photo: \"Where is the sun shining?\"\n   - Ask: \"If you could pick, would you sit in the sun or in the shade on a hot day? Why?\"\n   - Listen for responses showing they understand the sun makes things warmer.\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Heat** | Warmth that comes from the sun and makes things feel hot |\n| **Temperature** | How warm or cool something is (what a thermometer measures) |\n| **Sunlight** | Energy that comes from the sun and travels to Earth |\n| **Shade** | A cool place where sunlight is blocked or blocked (like under a tree) |\n| **Thermometer** | A tool that measures how warm something is |\n\n**Expected Student Outcomes:**\n- Students can identify sunny vs. shady places.\n- Students understand that sunlight makes things warmer.\n- Students can use the word \"warm,\" \"cool,\" \"sun,\" and \"shade\" appropriately.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding of the sun's warming effect by designing and testing a simple sunshade structure.\n\n**Materials:**\n- Per group: 1 white paper plate or white cardboard square (4\"×4\")\n- Craft materials: popsicle sticks, paper clips, tape, string\n- Per group: 1 small thermometer or temperature-sensitive color-changing card\n- Small cardboard boxes (1 per group) to serve as a base/ground\n- Markers for labeling\n\n**Activity:**\n\n1. **Introduction (2–3 minutes):**\n   - \"We learned the sun makes things warm. Now you're going to design a sunshade — something to keep the sun from warming up the ground!\"\n   - Show a simple example: a popsicle stick with paper taped to it as a tiny umbrella.\n   - \"Your job: build a shade structure that can cover this thermometer and block the sun.\"\n\n2. **Design Challenge (10–12 minutes):**\n   - **Step 1:** \"What could you use to block the sun? Choose your materials.\"\n   - **Step 2:** \"Build your sunshade. It needs to shade the thermometer but not touch it.\"\n   - **Step 3:** \"Place your thermometer in the open sun. Record the temperature.\"\n   - **Step 4:** \"Place your thermometer under your new shade. Wait 2–3 minutes. Record the new temperature.\"\n   - **Step 5:** \"Did your shade work? Is the temperature cooler under it? Draw or tell about your discovery.\"\n\n3. **Student Directions (Read aloud):**\n   - \"Build something that makes shade using sticks, tape, and paper.\"\n   - \"Your sunshade should keep sun off the thermometer.\"\n   - \"Check: Is the temperature different under your shade? Cooler is better!\"\n\n4. **Teacher Role:**\n   - Provide materials and help with assembly (taping, securing structures).\n   - Ask: \"Why do you think the shade makes it cooler?\" (to encourage reflection, not judgment).\n   - Encourage iteration: \"What could you change to make it even better?\"\n   - Document with photos of structures.\n\n**Expected Student Outcomes:**\n- Students design a simple structure that provides shade.\n- Students observe that a shade reduces warming from sunlight.\n- Students collect two temperature measurements and compare them.\n- Evidence: the physical structure, recorded temperatures (or pictures of numbers), and verbal explanations of the difference.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of sunlight's warming effect and their ability to observe and compare temperatures.\n\n**Activity:**\n\n1. **Formative Assessment (During the lesson):**\n   - **Observation during Explore:** Watch for students accurately comparing sunny vs. shady areas and attempting to use the thermometer.\n   - **Questioning during Explain:** Listen for use of vocabulary terms (warm, shade, sunlight) and understanding that sun makes things warmer.\n   - **Observation during Elaborate:** Assess whether students successfully created a functional shade structure and made temperature comparisons.\n\n2. **Exit Ticket / Summative Assessment (5–7 minutes):**\n\n   Use one or more of these strategies:\n\n   - **Show & Tell Thermometer:** Hold up an image of the original photo. Ask:\n     - \"Show me with your hand: which part of this picture is in the sun?\" (Students point.)\n     - \"Is that part warmer or cooler?\" (Students respond: warmer.)\n     - \"Why?\" (Listen for: \"Because the sun makes it warm.\")\n\n   - **Picture Sorting:** Show 3–4 photos of sunny and shady places (playground, classroom with shade/sun, sidewalk). Ask: \"Which of these places would be warmer?\" Students point or sort into two piles.\n\n   - **Drawing Exit Ticket:** Have students draw one sunny place and one shady place, then draw the sun on the sunny picture. Label with \"warm\" or \"cool\" (teacher writes or student draws).\n\n   - **Verbal Reflection:** Ask individually or as a group:\n     - \"When you go outside today, what could you use to stay cool from the sun?\" (Listen for shade-related answers: tree, umbrella, building.)\n\n3. **Success Criteria for Meeting Learning Objectives:**\n\n   | Learning Objective | Success Indicator |\n   |-------------------|-------------------|\n   | Observe and describe how sunlight makes places warmer | Student correctly identifies sunny vs. shady places and states that the sunny place is warmer |\n   | Identify and compare sunny and shady areas | Student can point to or describe a sunny and a shady location and explain the difference |\n   | Use a thermometer to record temperatures | Student attempts to use the tool and records/draws two different numbers or observations |\n   | Design and test a sunshade structure | Student builds a structure that reduces temperature under it, as shown by a lower reading or student statement |\n\n**Expected Student Outcomes:**\n- 80% of students can identify that sunlight makes things warmer.\n- 70% of students can successfully use a thermometer (with guidance) and compare two readings.\n- 75% of students design a shade that reduces temperature under it.\n- Students use key vocabulary (sun, warm, shade, cool) appropriately in context.\n\n---\n\n## Differentiation\n\n### Support (Scaffolding for Struggling Learners)\n\n1. **Pair with a Partner:** Assign students who struggle with observation or fine motor skills to work with stronger peers during the Explore and Elaborate phases. This allows them to participate fully while building confidence.\n\n2. **Simplified Thermometer Use:** For students who cannot read numbers, use a non-digital thermometer with large colors (blue = cold, red = hot). Or use a temperature-sensitive color-changing card instead of a thermometer — no reading required; just observe the color change.\n\n3. **Shorter Shade Design:** Instead of building from scratch, provide pre-cut paper \"shades\" attached to popsicle sticks. Students simply place them over a thermometer and observe the effect. This removes the construction barrier while keeping the science intact.\n\n4. **Visual Supports:** Use picture schedules showing the steps: sunny spot → feel it → measure it → shady spot → feel it → measure it → compare.\n\n### Challenge (Extensions for Advanced Learners)\n\n1. **Multi-Location Investigation:** Advanced students predict and test temperatures of three or more locations (concrete, grass, metal, etc.) and rank them from warmest to coolest. They can create a chart or graph with teacher support.\n\n2. **Material Testing:** Provide different materials (dark paper, white paper, aluminum foil, cloth) and have students predict which will get warmest in the sun and test them with a thermometer. Discuss why some colors/materials absorb more heat.\n\n3. **Shade Design Optimization:** Challenge students to design the \"best\" sunshade — one that blocks the sun but allows airflow, or one that can stand on its own, or one made from recycled materials. Test multiple designs and compare results.\n\n4. **Time-Based Observation:** Have advanced students check temperature at different times (start of Explore, middle, end) and notice if the shaded area gets warmer as time passes, introducing the idea that shade can help but the sun's energy is persistent.\n\n---\n\n## Extension Activities\n\n1. **Shadow Investigation:** On a sunny day, have students trace their own shadows on the ground at different times (beginning, middle, end of outdoor time). Notice how shadows move and change. Discuss: \"The sun is moving, so the shade moves too!\" Connect to keeping cool.\n\n2. **Sunscreen / Sunshade Scavenger Hunt:** Take a classroom walk and identify all the places where there is natural shade (trees, buildings, awnings) and places with no shade. Discuss why people might choose to sit or play in shaded areas. Tie to sun safety and heat awareness.\n\n3. **Home Temperature Challenge:** Send home a simple chart asking families to find a sunny and shady spot in their home and compare which feels warmer. Students bring back drawings or descriptions to share with the class, extending the learning to their own environment. (Note: no thermometer required — just observation with senses.)\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety First:** Remind students never to look directly at the sun. Thermometers can be handled safely, but supervise all use.\n- **Timing:** This lesson works best on a sunny day with outdoor access. If indoor only, use a sunny window and compare temperatures on the sill vs. a few inches away from direct sunlight.\n- **Thermometer Choice:** An infrared thermometer (as in the photo) is ideal but not required. Any classroom thermometer will work; focus on the concept, not the specific tool.\n- **Vocabulary Repetition:** Use new vocabulary consistently throughout the day and in future lessons (e.g., \"Find a shady spot for lunch,\" \"Is it warm in the sun today?\").\n- **Student Language:** Kindergarteners may not use \"temperature\" fluently; focus on \"warm\" and \"cool\" as primary descriptors. Introduce \"temperature\" as the word for \"how warm it is.\"\n\n---\n\nThis lesson directly engages students with the photograph's visible elements (thermometer, sunny vs. shady surfaces, brick wall) while building toward NGSS K-PS3-1 and K-PS3-2 through authentic, hands-on investigation and design challenges appropriate for five-year-olds.",
  "inputTokens": 2910,
  "outputTokens": 4201,
  "cost": 0.023915,
  "generatedAt": "2026-02-13T01:31:20.335Z"
}