{
  "title": "Kinetic Energy",
  "category": "physical-science",
  "imageFile": "kinetic_energy.jpg",
  "imagePath": "images/physical-science/kinetic_energy.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Motion and Energy at the Skate Park\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Motion and Force:** The skateboarder demonstrates how pushing and jumping create movement; the skateboard moves forward when force is applied to it.\n- **Speed and Direction:** The skateboard travels at different speeds depending on the force applied; the skateboarder changes direction by shifting body position and weight.\n- **Energy Transfer:** The skateboarder's body energy is transferred to the skateboard, causing it to move; the skateboard's motion comes from the energy the skateboarder provides.\n- **Cause and Effect Relationships:** Actions (pushing, jumping) cause reactions (skateboard moving, changing direction); changes in force result in changes in motion.\n\n---\n\n## Lesson Title\n\n**Pushes and Pulls Make Things Move: Exploring Energy at the Skate Park**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes across two 45-minute sessions (or one extended 90-minute block)\n- **NGSS Standards:** \n  - *2-PS1-2:* Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.\n  - (Note: This lesson emphasizes motion and forces as foundations for understanding that objects need pushes/pulls to move—aligned with grade 2 physical science practices, though not explicitly listed in the provided PS-only standards. The lesson uses 2-PS1-2 as the closest alignment for testing materials' properties and purposes.)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how pushes and pulls cause objects to move in different directions and at different speeds.\n2. Explain that energy from one object (like a person) can transfer to another object (like a skateboard) to make it move.\n3. Predict how changes in the size or strength of a push affect how far or fast an object moves.\n4. Test different materials or wheel types to determine which work best for rolling objects, using observations as evidence.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Photograph of skateboarder at skate park (projected or printed)\n- Chart paper and markers for recording questions\n\n**Activity:**\n\n1. **Display the photograph** on the board or document camera. Allow 30 seconds of silent observation.\n\n2. **Ask these discovery questions** (one at a time, pausing for responses):\n   - \"What is happening to the skateboard in this picture? Is it sitting still or moving?\"\n   - \"What do you think made the skateboard start moving? Where did that movement come from?\"\n   - \"Look at the skateboarder's arms and legs. What are they doing? How might that help the skateboard go faster?\"\n   - \"If the skateboarder pushed harder, what do you think would happen to the skateboard?\"\n\n3. **Record student wonderings** on chart paper. Accept all ideas without judgment (e.g., \"Does the skateboard need a push to move?\" \"Can you make a skateboard go really fast?\").\n\n4. **Prediction prompt:** \"I'm going to give you a skateboard (or a toy car with wheels) and a ramp. What do you think will happen when you push it? Will it go fast or slow? Will it go far or just a little bit?\"\n\n**Transition:** Now that we've wondered about what makes skateboards move, let's test our ideas with our own rolling objects and see what we discover!\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:** (per small group of 3–4 students)\n- 1 toy car, rolling toy, or skateboard toy (not full-sized)\n- 1 foam ramp or homemade ramp (2–3 boards leaning at slight angle, or tilted clipboard)\n- 1 smooth surface (wood plank, tile, or smooth floor space)\n- 1 rough surface (sandpaper, carpet, or grass area outside)\n- Measuring tape or string cut into 12-inch segments\n- Chart for recording: \"How Far Did It Roll?\" (pre-drawn)\n- Safety goggles (if needed for classroom comfort)\n\n**Activity: \"Testing How Pushes Change Rolling\"**\n\n**Step-by-step student directions:**\n\n1. **Setup:** Place your toy car at the start line on the smooth surface. Decide who will be the \"pusher,\" who will be the \"measurer,\" and who will be the \"recorder.\"\n\n2. **Gentle push test:** The pusher gives the car a *gentle, small push* and releases it. Measure how far it travels before stopping. Record the distance in inches on your chart. Make a prediction about what will happen next.\n\n3. **Medium push test:** The pusher gives the car a *medium push* (stronger than the gentle one) and releases it. Measure and record the distance. Was this farther or closer than the gentle push?\n\n4. **Big push test:** The pusher gives the car a *big, strong push* and releases it. Measure and record the distance. What do you notice now?\n\n5. **Change the surface:** Repeat one of the pushes (your choice—gentle, medium, or big) on the *rough surface* (carpet or sandpaper). Measure and record. How does this distance compare to the smooth surface?\n\n6. **Draw or write:** On your chart, create a simple picture or write a sentence about what you discovered: \"When we push harder, the car goes ___.\"\n\n**How the activity connects to the photograph:**\nJust as the skateboarder uses pushes and jumps to make the skateboard move across the concrete park, your pushes make the toy car roll. The stronger the push, the more energy you give to the car!\n\n**What students should record or document:**\n- Distances (in inches or by marking with tape on floor)\n- Comparison statements (\"Gentle push went to here; big push went to here\")\n- Rough vs. smooth surface observations\n- A simple drawing or sentence about the relationship between push strength and distance\n\n**Teacher Role:**\n- Circulate to each group and ask guiding questions: \"What happened when you pushed harder?\" \"Why do you think the car stopped on the rough surface sooner?\"\n- Do NOT tell students answers; instead, reflect their observations back to them: \"I see the car went much farther with a big push. What does that tell you?\"\n- Help groups that struggle with measurement by marking distances with tape on the ground instead of using rulers.\n\n**Expected Student Outcomes:**\n- Students will observe and record that stronger pushes cause objects to travel farther.\n- Students will notice that surface texture (smooth vs. rough) affects how far an object rolls.\n- Students will make a causal connection: bigger pushes = more movement.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Large chart with vocabulary words and simple drawings\n- Photographs from Explore phase or simple student drawings\n- The original skateboarder photograph (for reference)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 2–3 groups to share one discovery: \"We found that when we pushed [gently/medium/hard], the car went [far/not very far].\"\n   - Display their measurement charts visibly so all can see patterns.\n   - Ask the class: \"What do you notice? Did the same thing happen in every group?\"\n\n2. **Introduce key vocabulary (8 minutes):**\n   Using simple language and drawings on chart paper, teach these terms:\n\n   **Vocabulary:**\n   - **Push/Pull:** A force that makes something move. A push moves something *away* from you; a pull moves something *toward* you. *Example: The skateboarder pushes off the ground to make the skateboard move.*\n   - **Force:** The strength or power of a push or pull that makes things move or change direction. *Example: A strong push is a big force; a gentle push is a small force.*\n   - **Energy:** The power that makes things move and change. It comes from living things (like the skateboarder) and can be transferred to objects (like the skateboard). *Example: The skateboarder's energy makes the skateboard go.*\n   - **Motion:** Movement. Something in motion is going from one place to another. *Example: The skateboard in the picture is in motion—it's moving through the air.*\n   - **Speed:** How fast something is moving. More force = faster speed; less force = slower speed. *Example: A big push made your car go fast; a gentle push made it go slow.*\n\n3. **Connections back to the photograph and Explore activity (5 minutes):**\n   - Point to the skateboarder: \"The skateboarder gives a big push or jump to transfer energy to the skateboard. Just like you pushed your toy car, the skateboarder is pushing!\"\n   - Show a student's chart: \"When you pushed hard, the car traveled far and fast. The skateboarder is doing the same thing—a powerful push makes the skateboard go far and fast across the park!\"\n   - Draw an arrow on the board: Push (force) → Movement (motion). \"The push is the force. The moving is the motion. The push causes the motion!\"\n\n4. **Check for understanding (2 minutes):**\n   Ask these quick comprehension questions:\n   - \"What happens to the skateboard when the skateboarder pushes hard?\" (It moves fast and far.)\n   - \"Does the skateboard move by itself, or does it need a push?\" (It needs a push; it needs force.)\n   - \"When I push my toy car gently, does it go as far as when I push it hard?\" (No, the gentle push doesn't make it go as far.)\n\n**Expected Student Outcomes:**\n- Students understand that pushes and pulls are forces that cause motion.\n- Students can use the word \"energy\" to describe what the skateboarder transfers to the skateboard.\n- Students recognize that stronger forces create faster, longer motion.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:** (per small group)\n- 1 toy car or rolling object\n- 2–3 different types of \"wheels\" or surfaces to test (e.g., toy car with plastic wheels, toy with rubber wheels, a wooden block on different wheel types, or cotton balls for \"wheels\" vs. normal wheels)\n- Smooth testing surface (tape a lane on floor)\n- Data chart: \"Which Wheels Roll Best?\" (pre-drawn with columns for wheel type and distance)\n\n**Activity: \"Engineer's Challenge—Which Wheels Work Best?\"**\n\n**Scenario:** \"Imagine you are building a skateboard. You need to choose the best wheels so the skateboard rolls far and fast when pushed. Let's test different wheel types to see which works best!\"\n\n**Student directions:**\n\n1. **Predict:** Look at the different wheels or wheel types. Which do you think will make the car roll the farthest? Draw or write your prediction.\n\n2. **Test wheel type 1:** Attach or use wheel type 1 (e.g., plastic wheels). Give the car a *medium push* (same push every time—this is important!). Measure how far it rolls. Record on the data chart.\n\n3. **Test wheel type 2:** Repeat with a different wheel type using the same medium push. Record the distance.\n\n4. **Compare and conclude:** Look at your two distances. Which wheels made the car roll farther? Which wheels would you choose for your skateboard? Why?\n\n5. **Explain your thinking:** Draw or write: \"The best wheels are _____ because _____.\"\n\n**Teacher Role:**\n- Emphasize: \"You need to push the same way every time so the test is fair. If you push different amounts, you won't know if the wheels are different or if the pushes were different.\"\n- Ask: \"How is this like the skateboarder choosing a skateboard? The skateboarder wants wheels that roll really well so the skateboard goes fast!\"\n- Help students see that material properties (smooth wheels vs. rough wheels) affect motion.\n\n**Expected Student Outcomes:**\n- Students will test materials and use data to determine which properties (like wheel type) are best suited for the purpose of rolling far and fast.\n- Students will make evidence-based claims: \"These wheels roll farther because they are smoother/rounder/etc.\"\n- Students will connect this to real-world skateboarding: \"A skateboard needs good wheels just like the one in the picture.\"\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of pushes, pulls, energy, and motion.\n\n**Activity:** Multi-part assessment using formative and summative strategies\n\n**Formative Assessment (during lesson):**\n- Observation checklist during Explore phase: Can students accurately measure and record? Do they notice the relationship between push strength and distance?\n- Listen to group discussions during Explain phase: Are students using new vocabulary correctly?\n- Review student predictions during Elaborate phase: Did students make reasonable guesses based on observations?\n\n**Exit Ticket / Summative Assessment:**\nProvide each student with a simple paper exit ticket with 2–3 questions (show pictures where possible; read aloud for students who need support):\n\n**Question 1:** \"Look at this picture of a girl pushing a toy car. What will happen to the car?\"\n- A) The car will stay in the same place.\n- B) The car will move away from the girl.\n- C) The car will fly into the air.\n- *Correct answer: B*\n\n**Question 2:** \"If you push a toy car very hard, what happens?\"\n- Draw or write: The car will go _______ (far/fast/both).\n\n**Question 3:** \"In the skateboard picture, the skateboarder is in the air. What made the skateboard start moving?\"\n- Draw or write a simple explanation (e.g., \"The skateboard moved because the person pushed it\" or \"The person gave it energy\").\n\n**Success Criteria for Understanding:**\n- ✓ Student correctly identifies that a push causes motion (Q1, answer B).\n- ✓ Student understands that stronger pushes cause greater distance/speed (Q2).\n- ✓ Student recognizes that force from the skateboarder transfers to the skateboard (Q3).\n\n**Expected Student Outcomes:**\n- 80% of students will answer Q1 and Q2 correctly.\n- Students will provide at least a simple explanation for Q3 (even if only a picture).\n- Student work will show understanding of the cause-and-effect relationship between pushes and motion.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified vocabulary:** Use only \"push,\" \"move,\" and \"fast/slow\" if \"force\" and \"energy\" are too abstract. Revisit these terms in future lessons.\n\n2. **Peer partnerships:** Pair struggling students with stronger peers during Explore and Elaborate phases. Assign roles (measurer, recorder, pusher) that don't require reading/writing if that's a barrier.\n\n3. **Concrete measurement:** Instead of rulers, use tape flags on the ground or yarn segments to mark distances. Students can count \"jumps\" of a set distance or use body parts (\"How many hand-widths did it travel?\").\n\n4. **Visual supports:** Provide picture cards with push/pull examples and label them with words. Refer to these repeatedly during Explain phase.\n\n5. **Reduced data collection:** Have these students focus on only 2 push strengths (gentle vs. hard) rather than 3, or test only one surface type.\n\n### Challenge (for advanced learners)\n\n1. **Angle investigation:** \"If we tilt the ramp at different angles, does the car go farther or faster? Let's test 3 different tilt angles and graph the results.\"\n\n2. **Friction deep dive:** \"What materials slow down rolling objects? Test: carpet, sandpaper, wax paper, and tile. Rank them from 'most friction' to 'least friction.'\"\n\n3. **Multi-variable experiment:** \"We found that wheel type matters. But does pushing angle matter too? Let's push straight forward, at an angle, and upward. What's the difference?\" (Introduce idea of direction mattering.)\n\n4. **Real-world connection:** \"Research and draw: What do you think a skateboarder is thinking about when choosing a skateboard? Wheels? Shape? Why?\" (Bridge to engineering and design thinking.)\n\n5. **Data graphing:** Have advanced students create a bar graph or simple pictograph of their Explore data showing push strength vs. distance, labeled with words.\n\n---\n\n## Extension Activities\n\n1. **Build Your Own Ramp (at home or in later lesson):** \n   Provide families with a take-home sheet: \"Gather a toy car, a ruler or measuring tape, and something to make a ramp (books, a board, etc.). Test your car on 3 ramps at different angles. Which angle makes the car go fastest? Bring your results back to class to share!\" This extends the Elaborate phase into a real-world context.\n\n2. **Skateboard Park Design Challenge (whole class or small group):**\n   \"Now that you know about pushes, forces, and motion, design a skate park! Draw or build (with blocks) a park with ramps, curves, and flat areas. Where would a skateboarder need to push hard? Where could they coast? Label your design and explain your thinking.\" (Connects to engineering practices and real-world application.)\n\n3. **\"Pushes and Pulls Around Us\" Discovery Walk (classroom or hallway):**\n   Take students on a 10-minute walk. Challenge them to find and point out things in your school that use pushes and pulls (doors opening, balls rolling, toy cars, playground equipment). Create a class \"Pushes and Pulls\" poster with photos or drawings of examples. (Reinforces vocabulary and real-world connections.)\n\n4. **Video or Picture Sort Activity (early finishers):**\n   Provide a set of 8–10 pictures or short video clips showing different motions (child running, car rolling, ball being thrown, door closing, person sitting still). Students sort them into \"Uses a Push or Pull\" and \"No Push or Pull Needed.\" Discuss results. (Reinforces concept understanding through classification.)\n\n5. **Creative Story Writing (advanced or homework):**\n   \"Write (or draw and label) a story about the skateboarder in the picture. What is the skateboarder thinking? What will they do next? How will they make the skateboard go? Use the words: push, move, fast, energy.\" (Combines literacy with science vocabulary and creative thinking.)\n\n---\n\n## Teacher Notes and Tips\n\n- **Safety:** Keep the Explore activity to smooth, flat, open floor space. Ensure students wear safety goggles if testing wheels at speed or if objects are rolling unpredictably.\n- **Measurement support:** Second graders may struggle with precise measurement. Pre-mark distances with tape (0 inches, 6 inches, 12 inches, 18 inches) so students can see the pattern without needing a ruler.\n- **Realism check:** The original photograph shows a highly skilled skateboarder doing a trick. Clarify that the skateboard is moving *because of the skateboarder's push/energy*, not magic, and that this skateboarder has practiced for a long time. Frame it positively: \"This person knows a lot about how pushes and forces work on a skateboard!\"\n- **Vocabulary revisiting:** These concepts (force, energy, motion) will be revisited in third and fourth grade. Your goal is for second graders to have concrete, observable understanding—not formal definitions. Build from \"I saw the car go farther\" to \"The bigger push made the car go farther\" to \"The force changed the motion.\"\n\n---\n\n**This lesson plan provides a complete, ready-to-teach framework that moves students from curiosity to hands-on discovery to formal understanding and real-world application. All activities are classroom-feasible and aligned to second-grade developmental levels.**",
  "inputTokens": 2384,
  "outputTokens": 4709,
  "cost": 0.025929000000000004,
  "generatedAt": "2026-02-13T02:25:39.776Z"
}