{
  "id": 0,
  "title": "Kinetic_energy",
  "category": "physical-science",
  "imageFile": "kinetic_energy.jpg",
  "imagePath": "images/physical-science/kinetic_energy.jpg",
  "gradeLevel": "Third Grade",
  "content": "# Third Grade Science Lesson: Kinetic Energy in Motion\n\n## 📸 Photo Description\n\nIn this image, a skateboarder is performing a trick at a concrete skate park, jumping high into the air while the skateboard flips beneath them. The skateboarder's body is stretched out with arms extended, showing the energy of movement. You can see the skateboard in mid-air below them, and other people watching in the background.\n\n## 🔬 Scientific Phenomena\n\n**Anchoring Phenomenon:** A moving skateboard and skateboarder demonstrate **kinetic energy**—the energy of motion.\n\n**Why This Happens:** When the skateboarder pushes off the ground, they transfer energy to their body and the skateboard, making them move. Objects that are moving have kinetic energy. The faster something moves, the more kinetic energy it has. Even though the skateboard is in the air (separated from the skateboarder), it still has kinetic energy because it's moving through space.\n\n## 📚 Core Science Concepts\n\n* **Kinetic Energy:** Energy that an object has because it is moving. The skateboard, the skateboarder, and even their arms and legs all have kinetic energy in this photo.\n\n* **Force and Motion:** The skateboarder used force (a push) to make the skateboard and their body move. A force is a push or pull that can change how something moves.\n\n* **Speed and Movement:** The faster an object moves, the more kinetic energy it has. The skateboarder is moving very quickly here, so they have lots of kinetic energy.\n\n* **Energy Transfer:** The skateboarder's muscles created energy that was transferred to the skateboard through a push, making it move across the ground and then launch into the air.\n\n<pedagogical-tip>\nHelp students connect kinetic energy to their own bodies by having them run, skip, and walk at different speeds. Ask them: \"When are you using more kinetic energy—when you walk slowly or run fast?\" This makes an abstract concept concrete and personal.\n</pedagogical-tip>\n\n<udl-suggestions>\nProvide multiple ways for students to engage with kinetic energy: (1) Visual learners can watch slow-motion videos of skateboarders; (2) Kinesthetic learners can move their own bodies at different speeds and feel the difference; (3) Verbal learners can discuss and explain what they see; (4) Use simplified sentence frames like \"The skateboard is moving because ___.\" to support students with varying language levels.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n**Performance Expectation:** 3-PS2-1: Plan and conduct an investigation to provide evidence that balanced and unbalanced forces on an object will change the object's motion.\n\n**Disciplinary Core Ideas:**\n- [[NGSS:DCI:3-PS2.A]]: Forces and Motion\n- [[NGSS:DCI:3-PS2.B]]: Types of Interactions\n\n**Crosscutting Concepts:**\n- [[NGSS:CCC:Cause and Effect]]\n- [[NGSS:CCC:Energy and Matter]]\n\n## 💬 Discussion Questions\n\n1. What made the skateboard and the skateboarder move through the air? (Bloom's: Understand | DOK: 1)\n\n2. How do you think the skateboarder's kinetic energy would change if they pushed even harder with their legs? (Bloom's: Predict | DOK: 2)\n\n3. Why does the skateboard have kinetic energy even though it's not touching the ground anymore? (Bloom's: Analyze | DOK: 3)\n\n4. If the skateboarder was moving slower, how would their kinetic energy be different? (Bloom's: Analyze | DOK: 2)\n\n## 📖 Vocabulary\n\n* **Kinetic Energy:** The energy that something has when it is moving.\n\n* **Force:** A push or pull that makes something move or changes how it moves.\n\n* **Motion:** When something changes position and moves from one place to another.\n\n* **Speed:** How fast something is moving.\n\n* **Energy:** The power to make things move or change.\n\n* **Push:** Using force to move something away from you.\n\n## 🌡️ Extension Activities\n\n1. **Speed Investigation:** Have students race toy cars or roll balls down ramps at different heights. Ask: \"Does a car that moves faster have more or less kinetic energy?\" Students can observe and record which objects move faster and discuss why.\n\n2. **Human Kinetic Energy Exploration:** In a safe space (gym or outdoor area), have students walk, jog, and run while you clap at different speeds. Ask them to match their movement to the clapping speed. Then discuss: \"When were you using more kinetic energy—when you walked or when you ran?\"\n\n3. **Energy Stopping Challenge:** Students can push toy cars and try to stop them by placing obstacles in the path. Discuss: \"Why is it harder to stop a fast-moving car than a slow-moving car?\" Connect this to kinetic energy.\n\n## 📚 External Resources\n\n**Children's Books:**\n- *Motion* by David Adler (explores how things move and why)\n- *Push and Pull* by Lola M. Schaefer (introduces forces that create movement)\n- *What Makes It Move?* by Richard Lindsey (explores energy and motion in everyday objects)\n\n**YouTube Videos:**\n- **\"Kinetic Energy for Kids,\"** Crash Course Kids\n  https://www.youtube.com/watch?v=ZR1H7s8mB-o\n  This video explains kinetic energy using relatable examples and animations that third graders can understand.\n\n- **\"Forces and Motion for Kids,\"** National Geographic Kids\n  https://www.youtube.com/watch?v=jKUPqj-QSfY\n  Shows real-world examples of motion and forces in action, including sports and skateboarding.",
  "generatedAt": "2026-02-05T18:22:37.241Z"
}