{
  "title": "Kinetic Energy",
  "category": "physical-science",
  "imageFile": "kinetic_energy.jpg",
  "imagePath": "images/physical-science/kinetic_energy.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Skateboard Jumps and Motion\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Unbalanced Forces:** The skateboarder applies a force (pushing off) that overcomes gravity, causing the skateboard and rider to move and become airborne.\n- **Motion and Speed:** The skateboard accelerates across the concrete surface and moves through the air in a predictable path before returning to the ground.\n- **Energy Transfer:** The skateboarder's muscle energy is transferred to the skateboard, propelling it forward and upward.\n- **Gravity's Effect on Motion:** After the skateboard leaves the ground, gravity pulls it (and the rider) back down, demonstrating how forces affect an object's path.\n\n---\n\n## Lesson Title\n\n**Pushing, Flying, Landing: How Forces Make Things Move**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes (two 45-minute sessions, or one extended session)\n- **NGSS Standards:** \n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object.\n  - 3-PS2-2: Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** how a push or pull (force) causes an object to move faster, slower, or change direction.\n2. **Predict** what will happen to a rolling object when they apply different amounts of force to it.\n3. **Explain** using simple language how forces (like pushing) affect the motion of objects (like skateboards or toy cars).\n4. **Record data** about motion in a chart or drawing to show patterns in how objects move.\n\n---\n\n## 5E Lesson Sequence\n\n---\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about forces and motion using the skateboard photograph.\n\n**Materials:**\n- Projected photograph of the skateboarder (or printed copies, 8.5\" × 11\" on cardstock)\n- Chart paper and markers\n- Student Science Journals (or paper with space to draw and write)\n\n**Activity:**\n\n1. **Display the Photograph:** Project the skateboard jump image on the board or pass around a printed copy. Allow students 30 seconds of silent looking before speaking.\n\n2. **Launch with Wonder:** Say aloud: *\"Look carefully at this picture. What do you think just happened? What is the skateboarder doing RIGHT NOW in this moment?\"* Pause for thinking time (5–10 seconds).\n\n3. **Guided Discussion Questions (ask these in order):**\n   - **\"Why do you think the skateboard left the ground? What made that happen?\"** *(Listen for: pushing, jumping, going fast, the skateboarder pushed with their foot.)*\n   - **\"If the skateboarder pushes harder with their foot, what do you think will happen to how high or far they jump?\"** *(Accept predictions without judgment.)*\n   - **\"What will bring the skateboard back down? Why doesn't it just keep flying?\"** *(Guide toward gravity—\"something pulling it down\"—without using the term yet.)*\n   - **\"Have you ever pushed something and watched it move? Tell me about it.\"** *(Activate prior knowledge of forces.)*\n\n4. **Prediction Prompt:** Ask students to draw in their Science Journals: *\"Draw what you think happens RIGHT AFTER this picture—when the skateboard lands.\"* Give 2–3 minutes for drawing.\n\n**Transition:** *\"Today, we're going to become scientists and test how pushing and pulling makes things move—just like the skateboarder. Let's explore!\"*\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate the relationship between force and motion through hands-on experimentation with toy cars or rolling objects.\n\n**Materials (per small group of 3–4 students):**\n- 1 toy car, skateboard, or rolling toy (alternative: use a small ball)\n- 1 meter stick or measuring tape (or chalk to mark distances on the ground/floor)\n- 1 ramp made from a wooden ruler propped on a block (or a book under one end)\n- 2–3 objects of different weights to use as \"pushers\" (e.g., wooden block, hand, foam block)\n- Chart paper labeled \"Distance Our Car Traveled\" with columns for \"Force\" (soft push, medium push, hard push) and \"Distance\"\n- Crayons or markers\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. **Set Up:** Place the toy car at the bottom of the ramp or on a flat surface (like a hallway or playground). Mark a starting line with tape or chalk.\n\n2. **Test 1—Soft Push:** One student gently pushes the car from the starting line. Another student watches and marks where the car stops (using chalk or tape). Measure the distance it traveled using the meter stick. Record this distance on the chart.\n\n3. **Test 2—Medium Push:** Move the car back to the starting line. Another student pushes with a medium amount of force. Mark where it stops. Measure and record.\n\n4. **Test 3—Hard Push:** Reset the car at the starting line. A student pushes as hard as they safely can. Mark and measure the distance traveled. Record this distance.\n\n5. **Observation:** Ask: *\"Which push made the car go the farthest? Which push made it go the shortest distance? Why do you think that happened?\"* Students should record observations (words or pictures) in their Science Journals.\n\n6. **Try It with a Ramp (if time allows):** Place the car at the top of the ramp. Release it (no push). Where does it stop? Then roll it down the ramp from different heights to see if height affects how far it travels.\n\n**Connection to Photograph:** *\"The skateboarder pushes hard with their foot—that's a big force. The harder they push, the faster they go, and the higher they can jump. Just like your car went farther when you pushed harder!\"*\n\n**What Students Record:**\n- Distance chart (numbers or pictures showing short, medium, and long distances)\n- Drawings of the car in motion\n- Written or oral observations: \"When we pushed hard, the car went ____. When we pushed soft, the car went ____.\"\n\n**Teacher Role:**\n- Circulate among groups. Ask guiding questions: *\"How did that push compare to the last one?\"* or *\"What do you notice about the distance when you use more force?\"*\n- Do NOT tell students \"harder push = longer distance.\" Let them discover it.\n- Help students accurately measure and record data.\n- Encourage students to explain *why* they think something happened, not just *what* happened.\n\n**Expected Student Outcomes:**\n- Students will discover and articulate that a bigger push (more force) makes the car travel farther.\n- Groups will produce a chart showing increasing distances with increasing force.\n- Students will begin to predict: *\"If we push even harder, it will go farther.\"*\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to the skateboard photograph and to broader physical science concepts.\n\n**Materials:**\n- Chart paper with vocabulary terms pre-written or revealed as you teach\n- Photograph of the skateboarder (displayed again)\n- Student Science Journals\n- Optional: a toy car or ball for teacher demonstration\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 2–3 groups to share their distance charts and one observation they made.\n   - Ask the class: *\"What did all the groups discover? What pattern do you see?\"* (Guide toward: bigger force = longer distance.)\n\n2. **Introduce Vocabulary (8–10 minutes):**\n   Present these terms with student-friendly definitions. Write on chart paper and leave visible for the rest of the unit.\n\n   **Vocabulary:**\n\n   - **Force:** A push or a pull. It makes things move, speed up, slow down, or change direction.\n     - *Student example: \"When you push a car, you are using a force.\"*\n\n   - **Motion:** When something is moving or changing position. It goes from one place to another.\n     - *Student example: \"The skateboard is in motion when it travels across the ground and through the air.\"*\n\n   - **Unbalanced Force:** A push or pull that is stronger than the forces pushing or pulling the other way. It causes motion to change.\n     - *Student example: \"The skateboarder's push is stronger than the friction trying to slow them down, so they accelerate.\"* (Use simpler language: *\"The push is bigger than what's slowing it down, so the skateboard moves.\"*)\n\n   - **Gravity:** An invisible force that pulls things toward Earth. It pulls the skateboarder (and skateboard) back down after a jump.\n     - *Student example: \"Gravity is why the skateboard comes back down. It's like Earth is pulling it.\"*\n\n3. **Connect Back to the Photograph (3–5 minutes):**\n   - Display the skateboard image again.\n   - Say: *\"The skateboarder uses a BIG FORCE when they push off the ground with their foot. That unbalanced force makes the skateboard accelerate—it goes faster and faster. The force is so strong, it lifts them into the air. But then GRAVITY takes over—an invisible force pulls the skateboard (and the rider) back down.\"*\n   - Point to the photograph: *\"Here, the skateboard is in MOTION. The skateboarder gave it a huge push—a force. That's why it's flying!\"*\n\n4. **Check for Understanding:**\n   - Ask: *\"If the skateboarder pushed with LESS force, what would happen? Would they jump as high?\"* (Expected response: No, they wouldn't go as far or as high.)\n   - Ask: *\"What force brings the skateboard back down?\"* (Expected response: Gravity.)\n   - Have students draw or write in their journals: *\"Show me a picture of a FORCE. Label it. What does it do?\"*\n\n**Expected Student Outcomes:**\n- Students use the terms **force**, **motion**, **unbalanced force**, and **gravity** in context (even if pronunciation or usage isn't perfect).\n- Students can point to the skateboard photograph and explain: *\"The skateboarder used a force (a push) to make the skateboard move.\"*\n- Students understand that bigger forces cause bigger changes in motion.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding of forces and motion to a new scenario and make predictions.\n\n**Materials:**\n- Paper ramps (ruler or cardboard bent slightly)\n- Toy cars or rolling balls (same as Explore phase)\n- Various \"obstacles\" or targets: paper cups (to knock down), tape to create a target area, or a box to \"land in\"\n- Tape or chalk for marking\n- \"Challenge Cards\" (see below)\n- Student Science Journals\n\n**Activity:**\n\n**Challenge: \"Design a Jump Course\"**\n\nPresent this scenario: *\"The skateboarder wants to practice jumps! Help them create a course where they have to jump over obstacles, land in a specific zone, and travel different distances. You'll use a toy car to test how much FORCE you need to jump it over things and where it lands.\"*\n\n**Student Directions:**\n\n1. **Design Phase:** In groups, students set up a simple obstacle course using cups, tape lines, or small boxes on a flat surface or ramp.\n   - Example: A tape line is the \"ramp.\" A paper cup is an \"obstacle to jump over.\" A chalk circle is the \"landing zone.\"\n\n2. **Predict:** Before rolling the car, students predict: *\"Do you think we need a soft push, medium push, or hard push to get our car over the cup?\"* Record prediction in journals.\n\n3. **Test:** Roll the car from the starting point with different amounts of force. Does it knock over the cup? Land in the zone? Go too far?\n\n4. **Adjust:** Try again with a different amount of force if needed. Record what worked: *\"We used a _______ push to make it work.\"*\n\n5. **Challenge Extension:** *\"Now, make TWO obstacles. What if the skateboarder has to jump over a cup AND land in a small square? How much force does that take?\"*\n\n**Connection to Real World:** *\"Skateboarders plan tricks by knowing HOW MUCH FORCE they need to land where they want. You just did what they do!\"*\n\n**Teacher Role:**\n- Ask: *\"What force do you think you need? Why?\"*\n- If students struggle: *\"Remember when we pushed soft, medium, and hard? Which one do you think will work here?\"*\n- Push thinking: *\"What if you need the car to stop in this zone? Would you use more or less force?\"*\n\n**Expected Student Outcomes:**\n- Students predict and test different amounts of force to solve a specific problem.\n- Students understand that controlling force helps you control where something lands.\n- Groups produce a simple diagram showing their obstacle course and the amount of force needed.\n- Students articulate: *\"We used a hard push because we needed it to go far and jump over the cup.\"*\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of forces, motion, and how forces affect movement.\n\n**Activity:**\n\n**Formative Assessment (Throughout the Lesson):**\n- During Explore: Observe and listen to groups. Do they notice the relationship between push strength and distance? Can they explain why?\n- During Explain: Listen to student responses to check-for-understanding questions. Can they use \"force\" and \"motion\" correctly?\n- During Elaborate: Watch for ability to predict force needed and adjust based on results.\n\n**Exit Ticket / Summative Assessment (5–10 minutes):**\n\nGive each student a slip of paper or a section of their Science Journal. Ask them to respond to these prompts (accept drawings, words, or a mix):\n\n**Exit Ticket Questions:**\n\n1. **\"Draw a picture showing a FORCE. What does it do?\"**\n   - *Success Criteria:* Student shows a push or pull (even a simple arrow or stick figure pushing something). They write or say, \"It makes things move\" or similar.\n\n2. **\"If you wanted to push a toy car a LONG distance, would you push soft or hard? Why?\"**\n   - *Success Criteria:* Student says \"hard\" and gives a reason: \"because bigger pushes make it go farther\" or \"the harder you push, the farther it goes.\"\n\n3. **\"Why does the skateboarder come back down after jumping?\"** (Show the photograph again.)\n   - *Success Criteria:* Student mentions gravity or \"something pulling down\" or \"Earth pulling it back.\" They don't need the word \"gravity\" if the idea is there.\n\n4. **\"Predict: If the skateboarder pushes with even MORE force next time, what will happen?\"**\n   - *Success Criteria:* Student predicts they will jump higher or go farther. They connect it to force.\n\n**Success Criteria for the Lesson:**\n- ✓ Student can identify a force (push/pull) in the photograph or in real life.\n- ✓ Student can explain that a bigger force causes a bigger change in motion (farther distance, higher jump).\n- ✓ Student can predict what will happen when force changes.\n- ✓ Student uses vocabulary (force, motion, gravity) in context, even if not perfectly.\n\n**How to Determine if Students Met Learning Objectives:**\n- Review exit tickets: Look for correct predictions and reasons tied to force.\n- Observe group discussions during Elaborate: Did students think about force when solving the obstacle course?\n- Review Science Journal entries: Do drawings and written observations show understanding of cause and effect between force and motion?\n- Informal questioning: Can students explain to a peer or adult why the car went farther when pushed harder?\n\n---\n\n## Differentiation\n\n### Support (for students who struggle with the concepts)\n\n1. **Simplified Vocabulary:**\n   - Use \"push\" and \"pull\" only; use \"motion\" for movement. Introduce \"force\" only after they're comfortable with push/pull concepts.\n   - Avoid \"unbalanced force\" initially. Just say: \"A big push makes things move more.\"\n\n2. **Concrete Demonstrations:**\n   - Before Explore, do a quick teacher demo: push a car soft, medium, and hard. Ask students to **point** to which traveled farthest before explaining why.\n   - Pair struggling students with strong partners during group work. Assign roles: one student pushes, one student marks the distance, one student measures.\n\n3. **Reduced Data Collection:**\n   - Instead of three trials, do two (soft push, hard push). Reduce the chart to two rows.\n   - Allow students to show distance with drawings (long line vs. short line) instead of numbers if measurement is challenging.\n\n### Challenge (for advanced learners)\n\n1. **Variables and Predictions:**\n   - Ask: *\"What if we use a heavier car? Will we need more force or less force to make it go the same distance?\"* Investigate with two different cars.\n   - Introduce angle: *\"If the ramp is steeper, does gravity do more work, or does the car still need the same push?\"*\n\n2. **Real-World Application:**\n   - Show a video of different skateboard tricks (flips, grinds, airs). Ask: *\"What different forces do you think the skateboarder uses for each trick?\"*\n   - Design a multi-stage obstacle course: *\"Make it so a car has to jump over something, roll through a straightaway, and land in a zone. What forces are needed for each part?\"*\n\n3. **Extended Thinking:**\n   - Ask: *\"If there was no gravity, what would happen to the skateboard after it left the ground?\"* Discuss (it would keep going up forever).\n   - Introduce friction: *\"Why does the car slow down even if you're not stopping it? What invisible force is slowing it down?\"* (Friction, another force!)\n\n---\n\n## Extension Activities\n\n1. **Skateboard or Roller Skate Design Challenge:**\n   - Bring in toy skateboards or show pictures of real ones. Ask: *\"What parts of the skateboard help the skateboarder jump and land safely?\"* (Wheels, deck shape, etc.) Discuss how the design relates to forces and motion. Have students design their own skateboard on paper, labeling parts and explaining what each does.\n\n2. **Gravity Exploration Station:**\n   - Set up a station where students drop different objects (feathers, balls, books) from the same height and observe which falls fastest/slowest. Record observations. Discuss: *\"Is gravity pulling all of them? Why do some seem slower?\"* (Air resistance—introduce as a bonus force!)\n\n3. **Human Motion Investigation:**\n   - Take students outside. Have them run, skip, and walk to different marked lines. Measure distances. Discuss: *\"When you run (use more force with your legs), you go farther than when you walk. Why?\"* Connect human movement to the car investigation.\n\n4. **Skateboard Trick Video Analysis:**\n   - Show a 1–2 minute clip of skateboarding tricks (ensure it's age-appropriate and shows basic tricks—kickflips, ollies, etc.). Ask students to identify the forces they see: *\"Where is the skateboarder pushing? What happens to the skateboard?\"* Draw diagrams with arrows showing forces.\n\n---\n\n## Teacher Notes\n\n- **Safety First:** Ensure Explore and Elaborate activities happen in a safe space (hallway, gymnasium, or controlled classroom area where toy cars won't roll into students). Supervise ramp use closely.\n- **Prior Knowledge:** Most third graders understand \"pushing\" and \"pulling\" in their daily lives. Leverage this! Connect to playground (swings, slides) and classroom experiences.\n- **Vocabulary Complexity:** Third graders are concrete thinkers. Always pair vocabulary with a visible, hands-on example. Don't expect deep understanding of \"gravity\" yet—just that it's a force pulling things down.\n- **Data Recording:** Some students may not read rulers accurately. Encourage them to compare distances visually (shorter vs. longer line) and use simpler language (\"the hard push made it go way farther\").\n- **Time Flexibility:** If you need to compress the lesson, combine Explore and Elaborate into one activity: test soft/medium/hard pushes, then immediately use those insights to design an obstacle course.\n- **Photograph Connection:** Return to the skateboard photograph at least 3 times during the lesson (Engage, Explain, and Elaborate). Students make meaning by seeing how their experiments relate to the real-world image.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 2378,
  "outputTokens": 4906,
  "cost": 0.026908,
  "generatedAt": "2026-02-13T02:26:31.720Z"
}