{
  "title": "Kinetic Energy",
  "category": "physical-science",
  "imageFile": "kinetic_energy.jpg",
  "imagePath": "images/physical-science/kinetic_energy.jpg",
  "content": "### Visible Elements in Photo\n- A concrete skate park with curved ramps, rails, and transition features (half-pipes and quarter-pipes)\n- A skateboarder mid-trick, airborne above the skateboard\n- A skateboard in mid-air below the rider\n- Concrete surfaces of varying heights and angles\n- Spectators observing in the background\n- Safety equipment (helmet) worn by the skateboarder\n\n### Reasonable Inferences\n- **From the curved ramps and rider's trajectory**: The skateboarder is using gravity and the ramp's shape to build speed and launch into the air—the curved surface converts horizontal motion into vertical lift.\n- **From the skateboard separated from the rider**: The rider has successfully transferred momentum to the board, but gravity is now pulling both the rider and board downward at different rates.\n- **From the park's design**: The concrete obstacles and varied heights were intentionally engineered to enable tricks and control motion, suggesting that shape and angle directly affect how objects move.\n\n### Engineering Task\n\n**K-2**: \nMake a ramp out of blocks and boards that helps a toy car or ball roll fast and fly off the end. Test different ramp shapes (steep, gentle, curved) to see which one makes your toy go the highest or farthest. Draw or show which shape worked best.\n\n**3-5**: \nDesign and build a ramp system using cardboard, PVC pipe, or foam that launches a marble or ball to reach a target landing zone at least 2 feet away. Your ramp must:\n- Be at least 12 inches tall at the highest point\n- Use at least one curved section to redirect motion\n- Launch the projectile successfully at least 3 times with consistent results\nTest different ramp angles (30°, 45°, 60°) and curve shapes. Measure and record how angle affects launch distance and height. Explain why your winning design worked best.\n\n### EDP Phase Targeted\n**Create / Test** — The photo shows a real-world structure (the skate park) and an active, observable physics outcome (the trick in motion). Students benefit most from immediately building and testing different ramp designs rather than debating what the problem is. They can see cause-and-effect quickly through their own prototypes, mirroring the skateboarder's iterative skill-building.\n\n### Suggested Materials\n- Cardboard tubes or PVC pipe (4–6 inch diameter)\n- Foam board or rigid cardboard sheets\n- Wooden blocks or books (for height and angle support)\n- Marbles, ping-pong balls, or toy cars\n- Measuring tape and masking tape\n- Protractor or angle guide (for 3–5 grade)\n\n### Estimated Time\n**K-2**: 45–60 minutes (build simple ramp, test 3 shapes, discuss results)  \n**3-5**: Two 45-minute sessions (Session 1: design and build; Session 2: test angles, measure, refine, record data)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS K-PS2-1** and **3-PS2-1** (motion and forces): students observe and explain how the shape and angle of a surface change the direction and speed of an object, connecting real-world skateboard physics to measurable engineering outcomes.",
  "inputTokens": 1805,
  "outputTokens": 752,
  "cost": 0.0055650000000000005,
  "generatedAt": "2026-02-09T13:34:15.459Z"
}