{
  "title": "Mechanical Energy",
  "category": "physical-science",
  "imageFile": "mechanical_energy.jpeg",
  "imagePath": "images/physical-science/mechanical_energy.jpeg",
  "content": "# Engineering Design Challenge: Lifting & Lowering Systems\n\n## Visible Elements in Photo\n- A white Ford utility truck with an extended cab\n- A tall articulated boom/crane arm mounted on the truck bed, angled upward\n- A pulley system with rope attached to the boom (visible rope and pulley mechanism)\n- A person on the ground holding what appears to be a large spherical object (possibly a weather balloon or exercise ball)\n- Dense green trees and grassy outdoor setting\n- A cable or rope extending from the boom to the ground where the person is positioned\n\n## Reasonable Inferences\n- **From the boom arm and pulley system**: The truck is designed to lift or lower heavy or awkwardly-shaped loads safely using mechanical advantage (pulleys and leverage reduce the force needed).\n- **From the person's stance and position**: The load being lowered requires human guidance and control, suggesting that mechanical systems often need human direction to work precisely.\n- **From the outdoor setting**: This is a real-world application where simple machines (levers, pulleys) solve practical problems in difficult terrain or tight spaces where hands alone wouldn't work.\n\n## Engineering Task\n\n### K–2 Version\n**\"Design a Lifting Helper\"**\n\nYour job is to build a simple machine that helps lift a heavy object off the ground without using your arm muscles. Use a stick, string, and a paper cup. Can you design a system where pulling down on the string lifts the cup up? Test it with a small object inside the cup. Does your helper work smoothly, or does it get stuck?\n\n---\n\n### 3–5 Version\n**\"Engineer a Pulley System to Lift and Lower a Load Safely\"**\n\nYour challenge: Design and build a pulley-and-rope system that can lift a 500-gram bag of sand at least 30 cm off the ground and lower it back down smoothly without dropping it. Your system must:\n- Use at least one pulley (fixed or movable)\n- Allow the operator to control the speed of lowering (not a free fall)\n- Be strong enough to lift the load without the rope fraying or snapping\n- Work from a single pull point\n\n**Success criteria**: Load lifts to target height, descends in a controlled manner (takes at least 3 seconds to lower), and rope remains intact after 5 full lift-and-lower cycles.\n\n## EDP Phase Targeted\n\n**Ask / Define Problem** — This phase is the best starting point because the photo shows a *real-world need* (lifting loads in outdoor work) but doesn't show students actively testing yet. Students should first identify why humans need simple machines (the problem: heavy objects are hard to lift), then imagine how pulleys and levers could help, before building prototypes.\n\n## Suggested Materials\n\n- String or rope (clothesline or paracord works well)\n- Wooden dowels or PVC pipes (for boom/frame structure)\n- Paper or plastic cups, or small buckets\n- Fixed pulleys (hardware store) or makeshift pulleys (rubber bands looped through pencils)\n- Sandbags, rocks, or water bottles as loads (500 g to 2 kg range)\n- Tape, zip ties, or clamps to secure components\n- A sturdy table, ladder, or frame to mount the boom\n\n## Estimated Time\n\n**K–2**: 40–50 minutes (15 min intro, 20 min build, 10–15 min test and troubleshoot)  \n**3–5**: Two 40-minute sessions (Session 1: design, planning, build; Session 2: test, measure results, refine)\n\n## Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) and **ETS1.B** (developing solutions) by asking students to identify how simple machines solve real-world load-handling challenges, then prototype and test their own systems under measurable constraints.",
  "inputTokens": 2328,
  "outputTokens": 888,
  "cost": 0.006768,
  "generatedAt": "2026-02-09T13:34:46.354Z"
}