{
  "title": "Mixtures",
  "category": "physical-science",
  "imageFile": "mixtures.jpg",
  "imagePath": "images/physical-science/mixtures.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Mixing Materials to Make Something New\n\n### Core Science Concepts from Image Analysis\n\n- **Materials have observable properties:** The photograph shows different materials (dry ingredients, liquids) with distinct visual characteristics (color, texture, appearance) that can be observed and described.\n- **Mixing materials creates change:** When different materials are combined together (as shown with the dry ingredients in one bowl and the red liquid in the mixer), they can blend and transform into something new.\n- **Tools help us combine materials:** Various kitchen tools (whisk, mixer, measuring containers) are used to help mix materials together, demonstrating how tools can assist in combining substances.\n- **Physical change through mixing:** The act of combining and stirring materials (visible through the whisk in the dry bowl and the mixer with liquid) demonstrates a physical change where materials are mixed together.\n\n### Lesson Title\n\n**Stirring Up Changes: Exploring What Happens When We Mix Materials**\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** 1-PS4-1 (through observing vibrations during mixing), and aligned with foundational physical science exploration of material properties and changes\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and describe the properties of different materials before and after mixing\n- Use simple tools (spoons, whisks) to combine materials and observe changes\n- Explain what happens when two different materials are mixed together\n- Record their observations using pictures, words, or simple sentences\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by exploring the photograph and introducing the concept of mixing materials.\n\n**Materials:**\n- Printed or projected image of the mixing setup (photograph provided)\n- One pre-made sample mixture in a clear bowl (e.g., chocolate cake batter or simple colored mixture)\n- Spoon or whisk for demonstration\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it so all students can see clearly. Ask students to sit in a circle or gather around so everyone can view.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you see in this picture? What are all the things you notice?\" (Accept all observations: bowls, spoons, dry stuff, red liquid, etc.)\n   - \"Do you think these materials look the same or different? What's different about them?\" (Guide students to notice the dry, brown ingredient vs. the red liquid)\n   - \"Why would someone put a whisk in that bowl? What do you think it does?\" (Elicit ideas about stirring, mixing, combining)\n   - \"Have you ever mixed things together at home? What did you mix? What happened?\" (Connect to home cooking experiences)\n\n3. **Prediction/Wonder Prompt:** \n   Show the pre-made sample mixture and say: \"When we mix different materials together, something interesting happens. What do you think will happen if we mix the dry stuff with the red liquid? Will they still look the same? Will something new happen?\" \n   Encourage students to share predictions without judgment.\n\n4. **Transition:** \"Today, we're going to be scientists and mix materials together just like in this picture. We'll see what happens when we combine things!\"\n\n**Transition:** \"Let's go to our science station and try mixing materials ourselves to see what really happens.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover the effects of mixing different materials through hands-on exploration.\n\n**Materials:**\n- Small bowls or clear cups (one per student or per pair)\n- Dry materials: flour, cocoa powder, cinnamon, or colored sand (one type per group)\n- Liquids: water, food coloring mixed with water, or oil (safe options)\n- Whisks, plastic spoons, or craft sticks (one per student)\n- Paper towels or newspaper to protect surfaces\n- Observation recording sheets (simple paper with space for drawing and 2-3 sentence starters: \"At first, it looked like ___. When I mixed it, ___. Now it looks like ___.\")\n\n**Activity:**\n\n1. **Distribute materials.** Give each student or pair a small bowl with a dry material and a cup with liquid. Explain: \"You're going to be a materials scientist today. Your job is to mix these two things together and watch what happens.\"\n\n2. **Step-by-step student directions:**\n   - \"First, look at the dry material in your bowl. What color is it? Does it feel bumpy or smooth? Draw or describe what you see.\"\n   - \"Now pour a small amount of the liquid into your bowl. What do you see now? Are the materials still separate?\"\n   - \"Use your whisk (or spoon) to stir everything together. Mix, mix, mix! Watch carefully as you stir.\"\n   - \"Keep stirring for about 30 seconds. What's happening? Is the mixture changing?\"\n   - \"Stop and look at what you made. Does it look like the dry material now? Does it look like the liquid? Or does it look like something completely new?\"\n\n3. **Connection to photograph:** Point back to the image and say: \"This is exactly what's happening in our picture—someone mixed a dry ingredient with a red liquid and used tools to combine them, just like we're doing right now.\"\n\n4. **What students should record:**\n   - A simple drawing of their dry material before mixing\n   - A drawing of what it looked like after mixing\n   - A word or sentence completing: \"When I mixed them, the materials _____ (changed/became wet/became different/turned to paste).\"\n\n5. **Teacher Role:** \n   - Circulate around the room, asking open-ended questions: \"What do you notice? Is it changing? What does it feel like now?\"\n   - Do NOT tell students what to observe; guide with questions like \"What color was it before? What color is it now?\"\n   - Help students use whisks if they're struggling with fine motor skills; allow spoons as an alternative.\n   - Ensure safety (no tasting, clean up spills immediately).\n\n**Expected Student Outcomes:**\n- Students will observe that mixing dry and wet materials creates a visible change (texture, consistency, color shift)\n- Students will discover that the two separate materials combine into a new substance\n- Students will produce simple drawings and/or written observations of the before-and-after\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and explain the concept of mixing and material change.\n\n**Materials:**\n- Chart paper or whiteboard\n- Marker\n- Photograph (displayed again)\n- Student observation sheets from Explore phase\n- Simple picture cards showing \"before mixing\" and \"after mixing\"\n\n**Activity:**\n\n1. **Group share-out from Explore phase:**\n   - Ask 4-5 students to share what they observed. Have them show their drawings and describe what happened in their own words.\n   - Create a class list on chart paper titled \"What We Discovered When We Mixed\" with student responses (e.g., \"It got wet,\" \"It changed color,\" \"It became squishy,\" \"It was thicker\").\n\n2. **Introduce key vocabulary** with grade-appropriate definitions:\n\n   - **Material:** A substance or thing that something is made of (e.g., flour is a material, water is a material). *Show examples: \"This dry powder is a material. This liquid is a material.\"*\n   \n   - **Mixing:** Combining two or more materials together. *Demonstrate by stirring your whisk in the air.* \"When we mix, we put things together.\"\n   \n   - **Change:** When something becomes different. *Show before-and-after pictures.* \"A change is when something looks or feels different than it did before.\"\n   \n   - **Observe:** To watch carefully and notice things. *Point to eyes.* \"We observe by looking and paying attention.\"\n   \n   - **Liquid:** A wet material that you can pour (like water, juice, or oil). *Show a cup of water.* \"Liquids flow and can be poured.\"\n\n3. **Make connections back to photograph and Explore activity:**\n   - Point to the photograph again: \"In this picture, someone mixed a dry material (like the flour in our bowls) with a red liquid. What do you think they were making? (Answer: cake batter!) Just like we did, they stirred it all together.\"\n   - Show the class mixture again: \"This is what happened when materials mixed. The dry and wet became one new thing.\"\n\n4. **Check for understanding strategy:**\n   - Ask: \"Thumbs up if you think mixing is putting two things together. Thumbs sideways if you're not sure. Thumbs down if you think something else.\" (Use this gestural response to gauge understanding without putting students on the spot.)\n   - Ask simple yes/no questions: \"Did your dry material change when you mixed it with liquid? Did it become something new?\"\n\n**Vocabulary List:**\n- **Material:** A thing or stuff that something is made of\n- **Mixing:** Putting two or more materials together\n- **Change:** When something becomes different\n- **Observe:** To watch and notice carefully\n- **Liquid:** A wet material that you can pour\n\n**Expected Student Outcomes:**\n- Students will understand that mixing is a process of combining materials\n- Students will recognize that when materials mix, a change occurs\n- Students will begin using vocabulary terms (mixing, materials, change) in their descriptions\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of mixing by exploring a new combination and making predictions.\n\n**Materials:**\n- Two different dry materials (e.g., flour and salt, or cocoa and cinnamon)\n- Containers with different liquids (e.g., water and oil, or colored water and clear water)\n- Bowls or cups\n- Whisks/spoons\n- Chart paper: \"What Will Happen If We Mix These?\"\n- Student prediction sheets (with simple drawings of \"What I think will happen\" and \"What really happened\")\n\n**Activity:**\n\n1. **Introduce a new scenario:** \"Now we know what happens when we mix one dry thing with one wet thing. But what if we mix two different dry materials? Or what if we mix two different liquids? What will happen?\"\n\n2. **Prediction phase:**\n   - Show students two different dry materials side by side: \"Which one do you think is lighter? Which is darker? If we mix them together, what will the new mixture look like?\"\n   - Have students draw or discuss their predictions: \"Will it be dark? Will it be light? Will it have both colors mixed?\"\n\n3. **Student activity—Mixing Challenge:**\n   - Assign pairs or small groups one mixing challenge:\n     - Challenge 1: \"Mix salt and flour together. What do you notice?\"\n     - Challenge 2: \"Mix water and oil together. Do they mix the same way?\"\n     - Challenge 3: \"Mix two different colored waters. What happens?\"\n   \n4. **Student directions:**\n   - \"First, predict what you think will happen. Draw or write your guess.\"\n   - \"Now mix the materials carefully. Observe what happens.\"\n   - \"Was your prediction right or different? Draw or write what really happened.\"\n\n5. **Real-world connection:**\n   - \"Cooks and bakers do this all the time. They mix materials to make food. You make a change by mixing!\"\n   - \"Scientists also mix materials to see what happens. That's what we're doing—we're being scientists!\"\n\n6. **Teacher Role:**\n   - Facilitate by asking: \"Is this the same mixture as before? What's different?\"\n   - Help students record their predictions and outcomes\n   - Celebrate surprised discoveries: \"Interesting! It didn't mix the same way, did it? Why might that be?\"\n\n**Expected Student Outcomes:**\n- Students will make predictions based on prior experience\n- Students will discover that different materials mix in different ways\n- Students will record and explain their new discoveries\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of material mixing and observable changes.\n\n**Activity:**\n\n1. **Formative assessment used during the lesson:**\n   - Observation checklists during Explore phase: Did students observe changes? Did they use mixing tools appropriately? Did they describe what they noticed?\n   - Thumbs-up/sideways/down responses during Explain phase for vocabulary comprehension\n   - Student drawings and writing samples from both Explore and Elaborate phases\n\n2. **Exit Ticket (provide to students at the end of both days):**\n\n   **Day 1 Exit Ticket:**\n   - \"Show me by drawing or pointing: What happens when we mix two different materials together?\" \n   - \"Does the mixture look like it did before we mixed? Yes or No\"\n   - \"Use one word to tell me what you observed when you mixed.\"\n\n   **Day 2 Exit Ticket:**\n   - \"I can mix materials together.\" (Thumbs up/sideways/down)\n   - \"When I mix materials, _____ happens.\" (Complete the sentence with a picture or word)\n   - \"Show me two materials we could mix together.\" (Draw or point to items)\n\n3. **Summative assessment:**\n   - Collect observation sheets from Explore and Elaborate phases\n   - Review student drawings for evidence of before-and-after understanding\n   - Use a simple rubric:\n     - **Developing:** Student observed some change but has difficulty describing it\n     - **Proficient:** Student clearly observed materials mixing and documented the change with pictures/words\n     - **Advanced:** Student predicted outcomes, explained why mixing caused change, and used vocabulary terms\n\n4. **Success criteria for student understanding:**\n   - Students can demonstrate (by drawing, showing, or explaining) that mixing two materials creates a visible change\n   - Students use words like \"mixing,\" \"materials,\" \"change,\" or \"different\" to describe what happened\n   - Students can observe and record observations in multiple ways (drawing, pointing, simple sentences)\n\n**Expected Student Outcomes:**\n- Evidence that students understand mixing is a process that causes observable change\n- Student documentation showing before-and-after understanding\n- Growth in vocabulary use (materials, mixing, change, observe)\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Provide sensory-rich cues:** Use highly contrasting colors (dark cocoa powder with bright blue water) so changes are dramatic and obvious. Some students need visual clarity to understand transformation.\n\n2. **Offer hand-over-hand guidance:** For students with fine motor delays, physically guide their hand while mixing, narrating as you go: \"We're stirring... we're mixing... watch how it changes!\" This builds motor memory and confidence.\n\n3. **Use simplified vocabulary:** Stick to 2-3 key words (mix, change, materials) rather than introducing all vocabulary at once. Repeat these words consistently. Use gesture and repetition: \"We mix... we watch for change.\"\n\n4. **Provide pre-drawn recording sheets:** Instead of asking students to draw from scratch, provide partially completed observation sheets with simple outlines or pictures to fill in, reducing cognitive load.\n\n**Challenge (for advanced learners):**\n\n1. **Comparative investigations:** Ask advanced students to predict and test multiple combinations: \"If dark powder makes a dark mixture, what will happen with light powder? Why?\" Encourage hypothesis-making and pattern recognition.\n\n2. **Introduce reversibility questions:** \"If we mix water with flour, can we ever separate them again? Why or why not?\" This pushes toward deeper thinking about material properties and irreversible changes.\n\n3. **Real-world application:** \"Bakers need to know how materials mix. If you were making a cake, what would happen if you mixed flour with salt instead of sugar? Could we eat it?\" Connect mixing to function and purpose.\n\n4. **Extend to more complex materials:** Offer more challenging combinations (oil and water, salt and sugar, flour and sand) and ask students to compare: \"Some materials seem to stay separate even when we mix. Why might that be?\"\n\n---\n\n### Extension Activities\n\n1. **Cooking Together: Make Simple Playdough**\n   Create a no-cook playdough recipe in class (flour, salt, water, food coloring). Students mix materials and observe the transformation into a modeling substance. This demonstrates mixing in a context students find highly motivating. Send the recipe home so families can explore mixing further together.\n\n2. **Mystery Mixture Hunt**\n   Create or bring in 3-4 containers with different pre-made mixtures (sand and water, rice and beans, flour and cocoa, salt and sugar in water). Students observe each mystery mixture, predict what materials are mixed inside, and discuss how they might figure it out. This deepens observational skills and inferential thinking.\n\n3. **Mixing Chart Display**\n   Create a classroom \"Materials We Can Mix\" poster or display. After each mixing exploration, add a photograph or drawing showing the two materials before mixing and the result after mixing. Label with student observations: \"Flour + Water = Paste,\" \"Cocoa + Water = Chocolate,\" etc. Review the display regularly to build pattern recognition and memory of material combinations.\n\n---\n\n**Teacher Implementation Notes:**\n\nThis lesson is deliberately structured across two days to allow adequate time for exploration and processing. First graders benefit from hands-on repetition and multiple exposures to concepts. The photograph serves as both an engagement tool and a concrete reference point that students can return to throughout all five phases. Keep the language simple, the activities short, and the celebration of observation genuine—first graders are natural scientists and delight in mixing and exploring materials. Safety is paramount: ensure all materials are food-safe or clearly labeled as non-edible, and supervise closely during all mixing activities.",
  "inputTokens": 224,
  "outputTokens": 4085,
  "cost": 0.021176800000000003,
  "generatedAt": "2026-02-13T05:28:57.173Z"
}