{
  "title": "Sound",
  "category": "physical-science",
  "imageFile": "p12.jpg",
  "imagePath": "images/physical-science/p12.jpg",
  "content": "# Engineering Design Challenge: School Band Sound Amplification\n\n### Visible Elements in Photo\n- A school marching band performing on an indoor stage with brass instruments (trumpets, trombones, tuba)\n- Students wearing red and navy uniforms with name badges\n- Dark curtains hung above and behind the performers\n- A stage with wooden flooring and a banner on the left wall\n- A potted plant near the stage floor\n- Bright stage lighting from above\n\n### Reasonable Inferences\n- **From brass instruments & enclosed space**: The sound produced by the band must travel through the indoor venue, but the dark curtains may absorb sound rather than reflect it, making the performance harder to hear in the back of the room.\n- **From stage setup & curtains**: The performers need their sound to project farther and more evenly throughout the space, suggesting an acoustic challenge.\n- **From stage lighting**: The venue has resources for stage enhancements, implying that acoustic improvements could also be engineered into the performance environment.\n\n### Engineering Task\n\n**K-2 Version:**\nImagine you're helping the school band sound louder and clearer in the gym. Design a \"sound helper\" using paper, cups, or cardboard tubes. Can you make something that helps the trumpet player's music travel farther into the room? Build your helper and test it by having a friend whisper or hum into it.\n\n**3-5 Version:**\nThe school band needs help making their music heard clearly throughout the auditorium. Design an acoustic reflector or amplification device using only cardboard tubes, poster board, aluminum foil, and tape. Your design must:\n- Be at least 30 cm wide so a trumpet bell can fit inside or behind it\n- Improve sound projection by at least one meter in distance\n- Be sturdy enough to stand on the stage for a 5-minute performance\n- Use no more than three materials from the list\n\nTest your design by having a student play a note from a brass instrument with and without your device, and measure how far the sound travels clearly.\n\n### EDP Phase Targeted\n**Ask / Define Problem** — This phase fits best because the photo shows a real performance environment where sound quality is a measurable, observable need. Students must first understand *why* the acoustics matter (auditory feedback from back of room, audience experience) before jumping to solutions like reflectors or baffles.\n\n### Suggested Materials\n- Cardboard paper towel tubes or mailing tubes\n- Poster board or foam board sheets\n- Aluminum foil\n- Duct tape or masking tape\n- Paper cups\n- Optional: small megaphones or PVC pipes (if available)\n\n### Estimated Time\n**45–60 minutes** for a single session: 10 minutes to define the problem and test baseline sound travel, 20 minutes to design and build, 15 minutes to test and refine.\n*Extension: Two 30-minute sessions if students iterate after first testing.*\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining design problems based on criteria and constraints) and **ETS1.B** (developing and using models to test solutions), while keeping students engaged with a real school event they can see and hear.",
  "inputTokens": 1803,
  "outputTokens": 721,
  "cost": 0.005408,
  "generatedAt": "2026-02-09T13:27:15.572Z"
}