{
  "title": "Static Electricity",
  "category": "physical-science",
  "imageFile": "p13.jpg",
  "imagePath": "images/physical-science/p13.jpg",
  "content": "### Visible Elements in Photo\n\n- A large blue sphere or balloon suspended above a dark surface\n- Multiple small colored confetti pieces (red, yellow, green, blue, white) scattered on the dark surface below\n- Water droplets clinging to the underside of the blue sphere\n- Blurred background suggesting an indoor setting\n- A gray or metallic surface visible at the top left edge\n\n### Reasonable Inferences\n\n- **From water droplets on the sphere**: The sphere has recently been in contact with moisture or a wet environment, suggesting it may be permeable or have collected condensation.\n- **From confetti scattered below**: The sphere may have been dropped, rolled, or moved across the surface, causing lightweight objects to scatter (implies motion and force).\n- **From the sphere's position and droplets**: Gravity is pulling water downward while the sphere's curved surface affects how droplets cling and fall.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nDesign a catcher using a cup, net, or container to catch falling confetti pieces as they drop from a bouncing or rolling blue ball. Your catcher must catch at least 5 pieces and keep them inside. Test it by gently bouncing or rolling your ball and see how many pieces you can catch!\n\n**3-5 Version:**\nDesign and build a collection system that captures at least 10 scattered confetti pieces from a moving sphere using only a shallow container, mesh, or fabric. Your system must:\n- Keep all captured pieces contained (they cannot roll or fly out)\n- Be repositionable in less than 10 seconds\n- Work when the sphere is rolled or dropped from 30 cm above the surface\n\nTest multiple designs and measure which one captures the most pieces in three trials.\n\n---\n\n### EDP Phase Targeted\n\n**Create / Test**\n\nThis photo shows materials in motion and a scattering problem already happening. Students benefit most from jumping directly to prototyping simple catchers and testing which design works best. They'll iterate quickly by observing what catches confetti effectively, making this an ideal \"hands-on learning by doing\" entry point.\n\n---\n\n### Suggested Materials\n\n- Plastic cups or containers (various sizes)\n- Mesh or cheesecloth fabric\n- Tape (masking or duct)\n- Blue balloon or ball\n- Colored paper scraps or confetti\n- Ruler or measuring tape\n\n---\n\n### Estimated Time\n\n**K-2**: 20–30 minutes (design + 2–3 test cycles)  \n**3-5**: 40–50 minutes (design, build, test 3 trials, compare results)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.B (Developing Possible Solutions)** by asking students to design a simple system that solves a concrete problem—capturing moving objects—and test whether their solution meets specific criteria, while reinforcing cause-and-effect reasoning through physical trial and observation.",
  "inputTokens": 1803,
  "outputTokens": 659,
  "cost": 0.005098,
  "generatedAt": "2026-02-09T13:27:25.562Z"
}