{
  "title": "Static Electricity",
  "category": "physical-science",
  "imageFile": "p13.jpg",
  "imagePath": "images/physical-science/p13.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Forces in Motion — Balloons, Confetti, and Gravity\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Gravitational Force:** Earth's gravitational pull acts downward on all objects, causing confetti and water droplets to fall from the balloon.\n- **Motion and Forces:** Objects in motion (falling confetti and droplets) are affected by the force of gravity pulling them toward Earth.\n- **Properties of Materials:** Different materials (confetti, water) respond to gravitational force; lighter objects like confetti fall more slowly, while water droplets fall faster due to their mass and surface tension.\n- **Energy Transfer:** The mechanical energy in the falling balloon was transferred to confetti and water, which now move due to gravitational force.\n\n---\n\n## Lesson Title\n\n**Falling Fast or Slow? Exploring Gravity with Balloons and Confetti**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes (two 45-minute sessions, or one extended block)\n- **NGSS Standards:** \n  - 5-PS2-1: Support an argument that the gravitational force exerted by Earth on objects is directed down.\n  - 5-PS1-3: Make observations and measurements to identify materials based on their properties.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** how gravity pulls objects downward toward Earth.\n2. **Explain** why objects of different sizes and materials fall at different rates.\n3. **Predict and test** how the amount of confetti affects falling speed.\n4. **Support an argument** using evidence that gravitational force always acts downward.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about falling objects and gravity using the photograph.\n\n**Materials:**\n- Printed photograph (or projected on screen)\n- Chart paper and markers\n- Blue balloon (optional: bring one to class)\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it. Allow 1–2 minutes of silent observation. Ask students to simply notice what they see without talking.\n\n2. **Ask these specific questions to spark discussion:**\n   - \"What is falling in this picture? How do you know?\"\n   - \"Why do you think the confetti pieces are moving downward instead of sideways or upward?\"\n   - \"Do you think all the pieces are falling at the same speed? Why or why not?\"\n   - \"Where do you think this confetti will end up?\"\n\n3. **Wonder Prompt:** \"I wonder what makes things fall down instead of falling sideways or floating up. Can we predict which things fall fastest — the confetti circles or the water drops? Why?\"\n\n4. **Record student predictions** on chart paper. Leave visible for later comparison.\n\n**Transition:** \"Today, we're going to investigate what makes things fall and test if different objects really do fall at different speeds.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate how gravity affects objects of different materials and sizes.\n\n**Materials (per student pair):**\n- 1 large clear plastic cup or container\n- Assorted confetti (circles, streamers, small pieces)\n- Water or sand in a small cup\n- Small feather or paper piece\n- Small metal washer or heavy object (same size as washer)\n- Ruler or measuring tape\n- Stopwatch or second hand watch\n- Recording sheet (provided below)\n- Tape\n\n**Activity — \"Drop Race Investigation\":**\n\n**Step-by-Step Student Directions:**\n\n1. **Prepare your testing station:** Tape a ruler vertically to the side of a cup or container. Mark distances (6 inches, 12 inches, 18 inches).\n\n2. **Choose two objects to race:** Pick one light object (confetti piece or feather) and one heavier object (washer or stone). They should be roughly the same size.\n\n3. **Make a prediction:** Before dropping, write down which object you think will hit the bottom first and why.\n\n4. **Drop and observe:** Hold both objects at the top of the container (18-inch mark). Drop them at the same time. Watch carefully which lands first.\n\n5. **Test again:** Repeat 3 times with the same pair of objects. Did the results stay the same?\n\n6. **Test different pairs:** Try other combinations (confetti vs. water drop, feather vs. washer, etc.).\n\n7. **Record everything:** On your recording sheet, draw the objects, mark which fell first, and write \"why do you think that happened?\"\n\n**How This Connects to the Photograph:**\n\"In the photo, you saw confetti and water drops falling from the balloon. Your investigation helps us understand why they fall and how fast.\"\n\n**What Students Should Record:**\n- Drawings of object pairs\n- Which landed first\n- Number of repeats\n- Written observations: \"The _____ fell faster because…\"\n\n**Teacher Role:**\n- Circulate to each pair; **do not** tell them which will fall faster.\n- Ask prompting questions: \"What did you notice? Did both objects land at the same time? What was different about them?\"\n- If students are frustrated, ask: \"What do you think gravity is doing to each object?\"\n- Ensure safe dropping (no throwing; no stepping on containers).\n\n**Expected Student Outcomes:**\nStudents should discover that:\n- Heavier objects generally fall faster than lighter ones.\n- The same objects produce consistent results when tested multiple times.\n- Gravity pulls **downward** every time—no object fell sideways or up.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect exploration to the concept of gravitational force.\n\n**Materials:**\n- Chart paper and markers\n- Photograph (displayed again)\n- Student recording sheets from Explore\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Call on 3–4 student pairs to share their results: \"Which objects fell fastest in your tests? Did everyone get the same results?\"\n   - Record findings on chart paper. Highlight that heavier objects tend to fall faster.\n\n2. **Introduce Vocabulary (8 minutes):**\n   Teach these terms using the photograph and student observations:\n\n   - **Gravity:** An invisible force that pulls objects downward toward Earth.\n   - **Gravitational Force:** The push or pull that gravity creates on objects, always pointing toward the ground.\n   - **Mass:** How much \"stuff\" (matter) is in an object. Heavier objects have more mass.\n   - **Fall/Falling:** The motion of an object moving downward due to gravity.\n   - **Direction:** Which way something is moving (up, down, sideways).\n\n   **How to teach each:** Use gestures, the photograph, and student objects.\n   - *Show confetti falling in photo:* \"This is gravity pulling the confetti **down** toward Earth.\"\n   - *Hold up a washer and feather:* \"The washer has more mass than the feather. Which do you think Earth's gravity pulls harder?\"\n\n3. **Connections Back to the Photo & Explore (5 minutes):**\n   - Point to the photo: \"Look at the confetti and water drops. They're falling **downward**. Gravity pulled them out of the balloon.\"\n   - Reference their investigation: \"Just like in your drop races, heavier water drops fell faster than light confetti pieces.\"\n\n4. **Check for Understanding:**\n   Ask: \"If I hold a pencil and a feather and drop them at the same time, which way will they fall? Why?\" (Students should say \"down\" and mention gravity.)\n\n**Vocabulary Summary (Display on Word Wall):**\n- **Gravity** = An invisible force that pulls objects down\n- **Gravitational Force** = The pull of gravity acting on an object\n- **Mass** = How heavy an object is\n- **Direction** = The way something moves (down, up, left, right)\n\n**Expected Student Outcomes:**\nStudents should understand that:\n- Gravity is a force that always pulls objects downward.\n- Heavier objects (more mass) fall faster than lighter ones.\n- This is why the confetti and water fell in the photograph.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply gravitational force concepts to a new scenario and deepen understanding.\n\n**Materials:**\n- 2 small paper cups\n- Confetti (various amounts: 1 tablespoon, 2 tablespoons, 4 tablespoons)\n- Water in a spray bottle\n- Stopwatch\n- Measuring spoons\n- Recording sheet for \"Confetti Mass Test\"\n\n**Activity — \"Does More Confetti Fall Faster?\":**\n\n1. **Present a new question:** \"We found that heavier objects fall faster. But what if we add MORE confetti to make it heavier? Will a big pile of confetti fall faster than a small pile?\"\n\n2. **Student Investigation (10 minutes):**\n   - Pair students. Give each pair two cups and three different amounts of confetti (1 Tbsp, 2 Tbsp, 4 Tbsp).\n   - Students hold one cup with 1 Tbsp confetti in each hand, drop from shoulder height, and time how long it takes to reach the ground. Repeat 2 times.\n   - Repeat with 2 Tbsp and 4 Tbsp.\n   - Record results in a table.\n\n3. **Guided Observations:**\n   - Ask: \"Did the pile with MORE confetti fall faster or slower than the smaller pile?\"\n   - Follow-up: \"Why do you think that happened? Remember — more confetti = more mass.\"\n\n4. **Connect to Real World:**\n   - \"A piece of confetti falls slowly. But imagine thousands of pieces packed tightly together — like in the photo! The whole bunch has more mass and falls faster. That's why you see the water balloon dropping so quickly in the picture.\"\n\n**Teacher Role:**\n- Facilitate timing; keep students on task.\n- Ask: \"What changed? Only the amount of confetti, right? So that's what caused the difference in falling speed.\"\n\n**Expected Student Outcomes:**\nStudents should observe that:\n- More confetti (more mass) falls faster than less confetti.\n- This confirms that mass affects how fast things fall due to gravity.\n- Real-world balloons drop quickly because they have a lot of mass.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of gravitational force and its effects on objects.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- Observe students during Explore and Elaborate phases.\n- Listen for correct use of vocabulary (gravity, gravitational force, direction).\n- Check recording sheets for accurate observations and reasoning.\n- Use teacher questioning: \"Why did the heavy object fall first?\"\n\n**Summative Assessment — Exit Ticket (5 minutes):**\n\nProvide each student with this 3-question exit ticket:\n\n---\n\n**Name: _________________ Date: _____________**\n\n**1. When you drop a pencil, which direction does it fall?**\n   - A) Upward  \n   - B) Downward  \n   - C) Sideways  \n\n**2. Why does the pencil fall in that direction?**\n   ___________________________________________________\n\n**3. Look at the picture of the balloon and confetti again. Draw an arrow showing the direction the confetti is falling. Label your arrow with the word \"GRAVITY.\"**\n\n[Space for drawing]\n\n---\n\n**Success Criteria:**\n- ✓ Student selects \"B) Downward\" (or equivalent)\n- ✓ Student explains: \"Gravity pulls it down\" or \"Earth's gravity pulls it downward\"\n- ✓ Student draws downward arrows and correctly labels them with \"GRAVITY\"\n\n**Determining if Students Met Learning Objectives:**\n- **Objective 1 (Observe and describe gravity):** Students answer Question 1 correctly and explain direction in Question 2.\n- **Objective 2 (Explain why objects fall at different rates):** Review Explore investigation sheets — students should show that heavier objects fell faster and gave reasoning.\n- **Objective 3 (Predict and test):** Check that students made predictions in Explore and made multiple attempts to verify results.\n- **Objective 4 (Support argument with evidence):** Exit ticket answers and investigation sheets show evidence-based reasoning (\"The washer fell first because it has more mass\").\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplify the Explore Activity:**\n   - Provide only 2 object pairs (e.g., washer vs. feather) instead of multiple options.\n   - Use a shorter drop distance (12 inches instead of 18).\n   - Pair student with a stronger reader to help record observations.\n\n2. **Vocabulary Pre-Teaching:**\n   - Introduce \"gravity\" and \"fall\" the day before using everyday examples (\"When you jump, gravity pulls you back to the ground\").\n   - Use picture cards showing arrows pointing downward to represent gravity.\n\n3. **Exit Ticket Modification:**\n   - Offer multiple-choice answers for all three questions.\n   - Allow drawing instead of writing for Question 2.\n\n### Challenge (For Advanced Learners)\n\n1. **Investigate Surface Area:**\n   - \"If we unfold the confetti streamers (more surface area), will they fall faster or slower? Why?\" Students design and test a hypothesis.\n   - Introduce concepts of air resistance without formal terminology: \"Does the shape change how fast it falls?\"\n\n2. **Graph and Analyze Data:**\n   - Have students create a bar graph comparing fall times for different object pairs.\n   - Ask: \"Which object pair had the BIGGEST difference in fall time? Why?\"\n\n3. **Real-World Application:**\n   - \"Skydivers wear parachutes to fall more slowly. Why would a parachute make you fall slower even though gravity is still pulling down?\"\n   - Students design a \"parachute\" for confetti using tissue paper and string; test if it extends fall time.\n\n---\n\n## Extension Activities\n\n1. **Gravity Scavenger Hunt (Homework or Free Time):**\n   - Students find 5 objects at home and predict whether they fall fast or slowly based on mass.\n   - They drop each object and record results.\n   - Bring results back and compare predictions to actual falls.\n\n2. **Design a Confetti Catcher:**\n   - Challenge: \"Make a device that catches falling confetti without breaking it. You have paper cups, tape, and paper.\"\n   - Students design and test catchers; discuss which design slowed the confetti most.\n   - Connect to engineers designing solutions to real problems.\n\n3. **Gravity in Space (Reading & Discussion):**\n   - Read a short passage about astronauts floating in space: \"Does gravity exist in space?\"\n   - Discuss: \"Astronauts are still being pulled by gravity, but they're falling around Earth in a spacecraft, so it looks like they're floating.\"\n   - Bridge to understanding that gravity exists everywhere, not just on the ground.\n\n---\n\n## Teacher Notes\n\n- **Safety First:** Ensure drops occur over tables or containers; confetti is small and may be a choking hazard for very young students — supervise closely.\n- **Pre-Lesson Prep:** Gather all materials in advance. Test the timing of activities to ensure 90-minute fit.\n- **Photograph Connection:** Return to the photo multiple times throughout the lesson. Students need repeated visual anchors.\n- **Vocabulary Reinforcement:** Post vocabulary cards with pictures throughout the lesson and refer to them frequently.\n- **Inclusive Language:** Use \"falls downward\" and \"gravity pulls down\" consistently to reinforce directional language for ELL learners.\n\n---\n\nThis lesson directly answers the question posed in the photograph: *Why do objects fall downward?* Through hands-on investigation, Fifth Grade students develop an evidence-based understanding of gravitational force that meets the NGSS standard 5-PS2-1.",
  "inputTokens": 2442,
  "outputTokens": 3737,
  "cost": 0.021127,
  "generatedAt": "2026-02-12T23:35:40.321Z"
}