{
  "title": "Ice",
  "category": "physical-science",
  "imageFile": "p15.jpg",
  "imagePath": "images/physical-science/p15.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Freezing Bubbles and State Changes\n\n## Core Science Concepts from Image Analysis\n\n- **States of Matter and Phase Changes:** The photograph shows a frozen bubble, demonstrating the transition from liquid (soapy water) to solid (ice). This makes the invisible transformation of matter visible and tangible.\n- **Properties of Materials:** The bubble's crystalline ice structure and brittleness contrast with the flexibility of liquid soap. Freezing fundamentally changes how a material behaves and looks.\n- **Conservation of Matter:** Even though the bubble has frozen solid, the amount of matter (mass) remains the same—it has simply changed form.\n- **Energy and Temperature:** The visible frost and ice formation reveal that energy (heat) has been removed from the system, causing the state change. This makes the abstract concept of thermal energy loss concrete.\n\n---\n\n## Lesson Title\n\n**Frozen Bubbles: Watching Matter Change Its Mind**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or one 90-minute block)\n- **NGSS Standards:** \n  - 5-PS1-1 (Develop a model to describe that matter is made of particles too small to be seen)\n  - 5-PS1-3 (Make observations and measurements to identify materials based on their properties)\n  - 5-PS1-4 (Conduct an investigation to determine whether mixing of two or more substances results in new substances)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** the physical properties of matter in different states (liquid and solid), using detailed vocabulary.\n2. **Collect evidence** that matter changes state when temperature changes, but the amount of matter stays the same.\n3. **Explain** that when liquid soap freezes into a solid, the tiny particles slow down and arrange differently, even though the total amount of matter is conserved.\n4. **Predict** what will happen to frozen bubbles when they are exposed to heat and test their predictions.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Spark curiosity about state changes and properties of matter using the photograph as a visual anchor.\n\n**Materials:**\n- Projected or printed photograph of the frozen bubble (large enough for all students to see clearly)\n- Chart paper and markers\n- Student science notebooks\n\n**Activity:**\n\n1. **Display the photograph** on a screen or as a large printout without explanation. Give students 30 seconds of silent observation time. Ask them to turn to a partner and describe what they notice in one sentence each.\n\n2. **Facilitate a whole-group discussion** using these guiding questions:\n   - *\"What do you think this bubble is made of?\"* (Expected: soapy water, air inside)\n   - *\"How is this bubble different from a regular soap bubble you've blown?\"* (Expected: It looks frozen, has ice on it, is white/cloudy, looks solid)\n   - *\"What do you think happened to make the bubble look this way?\"* (Expected: It got cold, froze, was put in ice/freezer)\n   - *\"If we held this frozen bubble in our warm hands, what do you predict would happen?\"* (Take several predictions; record on chart paper without validation yet.)\n\n3. **Wonder Prompt:** *\"Our big question is: When something freezes, does it still have the same amount of stuff inside it, or does the stuff disappear?\"* Write this on the chart and leave it visible for the lesson.\n\n4. **Transition:** *\"Today, we're going to make our own frozen bubbles and investigate what happens to matter when it gets really cold.\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students conduct a hands-on investigation to observe state changes and test conservation of matter through bubble freezing and measurement.\n\n**Materials (per group of 3-4 students):**\n- Small shallow containers or pie tins (at least 4 per group)\n- Bubble solution (pre-made: mix 1 part dish soap to 6 parts water + 1 part corn syrup for durability)\n- Bubble wands or straws\n- Freezer access (or access to a container filled with ice and salt, kept at -10°C or colder)\n- Ruler (12-inch)\n- Digital scale (if available) or simple comparison balance scale\n- Warm water in a container\n- Paper towels\n- Student observation sheets (provided below)\n- Pencils\n\n**Student Directions (written on board or provided as handout):**\n\n1. **Measure and Record (Baseline):**\n   - Pour 50 mL of bubble solution into a small container. Measure the height of the liquid and record it on your observation sheet.\n   - If using a scale, weigh the container of bubble solution and record the mass.\n\n2. **Blow and Freeze:**\n   - Blow 3-5 bubbles onto a shallow container. Be gentle—try not to pop them.\n   - Immediately place the container with the bubbles in the freezer (or into the ice bath).\n   - Wait 10-15 minutes for the bubbles to freeze solid.\n\n3. **Observe the Frozen Bubbles:**\n   - Remove the container carefully. Observe the frozen bubbles with a partner using the observation sheet.\n   - Describe: What do the bubbles look like? Can you touch them? Are they hard or soft? What color are they? Can you see through them?\n   - Measure the height of the frozen bubble structure (if it maintains a measurable height). Record this.\n   - If using a scale, weigh the container with frozen bubbles and record the mass.\n\n4. **Warm It Up (Optional, if time allows):**\n   - Place the frozen bubbles in warm (not hot) water and observe what happens over 5 minutes.\n   - Describe: What changes? Do the bubbles return to liquid? Record observations.\n\n**Teacher Role:**\n\n- Circulate and listen to student observations without correcting or confirming immediately.\n- Ask probing questions: *\"What changed about the bubbles?\"* *\"What stayed the same?\"* *\"Where did the soapy water go?\"*\n- Ensure students are recording observations in detail (not just yes/no answers).\n- Manage freezer/ice bath access and timing so all groups can complete the activity.\n- Prompt students who finish early to compare their frozen bubbles with a partner's and describe differences.\n\n**Expected Student Outcomes:**\n\n- Students observe that the liquid bubble solution becomes a solid structure with visible ice crystals.\n- Students note the texture change from slippery/liquid to hard/brittle.\n- Students record measurements and (if applicable) mass data showing little to no change in total amount of matter.\n- Students may notice that color changes (becomes cloudy/white) due to ice crystal formation.\n- Students generate observations like: *\"The bubble got hard,\"* *\"It looks sparkly,\"* *\"The inside is all frosty.\"*\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student observations to the scientific concept of state changes and particle behavior.\n\n**Materials:**\n- Chart paper with guiding questions from Engage phase\n- Markers\n- Diagram of particle arrangement (see activity description)\n- Frozen bubble sample(s) from Explore phase\n- Student notebooks\n\n**Activity:**\n\n1. **Share-Out from Explore (5 minutes):**\n   - Ask 2-3 groups to share one observation: *\"What did you notice about your frozen bubbles?\"*\n   - List observations on chart paper. Group them by category (appearance, texture, temperature, etc.).\n\n2. **Mini-Lesson: States of Matter and Particles (8 minutes):**\n\n   Use the frozen bubble as a concrete reference and draw/show this model:\n\n   - **Explain:** *\"When your bubble was liquid, the tiny particles (too small to see) were moving really fast and bouncing all around. The liquid soap flowed and dripped.\"*\n   - **Show a simple drawing:** Circles (particles) far apart and moving (use arrows).\n   - **Explain:** *\"When we put the bubble in the freezer, the heat energy left the water and soap. The particles slowed down and got packed tightly together. Now they're stuck in one place—that's why it became solid and hard.\"*\n   - **Show the drawing update:** Circles (particles) packed closely together, no arrows.\n   - **Explain:** *\"Here's the important part: Even though the bubble changed from liquid to solid, all the tiny particles are still there. The amount of stuff didn't disappear—it just arranged itself differently. We call this **conservation of matter.**\"*\n\n3. **Vocabulary Introduction (5 minutes):**\n\n   Write each term on the board. Have students repeat and write in notebooks:\n\n   - **Solid:** A state of matter with a fixed shape. The particles are packed tightly together and barely move. Example: Your frozen bubble is solid.\n   - **Liquid:** A state of matter that takes the shape of its container. The particles move around but stay connected. Example: The bubble solution before freezing.\n   - **Freezing:** The process when a liquid cools down and turns into a solid. Heat energy leaves the matter.\n   - **Particle:** A tiny piece of matter too small to see. Everything is made of particles stuck together.\n   - **Conservation of Matter:** The idea that matter doesn't disappear or appear out of nowhere—it only changes form.\n\n4. **Check for Understanding:**\n   - *\"If we weighed the bubble before and after freezing, would the weight change? Why or why not?\"* (Expect: No, because the particles are still there, just arranged differently.)\n   - *\"What had to happen for the liquid bubble to become solid?\"* (Expect: It got cold, heat left it, the temperature dropped.)\n\n**Expected Student Outcomes:**\n\n- Students can distinguish between solid and liquid states using the frozen bubble as reference.\n- Students can explain that freezing is a state change caused by temperature/energy loss.\n- Students understand that the amount of matter is conserved even when it changes state.\n- Students can use the word \"particles\" and \"conservation\" in a sentence about the activity.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of state changes to a new context and make predictions based on evidence.\n\n**Materials:**\n- Frozen bubble samples (from Explore, still frozen or refrozen)\n- Warm water in a container\n- Thermometer\n- Timer\n- Paper towels\n- Observation sheets (new one for this phase)\n- Colored ice cubes (optional, for comparison)\n\n**Activity: Melting Investigation and Prediction**\n\n1. **Set Up the Challenge (2 minutes):**\n   - Explain: *\"Now we know that freezing turns liquid into solid. What do you think happens when we warm up a frozen bubble? Does it turn back to liquid? Let's test it.\"*\n\n2. **Prediction (3 minutes):**\n   - Students individually write or draw a prediction: *\"When I warm the frozen bubble, I think ______ will happen because ______.\"*\n   - Pairs share predictions with a partner.\n\n3. **Investigation (10 minutes):**\n   - Each group removes their frozen bubble from storage (or re-freezes if needed).\n   - Record the starting temperature of the frozen bubble using a thermometer (if available; otherwise, describe it as \"very cold\").\n   - Place the frozen bubble in a shallow container of warm water (about 40-45°C / 100-110°F—warm but not hot enough to cause burns).\n   - Observe and record every 2 minutes for 10 minutes:\n     - What changes do you see?\n     - Is the bubble still hard? Does it get softer?\n     - Do you see any liquid?\n     - What happens to the shape?\n   - Record final observations on the observation sheet.\n\n4. **Group Discussion (5 minutes):**\n   - Bring students back together.\n   - Ask: *\"What happened to the frozen bubble when it warmed up?\"* (Expected: It melted, turned back to liquid, dripped, became soft.)\n   - Ask: *\"Is this the same bubble solution we started with, or is it something new?\"* (Expected: Same stuff, just changed form again.)\n   - Ask: *\"So we've seen liquid freeze into solid, and solid melt back into liquid. What do you think would happen if we froze it again?\"* (Expected: It would freeze again; the cycle can repeat.)\n\n**Teacher Role:**\n\n- Facilitate observations without leading answers.\n- Ask follow-up questions: *\"What do you think is happening to the particles right now?\"* (They're speeding up, moving apart, becoming loose again.)\n- Manage warm water safety (ensure it's not too hot).\n- Encourage students to make connections: *\"Remember when the particles were packed together? What's happening now?\"*\n\n**Expected Student Outcomes:**\n\n- Students observe that heating reverses the freezing process (melting).\n- Students recognize that the same matter can change states multiple times.\n- Students apply the particle model to explain melting: *\"The heat gave energy back to the particles, so they started moving fast and loose again.\"*\n- Students demonstrate understanding that this is still conservation of matter: *\"It's the same bubble solution, just in a different form.\"*\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student mastery of learning objectives through formative and summative strategies.\n\n**Formative Assessment (During the Lesson):**\n\n- **Observation Sheets:** Review student documentation during Explore and Elaborate phases for accuracy and detail.\n- **Class Discussions:** Listen for student use of vocabulary (solid, liquid, freezing, particle, conservation) in context.\n- **Questioning:** Use probing questions throughout to gauge understanding (noted in each phase above).\n- **Partner Conversations:** Circulate and listen to student pairs explaining observations to each other.\n\n**Summative Assessment: Exit Ticket (5-10 minutes)**\n\n**Provide each student with a slip of paper or digital form with these three prompts:**\n\n1. **Draw and Label:** *\"Draw what you think happened to the particles in the bubble solution when it froze. Label your drawing with 'liquid' and 'solid' to show the difference.\"*\n\n2. **Explain in Words:** *\"Write one sentence explaining why the frozen bubble is solid instead of liquid.\"*\n\n3. **Predict:** *\"If we left the frozen bubble outside on a hot summer day, what would happen and why?\"*\n\n**Success Criteria:**\n\n- **Proficient:** Student drawing shows particles more spread out in liquid state and packed together in solid state. Written explanation includes reference to cooling/heat loss and particle movement or arrangement. Prediction mentions melting and relates to warming/heat.\n- **Developing:** Student drawing shows some difference between states but may lack clarity. Written explanation mentions freezing but may not explain particle behavior. Prediction mentions melting but lacks reasoning.\n- **Beginning:** Student drawing shows little differentiation between states. Written explanation is vague or incomplete. Prediction is inaccurate or missing.\n\n**Expected Student Outcomes:**\n\n- 80% of students can distinguish between solid and liquid states and explain the role of temperature in state changes.\n- 70% of students can reference particle movement/arrangement when explaining state changes.\n- 85% of students predict that heat causes frozen matter to melt back to liquid.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Sentence Frames:** Provide pre-written sentence starters during Explain phase:\n   - *\"The liquid bubble became solid because _______.\"*\n   - *\"The tiny particles in a solid are _______ (close together / far apart).\"*\n   - *\"When we heat the frozen bubble, I think _______.\"*\n\n2. **Simplified Particle Diagram:** Use only 3-4 large circles to represent particles instead of many, and use very clear labels (cold = packed, hot = spread out).\n\n3. **Buddy System:** Pair struggling readers/writers with stronger students during Elaborate phase for peer explanation and co-documentation.\n\n### Challenge (For Advanced Learners)\n\n1. **Extend to a Third State:** Introduce the concept of gas (evaporation).\n   - *\"If we left the melted bubble on a sunny windowsill for a week, where would the water go? What would happen to the particles?\"*\n   - Have students research or investigate evaporation separately and create a poster showing all three states: solid, liquid, gas.\n\n2. **Quantitative Analysis:** If students used scales during Explore:\n   - Challenge them to graph mass data (before freezing vs. after) on a bar chart.\n   - Ask: *\"Why do you think the mass stayed almost exactly the same?\"*\n   - Introduce the idea of scientific precision and measurement error.\n\n3. **Real-World Applications:** Ask students to research and present on one of these:\n   - How freezing is used to preserve food.\n   - Why roads ice over in winter and how salt helps.\n   - How glaciers form and what happens to them as Earth warms.\n\n---\n\n## Extension Activities\n\n1. **Bubble Art and Temperature Mapping (30 minutes):**\n   - Provide students with bubble solution and access to multiple temperature zones (freezer, refrigerator, room temperature, warm water).\n   - Have them blow bubbles in each location and observe/sketch the results.\n   - Ask: *\"In which location did the bubble freeze fastest? Slowest? Why?\"*\n   - Display sketches as a \"temperature and state change exhibit.\"\n\n2. **Reverse Engineering: From Solid Back to Liquid (Homework or Next-Day Activity):**\n   - Provide students with a frozen bubble in a sealed bag to take home (or create one in class and refrigerate overnight).\n   - Assign: *\"At home, observe your frozen bubble as it sits in your room for 2 hours. Draw what you see every 30 minutes. Describe what's happening to the particles. Bring your drawings to class to share.\"*\n   - This reinforces the concept of state change in a familiar, safe context.\n\n3. **Compare and Contrast: Other Freezing Materials (20-30 minutes):**\n   - Provide students with several liquids in small cups: water, corn syrup, oil, juice, milk.\n   - Ask: *\"Which of these do you think will freeze solid like our bubble? Which might stay partly liquid? Why?\"*\n   - Place all cups in the freezer together. Check them every 5 minutes over 20 minutes.\n   - Record observations: Which froze first? Which didn't freeze? Why might different liquids freeze at different rates?\n   - Introduce the concept that different materials have different freezing points.\n\n---\n\n## Notes for Teacher Implementation\n\n- **Timing:** This lesson can be delivered in two 45-minute sessions (Engage/Explore on Day 1; Explain/Elaborate on Day 2) or compressed into one 90-minute block if you have freezer access in or near your classroom.\n- **Freezer Access:** Coordinate with your school to ensure freezer space. Alternatively, use an ice bath with salt (sodium chloride) to achieve -10°C temperatures without a freezer.\n- **Bubble Solution Recipe:** The corn syrup makes bubbles more durable and less likely to pop during freezing. Prepare this ahead of time.\n- **Safety:** Ensure warm water is hot enough to speed up melting but not so hot it poses a burn risk. Supervise closely during the warming phase.\n- **Accessibility:** Students with limited motor control can use bubble wands or pre-blown bubbles (you blow, they observe). Ensure observation sheets are large print and high contrast if needed.",
  "inputTokens": 2442,
  "outputTokens": 4601,
  "cost": 0.025446999999999997,
  "generatedAt": "2026-02-12T23:40:19.118Z"
}