{
  "id": 59,
  "title": "Ice",
  "category": "physical-science",
  "imageFile": "p15.jpg",
  "imagePath": "images/physical-science/p15.jpg",
  "gradeLevel": "fifth-grade",
  "content": "## 📸 Photo Description\n\nA clear glass bowl filled with water contains what appears to be dry ice creating dramatic white fog or vapor that spills over the edges. The frozen carbon dioxide is sublimating, changing directly from a solid to a gas without becoming liquid first. This creates a misty, cloud-like effect that flows downward because the cold carbon dioxide gas is denser than the surrounding warm air.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates **sublimation** - the phase change where a solid transforms directly into a gas without passing through the liquid phase. The dry ice (frozen carbon dioxide) is absorbing thermal energy from the surrounding water and air, causing it to sublimate at -78.5°C (-109.3°F). The dramatic white \"fog\" is actually a mixture of cold carbon dioxide gas and water vapor that condenses in the air due to the extreme temperature difference. The fog sinks because cold CO₂ gas is denser than warm air, creating the flowing, cascading effect visible in the image.\n\n## 📚 Core Science Concepts\n\n1. **States of Matter and Phase Changes**: Matter exists in different states (solid, liquid, gas) and can change between these states when energy is added or removed.\n\n2. **Sublimation**: A specific phase change where solids transform directly into gases without melting into liquids first.\n\n3. **Density and Gas Behavior**: Cold gases are denser than warm gases, causing the carbon dioxide vapor to sink and flow downward like a heavy liquid.\n\n4. **Heat Transfer**: Thermal energy moves from warmer objects (water, air) to cooler objects (dry ice), driving the sublimation process.\n\n<pedagogical-tip>Use this demonstration to help students distinguish between sublimation and evaporation by comparing dry ice (solid to gas) with regular ice melting and then evaporating (solid to liquid to gas).</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to observe this phenomenon: live demonstration, slow-motion video, and time-lapse photography to accommodate different learning preferences and ensure all students can access the visual information.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n**Zoom In:** At the molecular level, carbon dioxide molecules in the solid dry ice are vibrating more rapidly as they absorb thermal energy. When they gain enough energy, they break free from their solid structure and move into the gas phase, with molecules spreading far apart and moving freely through space.\n\n**Zoom Out:** This same sublimation process occurs naturally in Earth's systems, such as when snow and ice sublimate directly into water vapor in cold, dry climates, contributing to the water cycle. On Mars, the polar ice caps are made of frozen carbon dioxide that sublimates seasonally, creating dramatic atmospheric changes.\n\n## 🤔 Potential Student Misconceptions\n\n1. **\"The white fog is steam\"** - Students often confuse the visible vapor with water steam. The white fog is actually condensed water vapor in the air caused by the extreme cold, mixed with invisible carbon dioxide gas.\n\n2. **\"Dry ice is just really cold regular ice\"** - Students may think dry ice is frozen water. Dry ice is actually frozen carbon dioxide, a completely different substance that sublimates at much colder temperatures.\n\n3. **\"The fog rises because it's hot\"** - Students might expect all vapors to rise. The CO₂ gas is actually sinking because it's much denser than the surrounding warm air.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation:** 5-PS1-1: Develop a model to describe that matter is made of particles too small to be seen\n- **Disciplinary Core Ideas:** [[NGSS:DCI:5-PS1.A]] - Structure and Properties of Matter\n- **Disciplinary Core Ideas:** [[NGSS:DCI:2-PS1.A]] - Structure and Properties of Matter  \n- **Crosscutting Concepts:** [[NGSS:CCC:Patterns]] - Observable patterns in nature guide organization and classification\n- **Crosscutting Concepts:** [[NGSS:CCC:Cause and Effect]] - Events have causes that generate observable patterns\n- **Science and Engineering Practices:** Developing and Using Models\n\n## 💬 Discussion Questions\n\n1. What do you think would happen if we put the dry ice in hot water instead of room temperature water? (Bloom's: Predict/Analyze | DOK: 3)\n\n2. Why does the white fog flow downward instead of floating upward like smoke? (Bloom's: Analyze | DOK: 2)\n\n3. How is what's happening to the dry ice different from what happens when regular ice melts? (Bloom's: Compare | DOK: 2)\n\n4. What other examples of sublimation have you observed in nature or everyday life? (Bloom's: Apply | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Sublimation:** The process where a solid changes directly into a gas without becoming a liquid first.\n* **Phase change:** When matter transforms from one state (solid, liquid, or gas) to another state.\n* **Density:** How much matter is packed into a space, which affects whether substances sink or float.\n* **Carbon dioxide:** A colorless gas made of carbon and oxygen that we breathe out and plants use.\n* **Thermal energy:** The energy that comes from heat and makes molecules move faster.\n* **Condensation:** When a gas cools down and changes into tiny water droplets that we can see.\n\n## 📚 External Resources\n\n**Children's Books:**\n- States of Matter by David Dreier\n- What Is the World Made Of? All About Solids, Liquids, and Gases by Kathleen Weidner Zoehfeld\n- Matter: Physical Science for Kids by Andi Diehn\n\n**YouTube Videos:**\n- \"Dry Ice Experiments - Cool Science Demonstrations\" - Safe demonstrations showing sublimation and density properties of dry ice: https://www.youtube.com/watch?v=gjsMV1MglA4\n- \"States of Matter for Kids\" - Educational video explaining solids, liquids, gases, and phase changes with animations: https://www.youtube.com/watch?v=ZnbKmPdpVFs",
  "generatedAt": "2026-02-04T17:01:44.986Z"
}