{
  "id": 59,
  "title": "Ice",
  "category": "physical-science",
  "imageFile": "p15.jpg",
  "imagePath": "images/physical-science/p15.jpg",
  "gradeLevel": "first-grade",
  "content": "## 📸 Photo Description\n\nA clear glass has water and ice cubes in it. White smoke or fog is coming out of the glass. The ice looks very cold and makes the air around it foggy.\n\n## 🔬 Scientific Phenomena\n\nThis image shows **sublimation** - the process where dry ice (frozen carbon dioxide) changes directly from a solid to a gas without becoming liquid first. The dramatic \"fog\" effect occurs because the extremely cold carbon dioxide gas (-78.5°C) causes water vapor in the surrounding air to condense into tiny visible water droplets, creating the cloudy appearance. This is different from regular ice melting, as dry ice never becomes liquid at normal atmospheric pressure.\n\n## 📚 Core Science Concepts\n\n1. **States of Matter**: Matter exists in different forms - solid, liquid, and gas - and can change between these states\n2. **Temperature Effects**: Very cold materials can change the air around them, making water vapor visible as fog\n3. **Phase Changes**: Some materials can skip the liquid phase and go directly from solid to gas (sublimation)\n4. **Observable Properties**: We can use our senses to observe changes in materials, like seeing fog or feeling cold\n\n<pedagogical-tip>Use this dramatic visual to engage students in making predictions before revealing what's happening. Ask \"What do you notice?\" and \"What do you wonder?\" to activate their natural curiosity about the mysterious fog effect.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to engage with this concept: visual observation of the fog, tactile experience with regular ice cubes (safely), and kinesthetic movement activities where students act out different states of matter with their bodies.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** At the molecular level, the carbon dioxide molecules in dry ice are vibrating so fast due to temperature that they break free from their solid structure and become gas molecules, moving rapidly in all directions.\n\n2. **Zoom Out:** This same sublimation process happens naturally in our environment when snow disappears on cold, dry days without melting, and it's used in weather modification, food preservation, and special effects in entertainment.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"The white fog is steam from hot water\"\n   **Clarification**: The fog is actually cold water droplets formed when very cold gas meets warm, moist air\n\n2. **Misconception**: \"All ice melts the same way into water\"\n   **Clarification**: Regular ice melts into water, but dry ice skips being liquid and goes straight to gas\n\n3. **Misconception**: \"The smoke means something is burning\"\n   **Clarification**: No burning is happening - this is a cold process where solid material becomes gas\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: K-PS1-1 - Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties\n- **Disciplinary Core Idea**: [[NGSS:DCI:K-PS1.A]] - Properties of materials can be observed and described\n- **Crosscutting Concept**: [[NGSS:CCC:Patterns]] - Patterns in the natural world can be observed and used as evidence\n\n## 💬 Discussion Questions\n\n1. What do you see happening in this glass? (Bloom's: Knowledge | DOK: 1)\n2. Why do you think the fog is coming out of the water? (Bloom's: Analysis | DOK: 2)\n3. How is this different from what happens when you put regular ice in water? (Bloom's: Analysis | DOK: 2)\n4. What other times have you seen fog or clouds appear? (Bloom's: Application | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Solid:** Matter that keeps its shape and doesn't flow\n* **Gas:** Matter that spreads out and fills up space\n* **Fog:** Tiny water drops floating in the air that we can see\n* **Cold:** Having a low temperature that we can feel\n* **Change:** When something becomes different than it was before\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math - Measurement & Observation**: Have students measure how long it takes for the fog to disappear from the glass using a simple sand timer or counting method. Create a simple bar graph showing \"fog is there\" vs. \"fog is gone\" to practice data collection and visualization.\n\n2. **ELA - Descriptive Writing**: Ask students to draw the foggy glass and write or dictate words that describe what they see and feel. Use sensory vocabulary like \"cold,\" \"white,\" \"wispy,\" and \"mysterious\" to build descriptive language skills.\n\n3. **Art - Color & Movement**: Have students paint or draw the fog effect using white paint on colored paper, experimenting with how fog moves and changes. They can use cotton balls, chalk, or watercolors to create their own \"foggy\" artwork inspired by the photograph.\n\n4. **Social Studies - Seasons & Weather**: Connect sublimation to real-world weather by discussing how snow disappears in winter without melting, and how fog appears on cold mornings. This helps students understand natural phenomena they observe in their own communities.\n\n## 🚀 STEM Career Connection\n\n1. **Meteorologist (Weather Scientist)**: A meteorologist studies weather and clouds, including how fog forms in the sky. They help people know when rain or snow is coming. Meteorologists use science to understand all the water and air around us. **Average Salary: $97,000/year**\n\n2. **Food Scientist**: Food scientists use dry ice and sublimation to keep food fresh and cold during delivery and storage. They experiment with different materials to discover the best ways to preserve food so it stays healthy and tasty longer. **Average Salary: $68,000/year**\n\n3. **Special Effects Designer**: Special effects designers use dry ice and sublimation to create amazing fog and smoke effects for movies, theater shows, and concerts. They use science to make magical-looking scenes that audiences love to watch! **Average Salary: $75,000/year**\n\n## 📚 External Resources\n\n**Children's Books:**\n- What Is the World Made Of? All About Solids, Liquids, and Gases by Kathleen Weidner Zoehfeld\n- Solids, Liquids, and Gases by David Dreier",
  "generatedAt": "2026-02-04T16:59:46.052Z"
}