{
  "title": "Reflection",
  "category": "physical-science",
  "imageFile": "p17.jpg",
  "imagePath": "images/physical-science/p17.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Light and Shadows in City Buildings\n\n## Core Science Concepts from Image Analysis\n\n- **Light and Shadows:** The photograph clearly shows how glass windows and building structures create patterns of light and shadow—glass panes reflect and allow light through, while the building structures block light and create dark shadows.\n- **Properties of Materials:** Different materials interact with light differently—the transparent glass windows allow light to pass through and show reflections, while opaque building materials block light entirely.\n- **Patterns and Predictions:** The repeating grid pattern of windows creates predictable patterns of light and shadow across the building surfaces, demonstrating how patterns help us understand and predict how light behaves.\n- **Force and Motion of Light:** Light travels in straight lines and interacts with objects, creating visible evidence of its path through reflections and shadows.\n\n---\n\n## Lesson Title\n\n**The Mystery of Shadows: How Light Plays Peek-a-Boo with Buildings**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes (three 30-minute sessions, or two 45-minute sessions)\n- **NGSS Standards:** \n  - 3-PS2-2: Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion.\n  - 3-PS2-3: Ask questions to determine cause and effect relationships of electric or magnetic interactions between two objects not in contact with each other. *(Note: Modified context—light as energy interacting with materials)*\n\n---\n\n## Learning Objectives\n\nStudents will be able to...\n\n1. Observe and describe how light creates shadows and reflections on different materials.\n2. Identify patterns in how light and shadow appear on surfaces and use those patterns to predict where shadows will form.\n3. Explain why some materials let light through (transparent) while others block light completely (opaque).\n4. Predict and test how the position of a light source affects the size and location of shadows.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest by exploring the photograph and activating curiosity about light, shadows, and patterns.\n\n**Materials:**\n- Printed color photograph (8.5\" × 11\" or larger, if possible)\n- Document camera or projector to display the image\n- Chart paper or whiteboard for recording observations\n\n**Activity:**\n\n1. **Display the photograph** using a projector or document camera so all students can see it clearly. Show only a portion at first (perhaps one building section) to build curiosity.\n\n2. **Introduce with a mystery question:** \"What do you notice about this tall building? Why do some parts look darker and some parts look lighter?\" Give students 30 seconds to turn and talk to a neighbor.\n\n3. **Ask specific discussion questions** (one at a time, allowing 1-2 minutes per question):\n   - \"Look at all those windows. Why do you think some windows look bright and shiny, while others look dark?\"\n   - \"What do you see reflecting in the glass? What might be making that reflection?\"\n   - \"Can you find patterns on this building? What repeats over and over?\"\n   - \"If the sun moved to a different place in the sky, do you think the dark and light areas would look the same or different?\"\n\n4. **Prediction prompt:** \"I'm wondering... if we stood in front of this building at noon when the sun is high up, and then came back at late afternoon when the sun is low, would the shadows in the windows be in the same spot? Turn and talk about your idea.\"\n\n5. **Record student wonderings** on chart paper. Use phrases like: \"We wonder why...\", \"We think...\", \"We want to know...\"\n\n**Transition:** \"Great questions! Let's do some investigations to figure out exactly how light and shadows work. You're going to become light scientists!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how light creates shadows and how object position affects shadow size and location.\n\n**Materials (per pair of students):**\n- One flashlight or small rechargeable LED light\n- One small opaque object (e.g., pencil, building block, toy figure, rubber duck)\n- White paper or poster board\n- Ruler (optional, for measurement)\n- Small notebook or paper for recording observations\n- Tape (optional, for securing paper)\n\n**Activity:**\n\n**Directions for students (read aloud, then post on chart):**\n\n1. \"You and your partner are light detectives. Set your white paper on a flat table or desk.\"\n\n2. \"Place your small object (the building) on the paper. This will be your tiny city building.\"\n\n3. \"Shine your flashlight at the object from different angles. Observe what happens.\"\n   - *First position:* Shine the light from directly above the object.\n   - *Second position:* Shine the light from the side of the object.\n   - *Third position:* Shine the light from very close to the object.\n   - *Fourth position:* Shine the light from far away.\n\n4. \"As you shine the light from each position, answer these questions in your notebook:\"\n   - \"Where does the shadow appear?\" (draw or write)\n   - \"Is the shadow big or small?\"\n   - \"What happens to the shadow when you move the light closer or farther away?\"\n   - \"What happens to the shadow when you move the light to different sides?\"\n\n5. \"Try to predict before you move the light: 'If I move the light here, I think the shadow will go there.' Then test it. Were you right?\"\n\n**How it connects to the photograph:** \"In the building picture, the sun is the flashlight. The buildings and windows are like your object. The ground and windows are like your white paper where you see the shadows. We're testing the same thing!\"\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What changed?\" \"How is the shadow different now?\" \"Why do you think that happened?\"\n- Do NOT tell students answers—guide them to discover through observation.\n- Help students stay focused on comparing shadows across trials.\n- Encourage sketching—even simple drawings help document observations.\n\n**Expected Student Outcomes:**\n- Students discover that shadows change size and position based on light source location.\n- Students recognize that opaque objects block light and create shadows.\n- Students identify patterns (e.g., \"shadow gets bigger when light gets closer\").\n- Students predict and test predictions, refining understanding through trial.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect hands-on discoveries to the building photograph and real-world light behavior.\n\n**Materials:**\n- Chart paper with vocabulary and illustrations\n- Photograph displayed on screen or printed copies for each student\n- Picture cards or illustrations showing transparent vs. opaque materials\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3-4 pairs to share one discovery: \"What did you learn about shadows?\" or \"Tell us about one prediction you made that was right (or wrong).\"\n   - Record recurring observations on chart paper: \"Shadows change when...\" / \"Shadows get bigger when...\" / \"Light makes...\"\n\n2. **Introduce Key Vocabulary (7 minutes):**\n   Present each term with a **student-friendly definition** and **visual example**:\n\n   - **Light:** Energy that lets us see. The sun and flashlights make light. (Point to light source.)\n   - **Shadow:** A dark area that forms when light is blocked by an object. (Show shadow on hand or wall.)\n   - **Transparent:** You can see through it clearly. Glass windows are transparent. (Hold up a clear cup or show glass in the photo.)\n   - **Opaque:** You cannot see through it. It blocks light. Buildings and people are opaque. (Point to building in photo.)\n   - **Reflection:** Light bouncing off a shiny surface so you see a mirror image. (Demonstrate with a mirror or shiny object.)\n\n3. **Connect Back to the Building Photograph (5 minutes):**\n   - Display the photograph again. Point to specific areas.\n   - \"See these bright, shiny spots on the glass? That's the sun reflecting off the transparent glass—light bouncing back at us!\"\n   - \"See these dark areas? Those are shadows created by the building structure blocking the sun's light.\"\n   - \"The grid pattern of windows repeats over and over. Each window creates the same pattern of light and shadow. That pattern helps us predict where shadows will appear.\"\n\n4. **Check for Understanding:**\n   Ask students to hold up fingers to show level of understanding:\n   - Fingers down (1) = \"I'm still confused\"\n   - Fingers up (5) = \"I understand!\"\n   - Address misconceptions immediately with a quick demonstration.\n\n**Vocabulary Summary Chart** (Post for reference):\n\n| Term | Simple Definition | Example |\n|------|-------------------|---------|\n| **Light** | Energy that helps us see | The sun, a flashlight |\n| **Shadow** | A dark spot where light is blocked | The dark area under a tree |\n| **Transparent** | You can see right through it | Clear glass, plastic wrap |\n| **Opaque** | You cannot see through it | A wall, a building, paper |\n| **Reflection** | Light bouncing off something shiny | Seeing yourself in a mirror |\n\n**Expected Student Outcomes:**\n- Students use vocabulary to describe what they observed.\n- Students explain why shadows form (light blocked by opaque objects).\n- Students recognize that transparent materials allow light through, creating reflections.\n- Students connect the photograph to their hands-on experiment.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding to predict and test shadow patterns in a new scenario related to the building photograph.\n\n**Materials (per pair):**\n- Building models made from blocks, boxes, or paper tubes (pre-built or student-made)\n- Flashlight or LED light\n- Chart paper or large paper for recording predictions\n- Colored pencils or markers\n- Ruler or measuring stick\n- Small town template (optional; simple grid of square outlines on paper)\n\n**Activity:**\n\n**Scenario:** \"We're going to design a tiny city! Your job is to figure out where shadows will fall at different times of day, just like the real city in our building photograph.\"\n\n**Student Directions:**\n\n1. \"Build a small city skyline using blocks or boxes on a large piece of paper. Make tall buildings and short buildings—just like real cities.\"\n\n2. \"Imagine the flashlight is the sun. It starts in the morning on one side of your city (west side). Shine the light there and observe the shadows. Draw or describe where the shadows fall.\"\n\n3. \"Now move your 'sun' (flashlight) to the middle (noon—directly above the buildings). What changed? Record your observations.\"\n\n4. \"Move your 'sun' to the afternoon position (east side). How are the shadows different now?\"\n\n5. **Make a prediction:** \"If it's evening and the sun is even lower on the horizon, where will the shadows be the longest?\" Draw your prediction, then test it with the flashlight.\n\n6. **Optional challenge:** \"Measure the shadow lengths at each position using a ruler. Which time of day made the longest shadows?\"\n\n**Teacher Role:**\n- Circulate and ask: \"Why do you think the shadow moved there?\" / \"What would happen if you added a taller building?\"\n- Encourage students to make connections: \"How is this like the photograph?\"\n- Push thinking: \"Could shadows tell us what time of day this photo was taken?\"\n\n**Expected Student Outcomes:**\n- Students predict shadow movement based on light source position.\n- Students test predictions and refine understanding.\n- Students apply vocabulary (transparent, opaque, shadow, light, reflection) in context.\n- Students recognize patterns in how shadows change over time.\n- Students make a real-world connection: shadows in the city photograph reflect the sun's position.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess students' understanding of light, shadows, and how object/light position affects shadow size and location.\n\n**Formative Assessment (throughout lesson):**\n- Observe student predictions and tests in Explore phase: Do they make reasonable guesses? Do they adjust predictions based on results?\n- Listen to group discussions in Explain phase: Do students use vocabulary correctly?\n- Observe Elaborate activity: Can students apply concepts to a new scenario?\n\n**Summative Assessment - Exit Ticket (5-10 minutes):**\n\nProvide each student with a simple exit ticket. Students may draw, write, or answer with words. **Provide sentence starters for support:**\n\n**Exit Ticket Questions:**\n\n1. **Drawing prompt:** \"Draw a building with the sun shining on one side. Show where you think the shadows would be. Label the shadow, the light, and the building.\"\n\n2. **Multiple choice or yes/no:**\n   - \"Can you see through transparent glass? Yes or No?\"\n   - \"Does light travel in straight lines or in curves?\"\n   - \"Which material blocks light better: transparent glass or opaque brick?\"\n\n3. **Open-ended (with sentence starter):**\n   - \"If a building is very tall and the sun is low in the sky, the shadow will be _______________ because _______________.\"\n\n4. **Prediction:**\n   - \"Look at this photo of a building. If the sun moves to the other side, will the shadows stay in the same place? Why or why not?\"\n\n**Success Criteria:**\n\n✓ Student accurately identifies transparent vs. opaque materials.\n\n✓ Student explains that shadows form when light is blocked.\n\n✓ Student predicts how shadow position/size changes with light source position.\n\n✓ Student uses at least 2 vocabulary terms correctly (light, shadow, transparent, opaque, reflection).\n\n✓ Student makes a reasonable connection between the photograph and their exploration.\n\n**Expected Student Outcomes:**\n\nStudents who meet all criteria show understanding of:\n- How light interacts with different materials\n- The cause-and-effect relationship between light source position and shadow appearance\n- Patterns in light behavior that allow prediction\n- Real-world application to the city building photograph\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Sentence Starters and Word Banks:** Provide vocabulary cards with pictures (e.g., photo of shadow, reflection, transparent material) so students can reference terms without spelling concerns.\n\n2. **Simplified Investigation:** Instead of four light positions in Explore, use only two: \"light above\" vs. \"light to the side.\" This reduces cognitive load while maintaining core concepts.\n\n3. **Guided Predictions:** For students who struggle with open-ended predictions, offer multiple-choice options: \"I think the shadow will be (a) bigger, (b) smaller, (c) in the same place\" before testing.\n\n4. **Peer Partnerships:** Pair students strategically with a patient partner who can explain observations verbally and help record findings.\n\n### Challenge (for advanced learners):\n\n1. **Measurement and Graphing:** Have advanced students measure shadow length at each light position using a ruler, record data, and create a simple bar graph showing how shadow length changes. Ask: \"What pattern do you see?\"\n\n2. **Complex Scenario:** Provide a photo of a different building or urban scene and ask: \"Based on where the shadows fall in this photo, what time of day do you think this was taken? How do you know?\"\n\n3. **Prediction with Multiple Variables:** Challenge students to predict shadows when *both* the building height and light position change: \"If I move the light closer AND move it to the side, what will happen to the shadow?\" Have them test and explain results.\n\n4. **Design Challenge:** \"Design a sundial using shadows. Where would you place the sun (light) at different times to mark morning, noon, and afternoon? Test your design.\"\n\n---\n\n## Extension Activities\n\n1. **Classroom Shadow Hunt:** Take students outside (or to a sunny window) on a sunny day to observe real shadows on the school building, playground structures, or trees. Have them sketch shadows and predict how those shadows will move in one hour. Return later to verify predictions. Discuss how this is exactly like the building photograph—real light from the sun creates real shadows.\n\n2. **Create a Shadow Puppet Theater:** Students design and decorate opaque puppets from black paper or cardboard, then position a light source to cast shadows on a white sheet or paper screen. This reinforces that opaque objects block light and create shadows, while adding creative engagement. Students can tell a story with their shadows.\n\n3. **Build a Model City with Transparent Windows:** Provide clear plastic sheets, cardboard tubes, and blocks. Have students construct buildings with both transparent windows (clear plastic) and opaque walls (cardboard). Shine light through the city model and observe which parts are bright (light passing through transparent materials) and which are dark (blocked by opaque materials). Document the results with photos or drawings. This deepens understanding of how different materials interact with light in real buildings.\n\n---\n\n## Additional Teacher Notes\n\n- **Safety reminder:** Ensure flashlights are cool and students don't shine lights directly in eyes.\n- **Timing flexibility:** This lesson can be taught in three 30-minute sessions (one phase per day) or compressed into two 45-minute sessions by combining Engage + Explore in Session 1 and Explain + Elaborate in Session 2, with Evaluate as a brief exit activity.\n- **Real-world relevance:** This lesson connects directly to architects and building designers who consider shadow patterns, natural light, and material transparency when designing buildings.\n- **Photograph revisiting:** Return to the building photograph at the end of the lesson for a final reflection: \"Now that you're light scientists, what can you tell us about this building? Where is the sun? Why are some windows bright? Why are some areas dark?\"",
  "inputTokens": 2376,
  "outputTokens": 4103,
  "cost": 0.022891,
  "generatedAt": "2026-02-12T23:47:42.096Z"
}