{
  "title": "Reflection",
  "category": "physical-science",
  "imageFile": "p17.jpg",
  "imagePath": "images/physical-science/p17.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Light and Shadows in the City\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Light and Shadows**: The photograph shows how light from the sun creates clear shadows of buildings reflected on glass surfaces and cast by structures, demonstrating that light travels and creates visible shadows.\n- **Transparent and Translucent Materials**: Glass windows allow light to pass through while also reflecting light, showing how different materials interact with light differently.\n- **Properties of Materials**: The contrast between glass (transparent) and concrete/stone (opaque) demonstrates how material properties affect how light behaves.\n- **Patterns and Repetition**: The regular grid pattern of windows creates repeating patterns that demonstrate predictable arrangements in structures, which relates to how light interacts consistently with similar surfaces.\n\n---\n\n## Lesson Title\n\n**Sunny Shadows: Light and Dark at the City Building**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total)\n- **NGSS Standards:** \n  - K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface.\n  - K-PS3-2: Use tools and materials to design and build a structure that will reduce the warming effect of sunlight on an area.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how sunlight creates shadows on different surfaces.\n2. Identify areas that are bright (lit by the sun) and dark (in shadow) in their classroom and outdoor environment.\n3. Explain that light comes from the sun and creates both bright spots and dark shadows.\n4. Use simple materials to create their own shadows and observe how they change.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about light and shadows using the urban photograph.\n\n**Materials:**\n- Projected or printed photograph (p17.jpg) displayed on screen or poster board\n- Pointer (stick, laser pointer, or teacher's finger)\n\n**Activity:**\n\n1. **Display the photograph** on the board or projector. Ask students to sit where they can all see clearly.\n\n2. **Direct attention** by pointing to different parts of the image: the bright glass windows on the left, the reflections and shadows visible in the middle, and the darker areas.\n\n3. **Ask these specific questions** (pause after each for responses):\n   - \"What do you see that is very bright in this picture?\" (Point to the glass windows.)\n   - \"Do you see any dark spots or shadows? Point to them.\" (Gesture to shadowed areas created by building overhangs and reflections.)\n   - \"Where does all that bright light come from?\" (Guide them to think about the sun.)\n   - \"Why do you think some parts are bright and some parts are dark?\"\n\n4. **Prediction prompt:** \"I wonder what makes those shadows. Do you think the sun makes shadows? Let's find out!\"\n\n**Transition:** \"We're going to go outside (or use our classroom) to look for shadows made by the sun, just like in this picture.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover how sunlight creates shadows through hands-on exploration.\n\n**Materials:**\n- Flashlights (or one lamp per small group)\n- Various objects (blocks, toys, books, pencils, stuffed animals)\n- White paper or white poster board (2-3 sheets)\n- Tape\n- The classroom (preferably with a window or outdoor space with sunlight)\n- Optional: shadow puppets printout or simple cutout shapes\n\n**Activity:**\n\n**Option A: Outdoor/Windowsill Exploration (if sunlight is available):**\n\n1. **Take students outside** (or to a sunny windowsill) on a sunny day.\n\n2. **Direct exploration:** Say, \"I want you to make a shadow! Stand where the sun is shining. Now look down at the ground. What do you see?\" Students observe their own shadows.\n\n3. **Investigative tasks** (students work in pairs or small groups):\n   - Hold up one hand in the sunlight. Observe the shadow on the ground or wall.\n   - Place a toy or object in the sunlight. Describe its shadow.\n   - Move the object closer to the light source (if indoors with a lamp) or move themselves to different positions. Observe how the shadow changes.\n   - Try to move your shadow. Can you make it bigger or smaller?\n\n4. **Documentation:** Teacher circulates with a clipboard and asks each child, \"Tell me about your shadow. Is it big or small? Dark or light?\" Write down responses using simple drawings or words.\n\n**Option B: Classroom Shadow Exploration (if outdoors is unavailable):**\n\n1. **Darken the room** partially (close blinds/curtains).\n\n2. **Set up stations** with flashlights and objects:\n   - Place a flashlight behind a white paper screen.\n   - Have students hold objects between the light and the paper.\n   - Observe the shadow cast on the paper.\n\n3. **Investigative tasks:**\n   - Move the object closer to and farther from the light. What happens to the shadow?\n   - Change which object you use. Does every object make a shadow?\n   - Hold your hand in front of the flashlight. Create shadow puppets (fingers spread, fist, etc.).\n\n4. **Documentation:** Have students draw or trace the shadow they created on their paper.\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What do you notice? Is the shadow dark or bright? What happens when you move the object?\"\n- Do NOT tell students what shadows are; let them describe observations.\n- Provide objects and light sources; facilitate exploration without directing outcomes.\n\n**Expected Student Outcomes:**\n- Students observe that shadows form when light is blocked.\n- Students notice that shadows change when objects move.\n- Students discover that light makes bright areas and shadows make dark areas.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to scientific concepts.\n\n**Materials:**\n- Photograph (p17.jpg) displayed again\n- Index cards with vocabulary words and simple illustrations\n- One flashlight and one object (to demonstrate for the whole group)\n- Chart paper and markers (for recording vocabulary)\n\n**Activity:**\n\n1. **Group Share-Out:**\n   - Invite 4-5 students to share what they discovered during Explore.\n   - Ask: \"What made the shadow? What does the sun have to do with it?\"\n   - Validate all observations and affirm correct ideas.\n\n2. **Introduce Key Vocabulary** using the photograph and a live demonstration:\n\n   - Show the flashlight and object again. Turn on the light. Create a shadow on the board.\n   - Say: \"When the light can't get through the object, it makes a **shadow**. A shadow is a dark place where the light can't reach.\"\n   - Point to the photo: \"See the shadows on the buildings? The sun is like our flashlight, and the buildings block the light.\"\n\n3. **Vocabulary (with student-friendly definitions):**\n   - **Light** (bright energy that comes from the sun and helps us see)\n   - **Shadow** (a dark place that happens when something blocks the light)\n   - **Sun** (the big bright light in the sky that gives us light and warmth)\n   - **Block** (to stop light from passing through)\n   - **Bright** (full of light; easy to see)\n\n4. **Connect Back to the Photo:**\n   - Point to the bright glass windows: \"This is where the sun's light is hitting the building.\"\n   - Point to darker areas: \"These are shadows—places where the building is blocking the sun's light.\"\n   - Point to reflections: \"Some light bounces off the glass, like a mirror!\"\n\n5. **Check for Understanding:**\n   - \"If I turn off the flashlight, will we still see a shadow?\" (No—we need light to make a shadow.)\n   - \"Can you show me with your hand where the light is coming from in our exploration?\"\n   - \"Point to a shadow in this photograph.\"\n\n**Expected Student Outcomes:**\n- Students understand that shadows form when light is blocked.\n- Students can identify the light source (sun or flashlight).\n- Students understand that light creates both bright areas and dark shadows.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply concepts to a new context and deepen understanding.\n\n**Materials:**\n- Building blocks, cardboard boxes, or other construction materials\n- Flashlight or access to sunlight\n- White paper or poster board\n- Tape\n- Optional: colored cellophane or translucent materials\n\n**Activity: Build a Shadow Structure**\n\n1. **Introduce the task:** \"Remember the tall buildings in the picture? They make shadows. Let's build our own building and see what shadow it makes!\"\n\n2. **Small group construction** (groups of 3-4):\n   - Provide blocks or boxes.\n   - Say: \"Build a tall structure. It can be as tall as you want!\"\n   - Once built, shine a flashlight on it from the side, or place it in sunlight.\n   - Observe and discuss: \"Look at the shadow your building makes! Is it big? Dark? Can you make the shadow bigger by moving the light?\"\n\n3. **Extended exploration:**\n   - Have students arrange their structures to create the darkest shadow possible.\n   - Ask: \"Where should the light come from to make the biggest shadow?\"\n   - Try adding a second light source. What happens to the shadow?\n\n4. **Real-world connection:** \"In the city, big buildings make shadows that keep areas cool and shady. On hot sunny days, people stand in the shadows to stay cool. The sun is very strong!\"\n\n**Teacher Role:**\n- Facilitate building and light placement.\n- Ask guiding questions: \"What happens if you move the flashlight closer? What if you build it even taller?\"\n- Help students articulate discoveries.\n\n**Expected Student Outcomes:**\n- Students apply their understanding of light and shadows to a new scenario.\n- Students discover that the size and direction of light affect shadow size.\n- Students make real-world connections (shadows provide shade and coolness).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of light, shadows, and the sun's effects.\n\n**Activity:**\n\n**Formative Assessment (Throughout the lesson):**\n- Observe student participation during Explore phase: Can they identify shadows and describe them accurately?\n- Listen to student explanations during Explain phase: Do they connect shadows to light being blocked?\n- Observe during Elaborate phase: Do they apply the concept to a new structure and light scenario?\n\n**Exit Ticket / Summative Assessment:**\n\nUse one or more of the following assessment strategies (choose based on time):\n\n**Option 1: Visual Sorting Activity**\n- Show students 4-6 images (printed pictures or drawn on cards):\n  - A sunny playground with clear shadows\n  - A dark indoor room\n  - A bright window\n  - A object blocking sunlight\n  - A child standing in shade\n- Ask: \"Which pictures show shadows? Point to them.\"\n- Success criterion: Student correctly identifies 3 out of 4 images with shadows.\n\n**Option 2: Quick-Draw Assessment**\n- Provide each student with a blank paper divided into two sections (labeled with a sun symbol and a cloud symbol).\n- Say: \"Draw a shadow in the sunny part. Draw what it might look like on a cloudy day in the other part.\"\n- Success criterion: Student draws a clear shadow in the sunny section and understands it might be different/missing on a cloudy day.\n\n**Option 3: Verbal Check-In**\n- Ask each student individually or in small groups:\n  - \"Where does a shadow come from?\" (Answer should reference light or the sun.)\n  - \"Can you make a shadow right now? Show me.\" (Student demonstrates understanding by using light/sun or their hand.)\n  - \"What did you learn about light and shadows?\"\n- Success criterion: Student provides a reasonable explanation that shows they understand shadows are created when light is blocked.\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding that the sun creates light.\n- Students can identify and locate shadows in images and real environments.\n- Students understand that shadows form when an object blocks light.\n- Students can apply this understanding to explain shadows in new contexts.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Pre-teach vocabulary** using real objects and demonstrations before the full lesson. Show a flashlight and object; create a shadow; repeat the word \"shadow\" multiple times with the visual.\n\n2. **Provide more scaffolding during Explore:** Partner struggling students with a peer or teacher. Use guiding questions: \"What do you see? Is it dark or bright? Where is the light coming from?\" rather than open-ended exploration.\n\n3. **Simplify the assessment:** Use only visual identification of shadows (pointing to images) rather than drawing or verbal explanation. Provide sentence frames: \"A shadow is ________\" (dark/dark place).\n\n### Challenge (For Advanced Learners)\n\n1. **Investigate shadow changes over time:** Have students observe their own shadow at different times of day (morning, midday, afternoon if possible). Ask: \"Why do you think the shadow moves and changes size? Where is the sun?\" Introduce the concept that the sun appears to move across the sky.\n\n2. **Explore transparent vs. opaque materials:** Provide clear plastic, frosted plastic, and opaque paper. Have students predict which will make a shadow and test their predictions. Discuss why some block light more than others.\n\n3. **Design a \"shade structure\":** Challenge students to design a building or structure using blocks that creates the most shadow to keep a toy animal or person \"cool\" in the sun. Introduce K-PS3-2 concepts: \"How can we design something to reduce the sun's warming effect?\"\n\n---\n\n## Extension Activities\n\n1. **Shadow Hunt Walk:** Take students on a guided walk around the school (playground, hallways, outdoor areas). Have them find and point out 5-10 different shadows created by trees, buildings, fences, and other objects. Take photos or make a list. Discuss: \"What is blocking the sunlight in each case?\"\n\n2. **Shadow Puppet Theater:** Create a simple shadow puppet theater using a lamp, white sheet, and puppet cutouts. Let students manipulate puppets to create shadows for a simple story (e.g., \"A bird flies across the sky\"). Reinforce that moving the puppet changes the shadow. This connects motion, light, and shadows.\n\n3. **Design a Sunshade:** Provide art supplies (paper, tape, stickers, markers) and ask students to design a small sunshade or umbrella for a toy figure. Have them test whether their design creates a shadow and keeps the \"person\" cool. Connect to K-PS3-2 (designing solutions to reduce warming effects of sunlight). Display designs around the classroom or send home to families with an explanation of what students learned.\n\n---\n\n**Teacher Notes:**\n- This lesson works best on a sunny day; plan accordingly or have indoor alternatives ready.\n- The photograph is an excellent reference tool—refer back to it frequently throughout all phases.\n- Kindergarteners learn through direct sensory experience, so hands-on exploration is critical. Minimize seated time.\n- Shadows are a concrete, observable phenomenon that naturally engages young learners; use this momentum to build enthusiasm for learning about light and energy.",
  "inputTokens": 2383,
  "outputTokens": 3584,
  "cost": 0.020303,
  "generatedAt": "2026-02-12T23:45:39.218Z"
}