{
  "title": "Reflection",
  "category": "physical-science",
  "imageFile": "p17.jpg",
  "imagePath": "images/physical-science/p17.jpg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Light and Shadows in the City\n\n## Core Science Concepts from Image Analysis\n\n- **Light travels in straight lines:** The photograph shows how light passes through glass windows and reflects off building surfaces, creating visible patterns and reflections. Students can observe how light from the sun creates clear, defined shadows and reflections on the glass and building facades.\n\n- **Reflection of light:** The glass windows and reflective surfaces visible in the photograph demonstrate how light bounces off shiny, smooth surfaces. Students can see the older building reflected in the modern glass facade, showing how reflected light allows us to see objects indirectly.\n\n- **Shadows form when light is blocked:** The shadows cast by the building framework and structural elements on the glass show that opaque objects block light, creating dark areas behind them. The contrast between bright and shadowed areas illustrates this concept.\n\n- **Energy transfer through light:** Light energy from the sun travels through space and interacts with the building materials, transferring energy that allows us to see colors, textures, and shapes of objects at a distance.\n\n---\n\n## Lesson Title\n\n**Shadows and Reflections: How Light Helps Us See the City**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 50-minute sessions (or 100 minutes total)\n- **NGSS Standards:** \n  - 4-PS4-2: Develop a model to describe that light reflecting from objects and entering the eye allows objects to be seen.\n  - 4-PS3-2: Make observations to provide evidence that energy can be transferred from place to place by sound, light, heat, and electric currents.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Explain that light travels in straight lines** and use evidence from the photograph to support this idea.\n2. **Describe how light reflects off shiny surfaces** and allows us to see objects that are not directly in front of us.\n3. **Demonstrate how opaque objects block light** to create shadows, using a model or hands-on investigation.\n4. **Predict where shadows and reflections will appear** when light interacts with different materials (clear, shiny, and opaque).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about light, shadows, and reflections using the photograph.\n\n**Materials:**\n- Color photograph of the building (projected on screen or printed copies for small groups)\n- Chart paper and markers\n- \"I Notice, I Wonder\" graphic organizer (printed or displayed)\n\n**Activity:**\n\n1. **Display the photograph** on the projector or show students printed copies. Ask them to look closely for 30 seconds without talking.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you notice in this photograph? What can you see clearly?\" (Guide them to notice the glass windows, reflections of the older building, shadows cast by the framework.)\n   - \"How do you think we can see the old building that's actually behind the glass? What is allowing us to see it?\" (Elicit ideas about light and reflections.)\n   - \"Why are some parts of the glass darker than others? What do you think is causing those dark areas?\" (Listen for \"shadows,\" \"shade,\" \"something blocking light.\")\n   - \"If you stood in front of this building on a sunny day, where would you expect to see your shadow? Why?\" (Activate thinking about light blocking and shadow formation.)\n\n3. **Wonder Prompt:** Display on chart paper: *\"I wonder: How does light help us see things in the city? What stops light from reaching us?\"*\n\n   Ask students to turn to a partner and share one thing they wonder about light, shadows, or reflections. Record 2-3 student wonderings on the chart.\n\n**Transition:** \"Today, we're going to investigate how light travels, bounces off surfaces, and creates shadows so we can understand exactly what we're seeing in this photograph.\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate light reflection and shadow formation through hands-on experimentation.\n\n**Materials (per pair/small group):**\n- Flashlight or small lamp\n- Clear plastic cup or glass\n- Mirror (small, 4\"×4\" or similar)\n- Opaque object (pencil, eraser, block, or book)\n- Dark construction paper or black poster board (to use as background)\n- White paper or index cards (to observe reflections and shadows)\n- Tape\n- Notebook for recording observations\n\n**Activity:**\n\n**Part A: Light and Reflection (10 minutes)**\n\n1. **Provide these step-by-step directions to students:**\n   - \"Place the mirror on a piece of white paper in front of a dark background.\"\n   - \"Shine the flashlight at an angle onto the mirror's surface. What do you see? Does the light reflect onto the paper or wall?\"\n   - \"Now shine the flashlight directly at the clear plastic cup. Can you see light pass through it? Can you see light reflect off it?\"\n   - \"Record: Which surface (mirror or cup) reflected the light more brightly? Why do you think that happened?\"\n\n2. **Observation Focus:** Guide students to notice that the smooth, shiny mirror surface bounces (reflects) light in a clear direction, while the clear cup allows light to pass through AND reflects some light.\n\n**Part B: Shadows and Blocked Light (12 minutes)**\n\n1. **Provide these step-by-step directions to students:**\n   - \"Place the opaque object (pencil or block) between the flashlight and the white paper.\"\n   - \"Shine the light. What do you observe? Can the light pass through the object? Where does the shadow appear?\"\n   - \"Move the flashlight closer to the object, then farther away. What happens to the shadow's size? Does it get bigger or smaller?\"\n   - \"Try the same experiment with the clear cup. Do you see a shadow? Why or why not?\"\n   - \"Record in your notebook: Draw the shadow you created. Describe where the light was, where the object was, and where the shadow formed.\"\n\n2. **Documentation Strategy:** Students should sketch and label: the light source, the object, and the shadow in their notebooks. Ask them to add arrows showing the direction light was traveling.\n\n**Teacher Role:**\n- Circulate to each group and ask: *\"How did the light reach the paper before you added the object? What happens to the light now that the object is in the way?\"*\n- Avoid telling students the answers; instead, guide them with questions like: *\"Where is the shadow compared to the light source?\"* and *\"What do you think is blocking the light?\"*\n- Ensure students are recording observations, not just experimenting randomly.\n\n**Expected Student Outcomes:**\n- Students discover that light travels in straight lines.\n- Students observe that shiny, smooth surfaces (mirrors) reflect light clearly.\n- Students see that opaque objects block light and create shadows on the opposite side from the light source.\n- Students notice that changing the distance between the light and object changes the shadow's size.\n- Students create labeled diagrams showing light paths, objects, and shadows.\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to the photograph and light concepts.\n\n**Materials:**\n- Chart paper and markers\n- Photograph of building (displayed again)\n- Three sample objects: mirror, clear plastic, opaque item\n- Flashlight\n- Visual anchor chart (pre-made or co-created)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 2-3 groups to briefly share one discovery from their exploration.\n   - Ask the class: *\"How is what you found with the flashlight and mirror similar to what we see in the photograph of the building?\"*\n   - Guide students to notice: the glass reflects the old building (like the mirror reflected light), and the framework casts shadows.\n\n2. **Introduce Key Vocabulary (8 minutes):**\n\n   Display each term with a labeled diagram or real object example:\n\n   - **Light:** Energy that travels from a source (like the sun or flashlight) and allows us to see. *\"Light is what makes things visible. Without light, we can't see.\"*\n\n   - **Reflection:** When light bounces off a smooth, shiny surface and travels to our eyes, allowing us to see the surface and sometimes things beyond it. *\"When light bounces off a mirror or smooth surface, that's reflection. That's how we see our reflection in a mirror!\"*\n\n   - **Opaque:** A material that light cannot pass through; light is blocked. *\"Opaque means light cannot go through it. A pencil is opaque. A wall is opaque. Shadows form behind opaque objects.\"*\n\n   - **Transparent:** A material that light can pass through; we can see clearly through it. *\"Transparent means light can pass through it. Glass, clear plastic, and water are transparent. You can see through them.\"*\n\n   - **Shadow:** A dark area created when an opaque object blocks light. *\"A shadow is the dark area behind an object when light is blocked. Your shadow forms on the ground when sunlight is blocked by your body.\"*\n\n3. **Connect Back to the Photograph (5 minutes):**\n   - Point to the glass windows: *\"These are transparent. Light passes through them, but light also reflects off them. See how you can see the old building in the glass? That's the reflection!\"*\n   - Point to the dark areas created by the building framework: *\"These are shadows. The framework is opaque—it blocks the sunlight. The shadow forms on the other side of the light source.\"*\n   - Ask: *\"Why can we see so much detail in this photograph? What is happening with the light?\"* (Guide them to see: light is entering the camera after reflecting off surfaces or passing through glass.)\n\n4. **Check for Understanding:**\n   - Ask individual students:\n     - *\"Is glass transparent or opaque? How do you know?\"*\n     - *\"If I shine a light on this [mirror], what will happen? Why?\"*\n     - *\"Where will a shadow form if the light comes from above?\"*\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Light** | Energy that travels from a source (like the sun) and helps us see things. |\n| **Reflection** | When light bounces off a smooth, shiny surface, like a mirror or glass, and travels into our eyes. |\n| **Opaque** | Something that light cannot pass through; light is blocked by it. |\n| **Transparent** | Something that light can pass through; we can see clearly through it. |\n| **Shadow** | A dark area that forms when an opaque object blocks light. |\n\n**Expected Student Outcomes:**\n- Students can define and identify examples of transparent, opaque, reflection, and shadows.\n- Students understand that light travels and interacts with materials in predictable ways.\n- Students can point to the photograph and explain what they see in terms of light, reflection, shadows, and the properties of materials.\n\n---\n\n### 4. ELABORATE (16 minutes)\n\n**Objective:** Students apply their understanding of light, reflection, and shadows to predict and explain real-world scenarios in an urban environment.\n\n**Materials:**\n- Copy of the building photograph (one per student or small group)\n- Colored pencils or markers\n- Tracing paper or clear acetate sheets (optional, for drawing light paths)\n- \"Prediction Cards\" with scenarios (pre-written or displayed)\n- Chart paper for shared predictions\n\n**Activity:**\n\n**Part A: Predict and Explain Reflections and Shadows in the Photograph (9 minutes)**\n\n1. **Display the photograph again.** Ask students to work in pairs or small groups to complete these tasks:\n\n   - **Task 1 (Reflection):** *\"Trace your finger across the glass windows on the left side of the building. The old building is visible in the reflection. Where is the sun or light source coming from? How do you know?\"* (Guide them to see that the angle of the reflection suggests where the light is positioned.)\n   \n   - **Task 2 (Shadows):** *\"Look at the darker lines on the glass and on the building. These are shadows. Draw an arrow showing where you think the light source is. Explain your thinking to your partner.\"*\n\n   - **Task 3 (Transparent vs. Opaque):** *\"Which parts of this building let light pass through (transparent)? Which parts block light (opaque)? List them.\"*\n\n2. **Share-Out:** Ask 2-3 groups to share their predictions. Display their answers on a chart and validate reasoning.\n\n**Part B: Apply to New Scenario (7 minutes)**\n\n1. **Present this scenario:** *\"Imagine you're standing on a sunny street in front of this building in the afternoon. The sun is low in the sky behind you. Where will you see your shadow? Will you see a reflection of the sky in the glass windows? Why or why not?\"*\n\n2. **Students draw and label a new diagram** showing:\n   - The position of the sun\n   - Where their shadow would fall\n   - Which surfaces would show reflections (and what would be reflected)\n\n3. **Pair-Share:** Students explain their diagram to a partner using vocabulary: light, transparent, opaque, reflection, shadow.\n\n**Teacher Role:**\n- Circulate and ask: *\"How is this scenario the same as your experiment? How is it different?\"*\n- Push thinking: *\"What would change if the sun moved to a different position? Show me with your diagram.\"*\n- Validate reasoning, even if predictions aren't perfectly accurate—focus on the reasoning process.\n\n**Expected Student Outcomes:**\n- Students apply understanding of light properties to explain real-world phenomena.\n- Students create diagrams with labeled light sources, objects, and resulting shadows/reflections.\n- Students use vocabulary (transparent, opaque, reflection, shadow, light) accurately in explanations.\n- Students demonstrate that they can transfer learning from controlled experiments to complex, real-world scenarios.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of light properties, reflections, and shadow formation.\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation Checklist** (use during Explore and Elaborate):\n  - ☐ Student accurately predicts where shadows form\n  - ☐ Student distinguishes between transparent and opaque materials\n  - ☐ Student explains reflection using light, smooth surfaces, and angles\n  - ☐ Student uses vocabulary correctly (light, reflection, shadow, opaque, transparent)\n\n**Exit Ticket (Summative Assessment—given at end of Lesson):**\n\nProvide each student with a printed card or display on the board. Students respond in writing or drawing:\n\n**Question 1 (Understanding of Light and Shadows):**\n*\"Look at this photograph of a tall building. The darker lines you see are shadows. Draw an arrow on the photograph showing where the sun must be. Explain your thinking in 2-3 sentences.\"*\n\n**Question 2 (Reflection):**\n*\"Why can you see the old building reflected in the modern glass building? Explain using the word 'reflection' or 'light bounces.'\"*\n\n**Question 3 (Application):**\n*\"If you wore a shiny, reflective jacket and stood in front of this building, what would happen to light from the sun? Choose one: A) Light would pass through your jacket, B) Light would bounce off your jacket, or C) Light would be blocked by your jacket. Circle your answer and explain why.\"*\n\n**Success Criteria:**\n- ✓ **Proficient:** Student correctly identifies light source position, accurately explains reflection, chooses correct answer for application, uses 2+ vocabulary terms correctly.\n- ✓ **Developing:** Student identifies light source with minor error, explains reflection with partial accuracy, chooses answer with unclear reasoning, uses 1 vocabulary term correctly.\n- ✓ **Beginning:** Student struggles to identify light source, reflection explanation is absent or incorrect, answer choice lacks reasoning, vocabulary use is unclear.\n\n**Expected Student Outcomes:**\n- Students can locate light sources based on shadow position.\n- Students explain reflection as light bouncing off smooth surfaces into the eye.\n- Students differentiate between transparent, opaque, and reflective materials.\n- Students apply concepts to novel scenarios.\n- Students use academic vocabulary accurately.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Vocabulary Anchor Chart:** Create a visual chart with pictures of each vocabulary term (light = sun and flashlight, reflection = mirror with bouncing light rays, shadow = dark area behind object). Allow students to reference this chart during all activities and assessments.\n\n2. **Guided Exploration with Questioning:** During the Explore phase, work one-on-one or in a small group with these students. Use leading questions: *\"What happened when you shined the light on the mirror? Did it bounce back or disappear?\"* Provide sentence stems: *\"The light ___. The shadow ___. The reflection ___.\"*\n\n3. **Exit Ticket Modification:** Instead of written responses, allow students to:\n   - Point to parts of the photograph and verbally explain what they see\n   - Choose between two options (A or B) for multiple-choice questions\n   - Draw and label their answers instead of writing sentences\n\n### Challenge (For Advanced Learners)\n\n1. **Investigate Angle of Incidence:** Ask: *\"Does the angle at which light hits a surface affect how the reflection looks? Test this. Shine the light at different angles on the mirror. Record what happens.\"* Guide them to discover that the angle of the incoming light equals the angle of the reflected light.\n\n2. **Design a Solution Using Light:** *\"Design a system using mirrors or glass surfaces that would allow someone inside the building to see around a corner without looking directly at it. Draw your design and explain how light reflects to make this possible.\"* (This connects to 4-PS4-2 and requires deeper reasoning about light pathways.)\n\n3. **Research and Report:** *\"Find a picture of a building at night with reflections or shadows. Explain where the light source is and why shadows and reflections appear where they do. Compare it to our daytime photograph.\"*\n\n---\n\n## Extension Activities\n\n1. **Shadow Art Project:** Students go outside on a sunny day and create shadow art by arranging objects (blocks, balls, sticks) and tracing shadows onto paper at different times of day. They compare shadow sizes and predict how shadows will change as the sun moves. They create a poster showing: *\"How does the sun's position affect shadow size and direction?\"*\n\n2. **Build a Periscope:** Using two small mirrors, straws, and a paper towel tube, students build a simple periscope. They investigate how light reflects off mirrors in sequence and how this allows them to see around obstacles. They test it in the classroom and write instructions for how it uses reflection to work.\n\n3. **Night Photography Exploration:** Display photographs of the same building or urban scene taken during day and night. Students compare shadows, reflections, and lighting. They predict what light sources are visible at night (streetlights, building lights, neon signs) and discuss how artificial light creates shadows and reflections differently than sunlight.\n\n---\n\n## Teacher Notes\n\n- **Safety:** Ensure flashlights are not shined directly into students' eyes. Use low-wattage bulbs.\n- **Classroom Setup:** Darken the room slightly during the Explore phase to make light and shadows more visible.\n- **Real-World Connection:** If possible, take students outside to observe shadows at different times of day. Photograph shadows on the actual school building and compare to the lesson photograph.\n- **Extensions to Next Grade:** This lesson builds foundation for understanding how light waves interact with matter and more complex optical instruments in higher grades.",
  "inputTokens": 2458,
  "outputTokens": 4571,
  "cost": 0.025313000000000002,
  "generatedAt": "2026-02-12T23:48:29.988Z"
}