{
  "title": "Solution",
  "category": "physical-science",
  "imageFile": "p19.jpg",
  "imagePath": "images/physical-science/p19.jpg",
  "content": "# Engineering Design Challenge: Ink Diffusion & Fluid Separation\n\n---\n\n### Visible Elements in Photo\n\n- Clear glass jar with screw-top metal lid\n- Water (clear liquid, approximately 2/3 full)\n- Blue ink or dye dispersing through the water in cloud-like formations\n- White/light background showing contrast with the blue dye\n- Dye concentration is denser at top, dispersing downward\n\n---\n\n### Reasonable Inferences\n\n- **From the dye dispersal pattern**: Liquids of different densities or temperatures mix at different rates; this suggests a need to control or predict how substances spread through water (relevant to water filtration, oil spill containment, or pollutant dispersion).\n- **From the jar's sealed lid**: The container is designed to hold and observe a closed system, implying students could test how barriers or materials slow or stop diffusion.\n- **From the visible stratification**: Students could investigate whether layers of different liquids or suspended materials can be separated or isolated from one another.\n\n---\n\n### Engineering Task\n\n#### **K–2 Version:**\n**\"Make a Magic Water Cleaner\"**\n\nYou have a jar of water that turned blue (messy!). Your job: design something that will clean the water and make it clear again. You can use filters, cloth, sand, or other materials. Test your cleaner and see if you can make the blue water less blue. Does your idea work? Can you make it even better the next time?\n\n#### **3–5 Version:**\n**\"Design a Diffusion Barrier System\"**\n\nBlue dye is spreading through water. Your challenge: build a barrier or filtration system that slows down or stops the dye from spreading to the bottom half of a sealed jar within 5 minutes. Your design must:\n- Use only natural or recycled materials (cloth, sand, gravel, paper, cotton)\n- Not completely block water flow (the liquid must still move slightly)\n- Be testable and repeatable with fresh dye each time\n\nSuccess criteria: Measure how far the dye travels downward in 5 minutes with your barrier vs. without it. Your barrier should reduce downward spread by at least 50%.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a phenomenon (dye diffusion) without an obvious solution approach. Students first need to observe and wonder: *Why is the dye spreading? How fast? Can we slow it down? Why would we want to?* This naturally invites students to define the engineering problem themselves (pollution control, water filtration, containment) before jumping to solutions. The visual is compelling but open-ended, making it ideal for the \"Ask\" phase.\n\n---\n\n### Suggested Materials\n\n- Clear jars or bottles (plastic or glass)\n- Blue or red food coloring or washable ink\n- Coffee filters, cheesecloth, or old cotton t-shirt fabric\n- Sand, gravel, or soil\n- Rubber bands\n- Paper towels\n- Water\n- Optional: timer, ruler or measuring tape\n\n---\n\n### Estimated Time\n\n**45–60 minutes** (one class period)\n\n- Setup & observation: 5 min\n- Design & planning: 10 min\n- Building barrier/filter: 15 min\n- First test & observation: 10 min\n- Refinement & second test: 15 min\n\n*For K–2, reduce to 30–40 minutes and skip the measurement component.*\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS.3-5.ETS1.B** (develop a simple sketch, drawing, or physical model to illustrate how the shape of an object helps it function to solve a given problem) and invites students to test whether different materials and designs affect diffusion rates, meeting both *structure-function* and *iterative testing* standards.",
  "inputTokens": 1803,
  "outputTokens": 873,
  "cost": 0.006168,
  "generatedAt": "2026-02-09T13:28:09.386Z"
}