{
  "title": "Solution",
  "category": "physical-science",
  "imageFile": "p19.jpg",
  "imagePath": "images/physical-science/p19.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: The Great Color Mixing Mystery\n\n## Core Science Concepts from Image Analysis\n\n- **States of Matter & Properties of Materials:** Water (liquid) and food coloring (liquid dye) are visible in the photograph, demonstrating how different materials can blend and change appearance while remaining in the same state.\n- **Light and Color:** The vibrant blue dye is visible because light is reflecting off the colored particles in the water, making the mixture visible to our eyes. Darker areas show where light is being absorbed by the concentrated dye.\n- **Transparency and Opacity:** The clear glass jar is transparent (we can see through it), while the concentrated blue dye creates a more opaque or darker region where less light passes through.\n- **Mixing and Diffusion:** The dye particles are spreading through the water, showing that materials can mix together and distribute at the molecular level—a physical change we can observe.\n\n---\n\n## Lesson Title\n\n**How Does Food Coloring Paint Pictures in Water?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 40-minute sessions (or one 75-minute block with a break)\n- **NGSS Standards:** \n  - 1-PS4-3: Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light.\n  - 1-PS4-2: Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated.\n\n---\n\n## Learning Objectives\n\nStudents will be able to...\n\n1. **Observe and describe** what happens when colored liquids mix with clear water, using words like \"spread,\" \"mix,\" and \"change color.\"\n2. **Predict** what will happen when food coloring is added to water before testing it.\n3. **Explain** that we can see the colors because light helps us see, and that darker colors let less light through than lighter colors.\n4. **Design and conduct** a simple experiment to test how different colors behave in water.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- The photograph displayed on a screen, interactive board, or printed large (8.5\" × 11\" minimum)\n- Chart paper or whiteboard for recording predictions\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on the board and ask students to sit where they can see it clearly. Say: \"Look at this jar. What do you see inside?\"\n\n2. **Ask these discovery questions one at a time, allowing 15-20 seconds for thinking and calling on 2-3 students per question:**\n   - \"What color do you see in this jar? Where is the darkest blue? Where is the lightest blue?\"\n   - \"How do you think the blue color got inside the clear water? What did someone do?\"\n   - \"Do you think that blue is a liquid or a solid? How do you know?\"\n   - \"If we shook this jar really hard, what do you think would happen to the colors?\"\n\n3. **Prediction Prompt:** Say: \"I'm going to give each of you a chance to mix food coloring with water, just like in this picture. Before we do it, I want you to think about this: What color do you think we'll make? Where will the color go first—the top of the water or the bottom?\" \n\n   Have students **turn and talk** to a partner, then call on 4-5 students to share their predictions aloud. Write 2-3 predictions on chart paper.\n\n4. **Create Wonder:** \"Today, we're going to be scientists and find out exactly what happens when we add drops of color to water. We're going to watch carefully and discover the answer together!\"\n\n**Transition:** \"Let's move to the investigation tables where you can try this experiment yourself.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials (per small group of 4-5 students):**\n- 1 clear jar or clear plastic cup (8-16 oz)\n- Tap water (room temperature)\n- Food coloring (1-2 colors per group; use different colors for different groups if possible)\n- Eyedropper or pipette\n- White paper or paper towels for placing under jars (to help students see color changes)\n- Observation sheet (see below) or clipboard with paper\n- Markers or colored pencils\n- Optional: hand lens for close observation\n\n**Activity:**\n\n**Student Directions (Read aloud and model each step):**\n\n1. \"First, fill your jar about three-quarters full with water. Look at the water—is it clear or colored?\" (Students observe and respond: clear.)\n\n2. \"Now, I'm going to give each group ONE drop of food coloring. Get ready to watch very, very carefully. Pick one person to drop it. When the drop hits the water, DON'T SHAKE IT OR STIR IT YET. Just watch and watch.\"\n\n3. \"What do you see happening? Does the color stay in one place or does it move? Does it go up, down, or sideways? Everyone point to where the color is going.\" (Allow 30-45 seconds of silent observation.)\n\n4. \"Now, draw what you see right now on your paper. Draw the jar and show where the blue (or other color) is.\"\n\n5. \"Now, everyone, let's gently stir the water with a popsicle stick or pencil. Stir slowly—like we're making magic potion. Watch what happens!\"\n\n6. \"What changed? Is the water all the same color now? Is the color darker or lighter than before? Draw what you see now.\"\n\n7. **Optional second observation:** \"Let's add ONE more drop of the same color. What happens? Does the water get darker or lighter?\"\n\n**Connection to Photograph:** \"This is exactly what happened in the big jar in the picture! Someone added colored drops, and just like in your jars, the color spread all through the water.\"\n\n**What Students Record:**\n- Two or three simple drawings showing:\n  - The water before the drop\n  - The drop in the water (where it is)\n  - The water after stirring (or after mixing)\n- Answers to prompted questions: \"Where did the color go?\" and \"Did the water change color?\"\n\n**Teacher Role:**\n- Circulate to each group; do NOT tell students what they should see.\n- Ask guiding questions: \"What's happening right now? Can you point to where the color is going? Is it darker or lighter?\"\n- If a group stirs too quickly, pause them and ask them to watch the next group's observation instead.\n- Ensure safe handling of food coloring (it stains—remind students to be careful and wash hands after).\n\n**Expected Student Outcomes:**\n- Students observe that one drop of food coloring spreads through water.\n- Students notice the water changes from clear to colored.\n- Students document their observations with drawings and words.\n- Students discover that stirring speeds up the mixing.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with vocabulary words written in large letters\n- The original photograph displayed again\n- Student observation sheets from Explore phase\n- Optional: a fresh jar with water and food coloring to demonstrate once more\n\n**Activity:**\n\n1. **Gather students on the carpet.** Say: \"You were all scientists today! Let's talk about what we discovered.\"\n\n2. **Share observations:** \n   - Call on 3-4 different groups: \"What did you see when you added the food coloring?\" \n   - Record their responses on chart paper using their exact words, then translate to vocabulary.\n   - Example: Student says \"It went down and spread\" → Write: \"The color **mixed** with the water and **spread** throughout.\"\n\n3. **Introduce and define vocabulary** (point to each word on the chart as you say it):\n\n   **Vocabulary with Student-Friendly Definitions:**\n\n   - **Color/Dye:** A substance that makes something look a certain color. Food coloring is a dye. (Hold up the food coloring bottle.)\n   \n   - **Mix or Mixing:** When two things blend together and become hard to separate. When we mixed the food coloring with water, they became one thing.\n   \n   - **Spread or Diffuse:** When something moves out from one spot to many spots. The blue dye spread all through the jar.\n   \n   - **See/Observe:** To look carefully at something and notice what happens. Scientists observe to learn.\n   \n   - **Clear/Transparent:** You can see right through it. The water was clear before we added the dye.\n\n4. **Make the connection back to the photograph:**\n   - \"Look at this picture again. The blue dye **spread** through the water, just like in your jars. The dye **mixed** with the water. That's why the jar looks so colorful!\"\n\n5. **Why can we see the color? (Introduce light concept gently):**\n   - \"We can see the blue dye because light is bouncing off the blue particles and into our eyes. Light helps us see colors. The darker the blue, the less light comes through. The lighter blue lets more light come through.\"\n   - (Optional: Hold the jar up to the light and pass it to students to see the difference in brightness.)\n\n6. **Check for Understanding:**\n   - Ask: \"If I added more blue food coloring to your jar, what would happen? Would it get darker or lighter?\"\n   - Ask: \"Can you show me with your hands what 'spread' means? Can you show me what 'mix' means?\"\n   - Thumbs up/middle/down: \"Do you understand what happened when we mixed colors? Thumbs up if yes, middle if sort of, down if no.\"\n\n**Expected Student Outcomes:**\n- Students can use the words \"mix,\" \"spread,\" \"color,\" and \"observe\" in simple sentences.\n- Students understand that food coloring and water can mix together.\n- Students recognize that we need light to see colors.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials (per small group):**\n- Clear jars with water (same setup as Explore)\n- Food coloring in 2-3 different colors\n- Eyedroppers\n- Paper for predictions and drawings\n- Optional: flashlight or light source\n\n**Activity:**\n\n**Option A: Predicting with Different Colors (Recommended for most First Grade classes)**\n\n1. \"Now that you know how mixing works, let's try something new. I'm going to give your group TWO different colors of food coloring. Before you add them, I want you to predict: Will the colors stay separate or will they mix together?\"\n\n2. Students draw their prediction on paper.\n\n3. \"Add one drop of red food coloring. Observe. Then add one drop of blue food coloring. What happens? Do they mix or stay apart? Does the color change?\"\n\n4. Students draw what actually happened and compare to their prediction.\n\n5. **Discuss as a group:** \"Were you right? What color did we make? Did the colors mix the same way as when we stirred?\"\n\n**Option B: Light and Color Investigation (For classes ready for 1-PS4-3 connection)**\n\n1. If you have access to a flashlight or natural window light:\n   - \"Let's hold our colored jar up to the light. What do you notice? Can you see through it easily? Is it bright or dark?\"\n   - \"Now hold it away from the light. Can you see the color as well? Why do you think that is?\"\n   - \"Light helps us see colors! The brighter the light, the better we can see.\"\n\n2. Students compare a jar with light behind it to a jar with light in front of it.\n\n**Teacher Role:**\n- Observe which students made accurate predictions and which need more time with single-color mixing before moving to multi-color.\n- Ask: \"Why do you think the colors are mixing? Are they doing the same thing as before?\"\n- Encourage students to make predictions before they observe.\n\n**Expected Student Outcomes:**\n- Students predict what will happen with two colors (right or wrong; both are valuable).\n- Students observe that different colors can mix.\n- Students begin to understand that colors can create new colors through mixing.\n- Students notice the role of light in seeing colors.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (During the lesson):**\n- Observe students' drawings from the Explore phase. Do they show the dye spreading or mixing?\n- Listen to student language during Explain phase. Can they use words like \"spread,\" \"mix,\" and \"observe\"?\n- Observe predictions in Elaborate phase. Do students make reasonable predictions based on what they learned?\n- Ask guiding questions and note which students answer confidently vs. hesitantly.\n\n**Exit Ticket or Summative Assessment (Choose one):**\n\n**Option 1: Drawing + Dictation (Best for early First Grade)**\n- Show students the original photograph again.\n- Ask: \"Tell me one thing the food coloring did in this jar. Draw it or tell me.\"\n- Record their response on a sticky note: \"_____ says: [Student response about the color/mixing/spreading]\"\n\n**Option 2: Quick Verbal Check**\n- Ask each student individually or in small groups:\n  1. \"What did the food coloring do when we added it to the water?\"\n  2. \"Can we see the color if the water was in a dark room with no light? Why or why not?\"\n  3. \"If we added more food coloring, would the water get darker or lighter?\"\n\n**Option 3: Observation Checklist**\nUse this to assess during and after the lesson:\n\n| Indicator | Observed | Not Yet Observed |\n|-----------|----------|------------------|\n| Student observed the food coloring spread/mix in water | ☐ | ☐ |\n| Student used the word \"mix,\" \"spread,\" or \"color\" correctly | ☐ | ☐ |\n| Student made a reasonable prediction about what would happen | ☐ | ☐ |\n| Student drew or described what they observed | ☐ | ☐ |\n\n**Success Criteria for Understanding:**\n- ✓ Students can **describe in words or drawings** that food coloring spreads through water.\n- ✓ Students can **use the word \"mix\"** or \"spread\" correctly at least once.\n- ✓ Students understand that **we need light to see colors** (basic understanding; First Grade does not need deep explanation).\n- ✓ Students can **make a simple prediction** about what will happen with two colors (even if incorrect, the thinking matters).\n\n**Expected Student Outcomes:**\n- Most students will show basic understanding that food coloring and water mix.\n- Early First Grade students may focus on the visual change; older First Grade students may explain the spreading.\n- All students should be able to point to or name the colors in the original photograph.\n- Some students will make the connection to light helping us see.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplify the Explore phase:** \n   - Provide pre-filled jars (teacher fills with water beforehand) so the student only focuses on adding the drop and observing. This reduces steps and variables.\n   - Have the student observe the Explore phase first as a \"watcher\" before conducting their own experiment. Model the investigation with a teacher or aide, narrating each step.\n\n2. **Reduce recording demands:**\n   - Instead of asking for detailed drawings, ask the student to point to and name colors: \"Point to where the blue is. Now point to where it spread.\"\n   - Offer a pre-drawn jar outline and ask them to color it with crayons to show what they saw.\n\n3. **Use additional visual supports:**\n   - Post a sequence card showing: Drop → Spread → Mixed. Point to each step as it happens.\n   - Use a simplified vocabulary chart with pictures (a picture of \"spreading\" rather than just the word).\n\n### Challenge (For Advanced Learners)\n\n1. **Deepen the prediction and testing:**\n   - Ask: \"If we mixed red and blue food coloring, what color do you think we would make? Draw your prediction. Then test it. Were you right?\"\n   - Extend to three colors: \"What if we mixed red, yellow, and blue? What would we get?\"\n   - Ask them to predict which color will \"spread\" faster—hot water or cold water? (Introduction to temperature, future science.)\n\n2. **Explore light and color connections:**\n   - \"Why do you think we can see the blue dye? What helps us see it?\" (Guide to: light)\n   - Provide a flashlight and jar with dye: \"Hold it up to the light. Hold it away from the light. When can you see the color better? Why?\"\n   - Challenge: \"If the room was dark with no light, would we be able to see the color?\" (Connects to 1-PS4-2.)\n\n3. **Record more detailed observations:**\n   - Ask advanced learners to draw step-by-step observations: before, during (one or two intermediate steps), and after.\n   - Encourage them to write or dictate 2-3 word descriptions: \"The blue spread down,\" \"The color mixed,\" \"The water is now blue.\"\n\n---\n\n## Extension Activities\n\n**Activity 1: Color Mixing Rainbow Jar**\n- Provide clear jars and food coloring in multiple colors (red, yellow, blue, green).\n- Challenge: \"Can you make a rainbow in a jar by carefully dropping different colors?\"\n- Students predict the order and test. (Requires more patience and careful observation but extends mixing concept.)\n- **Real-world connection:** Artists and scientists use mixing to make new colors.\n\n**Activity 2: Transparent vs. Opaque**\n- Gather clear containers (glass jar, plastic cup), translucent containers (frosted plastic), and opaque containers (ceramic cup, paper cup).\n- Ask: \"Can we see through this? Let's test by adding food coloring. Which ones let light and color show through? Which ones don't?\"\n- Students sort containers and draw which ones are \"see-through\" (transparent) and which ones are \"not see-through\" (opaque).\n- **Connects to 1-PS4-3:** testing how different materials affect light.\n\n**Activity 3: Dye Diffusion in Salt Water vs. Fresh Water**\n- Set up two jars: one with regular water, one with salt water.\n- Add one drop of food coloring to each.\n- Predict: \"Will the dye spread the same way in both?\"\n- Observe and compare. (The salt water may show different diffusion rates depending on temperature, introducing variables.)\n- **Connects to real-world:** Ocean water is salty. How do pollutants spread in the ocean?\n\n---\n\n## Notes for Teacher Success\n\n1. **Prep ahead:** Mix food coloring into small dropper bottles the night before to avoid spills during the lesson.\n2. **Cover tables:** Use paper towels or newspapers under the jars—food coloring stains!\n3. **Timing:** If you have two sessions, do Engage and Explore on Day 1, then Explain and Elaborate on Day 2. This gives students time to think about their observations.\n4. **Safety reminder:** Food coloring is non-toxic but can stain clothing and skin. Keep hand washing supplies nearby and remind students: \"Be a careful scientist—keep the dye in the jar!\"\n5. **Celebrate observations:** First Grade scientists thrive on validation. After the Explore phase, say: \"I loved watching you observe so carefully! You are real scientists!\"\n\n---\n\nThis lesson is fully aligned with 1-PS4-3 (observing how materials affect light) and 1-PS4-2 (understanding that light helps us see), while staying grounded in the concrete, observable phenomenon of food coloring mixing with water. Students engage with the photograph, conduct a safe and simple experiment, and build foundational understanding of matter, mixing, and light—all age-appropriate and joyful.",
  "inputTokens": 2380,
  "outputTokens": 4717,
  "cost": 0.025965000000000002,
  "generatedAt": "2026-02-12T23:50:40.998Z"
}