{
  "title": "Solution",
  "category": "physical-science",
  "imageFile": "p19.jpg",
  "imagePath": "images/physical-science/p19.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Ink in Water\n\n## Core Science Concepts from Image Analysis\n\n- **Mixing and dispersion:** Blue ink particles spreading and mixing throughout clear water, demonstrating how materials can change when combined\n- **Density and motion:** Ink moving through water at different speeds and directions, showing how different materials interact and move\n- **Observable physical properties:** The color change visible in the water, demonstrating that we can observe materials and their changes\n- **States of matter interaction:** A liquid (ink) dispersing into another liquid (water), showing how liquids behave differently\n\n---\n\n## Lesson Title\n\n**Colors Dance: Exploring How Ink Moves Through Water**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or one 90-minute block with a break)\n- **NGSS Standards:** \n  - 3-PS2-2: Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion.\n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how ink moves and spreads when placed in water\n2. Predict and test how ink will move under different conditions (still water, moving water, warm water)\n3. Use descriptive words to explain the motion of ink particles spreading through water\n4. Identify variables that affect how quickly ink spreads in water\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or digital display of the photograph (large enough for whole class to see)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on a screen or printed poster where all students can see it clearly. Do not explain what happened yet.\n\n2. **Ask these discussion questions:**\n   - \"What do you see in this jar? What colors do you notice?\"\n   - \"How do you think the blue color got inside the jar if it started as clear water?\"\n   - \"Why is the blue color only in the top part of the jar and not spread all over?\"\n   - \"If we waited another hour, what do you think would happen to the blue color?\"\n\n3. **Record student predictions** on chart paper. Accept all reasonable answers without correcting them yet. Encourage students to use words like *spread*, *move*, *mix*, and *sink* if they arise naturally.\n\n4. **Wonder prompt:** \"I wonder what would happen if we mixed blue ink with cold water versus warm water? Would it spread at the same speed?\"\n\n**Transition:** \"Today, we're going to create our own jar like this one and watch carefully to see how the color moves and spreads. We'll be scientists making predictions!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials (per student or small group of 2-3):**\n- One clear glass jar, plastic jar, or clear plastic cup (at least 8 oz)\n- One bottle of blue food coloring (or another bright color like red or green)\n- Water (room temperature)\n- One eyedropper or pipette\n- One data recording sheet (see template below)\n- One pencil\n- Timer or clock visible to students\n- One small cup for water (for refilling the jar if needed)\n\n**Activity:**\n\n**Student Directions (write on board or provide as printed handout):**\n\n1. Fill your jar with clear water until it is about 3/4 full.\n2. Look carefully at the water. Draw what it looks like on your data sheet. Write the words \"clear\" or \"colorless.\"\n3. **Prediction:** Draw or write on your sheet: \"I think when I drop blue ink into the water, it will...\"\n4. Hold the eyedropper above the water (don't touch it).\n5. Squeeze one drop of blue food coloring into the center of the water.\n6. **Stop! Watch carefully.** Do not stir or shake the jar yet.\n7. Record what you see happening:\n   - Draw the path the blue color takes (does it sink, spread sideways, stay in one spot?)\n   - Count how many seconds it takes for the blue to touch the sides of the jar\n   - Write down words that describe the motion (e.g., *swirling*, *sinking*, *spreading*, *slow*, *fast*)\n8. Repeat the observation for 2-3 minutes, recording changes on your data sheet.\n9. (Optional extension) Gently stir the water with a pencil and observe what happens.\n\n**Data Recording Sheet Template:**\n\n```\nName: ________________     Date: ________________\n\nBEFORE I Added Ink\nWhat does the water look like?\n[Draw or write] _________________________________\n\nMY PREDICTION\nI think when I drop blue ink, it will...\n[Draw or write] _________________________________\n\nWHILE WATCHING THE INK\nDraw what you see:\n[Large box for drawing the jar at different time intervals]\n\nTime 0 seconds: ____________\nTime 30 seconds: ___________\nTime 60 seconds: ___________\n\nWords to describe the ink's motion:\n☐ spreading    ☐ sinking    ☐ swirling    ☐ fast    ☐ slow\n☐ mixing       ☐ rising     ☐ still       ☐ other: _______\n\nWhat happened when I stirred the water?\n[Draw or write] _________________________________\n```\n\n**Teacher Role:**\n- Circulate and observe student investigations without directing their observations (\"Tell me what YOU see\" rather than \"It's sinking, right?\")\n- Ask guiding questions: \"What's happening to the color now?\" \"Is it moving fast or slow?\" \"Where is it going?\"\n- If a student says something inaccurate (e.g., \"It disappeared\"), ask them to look more carefully and describe exactly where the color went\n- Ensure all students complete at least one full observation before moving to Explain phase\n- Have paper towels ready for inevitable spills\n\n**Expected Student Outcomes:**\n- Students observe that a single drop of ink disperses and mixes with water over time\n- Students record qualitative observations (descriptions) of how the ink moves\n- Students use words like *spread*, *sink*, *mix*, *slow*, *swirl* to describe motion\n- Students notice that ink moves in different directions and at different speeds\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper and markers\n- The original photograph\n- Students' data sheets from Explore phase\n- Picture cards or drawings showing ink dispersing (optional visual aid)\n\n**Activity:**\n\n1. **Share observations:** Ask 4-5 students to share what they observed. Write key words and phrases on chart paper as they share.\n   - \"Maria said the ink sank slowly. Everyone, show me slow motion with your hands. Now show me fast motion.\"\n   - \"James said the ink mixed with the water. What does *mixed* mean? Can you unmix it?\"\n\n2. **Introduce key vocabulary** using student observations:\n\n   | Term | Student-Friendly Definition |\n   |------|----------------------------|\n   | **Dispersion** | When something spreads out and mixes throughout another material (like our ink spreading through the water) |\n   | **Motion** | When something moves or changes position. It can be fast or slow. |\n   | **Mix** | When two things combine together so they become one thing (the blue ink and clear water became blue water) |\n   | **Observe** | To watch carefully and pay attention to what is happening |\n   | **Predict** | To guess what will happen next using what we already know |\n\n3. **Connect back to the photograph:**\n   - \"Remember the jar from the beginning? The blue color we see is ink that was added to water, just like you did. The ink is spreading and mixing through the water, but it hasn't finished yet. If we waited more hours, the whole jar would become light blue.\"\n\n4. **Explain the science simply:**\n   - \"Ink is made of tiny, tiny pieces of color mixed with water. When you put ink in a jar of water, those tiny pieces start moving around. They spread out slowly through all the water. The water doesn't have to be shaken or stirred—the ink moves on its own! This is called **dispersion**. The ink *disperses* through the water.\"\n\n5. **Check for understanding:**\n   - \"Show me with your thumb up, thumb sideways, or thumb down: Do you understand what dispersion means?\"\n   - \"Can someone use the word *dispersion* in a sentence about what we saw in our jars?\"\n   - Ask 2-3 students to answer; provide corrective feedback gently.\n\n**Vocabulary Chart** (display in classroom for reference):\n- **Dispersion** = spreading and mixing throughout\n- **Motion** = movement from one place to another\n- **Mix** = combining two things together\n- **Observe** = watch and pay close attention\n- **Predict** = say what you think will happen\n\n**Expected Student Outcomes:**\n- Students understand that *dispersion* is the process of ink spreading through water\n- Students can use the term *motion* to describe how the ink moved\n- Students recognize that mixing happened (the blue and clear became one color)\n- Students connect their hands-on observations to the formal terms\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Student data sheets and jars from Explore (if still available)\n- Predictive scenario cards (printed) OR teacher describes scenarios\n- Chart paper to record predictions\n- Optional: Different temperatures of water (warm, cold, ice water) if time and safety permit\n\n**Activity: Prediction Challenge**\n\nPresent students with new scenarios and ask them to predict what will happen based on what they learned:\n\n**Scenario 1:** \"What if we dropped ink into water that was very, very warm? Do you think the ink would spread faster, slower, or the same speed as our room-temperature water? Why?\"\n\n**Scenario 2:** \"What if we shook the jar right after dropping the ink in, instead of keeping it still? Would the ink spread faster or slower? Why?\"\n\n**Scenario 3:** \"What if we used twice as much ink—two drops instead of one? Would the water turn darker blue right away or gradually?\"\n\n**Student Response Activity:**\n\n1. Divide class into three small groups (or pairs).\n2. Assign each group one scenario.\n3. Have students **draw their prediction** on paper: show what the jar would look like.\n4. Ask them to **write or dictate one sentence** explaining their prediction using words like *dispersion*, *motion*, *mix*, or *fast/slow*.\n5. **Share predictions** with the class (2-3 minutes per group).\n6. Ask follow-up questions: \"What made you predict that?\" \"What did we observe that helps us think that?\"\n\n**Teacher Role:**\n- Listen for evidence that students understand dispersion and motion\n- Guide thinking with questions rather than providing answers: \"Remember how the ink moved in our jars—can you use that to help predict this?\"\n- Validate all reasonable predictions; praise the reasoning process\n\n**Expected Student Outcomes:**\n- Students make predictions grounded in their observations from the Explore phase\n- Students use new vocabulary (*dispersion*, *motion*, *mix*) in context\n- Students transfer their understanding to new, similar situations\n- Students explain their thinking (even if incorrect, the reasoning should show they're thinking about motion and mixing)\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity: Two-Part Assessment**\n\n**Part 1 – Observation & Recording (Formative, during Explore & Elaborate):**\n- Review each student's data sheet from the Explore phase\n- Check: Did they draw the jar? Did they write observations? Did they use descriptive words?\n- Success criteria: Student completed drawings or written observations showing they watched the ink disperse\n\n**Part 2 – Exit Ticket (Summative, end of lesson):**\n\nProvide each student with a simple exit ticket (paper or digital). Read the questions aloud; students can draw, write, or dictate answers.\n\n**Exit Ticket Questions:**\n\n1. **Picture/Draw:** \"Draw a jar with water and ink. Show where the ink is and where the water is.\"\n\n2. **Prediction Recall:** \"What happens to blue ink when you drop it in clear water? (Choose one or circle it)\"\n   - ☐ It stays in one spot\n   - ☐ It spreads and mixes through the water\n   - ☐ It floats on top\n   - ☐ It disappears\n\n3. **Word Use:** \"Finish this sentence: The ink moved through the water because ___________________\"\n   (Accept answers that mention spreading, mixing, slow motion, or similar concepts)\n\n4. **Observation Recall:** \"How long did it take for the ink to spread? Was it fast or slow?\"\n\n**Success Criteria:**\n- ✓ Students can draw or describe the jar showing ink dispersing through water\n- ✓ Students select that ink \"spreads and mixes\"\n- ✓ Students provide a reasonable explanation of motion/dispersion\n- ✓ Students describe the speed of dispersal (fast or slow)\n\n**How to Determine if Students Met Learning Objectives:**\n- **Objective 1 (Observe/describe):** Student's drawing and written observations on data sheet show they watched the ink move\n- **Objective 2 (Predict/test):** Student made a prediction on data sheet and during Elaborate scenario work\n- **Objective 3 (Use descriptive words):** Student's data sheet and exit ticket include words like *spread*, *mix*, *slow*, *motion*\n- **Objective 4 (Identify variables):** Student's responses to Elaborate scenarios show understanding that temperature, amount, or stirring affect how the ink moves\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified data sheet:** Provide a sheet with pre-drawn jars and prompts where students only need to fill in single words or color in sections rather than write sentences\n   - Example: \"The ink color is ______. It is moving _______ (fast/slow).\"\n\n2. **Partner with a mentor:** Pair struggling students with a more advanced peer for the Explore phase; the mentor helps describe what they both observe\n\n3. **Vocabulary cards with pictures:** Provide cards showing *dispersion*, *motion*, and *mix* with simple drawings, and allow students to point to cards instead of verbally responding during Explain phase\n\n### Challenge (for advanced learners)\n\n1. **Comparative testing:** Allow advanced students to test two variables simultaneously (e.g., warm water vs. cold water, or different colors of ink). Have them record which disperses faster and hypothesize why\n\n2. **Write/draw a comic strip:** Ask students to create a 3–4 panel comic showing the \"journey of one drop of ink\" through water, using vocabulary terms in speech bubbles\n\n3. **Real-world application:** Have students predict and explain how the same dispersal concept would work in other scenarios (e.g., \"What happens when you drop dye in a bathtub?\" \"What if a spill of oil entered a river?\"). Encourage them to think about whether the concept is the same or different\n\n---\n\n## Extension Activities\n\n1. **Rainbow Dispersion:** Provide students with water and multiple colors of food coloring (red, yellow, blue). Have them predict what happens when they drop different colors in simultaneously. Observe whether colors mix to create new colors (introduction to color mixing and dispersion in one activity)\n\n2. **Dispersion Speed Investigation:** Create a reproducible mini-lab where students test whether warm water, cold water, and ice water cause ink to disperse at different speeds. Provide a data table and ask them to graph or compare results (connects to data recording and patterns—prepares for future graphing skills)\n\n3. **Ink Trail Art Project:** Students drop ink into water and observe the dispersal pattern. Once dispersed, they carefully pour the colored water onto paper placed in a tray, creating an abstract ink-wash artwork. This bridges science observation to art while reinforcing their understanding of how ink moves and mixes\n\n---\n\n## Notes for Teacher Implementation\n\n- **Safety:** Ensure food coloring doesn't stain clothes; use old clothes or smocks if possible. Have paper towels readily available.\n- **Timing:** If students are engaged during Explore, it's fine to extend that phase beyond 25 minutes—the hands-on observation is the critical learning.\n- **Materials prep:** Pre-fill jars with water before the lesson if time is limited, or make it part of the Engage hook (let students fill jars).\n- **Photo connection:** Keep returning to the original photograph throughout the lesson to anchor learning in a real example students recognize.",
  "inputTokens": 2376,
  "outputTokens": 3966,
  "cost": 0.022206,
  "generatedAt": "2026-02-12T23:52:08.939Z"
}