{
  "title": "Solution",
  "category": "physical-science",
  "imageFile": "p19.jpg",
  "imagePath": "images/physical-science/p19.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Mixing & Dissolving—A Colorful Investigation\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Properties of Materials:** The photograph shows how different substances (water and food coloring) have distinct observable properties—one is clear and liquid, the other is colored and liquid. When combined, they create a new observable property (blue colored water).\n- **Mixing as a Physical Change:** Students can observe that when two materials are mixed together, they can change appearance while still being reversible (the materials are still present, just combined differently).\n- **States of Matter:** The image demonstrates liquids in their characteristic form—flowing and taking the shape of the container.\n- **Diffusion/Spreading:** The visible swirling and spreading of the blue dye through the water introduces the idea that materials can move and spread through other materials, even without stirring.\n\n---\n\n## Lesson Title\n\n**Blue Water Magic: Exploring How Materials Mix and Change**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 60–75 minutes (can be split into two 30–40 minute sessions)\n- **NGSS Standards:** \n  - **2-PS1-1:** Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n  - **2-PS1-2:** Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** the properties of water and food coloring before and after mixing.\n2. **Predict and test** what happens when two different materials are combined.\n3. **Explain** that mixing materials can change how they look, but the materials are still there.\n4. **Classify materials** by comparing their observable properties (color, clarity, whether they mix).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Spark curiosity about mixing and material properties using the striking photograph.\n\n**Materials:**\n- Photograph of blue dye in clear water (displayed on screen, printed, or shown on document camera)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see it clearly. Let them observe quietly for 15–20 seconds without comment.\n\n2. **Ask these specific discussion questions** to build curiosity:\n   - \"What do you see in this jar? Tell me the colors you notice.\"\n   - \"How do you think the water turned blue? What might have happened?\"\n   - \"Do you think the blue color will stay in the jar forever, or will it change?\"\n   - \"Have you ever mixed things together at home or at school? What happened?\"\n\n3. **Record student ideas** on chart paper (even incorrect predictions are valuable). Use phrases like \"Some friends think...\" to normalize diverse ideas.\n\n4. **Prediction prompt:** \"Today, we're going to be scientists and mix materials just like in this picture. Before we start, I want you to think: *If I mix clear water with blue food coloring, what do you think will happen?* Turn to a neighbor and share your prediction.\"\n\n**Transition:** \"Let's find out what really happens when we mix these materials. You're going to be the scientists!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate mixing through a hands-on discovery activity.\n\n**Materials:**\n- Clear plastic cups or jars (one per student pair, plus extras)\n- Water (room temperature, in a pitcher or squeeze bottles)\n- Food coloring (blue preferred to match photo, but any color works)\n- Droppers or pipettes (one per pair)\n- Paper towels\n- Optional: plastic spoons for gentle stirring\n- Data sheet (see below) or observation sheet with simple drawings/boxes to check\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. \"Work with a partner. One person will fill the cup halfway with water. The other person will watch carefully.\"\n\n2. \"Before we add color, **draw or describe what you see.** Is the water clear? What color is it? Write or draw your observation on your sheet.\"\n\n3. \"Now, **carefully add 3 drops of blue food coloring** to the water using the dropper. Don't stir yet!\"\n\n4. \"**Watch for 30 seconds.** What happens? Does the color stay in one place or does it move? Draw or write what you see. This is your **prediction observation.**\"\n\n5. \"**Gently stir or swirl** the cup. What happens now? Does the color change? How? Write or draw this.\"\n\n6. \"**Let it sit for one minute.** What do you observe? Is the color the same throughout?\"\n\n**Recording Sheet Prompts:**\n- Draw the water before coloring is added.\n- Draw the water right after drops are added (before stirring).\n- Draw the water after stirring.\n- Circle: Does the water still have color? YES / NO\n\n**Teacher Role:**\n- Circulate and ask open-ended questions without revealing answers: \"What are you noticing?\" \"Is the color moving? Where is it going?\" \"Does it look the same as before?\"\n- Do NOT say, \"Good guess, but actually...\" Instead, guide: \"Keep watching—what happens next?\"\n- Manage materials and ensure safety (food coloring won't harm skin, but remind students not to drink it).\n- Encourage precise observation language: \"Tell me exactly what you see.\"\n\n**Expected Student Outcomes:**\n- Students observe that blue dye spreads through the water over time.\n- Students notice the water changes from clear to blue.\n- Students see that stirring speeds up mixing.\n- Students record observations through drawings and simple words.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Build shared understanding and introduce vocabulary grounded in what students discovered.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- The original photograph (display again)\n- Optional: Word cards with vocabulary terms\n\n**Activity:**\n\n1. **Gather students** in a circle or meeting area where all can see and hear.\n\n2. **Invite share-out:** \"Who wants to tell us what you observed when you added the blue color to the water? What happened first? What happened next?\"\n   - Listen to 3–4 student descriptions.\n   - Ask follow-up questions: \"Did anyone see something different? Did the color stay in one spot or did it move around?\"\n\n3. **Make connections back to the photograph:**\n   - \"Look at our picture again. In the jar, the blue dye is all mixed through the water. This is what happened in our cups too!\"\n   - \"The blue dye and water are now together. They mixed.\"\n\n4. **Introduce vocabulary** using student-friendly definitions:\n\n| **Term** | **Student-Friendly Definition** |\n|---|---|\n| **Mix** | When two different things come together and combine. |\n| **Material** | Anything we can see and touch, like water, food coloring, or plastic. |\n| **Property** | A special thing about a material that we can see or feel, like color, if it's clear or cloudy, or if it's wet. |\n| **Change** | When something becomes different from how it was before. |\n| **Clear** | You can see right through it, like clean water. |\n\n   - **Model the language:** \"Water has the property of being **clear**—we can see through it. Food coloring has the property of being **colored**—it's bright blue. When we **mixed** them, the water changed. Now it's blue instead of clear. That was a **change**.\"\n\n5. **Check for understanding:**\n   - Hold up the photograph. \"Is this water clear or colored? How do you know?\"\n   - \"If I mix red food coloring with water, what property will change?\"\n   - Ask 2–3 students to repeat: \"Mixing is when...\" to ensure comprehension.\n\n**Expected Student Outcomes:**\n- Students use the word \"mix\" accurately to describe what happened in their experiment.\n- Students recognize that materials have properties (color, clearness).\n- Students identify the water as having changed from clear to blue—a **property change**.\n- Students explain that mixing is a way materials can come together and change appearance.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Deepen understanding by applying mixing concepts to a new, engaging scenario.\n\n**Materials:**\n- Copies of a **\"Design Your Own Color Mixing\"** worksheet, OR\n- Access to 3 clear cups per pair\n- Food coloring in different colors (red, yellow, blue, green)\n- Water\n- Droppers\n- Paper towels\n\n**Activity Option A: Guided Experiment (Recommended for most Second Grade classes)**\n\n**\"Make Your Own Color!\"**\n\n1. Pose the challenge: \"We made blue water by mixing clear water with blue dye. **What if we mix two different colors together? What new color will we get?**\"\n\n2. Demonstrate one example: \"Watch—I'm mixing a drop of red food coloring with a drop of yellow food coloring in water. What do you predict will happen? What color will we see?\"\n\n3. Students, in pairs, receive **two cups of water and a choice of two colors** (e.g., red + yellow, blue + yellow, red + blue).\n\n4. They add 3 drops of their first color, observe, then add 3 drops of their second color, and observe the new result.\n\n5. **Recording:** Students draw or write the colors they mixed and the new color they made on a simple chart:\n   - \"I mixed _____ and _____. The new color is _____.\"\n\n6. **Gallery walk:** Pairs display their results. Classmates walk around and observe the different color combinations.\n\n**Activity Option B: Sorting by Properties (Alternate)**\n\nProvide students with materials in cups (clear water, colored water from the Explore phase, milk, juice, oil) and challenge them to **sort by observable properties:** \"Which materials are clear? Which are colored? Which ones did we mix? How are they the same or different?\"\n\n**Teacher Role:**\n- Ask questions to deepen thinking: \"Why did you choose those colors?\" \"Do you think mixing purple and yellow will make a new color? Why?\"\n- Encourage peer discussion: \"Ask your partner what they notice.\"\n- Document observations (photos, notes) to use in evaluation.\n\n**Expected Student Outcomes:**\n- Students apply the concept of mixing to new color combinations.\n- Students make predictions based on prior observations.\n- Students recognize that mixing different materials can produce new observable properties (new colors).\n- Students begin to see patterns: \"Mixing always changes how things look.\"\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess whether students understand material properties, mixing, and observable change.\n\n**Formative Assessment (During Lesson):**\n- **Observation during Explore:** Note students who accurately describe what they see. Do they use words like \"color,\" \"spread,\" \"mixed\"?\n- **Listen during share-out (Explain phase):** Can students describe the sequence of what happened?\n- **Observe during Elaborate:** Do students make reasonable predictions? Can they explain their thinking?\n\n**Summative Assessment: Exit Ticket or Closing Activity**\n\n**Choose one option below:**\n\n**Option 1: Picture-Based Exit Ticket (Best for most Second Graders)**\nProvide each student with a printed image or show on screen:\n- A picture of a clear cup of water\n- A picture of a cup of blue water\n- A picture of blue food coloring bottle\n\nAsk (read aloud):\n1. \"Point to the picture that shows what happens when we mix water and blue food coloring.\"\n2. \"Circle the property that changed. Was it the COLOR or the SIZE of the water?\"\n3. \"Tell me one thing you learned today about mixing.\"\n\n**Option 2: Verbal Check-Out**\nAs students line up or transition, ask each student one question:\n- \"What colors did you mix today? What new color did you make?\"\n- \"If I mix water and red food coloring, will the water stay clear or change color? Why?\"\n- \"What is mixing? Give me an example from today.\"\n\n**Option 3: Picture Recording**\nStudents draw a simple picture of their Explore experiment and label it with words or letters you've written on the board (water, color, mix, change).\n\n**Success Criteria for Mastery:**\n- ✓ Student can identify observable properties (color, clear/cloudy).\n- ✓ Student can describe what \"mixing\" means in their own words.\n- ✓ Student recognizes that when materials mix, they can change appearance.\n- ✓ Student makes a reasonable prediction about what will happen when materials are mixed.\n\n**How to Determine if Students Met Learning Objectives:**\n- Review exit ticket responses and drawings.\n- Listen to student language during the lesson for use of key vocabulary.\n- Observe confidence and accuracy in predictions during Elaborate.\n- Check data sheets from Explore for clear before/after observations.\n- If 80% of the class demonstrates 3 of 4 success criteria, the learning objectives have been met.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Data Sheet:** Provide a sheet with three simple boxes labeled \"Start,\" \"After Adding Color,\" and \"After Stirring.\" Students only need to draw or circle colors (no writing required). Pre-label boxes with sentence starters: \"The water was ___.\" \"Now it is ___.\"\n\n2. **Paired Investigation with Teacher Support:** Assign a struggling student to work with a strong student, or pair with an aide/instructional assistant. The teacher asks guiding questions like \"What do you see happening?\" and models observation language: \"I notice the color is spreading through the water.\"\n\n3. **Vocabulary Pre-Teaching:** Before the Explain phase, show these students the vocabulary words on cards with pictures. Connect each to the Explore activity: \"This is **mixing**—that's what you just did when you poured the food coloring in!\"\n\n### Challenge (For Advanced Learners)\n\n1. **Prediction & Reasoning:** Challenge students to predict the outcome of mixing three colors or to explain *why* the color spreads (introduce the idea of diffusion informally: \"The tiny bits of color move all around the water\"). Have them draw arrows showing how the color moves.\n\n2. **Comparative Testing:** Ask, \"What if we use hot water instead of cold water? Will the blue color mix faster or slower? Let's test!\" Or, \"What if we use oil instead of water? Will the color mix the same way?\" Students design and conduct a mini-experiment.\n\n3. **Documentation Challenge:** Have advanced students take photos or draw detailed step-by-step diagrams of their Explore experiment and create a \"how-to\" guide to teach another class about mixing.\n\n---\n\n## Extension Activities\n\n1. **Tie-Dye Art Project (Follow-Up Lesson or Homework)**\n   Use food coloring and water to create tie-dye patterns on coffee filters or paper towels. Students observe how colors spread and mix naturally as the water travels through the paper. Connect to the original lesson: \"The color spreads just like it did in our cups!\"\n\n2. **Sink or Mix? Investigation**\n   Provide students with clear cups and encourage them to test whether different materials mix with water:\n   - Does salt mix? (Yes—dissolves)\n   - Does sand mix? (No—sinks to bottom)\n   - Does sugar mix? (Yes—dissolves)\n   - Does oil mix? (No—floats on top)\n   \n   Students classify materials by whether they mix with water and observe that water has different interactions with different materials.\n\n3. **\"What Mixes with Water?\" Sort Activity**\n   Create a sorting chart on the floor or table with pictures/real objects (salt, pepper, rice, food coloring, oil, glitter). Students predict and sort what will \"mix\" with water vs. what won't. Test predictions and discuss results. Introduces the idea that not all materials mix the same way.\n\n---\n\n## Summary Notes for Implementation\n\n- **Safety:** Food coloring is non-toxic but can stain. Protect clothing and surfaces with paper towels. Remind students not to taste or drink.\n- **Timing Flexibility:** This lesson can be taught in one 60–75 minute block or split across two days (Engage/Explore on Day 1; Explain/Elaborate/Evaluate on Day 2).\n- **Photo Connection:** Return to the original photograph repeatedly throughout the lesson to anchor student thinking and show how their experiment mirrors the classroom observation.\n- **Language-Rich Environment:** Model and repeat key vocabulary (mix, material, property, change) throughout all five phases. Create a word wall with pictures if possible.\n- **Real-World Connection:** Ask students where they see mixing at home (making juice, kool-aid, art projects, cooking) to build relevance.",
  "inputTokens": 2382,
  "outputTokens": 3933,
  "cost": 0.022046999999999997,
  "generatedAt": "2026-02-12T23:51:25.951Z"
}