{
  "title": "Solution",
  "category": "physical-science",
  "imageFile": "p19.jpg",
  "imagePath": "images/physical-science/p19.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Mixing Colors in Water\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Mixing and properties of liquids:** Food coloring mixes with water, showing that liquids can blend and change appearance while remaining liquids.\n- **Diffusion and color distribution:** The dye particles spread through water over time, demonstrating how materials move and spread within a liquid.\n- **Observable changes in matter:** The water changes color, showing that mixing substances creates a visible change without creating a new substance (reversible physical change).\n- **Properties of materials:** Water is transparent and colorless; food coloring is highly concentrated, vibrant, and water-soluble.\n\n---\n\n## Lesson Title\n\n**Whoosh! Colors Dance in Water**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 60–75 minutes (two sessions: 30–40 minutes on Day 1, 30–35 minutes on Day 2)\n- **NGSS Standards:** K-PS2-1 (pushes and pulls affecting motion); K-PS3-1 (observing effects of light on Earth's surface — optional extension)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe what happens when food coloring is mixed with water.\n2. Use words like \"spread,\" \"mix,\" and \"blend\" to describe color movement in liquids.\n3. Predict what will happen when different colors are added to water.\n4. Compare how fast or slow colors spread in water (connection to motion).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or digital image of the blue-dyed water jar displayed on a document camera, tablet, or poster board\n- Index cards or sticky notes for recording wonderings\n\n**Activity:**\n\n1. **Display the Photograph:** Show the image of the jar with blue dye swirling through clear water. Hold it up or project it so all students can see. Say: \"Look at this picture carefully. What do you see happening inside this jar?\"\n\n2. **Discussion Questions (calibrated for Kindergarten):**\n   - \"What color do you see in the jar? Where is it?\"\n   - \"Do you think the water at the top and the water at the bottom look the same? Why or why not?\"\n   - \"How do you think the blue color got all mixed into the water?\"\n   - \"What do you wonder about? What would you like to try?\"\n\n3. **Prediction/Wonder Prompt:** \"If we put a different color, like red, in water, what do you think would happen? Would it mix like the blue did? Would it be fast or slow?\" Have students turn and talk to a neighbor, then invite 3–4 volunteers to share. Record their ideas on a chart labeled \"Our Predictions.\"\n\n**Transition:** \"Great predictions! Now we get to do our own mixing experiment to see if your ideas are right. Let's get started!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Clear plastic cups or glass jars (one per student or per pair)\n- Water (room temperature, in a large pitcher or bucket)\n- Food coloring in primary colors (red, blue, yellow)\n- Small droppers or pipettes (one per color)\n- Paper towels\n- A simple recording sheet with three empty circles (for students to color with crayons to match what they see)\n- Optional: spoons or plastic stirrers\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. \"Each of you will get a cup of clear water. Don't drink it! This is for our science experiment.\"\n\n2. \"Hold your cup up to the light. What do you see? Describe the color of the water.\" (Expected: \"Clear!\" or \"White!\" — validate all observations.)\n\n3. \"Now I'm going to give one person in your group a dropper with food coloring. Choose one color.\" (Distribute droppers one at a time.)\n\n4. \"Squeeze one tiny drop of color into your water. Watch it! Don't stir yet. What happens? Does it sink? Does it float? Does it spread? Tell your partner what you see.\"\n\n5. \"Now gently stir your water with a spoon or your dropper. Keep watching. What happens to the color? Does it move? How fast?\"\n\n6. \"Once you've watched for 30 seconds, compare your water to someone else's. Are they the same? Different?\"\n\n7. \"On your recording sheet, use a crayon to color the empty circles to show the color you made.\"\n\n**Connection to Photograph:** \"The jar in the picture shows blue color spreading through water, just like what's happening in your cup right now!\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What do you notice?\" \"Is it changing?\" \"What's happening to the color?\"\n- Resist explaining; instead, guide observation: \"Keep watching—what do you see next?\"\n- Assist with dropper use if needed (fine motor development).\n- Manage spills with paper towels; keep the mood exploratory and playful.\n\n**Expected Student Outcomes:**\n- Students observe the color spreading/diffusing through the water.\n- They notice the color is slow or fast.\n- They recognize the water changes color.\n- Recording sheets show colored circles matching their observations.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- The photograph displayed again\n- A large jar of water with food coloring for demonstration (prepare ahead—show before or after groups share)\n- Chart paper and markers\n- Vocabulary cards with pictures\n\n**Activity:**\n\n1. **Group Share-Out:** Invite 5–6 students to share what they observed. Ask:\n   - \"What did you see when you dropped the color in?\"\n   - \"Did the color move fast or slow?\"\n   - \"What word would you use to tell what happened?\"\n\n2. **Teacher Explanation (child-friendly language):**\n   \n   \"When you dropped the color into the water, something amazing happened—the tiny pieces of color started moving and spreading all through the water. Watch again as I drop one color into this big jar. See how it goes up and down and all around? That's because the color pieces are moving through the water. We call this **mixing**. The water and the food coloring are becoming one thing together. The water doesn't disappear—it just changes color!\"\n\n3. **Introduce Key Vocabulary:**\n\n   | **Vocabulary Term** | **Student-Friendly Definition** |\n   |---|---|\n   | **Mix** | When two things come together and blend into one. The colors and water mix. |\n   | **Spread** | To move out and cover more space. The color spreads through the water. |\n   | **Liquid** | A substance that can pour and spreads. Water is a liquid. |\n   | **Color** | What we see when light bounces off something. The food coloring adds color to the water. |\n   | **Observe** | To watch carefully and notice what happens. |\n\n4. **Connections Back:** Point to the photograph. \"Look at the picture again. The blue color spread through the water in the jar, just like the colors spread in your cups. Scientists observe what they see and use words like 'mix' and 'spread' to describe it.\"\n\n5. **Check for Understanding:**\n   - Hold up your water cup with mixed color. Ask: \"Is the color mixed into the water? How do you know?\"\n   - \"Show me with your hands how the color spreads.\" (Students gesture spreading motions.)\n   - \"What do we call the clear stuff in the jar?\" (Expected: \"Water!\")\n\n**Expected Student Outcomes:**\n- Students use the word \"mix\" or \"spread\" to describe what they saw.\n- They understand that food coloring combines with water to change its color.\n- They can point out mixing in the photograph.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply and deepen their understanding in a new context.\n\n**Materials:**\n- Clear cups of water (one per student pair)\n- Food coloring in two or three colors\n- Droppers\n- Recording sheet: \"What happens when colors mix?\" with spaces for predictions and observations\n\n**Activity:**\n\n**Challenge: Mixing Two Colors**\n\n1. \"Now that you're mixing experts, let's try something new! What happens if we mix TWO colors together in one cup of water?\"\n\n2. **Prediction Phase:** Show two colors (e.g., red and blue). \"If I mix red and blue together in water, what new color do you think will appear?\" Record predictions on chart paper.\n\n3. **Investigation Phase:** \n   - Pair students up.\n   - Give each pair a cup of water, two colors of food coloring, and two droppers.\n   - Directions: \"Drop one color into your water. Watch it spread. Then drop a different color into the same cup. What happens? Does a new color appear? Does it look like the picture from the beginning of our lesson?\"\n\n4. **Observation Recording:** Students draw or color what they see on their recording sheet.\n\n5. **Real-World Connection:** \"Did you know that painters mix colors like this? And when you mix paints or markers, new colors appear, just like in your water cups!\"\n\n**Teacher Role:**\n- Facilitate pairing and material distribution.\n- Ask: \"What color do you see now? Is it the same as before?\"\n- Encourage language use: \"Tell your partner what you observe.\"\n- Celebrate surprises: \"Oh! The colors mixed and made a new color. That's what mixing does!\"\n\n**Expected Student Outcomes:**\n- Students observe that mixing two colors creates visual changes.\n- They use comparison language: \"It was blue, now it's purple!\"\n- They connect the activity to real-world mixing (painting, cooking, etc.).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of mixing and observation.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- Listen to student language during Explore and Elaborate phases. Do they use \"mix,\" \"spread,\" \"color,\" \"water\"?\n- Observe whether students can predict outcomes and notice changes.\n- Check recording sheets for accurate color representation and effort.\n\n**Exit Ticket/Summative Assessment:**\n\nGather students in a circle with three clear cups:\n- Cup A: Clear water (unchanged)\n- Cup B: Water with one color mixed in\n- Cup C: Water with two colors mixed in\n\n**Show each cup one at a time and ask:**\n\n1. \"Which cup has a mix in it?\" (Expected: Cup B or Cup C)\n2. \"What word do we use when colors come together in water?\" (Expected: \"Mix!\")\n3. \"Point to the cup that looks most like the picture we saw at the beginning.\" (Expected: Cup B, depending on color)\n4. **Final Question:** \"If I dropped red food coloring into this clear water (point to Cup A), what would happen?\" (Expected: Students describe the color spreading or mixing.)\n\n**Success Criteria:**\n- ✓ Student can identify which cup has mixed color.\n- ✓ Student uses the word \"mix\" or \"spread\" to describe what happens.\n- ✓ Student can predict what will happen when color is added to water.\n- ✓ Student can draw or describe the observation on recording sheet.\n\n**Expected Student Outcomes:**\n- Most Kindergarteners will correctly identify mixing and use descriptive language.\n- Some may use action words (\"The color went down!\" or \"It swirled!\").\n- All should show evidence of careful observation through discussion or drawings.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **One-on-One Dropper Practice:** If a student struggles with dropper control, practice squeezing into an empty cup first. Offer a wider-mouth jar for easier access.\n\n2. **Simplified Recording:** Instead of drawing, allow students to verbally describe and have you write or record them. Accept coloring circles as sufficient evidence.\n\n3. **Repetition with Familiar Context:** Use colors students already know and love. Ask: \"What's your favorite color? Let's make that color appear in the water!\"\n\n### Challenge (for advanced learners):\n\n1. **Prediction Chain:** \"If we mix red, blue, and yellow all together, what color do you think we'll get? Why?\" Challenge students to think about multiple steps.\n\n2. **Time Observation:** Provide a simple sand timer or stopwatch. \"How long does it take for the color to completely mix? Can we make it mix faster?\" (This connects to K-PS2-1: pushes/pulls affecting motion—stirring is a push.)\n\n3. **Pattern Exploration:** \"Can you drop the colors in a pattern? Red, blue, red, blue. What happens to the pattern as it mixes?\" (Geometric and cause-effect thinking.)\n\n---\n\n## Extension Activities\n\n1. **Sensory Integration (Smell Safe Colors):** On a separate day, add drops of food coloring to water and safe extracts (vanilla, lemon) to combine color observation with smell. Reinforce that mixing changes how things look and can change how they smell, but the water is not for drinking.\n\n2. **Rainbow in a Jar:** Layer clear dish soap, water, and drops of multiple colors (one at a time) in a jar. Observe how each color sits at a different level before gradually mixing. This introduces density in a visual, engaging way.\n\n3. **Color-Mixing Art:** Provide white paper and small cups of colored water. Use eye droppers or small paintbrushes to create watercolor art. As colors blend on paper, reinforce mixing vocabulary. Display as a gallery walk.\n\n---\n\n## Teacher Notes\n\n- **Safety First:** Remind students that food coloring is not for eating in this context (even though it's safe). Keep a \"science water only\" sign near the station.\n- **Sensory Learners:** Some students may want to touch the water. Let them do so if appropriate, but keep food coloring off skin and clothes.\n- **Excitement Management:** This activity is visually engaging and can lead to noise and movement. Set clear expectations: \"We watch with our eyes first, then we can tell a friend what we see.\"\n- **Photo Documentation:** Take photos of student cups at different stages. These become evidence of learning and can be printed for portfolios.\n- **Connection to Weather/Seasons (Optional K-PS3-1):** On a sunny day, place the mixed-color cups in sunlight. Observe: \"Does the color look different in the light?\" This preps for future light/shadow lessons.\n\n---\n\nThis lesson honors Kindergarten's love of color, movement, and hands-on discovery while anchoring learning in physical science observation and vocabulary. Students walk away with a concrete understanding of mixing as a physical process they can observe, predict, and describe.",
  "inputTokens": 2383,
  "outputTokens": 3486,
  "cost": 0.019813,
  "generatedAt": "2026-02-12T23:49:50.515Z"
}