{
  "title": "Solution",
  "category": "physical-science",
  "imageFile": "p19.jpg",
  "imagePath": "images/physical-science/p19.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Mixing and Dissolving — Understanding Matter in Motion\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Diffusion and Mixing:** The blue dye is spreading and dispersing through the water, demonstrating how particles move and mix at different rates.\n- **Properties of Matter:** The water and dye have different colors and densities, showing how observable properties help identify substances.\n- **States of Matter:** The lesson visibly shows a liquid (water) and a soluble substance (dye) combining, illustrating how materials interact.\n- **Particle Movement:** Though particles cannot be seen with the naked eye, the visible color change demonstrates that invisible particles are moving and spreading throughout the water.\n\n---\n\n## Lesson Title\n\n**Blue Dye Detective: Discovering How Substances Mix and Change**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or one 90-minute block)\n- **NGSS Standards:** \n  - 5-PS1-1 (Develop a model to describe that matter is made of particles too small to be seen)\n  - 5-PS1-4 (Conduct an investigation to determine whether the mixing of two or more substances results in new substances)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** what happens when two liquids (or a liquid and soluble substance) are mixed together.\n2. **Explain** that mixing substances creates observable changes, and predict how dye will spread through water over time.\n3. **Model particle behavior** by drawing or describing how invisible particles move and mix, even though we cannot see them.\n4. **Identify** whether mixing substances creates a new substance by observing properties before and after mixing.\n\n---\n\n## 5E Lesson Sequence\n\n---\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of the blue dye diffusing in water.\n\n**Materials:**\n- Photograph displayed on screen or printed (large version if possible)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** prominently. Do not explain it yet. Let students observe silently for 15-20 seconds.\n\n2. **Ask these discussion questions one at a time,** allowing 1-2 minutes for think-pair-share before whole-group responses:\n   - *\"What do you see happening in this jar? Describe the colors and patterns you notice.\"*\n   - *\"Why do you think the blue color is spreading out instead of staying in one place?\"*\n   - *\"If we waited 30 more minutes, what do you predict the jar would look like? Why?\"*\n   - *\"Do you think the blue color came from a solid, liquid, or gas? How can you tell?\"*\n\n3. **Wonder Prompt:** Record student predictions on chart paper: *\"I wonder what makes the blue spread through the water so slowly...\"* and *\"I think the water changes because...\"* Explain that today they will become \"dye detectives\" to solve this mystery.\n\n**Transition:** *\"Now it's your turn to create this same experiment and discover what's really happening inside that water jar!\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate diffusion and mixing through hands-on experimentation.\n\n**Materials:**\n- Clear plastic cups or jars (one per student or pair)\n- Room-temperature water (pre-poured into cups, about 3/4 full)\n- Blue food coloring or washable paint in small dropper bottles (one per pair or group)\n- Spoons for stirring (optional — students may observe without stirring)\n- Paper towels\n- Pre-made observation sheets (see below)\n- Timer or clock visible to all students\n\n**Activity — Student Directions:**\n\n1. **Observe the water:** Before adding anything, write or draw what your clear water looks like on your observation sheet.\n\n2. **Add one drop of blue dye** to the center of your cup. Do NOT stir. Watch carefully.\n\n3. **Record what happens at these time intervals** (teacher calls out times or students use a timer):\n   - **Immediately (right after adding dye):** Draw the pattern. Describe in words: *Where is the blue? Is it spreading? Is it staying in one spot?*\n   - **After 2 minutes:** Draw again. How far has it spread?\n   - **After 5 minutes:** Draw again. What do you notice?\n\n4. **Answer these questions on your sheet:**\n   - Is the blue dye moving by itself, or is something else happening?\n   - Where did the blue go?\n   - Do you think new water was created, or is it still the same water with color added?\n\n5. **Option for deeper investigation:** If time allows, students can add a second drop of a different color (yellow or red) to see if colors mix or stay separate.\n\n**Teacher Role:**\n\n- Circulate and **ask questions rather than give answers:**\n  - *\"What do you observe right now compared to when we started?\"*\n  - *\"Where is the dye spreading to next?\"*\n  - *\"Do you think the dye is a solid, liquid, or something else?\"*\n- **Encourage sketching and detailed observation.** Fifth graders often rush; slow them down by saying, *\"Take your time and really watch what's happening.\"*\n- **Do not allow stirring initially** — this reveals diffusion, not just mixing. If students stir, have them predict first, then compare.\n\n**Expected Student Outcomes:**\n\n- Detailed observation drawings showing dye spreading over time\n- Written descriptions noting that the blue spreads slowly throughout the water\n- Predictions about where the dye will go next\n- Recognition that the dye moves even without stirring (suggesting invisible particle movement)\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to particle theory.\n\n**Materials:**\n- Chart paper with vocabulary words and definitions\n- Photograph from the lesson displayed again\n- Student observation sheets from Explore phase\n\n**Activity:**\n\n1. **Share and discuss observations** (3-5 minutes):\n   - Call on 3-4 student pairs to share their drawings and describe what they observed.\n   - Record common observations: *The blue spread slowly, it didn't stay in the middle, the water changed color, the dye moved without stirring.*\n\n2. **Introduce and define vocabulary** (8-10 minutes). Write each term on chart paper as you discuss:\n\n   **Vocabulary:**\n   \n   - **Diffusion:** The way particles of a substance spread out and mix evenly throughout a liquid or gas, moving from where there is more of the substance to where there is less. *(Use your water experiment as the example: the dye particles spread throughout the whole jar.)*\n   \n   - **Particles:** Tiny, tiny pieces of matter that are too small to see, even with your eyes. Everything — water, dye, air — is made of particles. *(Hold up the dye bottle and water cup and say: \"Even though these look solid and smooth, they're actually made of trillions of super-tiny particles moving around.\")*\n   \n   - **Mixing:** When two or more substances come together and their particles spread throughout each other. *(Point to the photograph: \"The blue dye mixed with the water.\")*\n   \n   - **Substance:** A material that has its own special properties, like color, how it feels, and how it behaves. *(Examples: water is a substance, food coloring is a substance.)*\n   \n   - **New Substance:** When two substances mix and create something with completely different properties than what you started with. *(Ask: \"Is the blue water the same as pure water, or is it a new substance? Why?\")*\n\n3. **Connect back to the photograph and exploration** (4-5 minutes):\n   - Display the jar photograph again.\n   - *\"This jar shows diffusion. The blue dye particles are spreading throughout the water because those tiny particles are always moving — even though we can't see them. This is the same thing that happened in your jars!\"*\n   - *\"The dye and water are mixing together, and the result is a new substance — blue water — that is different from plain water.\"*\n\n4. **Check for understanding:**\n   - Ask: *\"If I add one drop of red dye to the blue water now, what do you predict will happen?\"* (Students should predict it will spread and mix like the blue did.)\n   - Ask: *\"Why did the dye spread out instead of staying in a blob in the middle?\"* (Because the particles moved and spread out on their own.)\n\n**Expected Student Outcomes:**\n\n- Students can use the word \"diffusion\" to describe what they observed.\n- Students understand that invisible particles moved the dye, even though we cannot see the particles themselves.\n- Students recognize that water + dye = a new substance with new properties (color).\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply diffusion concepts to a new scenario and deepen understanding of particle behavior.\n\n**Materials:**\n- Warm water (approximately 110-115°F — warm to the touch but safe; pre-poured into 1-2 cups)\n- Room-temperature water (pre-poured into 1-2 cups)\n- Blue food coloring\n- Dropper bottles\n- Observation sheets (same format as Explore)\n- Optional: Ice water if available\n\n**Activity:**\n\n**Comparative Diffusion Investigation:**\n\n1. **Set up comparison:** Show students two cups side by side — one with warm water, one with room-temperature water (or cold water if available). Explain: *\"We already know dye spreads in regular water. But today we're going to test if temperature changes how fast particles move.\"*\n\n2. **Make a prediction:** Ask students: *\"If I add a drop of blue dye to the warm water and a drop to the cold water at the same time, which one do you think the dye will spread through faster? Why?\"* Record predictions on the board.\n\n3. **Conduct the comparison:**\n   - Add one drop of blue dye to the warm water cup and one drop to the cold water cup simultaneously.\n   - Have students observe and sketch at 1-minute intervals for 5 minutes.\n   - Students record: *Which spread faster? Why do you think that happened?*\n\n4. **Discuss results:**\n   - Guide students to conclude: *\"When particles are warmer, they move faster. That's why the dye spread quicker in warm water.\"*\n   - Connect to vocabulary: *\"This shows us that diffusion happens at different speeds depending on temperature — the particles have more energy when they're warm.\"*\n\n5. **Introduce a model (optional but recommended):**\n   - Use a simple particle diagram on chart paper.\n   - Show water particles (draw small circles close together) and dye particles (a few circles in the center).\n   - As students watch, space out the dye particle circles to show how they spread throughout the water particles over time.\n   - Say: *\"Even though we can't see them, this is what's happening inside your jar at the particle level.\"*\n\n**Teacher Role:**\n\n- Ask guiding questions: *\"Do you see a difference in how fast the colors are spreading?\"* and *\"What could be causing one to spread faster than the other?\"*\n- Push thinking: *\"If particles move when they're warm, what else in the classroom might have moving particles?\"* (Answers: hot water for tea, heating, etc.)\n- Validate student observations without giving away conclusions.\n\n**Expected Student Outcomes:**\n\n- Students observe and record that warm water shows faster diffusion than cold water.\n- Students articulate that temperature affects particle movement.\n- Students create a simple visual model showing particle movement and diffusion.\n- Students extend their understanding to real-world scenarios (e.g., *\"My mom's tea gets cold slower in a hot mug because warm particles move faster.\"*).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of diffusion, particle behavior, and mixing.\n\n**Formative Assessment (Throughout Lesson):**\n\n- **Observation sheets** from Explore and Elaborate phases serve as formative data.\n- **Teacher questioning** during all phases reveals student thinking.\n- **Student drawings and descriptions** show whether they can model particle behavior and predict outcomes.\n\n**Summative Assessment — Exit Ticket (5-10 minutes):**\n\nProvide each student with a printed or digital exit ticket. Students may draw, write, or write-and-draw responses:\n\n**Exit Ticket Questions:**\n\n1. **Scenario:** *\"Your friend spills a tiny drop of food coloring in a pitcher of water. After 10 minutes, the whole pitcher is colored. Explain why this happened using what you learned about diffusion and particles.\"* (Students should mention that particles move and spread throughout the water.)\n\n2. **Model:** *\"Draw or describe what you think the particles are doing inside the water jar. Show how they moved the dye from the center to the edges of the jar.\"* (Accept drawings with small circles spreading outward; accept descriptions mentioning invisible particles moving.)\n\n3. **Application:** *\"If you wanted the blue dye to spread faster through the water, what could you do? Explain your thinking.\"* (Correct answer: make the water warmer, because warm particles move faster. Accept: stir, but note that this is mixing, not diffusion.)\n\n4. **Vocabulary Check:** *\"Is the blue water a new substance or the same as regular water? Explain.\"* (Should indicate it is a new substance with different properties — it has color now.)\n\n**Success Criteria:**\n\n✓ Student can describe or draw diffusion in action.\n✓ Student recognizes that invisible particles are responsible for the spread of dye.\n✓ Student understands that mixing substances creates a new substance with different properties.\n✓ Student predicts how temperature affects particle movement.\n✓ Student uses at least two vocabulary words correctly (diffusion, particles, mixing, substance).\n\n**How to Determine if Objectives Were Met:**\n\n- Review exit tickets for accuracy of explanations.\n- Cross-reference with observation sheets to see growth in thinking from Explore to Evaluate.\n- Identify students who can explain *why* diffusion happens (particle movement) vs. just observing *that* it happens.\n\n---\n\n## Differentiation\n\n### Support (Struggling Learners)\n\n1. **Provide a sentence frame for explanations:**\n   - *\"The dye spread because _____.\"*\n   - *\"Particles are _____, so they can _____.\"*\n   - *\"When I mixed water and dye, I made a new substance because _____.\"*\n\n2. **Simplify observation sheets:**\n   - Instead of writing descriptions, allow students to draw only and use a drawing key to label what they see (e.g., \"water,\" \"dye,\" \"mixed water\").\n   - Reduce the number of time intervals (observe at 0, 5, and 10 minutes instead of every 2 minutes).\n\n3. **Use a concrete particle model:**\n   - Place blue and white beads in a clear bag with a solid barrier in the middle.\n   - Shake the bag to show particles spreading (or provide pre-shaken example).\n   - Have students predict: *\"When we shake, what will happen to the beads?\"* This physical model bridges to invisible particle movement.\n\n### Challenge (Advanced Learners)\n\n1. **Introduce the concept of saturation:**\n   - Ask: *\"Do you think the dye will ever stop spreading? What would happen if we kept adding more and more dye drops?\"*\n   - Have students predict and test adding 5-10 drops over time. Discuss whether a substance can be \"full\" of another substance (saturation).\n\n2. **Explore variables systematically:**\n   - Have students design a fair test comparing diffusion in warm water, room-temperature water, and cold water (or salt water vs. fresh water).\n   - Students write a hypothesis, predict results, and organize data in a table or graph.\n   - Connect to the idea that particle size and environmental factors affect diffusion rates.\n\n3. **Connect to real-world applications:**\n   - Ask: *\"How is diffusion used in medicine, cooking, or water treatment?\"* (Examples: dyes spreading in fabric, tea steeping, water purification.)\n   - Have students research or brainstorm scenarios where controlling diffusion speed matters.\n\n---\n\n## Extension Activities\n\n1. **Perfume or Scent Diffusion Walk:**\n   - Spray a small amount of perfume or essential oil in one corner of the classroom in the morning (or during a lesson before this activity).\n   - Have students walk around and predict where they will smell the scent based on diffusion principles.\n   - Return 15 minutes later and observe if the smell has spread throughout the room.\n   - Discuss: *\"The scent particles are diffusing through the air, just like dye diffused through water!\"*\n\n2. **Dye Painting and Pattern Exploration:**\n   - Provide coffee filters, paper towels, or white cloth strips.\n   - Have students place a drop of blue (or multiple colors) on the fabric and observe how dye spreads and is absorbed.\n   - Compare diffusion on different materials (does it spread the same way in paper vs. cloth?).\n   - Extend: Introduce chromatography by dripping dye on the edge of a strip of paper dipped in water, creating a visual of how \"hidden colors\" separate as the water moves up the paper.\n\n3. **Temperature and Cooking Connection:**\n   - Bring in two cups of tea or broth — one hot and one cold.\n   - Ask: *\"Which one do you think will change color faster if we add a food-coloring drop?\"*\n   - Conduct the experiment and relate it to cooking: *\"When cooks heat liquids, diffusion happens faster, so flavors mix in more quickly.\"*\n   - Have students brainstorm foods or drinks where diffusion is important (soup, kool-aid, sauce, tea, etc.).\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety:** Ensure food coloring is non-toxic and age-appropriate. Use dropper bottles to control amounts. Provide paper towels for spills.\n- **Pacing:** Fifth graders may need more observation time than listed. If students are deeply engaged in watching diffusion, allow extra time rather than rushing to the next step.\n- **Misconception Prevention:** Some students may think the dye \"disappears\" or \"turns into water.\" Reinforce: *\"The dye is still there — it's just spread out so thin throughout the water that it's hard to see individual dye particles. But the water is now blue everywhere.\"*\n- **Connection to 5-PS1-1:** This lesson directly supports the performance expectation by having students observe diffusion (a particle-level phenomenon they cannot see) through its observable effects (color change). Students begin to build a mental model of invisible particles in motion.\n- **Connection to 5-PS1-4:** By the end of the lesson, students should recognize that mixing water and dye results in a new substance (blue water) with different properties than the original substances.\n\n---\n\n**This lesson is ready to teach. Gather materials, display the photograph, and let student curiosity drive discovery!**",
  "inputTokens": 2442,
  "outputTokens": 4486,
  "cost": 0.024872,
  "generatedAt": "2026-02-12T23:53:47.106Z"
}