{
  "title": "Mixture",
  "category": "physical-science",
  "imageFile": "p20.jpg",
  "imagePath": "images/physical-science/p20.jpg",
  "content": "# Engineering Design Challenge: Beach Sand Composition\n\n### Visible Elements in Photo\n- Fine white/light-colored sand (primary matrix)\n- Numerous small pebbles and rocks in varied colors (tan, brown, red, gold, dark gray/black)\n- Particles of varying sizes mixed throughout\n- Natural, unstructured surface with no human-made objects\n- Compact, densely-packed material suggesting coastal or beach environment\n\n### Reasonable Inferences\n- **From mixed rock colors and sizes**: This sand comes from multiple rock sources that have been broken down and transported by water, meaning different materials must be separated by size and type for different purposes.\n- **From fine sand + pebbles combination**: The coarser pebbles settling among fine sand suggests gravity and water movement sort particles by density and size—a principle useful for filtering or sorting tasks.\n- **From compact appearance**: The material is stable when dry but may shift or compact differently when wet, presenting structural challenges for building with it.\n\n### Engineering Task\n\n**K-2:**\nYou are a beach builder! Use sand and small rocks to make a **tall pile that doesn't fall down**. Can you build it higher by mixing the sand and rocks in a special way? Try different ways of stacking and mixing to see what stays up longest.\n\n**3-5:**\n**Design a filtration system** to separate beach sand into three size categories (fine sand, medium pebbles, large rocks) using only classroom materials. Your filter must:\n- Separate materials into at least 3 distinct piles\n- Work with a single pour-through (no re-filtering)\n- Complete separation in under 2 minutes\n- Handle a cup of mixed material without clogging\n\nTest your design and measure which particle sizes end up in each layer. Which size was hardest to separate?\n\n### EDP Phase Targeted\n**Ask / Define Problem** — This real-world photo of mixed sediment naturally raises the question: \"How can we sort materials of different sizes?\" Students observe a problem (mixed particles) and must first identify *why* separation matters before designing a solution. The visible diversity of materials invites curiosity about sorting.\n\n### Suggested Materials\n- Sand (play sand or beach sand if available)\n- Small pebbles or gravel\n- Shallow containers or trays\n- Mesh screens or strainers (multiple sizes if available)\n- Paper cups with holes poked in the bottom\n- Funnels and paper towels or coffee filters\n\n### Estimated Time\n**One 40-50 minute session** (K-2: shorter; 3-5: includes testing and redesign iteration)\n\n### Why This Works for Teachers\nThis task directly supports **NGSS 3-5-ETS1-1** (Define a problem that can be solved with a designed object or tool) by asking students to identify and solve a real materials-handling challenge inspired by natural sediment sorting processes.",
  "inputTokens": 1803,
  "outputTokens": 646,
  "cost": 0.005032999999999999,
  "generatedAt": "2026-02-09T13:28:21.054Z"
}