{
  "title": "System",
  "category": "physical-science",
  "imageFile": "p21.jpg",
  "imagePath": "images/physical-science/p21.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- Car engine with large black intake manifold and multiple cylindrical pipes\n- Red battery unit (left side)\n- White metal strut or brace spanning horizontally across the engine bay\n- Multiple fluid reservoirs and hoses throughout the compartment\n- Dense arrangement of components in a confined metal space (the engine bay)\n\n---\n\n### Reasonable Inferences\n1. **From the intake manifold and pipes** → Air and fuel need to travel efficiently through the engine; the curved, branching design suggests flow optimization to reach multiple locations.\n2. **From the confined space with many components** → Engineers had to pack complex systems (cooling, fuel, air intake, electrical) into a small area without parts touching or interfering with each other.\n3. **From the white brace and battery placement** → Heavy or vibrating parts need structural support and careful positioning to prevent damage and maintain safety during operation.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nDesign a \"busy parking space\" for toy cars and trucks. You have a small shoebox or bucket (your engine bay). Use pipe cleaners, straws, and blocks to create paths and supports so 3 different toy vehicles can fit inside without bumping into each other. Make sure nothing blocks the \"door\" from closing.\n\n**3-5 Version:**\nDesign a compact organization system for an engine bay 30 cm × 20 cm (shoe box size). You must fit five \"components\" (water bottle, plastic container, battery pack, bundle of cables, and a binder) into the space following these rules:\n- Heavy items cannot sit on light ones.\n- At least two items must be braced or supported so they don't shift during motion.\n- All items must be accessible for \"maintenance\" (you can remove and replace each one within 15 seconds).\n- The system must remain stable when the box is tilted 45 degrees (simulating vehicle movement).\nMeasure and record how efficiently you used the space (percentage of box volume occupied).\n\n---\n\n### EDP Phase Targeted\n\n**Imagine / Plan**\n\nThe photo shows an *existing, well-engineered solution*—the engine bay itself. Students can directly observe how professionals solved a spatial packing and stability problem. This makes \"Imagine/Plan\" ideal because students can examine the real design, identify the strategies (support braces, component stacking, use of vertical space), and then plan their own layout before building. Students skip the \"Ask\" phase (the need is obvious: fit lots of things in a small space safely) and go straight to envisioning their own version.\n\n---\n\n### Suggested Materials\n1. **Shoebox or plastic storage container** (the confined space)\n2. **Recycled bottles, containers, and cans** (to represent engine components)\n3. **Craft foam blocks or wooden blocks** (for spacers and supports)\n4. **Pipe cleaners or zip ties** (for bracing and securing items)\n5. **Tape or velcro strips** (for attaching supports and keeping items in place during tilting test)\n\n---\n\n### Estimated Time\n**60–75 minutes** (one class period + 10 minutes for testing and reflection)\n- Planning & sketching: 10–15 minutes\n- Building/organizing: 30–35 minutes  \n- Testing (tilting, accessibility check): 10 minutes\n- Reflection & discussion: 10 minutes\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (Define simple design problems and solutions based on how things work) and **3-5-ETS1-2** (Generate solutions based on constraints and criteria), by asking students to analyze a real-world spatial constraint problem and design their own efficient, stable system within strict physical limits.",
  "inputTokens": 1803,
  "outputTokens": 863,
  "cost": 0.006118,
  "generatedAt": "2026-02-09T13:28:33.164Z"
}