{
  "title": "Reflection",
  "category": "physical-science",
  "imageFile": "p25.jpg",
  "imagePath": "images/physical-science/p25.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Light and Shadows with Flowers\n\n## Core Science Concepts from Image Analysis\n- **Light travels in straight lines** from a source (the hanging lamp) and can be blocked by objects (the flower stems and vase), creating shadows.\n- **Properties of materials** determine how light passes through them (transparent glass vase vs. opaque flower stems).\n- **Light sources** (the lamp above) produce energy that travels outward and can illuminate objects at different distances.\n- **Shadows form** when an object blocks light, demonstrating the relationship between light, objects, and surfaces.\n\n---\n\n## Lesson Title\n**Chasing Shadows: How Light Makes Flowers Glow**\n\n---\n\n## Lesson Overview\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes (two 45-minute sessions, or one extended session with a break)\n- **NGSS Standards:** \n  - **3-PS2-1** (implied through observation of light energy and how it interacts with matter)\n  - **3-PS4-2** (not formally listed but foundational to light exploration per Grade 3 Physical Science)\n  - **Note:** This lesson centers on **light and shadows**, foundational to Grade 3 energy concepts. While a direct 3-PS4 standard isn't provided in your list, this lesson strongly supports Grade 3 understanding of waves and light energy.\n\n---\n\n## Learning Objectives\nStudents will be able to:\n1. **Observe and describe** how light from a source travels and creates shadows on surfaces.\n2. **Explain** what happens when light hits transparent, translucent, and opaque objects using evidence from observations.\n3. **Predict** where shadows will appear when a light source and object positions change.\n4. **Design and test** their own shadow scenes using household materials and a light source.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed photograph (or display on screen)\n- Classroom lamp or flashlight (keep hidden initially)\n- Chart paper and markers\n\n**Activity:**\n\n**Display the Photograph:**\nShow students the image of the red flowers in a vase on the table with the hanging lamp visible in the background. Ask them to look carefully without touching anything.\n\n**Discussion Questions (ask one at a time, allowing think-pair-share time):**\n1. \"What is the brightest thing you see in this picture? Where is the light coming from?\"\n2. \"Do you see a shadow? Can you point to where the flower shadows might be on the table or wall?\"\n3. \"Why do you think we can see the red flowers so clearly? What is making them bright?\"\n4. \"If we turned off that lamp above the flowers, what would happen to the shadows?\"\n\n**Wonder Prompt:**\n\"I wonder... if we moved the lamp closer to the flowers, would the shadow look bigger or smaller? Let's investigate!\"\n\n**Transition:** \nNow we're going to be shadow detectives and explore how light and shadows work together using our own light sources and objects.\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- One flashlight or desk lamp per pair/small group\n- Various objects: paper flowers, clear plastic cups, milk jugs, cardboard, translucent plastic, opaque blocks\n- White paper or large white poster board (one per group)\n- Tape\n- Student observation sheets (see below)\n\n**Activity:**\n\n**Setup (Teacher):**\nBefore the lesson, tape large white paper to a wall or place it upright on a table. This will be the \"shadow screen.\" Darken one corner of the classroom slightly (or use a cardboard screen to create a darker area).\n\n**Student Directions:**\n\n1. **Station Setup:** In pairs or small groups, position your white paper as a screen. Place your flashlight 12 inches away from the paper, pointing toward it. (Teacher demonstrates this first.)\n\n2. **Explore Transparent Objects:** Hold a clear plastic cup between the flashlight and the paper. What happens to the shadow? Record what you see on your observation sheet (draw or write).\n\n3. **Explore Opaque Objects:** Hold a solid cardboard block in front of the light. Compare the shadow to the cup shadow. Is it darker? Sharper? Write or draw your observations.\n\n4. **Explore the Flower:** Hold a paper flower (or real stem if available) in front of the light. What kind of shadow does it make? Where are the thin parts of the shadow?\n\n5. **Move the Light:** Keep the object still. Move the flashlight closer to the object, then farther away. How does the shadow change? Draw what happens.\n\n6. **Move the Object:** Keep the light still. Move the object closer to the light, then to the screen. Predict what will happen to the shadow size before you move it. Were you right?\n\n**Student Observation Sheet Template:**\n```\nSHADOW EXPLORERS RECORD SHEET\nWhat object are we testing? _______________\nDrawing of the shadow we see:\n[Space for drawing]\n\nWhat we noticed:\n- The shadow is (dark/light) _____________\n- The shadow is (sharp/blurry) ___________\n- When we moved the light closer, the shadow got (bigger/smaller)\n- When we moved the object closer to the light, the shadow got (bigger/smaller)\n```\n\n**Teacher Role:**\n- Circulate between groups asking guiding questions: \"What happened when you moved the light? Can you see through that shadow? Why is this shadow darker than that one?\"\n- Resist explaining *why*—let students discover through trial and error.\n- Ensure all students get a turn manipulating the light and objects.\n- Prompt students to make predictions before each change.\n\n**Expected Student Outcomes:**\n- Students will observe and record that **opaque objects make darker, sharper shadows** while **transparent objects make lighter, faint shadows**.\n- Students will discover that **moving the light source closer makes the shadow larger**; moving it farther makes it smaller.\n- Students will notice that **shadows appear on the surface opposite the light source**.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper and markers\n- Photograph displayed again\n- Visual aids (diagrams of light rays, labeled diagram of transparent/opaque)\n- Student vocabulary cards (optional)\n\n**Activity:**\n\n**Group Share-Out:**\nBring the whole class together. Ask 3-4 groups to share one discovery from their shadow experiments. Record their observations on chart paper using bullet points. (Example: \"When we moved the light closer, the shadow got BIGGER!\")\n\n**Teacher Mini-Lesson (5-7 minutes):**\n\n\"Great observations, scientists! Now I'm going to explain *why* shadows happen using what you discovered.\n\n**Light is energy that travels in straight lines from a source**—like our flashlight or the lamp in the photograph. When light hits an object, it can't go through (if it's opaque), so the light stops. Behind that object, there's no light hitting the surface—that's called a **shadow**.\n\nLet me show you: [Point to the classroom lamp.] The light travels down in straight lines. When it hits the flower stems, the light can't go through them because they're opaque—solid. So the light creates a dark spot on the table. That's the shadow!\n\nNow look at the vase in the photo. It's clear glass—**transparent**. Light passes right through it! So we see the water and stems through it, and the shadow is very faint or you might not see it at all.\"\n\n**Key Vocabulary:**\n\n1. **Light Source:** Anything that makes light and sends it out in all directions (like a lamp, flashlight, or the sun).\n   \n2. **Light Energy:** The thing that travels from a light source and lets us see. It's a form of energy.\n\n3. **Shadow:** A dark area created when an object blocks light from reaching a surface.\n\n4. **Opaque:** A material that light cannot pass through (solid, blocks light completely). Example: paper, cardboard, flowers.\n\n5. **Transparent:** A material that light can pass through easily, so we can see through it clearly. Example: clear glass, clear plastic.\n\n**Connection Back to Photograph and Explore Activity:**\n\"Remember the red flowers in our photograph? The lamp above creates light that hits the flowers. The flower stems are opaque—the light can't go through them. That's why we see a dark shadow below the flowers on the table. The glass vase is transparent, so light goes right through it and we see the water clearly. When we did our shadow activity with the flashlight, the same thing happened with our cup and cardboard—the cup is transparent, the cardboard is opaque!\"\n\n**Check for Understanding:**\nAsk students to hold up a \"thumbs up, thumbs sideways, or thumbs down\" to show if they understand. Ask clarifying questions:\n- \"If I shine a light on a clear plastic bag, will it make a shadow?\" (Yes, but it might be faint.)\n- \"What happens if I put opaque paper in front of light?\" (The shadow gets dark and clear.)\n\n**Expected Student Outcomes:**\nStudents will understand that **light travels from a source, shadows form when light is blocked, and different materials let different amounts of light through**.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Materials from Explore phase (flashlights, objects)\n- Extra materials: colored tissue paper, string, clay, additional flowers or plant materials\n- White paper screens\n- Challenge prompt cards (see below)\n\n**Activity:**\n\n**Creative Shadow Scene Challenge:**\n\nStudents return to their groups with this challenge: \"Create your own shadow scene using light and objects. You can make a picture, a shape, or tell a story with shadows. You decide!\"\n\n**Teacher Provides Example Scenarios (read aloud or on cards):**\n- \"Create a shadow picture of a butterfly. What objects could you use?\"\n- \"Make a shadow of a house or building. Which objects are opaque? Which are transparent?\"\n- \"Design a shadow creature—what shapes can you make?\"\n\n**Student Process:**\n1. Plan what you want to create (draw or describe it).\n2. Gather your objects and arrange them in front of the light.\n3. Adjust the light distance and object positions to match your plan.\n4. When it looks right, trace or draw the shadow shape you created.\n5. Explain to a partner: \"Why did I use opaque objects here? Why transparent there?\"\n\n**Teacher Role:**\n- Ask open-ended questions: \"What would happen if you used more transparent objects? What if you added this material?\"\n- Encourage students to think about whether they need light to block or light to pass through for their design.\n- Take photos or let students photograph their shadow scenes with a camera/phone.\n\n**Expected Student Outcomes:**\nStudents will **apply knowledge of transparent and opaque materials to intentionally design shadow scenes**, demonstrating understanding that **light behavior changes based on what it hits**.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation Sheets** (Explore phase): Check that students record predictions and observations about shadow size and sharpness.\n- **Group Discussions**: Listen for students using terms like \"shadow,\" \"light,\" \"dark,\" and descriptions of what happened (e.g., \"It got bigger\").\n- **Check-for-Understanding Thumbs** (Explain phase): Note which students showed confidence and which need review.\n\n**Exit Ticket (Summative Assessment):**\n\nProvide each student with a simple exit ticket (printed or drawn on paper). Ask:\n\n**Question 1 (Multiple Choice with Pictures):**\n\"Which object will make the DARKEST shadow?\" \n- Show pictures: A) clear plastic cup  B) cardboard block  C) tissue paper\n*Expected answer: B (opaque, solid)*\n\n**Question 2 (Drawing):**\n\"Draw where a shadow would be if I put this cup in front of a light that's shining down on a table.\"\n[Picture of light source and cup provided]\n*Expected: Shadow drawn below/behind the cup on the table surface*\n\n**Question 3 (Short Answer—student writes or tells teacher):**\n\"Why can we see the red flowers so clearly in the photograph? What do you think the light is doing?\"\n*Expected answer pattern: \"The light from the lamp is hitting the flowers so we can see them\" OR \"Light is shining on them\" OR similar cause-and-effect explanation*\n\n**Success Criteria:**\n- ✓ Student correctly identifies opaque objects as making darker shadows\n- ✓ Student can draw or describe where a shadow appears (on the opposite side of the light source)\n- ✓ Student uses at least one vocabulary word (light, shadow, opaque, transparent) appropriately\n- ✓ Student makes a prediction about light/shadow behavior and tests it\n\n**Expected Student Outcomes:**\nStudents who meet 3/4 success criteria have mastered the learning objectives. Students who meet all 4 demonstrate secure understanding ready for elaboration in future lessons.\n\n---\n\n## Differentiation\n\n### Support (Struggling Learners)\n\n1. **Simplified Vocabulary:** Pre-teach \"light,\" \"shadow,\" and \"block\" with visual demonstrations before the main lesson. Use only these three terms in early phases; introduce \"opaque\" and \"transparent\" later.\n\n2. **Guided Exploration:** Instead of open exploration, provide a structured protocol for struggling learners. Call them to a \"guided discovery station\" where you walk through the Explore activity step-by-step with them, asking predictive questions and helping record observations.\n\n3. **Sentence Frames for Explanation:** Provide frames like \"When the light is close, the shadow is ___.\" or \"The _____ blocks the light.\" so students can complete thoughts rather than generating original language.\n\n---\n\n### Challenge (Advanced Learners)\n\n1. **Layered Materials Investigation:** Ask advanced students to explore what happens when they layer two transparent objects (two cups, plastic over tissue) or combine transparent and opaque (cup in front of cardboard). Can they predict and explain the results?\n\n2. **Shadow Size Measurement:** Provide rulers and ask students to measure shadow size at different light distances. Can they find a pattern? (Shadow size increases as light gets closer.) Create a simple data table or graph.\n\n3. **Real-World Application Design:** Challenge students to explain how shadows in the school building are created (windows, lamps, sunlight). Ask them to sketch and label light sources and shadows in a classroom corner or hallway, labeling what's opaque/transparent.\n\n---\n\n## Extension Activities\n\n1. **Outdoor Shadow Hunt (Homework/Later Lesson):**\nStudents go outside with a camera or sketchpad and find 3 shadows created by the sun. They draw or photograph each one and label: \"What is making this shadow?\" and \"Where is the light coming from?\" Bring findings back to share.\n\n2. **Shadow Theater Performance:**\nOver 2-3 days, students create a short shadow puppet show using light, opaque cutouts, and a white screen. They write a simple script and perform for another class. (Deepens understanding of how light/opaque objects interact to create effects.)\n\n3. **Flower Light Experiment (Connection to Growth):**\nIf extending into life science, students can investigate: \"Do flowers (in vases with different light exposure) look different?\" Place flowers in a sunny window, a dimly lit corner, and a dark closet for 2-3 days. Observe and compare color, drooping, and freshness. Discuss: \"How does light affect living things?\" (Bridges to life science but rooted in physical science light observations.)\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety:** Ensure flashlights are cool before handling. If using a lamp, keep it away from water and check cords for safety.\n- **Timing:** If students are highly engaged in Explore, you can extend that phase and shorten Elaborate—shadow exploration is naturally compelling.\n- **Darkening the Space:** Closing blinds or using a cardboard \"cave\" significantly improves shadow visibility and student focus.\n- **Real Flowers:** If using the actual red flowers from the photograph, students see the real-world connection immediately. Otherwise, paper flowers work fine.\n- **Assessment Flexibility:** Students who struggle with writing can draw their exit ticket responses or explain verbally to you or a partner.\n\nThis lesson directly uses the photograph as an authentic, relatable anchor for abstract physical science concepts about light, energy, and shadows—making it concrete and discoverable for Third Grade learners.",
  "inputTokens": 2376,
  "outputTokens": 3882,
  "cost": 0.021786,
  "generatedAt": "2026-02-13T00:05:55.695Z"
}