{
  "title": "Friction",
  "category": "physical-science",
  "imageFile": "p28.jpg",
  "imagePath": "images/physical-science/p28.jpg",
  "content": "# NGSS Engineering Design Process Challenge: Light Rail Transit System\n\n### Visible Elements in Photo\n\n- Modern electric light rail train (Metro brand) with articulated passenger cars\n- Steel overhead electrical lines and support poles (catenary system)\n- Pantograph arm connecting train roof to overhead wires\n- Concrete track bed/platform surface\n- Urban/industrial setting with fencing and vegetation in background\n\n### Reasonable Inferences\n\n1. **From overhead wires & pantograph arm** – The train requires a continuous, elevated power source delivered through a sliding contact point; this means the pantograph must maintain consistent contact while the train moves freely along the track.\n\n2. **From articulated car design** – The train's flexible middle section allows it to turn corners and navigate curves while remaining stable; weight distribution and flexible joints are critical to safe operation.\n\n3. **From track bed infrastructure** – The system requires fixed, level pathways; the train's wheels must follow a precise route, suggesting alignment and rail geometry are fundamental to the design.\n\n### Engineering Task\n\n**K-2 Version:**\nBuild a train that gets power from a wire above it. Use a string stretched between two chairs or desks as your \"power line.\" Design a small car (use a block, cup, or cardboard tube) with a stick or straw touching the string. Can you pull your car along the ground while the stick stays touching the string the whole way?\n\n**3-5 Version:**\nDesign a model overhead power delivery system (catenary system) for a train that must:\n- Maintain contact between a pantograph arm and an overhead wire as the train moves at least 2 meters in a straight line\n- Support the weight of a 500-gram load on the train car without the wire sagging more than 2 centimeters\n- Navigate a 30-degree curve without losing electrical contact\n- Use only string/wire, tape, wooden dowels or straws, and a small cardboard or foam car\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows an *existing real-world solution* (the light rail system) to an unstated transportation and power-delivery problem. Students must first identify the challenge: \"How do we power a moving vehicle without dragging heavy cables?\" This contextual understanding makes the design task meaningful, not arbitrary.\n\n### Suggested Materials\n\n- String, fishing line, or electrical wire (for overhead lines and pantograph)\n- Wooden dowels, plastic straws, or coat hangers (for pantograph arm and support poles)\n- Cardboard tubes, foam blocks, or small wood blocks (for train car body)\n- Tape (masking, electrical, or duct) and fasteners\n- Small wheels or casters (optional, for smooth rolling)\n\n### Estimated Time\n\n**K-2:** 30–40 minutes (design, build, test contact along one straight path)\n\n**3-5:** 60–90 minutes (planning overhead geometry, building pantograph mechanism, testing multiple scenarios, refining alignment)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A (Defining Engineering Problems)** by having students identify constraints (weight, contact, movement) and criteria (continuous power delivery, structural integrity) from a real infrastructure system before building a solution.",
  "inputTokens": 1803,
  "outputTokens": 729,
  "cost": 0.005448,
  "generatedAt": "2026-02-09T13:29:05.196Z"
}