{
  "id": 67,
  "title": "Friction",
  "category": "physical-science",
  "imageFile": "p28.jpg",
  "content": "## 📸 Photo Description\n\nThis photo shows a modern light rail train, also known as a streetcar or trolley. The train is silver and dark gray with large windows. It is on a set of rails, likely in a city. On the front of the train, there is a logo that says \"METRO\" with a red and blue design. The train is connected to overhead power lines via a device called a pantograph. The train appears to be on a road or a dedicated track, with utility poles and trees in the background. The sky is overcast.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the use of electricity to power a vehicle. The train is a form of public transportation that runs on electricity. The overhead power lines supply electrical energy to the train. This energy is converted into mechanical energy by an electric motor, which turns the wheels and makes the train move. This is a form of energy transfer. The train is an example of a technology that helps people get to places without needing to use a car.\n\n## 📚 Core Concepts\n\n1\\. **Electricity:** A form of energy that can power machines and devices.  \n2\\. **Energy Transfer:** The process of converting one form of energy into another. In this case, electrical energy is converted into mechanical energy.  \n3\\. **Transportation Technology:** The use of machines and systems to move people and goods from one place to another.\n\n<pedagogical-tip>  \nUse the image to spark a discussion about different ways people get around. Ask students to name other forms of transportation they know. Then, compare and contrast the train with other modes like walking, biking, cars, and buses. Discuss the pros and cons of each, focusing on energy use and environmental impact. This helps students connect science to their everyday lives.  \n</pedagogical-tip>\n\n<udl-suggestions>  \n\\- **Visual Aids:** Provide pictures or diagrams of how the train works, including the overhead wires and the motor.  \n\\- **Hands-On Activity:** Build a simple model of a train using a battery, a motor, and wheels. This allows students to see how electricity can make something move.  \n\\- **Multimodal Learning:** Watch a video of a train in motion and discuss the sound and movement.  \n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n\\- [[NGSS:DCI:3-5-ETS1.A]]: Define a simple design problem requiring a solution that includes specified criteria and constraints.  \n\\- [[NGSS:DCI:3-5-PS3.A]]: Define the structure of a system to determine how energy is transferred.  \n\\- [[NGSS:DCI:3-5-PS3.B]]: Use models to describe how energy can be transferred from one place to another.  \n\\- [[NGSS:CCC:Energy]]: Energy can be transferred in different ways and between different objects.  \n\\- [[NGSS:CCC:Systems and System Models]]: Understanding how a system works, like a train, helps us understand its parts and how they work together.\n\n## 💬 Discussion Questions\n\n1\\. How do you think the train moves? (Bloom's: Understand) (DOK: 1)  \n2\\. What kind of energy does the train use? (Bloom's: Remember) (DOK: 1)  \n3\\. Why do you think the train has wires above it? (Bloom's: Analyze) (DOK: 2)  \n4\\. How is the train different from a car? (Bloom's: Compare) (DOK: 2)\n\n## 📖 Vocabulary\n\n\\- **Electricity:** A form of energy that flows through wires and powers devices.  \n\\- **Energy:** The ability to do work or cause change.  \n\\- **Motor:** A device that uses electricity to make something move.  \n\\- **Transportation:** The movement of people or goods from one place to another.  \n\\- **Technology:** Tools and machines that help people do things.\n\n## 🌡️ Extension Activities\n\n\\- Research different types of public transportation in your city or town.  \n\\- Draw a picture of a train and label the parts that make it move.  \n\\- Discuss how trains help reduce pollution compared to cars.  \n\\- Build a simple circuit to power a small motor.",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThe photo shows two people pushing a heavy object, like a box or crate, across a smooth floor. The people are using their hands and bodies to apply force to the object, causing it to move. The floor appears to be made of a slick material, like tile or linoleum.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific concept demonstrated in this photo is friction. Friction is the force that acts between two surfaces when they slide or try to slide across each other. In this case, the smooth floor surface creates less friction than a rougher surface would, making it easier for the people to push the heavy object across the floor.\n\n## 📚 Core Science Concepts\n\n1. **Friction:** The force that acts between two surfaces when they slide or try to slide across each other.\n2. **Force:** A push or pull that can cause an object to change its speed, shape, or direction.\n3. **Motion:** The act of moving or changing position.\n\n<pedagogical-tip>\nTo teach these concepts to Kindergarten students, focus on hands-on, interactive activities. Encourage students to push and pull objects on different surfaces, such as a smooth table and a rougher carpet. Ask them to describe how much effort is required to move the objects on each surface. This will help them understand the role of friction in making it easier or harder to move objects.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide images or videos of objects moving on different surfaces to help students visualize the concept of friction.\n- **Kinesthetic Learning:** Allow students to physically explore pushing and pulling objects on different surfaces, such as a tabletop and a carpeted floor.\n- **Multimodal Instruction:** Combine visual, auditory, and kinesthetic activities to reinforce the concept of friction and its effects on motion.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-PS2-1]] - Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object.\n- [[NGSS:CCC:Cause and Effect]] - Events have causes that generate observable patterns.\n- [[NGSS:CCC:Patterns]] - Patterns in the natural and human-designed world can be observed, used to describe phenomena, and used as evidence.\n\n## 💬 Discussion Questions\n\n1. What do you think is happening in the photo? (Bloom's: Remembering, DOK: 1)\n2. Why do you think it's easier for the people to push the object across the smooth floor? (Bloom's: Understanding, DOK: 2)\n3. Can you think of other surfaces that might be easier or harder to push an object across? (Bloom's: Applying, DOK: 2)\n4. How could you test which surface has more friction? (Bloom's: Analyzing, DOK: 3)\n\n## 📖 Vocabulary\n\n- **Friction:** The force that acts between two surfaces when they slide or try to slide across each other.\n- **Force:** A push or pull that can cause an object to change its speed, shape, or direction.\n- **Motion:** The act of moving or changing position.\n- **Surface:** The outside or top layer of an object.\n- **Smooth:** Having a flat, even, or unbroken surface.\n- **Rough:** Having an uneven or bumpy surface.\n\n## 🌡️ Extension Activities\n\n1. Conduct a \"friction experiment\" by having students push various objects (e.g., books, toys, balls) across different surfaces (e.g., carpet, tile, wood) and compare the effort required.\n2. Create a ramp and test how different surfaces affect the speed of a rolling object, such as a ball or car.\n3. Explore how adding materials (e.g., sandpaper, foam) to the surface can change the amount of friction.",
    "grade1": "## 📸 Photo Description\n\nThe photo shows two people sliding down a snowy hill on a sled. The sled is made of plastic and has a curved design to help it glide smoothly over the snow. The people are bundled up in warm winter clothes like hats, scarves, and jackets. The background is a snow-covered landscape with trees and mountains in the distance.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific concept demonstrated in this photo is friction. Friction is the force that opposes the movement of one surface sliding against another. As the sled slides down the snowy hill, there is friction between the sled and the snow. This friction creates a force that slows down the sled's movement.\n\n## 📚 Core Science Concepts\n\n1. **Friction:** The force that opposes the movement of one surface sliding against another.\n2. **Gravity:** The force that pulls objects towards the Earth's center.\n3. **Motion:** The change in an object's position over time.\n\n<pedagogical-tip>\nTo teach this concept to first-graders, encourage hands-on exploration and demonstrations. You can have students slide different objects (such as a book, a toy car, and a sled) down a ramp and observe how the friction affects their movement. This will help them understand the role of friction in motion. Additionally, you can discuss how friction can be both helpful (e.g., in braking a bike) and not-so-helpful (e.g., when trying to slide on snow).\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Use images, diagrams, or videos to illustrate the concept of friction and how it affects the movement of the sled.\n- **Tactile Experiences:** Provide opportunities for students to feel different surfaces and explore how friction varies between them.\n- **Multimodal Learning:** Incorporate physical demonstrations, hands-on activities, and discussions to engage students in the learning process.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-PS2-1]] Plan and conduct investigations to provide evidence that vibrating materials can make sound and that sound can make materials vibrate.\n- [[NGSS:DCI:1-PS2-2]] Predict the effect of a force (such as friction) on the motion of an object.\n- [[NGSS:CCC:Cause and Effect]] Events have causes that generate observable patterns.\n\n## 💬 Discussion Questions\n\n1. What is the force that is slowing down the sled as it slides down the hill? (Bloom's: Remember) (DOK: 1)\n2. How do you think the friction between the sled and the snow changes if the sled is going faster or slower? (Bloom's: Analyze) (DOK: 2)\n3. Can you think of other examples where friction is helpful or not helpful? (Bloom's: Apply) (DOK: 2)\n4. How does the shape of the sled affect how it slides down the hill? (Bloom's: Evaluate) (DOK: 3)\n\n## 📖 Vocabulary\n\n- **Friction:** The force that opposes the movement of one surface sliding against another.\n- **Gravity:** The force that pulls objects towards the Earth's center.\n- **Motion:** The change in an object's position over time.\n- **Surface:** The outside or top layer of an object.\n- **Slope:** The incline or angle of a surface.\n- **Momentum:** The quantity of motion an object has, which depends on its mass and speed.\n\n## 🌡️ Extension Activities\n\n- Experiment with different materials (e.g., sandpaper, plastic, wood) to see how they affect the friction and motion of a sled.\n- Investigate how the slope of a hill affects the speed and motion of a sled.\n- Design a sled that minimizes friction to travel down a hill as fast as possible.\n- Explore real-world examples of friction, such as in braking systems or tires on a car.",
    "grade2": "## 📸 Photo Description\n\nThe photo shows two people sliding a heavy box across a smooth, flat surface. The box appears to be made of wood or cardboard and is being pushed by one person while the other person is guiding it. The surface they are sliding the box on looks like a hardwood floor or a tile floor.\n\n## 🔬 Scientific Phenomena\n\nThe photo demonstrates the concept of friction. Friction is the force that resists the movement of one surface sliding against another. As the box is being pushed across the floor, the friction between the box and the floor surface slows down the movement of the box. The smoother the surface, the less friction there is, making it easier to slide the box.\n\n## 📚 Core Science Concepts\n\n1. **Friction:** The force that resists the movement of one surface sliding against another.\n2. **Force:** A push or pull that can cause an object to move, stop, or change direction.\n3. **Surface Interaction:** The way in which two surfaces interact with each other, affecting the amount of friction.\n\n<pedagogical-tip>\nEncourage students to observe the motion of the box and how the friction affects it. Have them experiment by sliding different objects, such as books or toys, across a variety of surfaces (e.g., carpet, hardwood, tile) to see how the surface affects the amount of friction. This hands-on exploration will help them better understand the concept of friction.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide images or diagrams of different surfaces and their relative friction levels.\n- **Kinesthetic Learning:** Allow students to physically manipulate objects and surfaces to experience friction firsthand.\n- **Multimodal Presentation:** Combine visual, auditory, and kinesthetic elements when explaining the concept of friction.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1-A]]: Different kinds of matter exist and many of them can be either solid or liquid, depending on temperature.\n- [[NGSS:DCI:2-PS1-B]]: Different properties are suited to different purposes.\n- [[NGSS:CCC:Cause and Effect]]: Events have causes that generate observable patterns.\n\n## 💬 Discussion Questions\n\n1. What do you notice happening to the box as it is being pushed across the floor? (Bloom's: Observe) (DOK: 1)\n2. How do you think the surface of the floor affects the movement of the box? (Bloom's: Analyze) (DOK: 2)\n3. Can you think of other examples in your daily life where you experience friction? (Bloom's: Apply) (DOK: 2)\n4. How could you make it easier or harder to move the box across the floor? (Bloom's: Evaluate) (DOK: 3)\n\n## 📖 Vocabulary\n\n- **Friction:** The force that resists the movement of one surface sliding against another.\n- **Force:** A push or pull that can cause an object to move, stop, or change direction.\n- **Surface:** The outer layer or boundary of an object.\n- **Interact:** When two or more things have an effect on each other.\n- **Resist:** To oppose or hold back the movement or action of something.\n- **Slide:** To move smoothly and easily over a surface.\n\n## 🌡️ Extension Activities\n\n1. Conduct a \"friction investigation\" where students test different materials and surfaces to see how they affect the movement of objects.\n2. Create a simple ramp and have students experiment with different surfaces to see how they affect the speed of a rolling object.\n3. Discuss how friction is used in everyday life, such as in brakes, tires, and shoes, and how it helps us move and stay safe.",
    "grade3": "## 📸 Photo Description\n\nThe photo shows two people pushing a large, heavy box across a smooth, tiled floor. The box appears to be made of wood or a similar material. The people are exerting force to move the box, but it is sliding slowly across the floor.\n\n## 🔬 Scientific Phenomena\n\nThis photo demonstrates the concept of friction. Friction is the force that opposes the relative motion between two surfaces in contact. In this case, the smooth floor and the bottom of the heavy box create a small amount of friction, making it difficult for the people to push the box easily. Friction can either help or hinder movement, depending on the situation.\n\n## 📚 Core Science Concepts\n\n1. **Friction:** The force that opposes the relative motion between two surfaces in contact.\n2. **Force:** A push or pull that can cause an object to move, stop, or change direction.\n3. **Work:** The transfer of energy when a force is applied to an object, causing it to move.\n\n<pedagogical-tip>\nEncourage students to observe the scene and think about what's happening. Ask them to consider how they could make the box easier to move. This will help them understand the concept of friction and how it can be reduced or increased. Hands-on activities, such as pushing different objects across various surfaces, can further reinforce the understanding of friction.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide images or diagrams that show the forces acting on the box and the concept of friction.\n- **Kinesthetic Learning:** Allow students to physically push and slide objects across different surfaces to experience the effects of friction.\n- **Differentiated Instruction:** Provide opportunities for students to explore friction using objects and surfaces of varying textures and weights, catering to different learning styles and abilities.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-PS2-1]] Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object.\n- [[NGSS:DCI:3-PS2-2]] Make observations and/or measurements of an object's motion to provide evidence of a pattern or a cause and effect relationship.\n- [[NGSS:CCC:Cause and Effect]] Cause and effect relationships may be used to predict phenomena in natural or designed systems.\n\n## 💬 Discussion Questions\n\n1. What do you think is happening in the photo? (Bloom's: Understand, DOK: 1)\n2. How do you think the people could make the box easier to move? (Bloom's: Analyze, DOK: 2)\n3. What would happen if the floor was rougher or had a different surface? (Bloom's: Evaluate, DOK: 3)\n4. Can you think of other examples in your daily life where friction plays a role? (Bloom's: Apply, DOK: 2)\n\n## 📖 Vocabulary\n\n- **Friction:** The force that opposes the relative motion between two surfaces in contact.\n- **Force:** A push or pull that can cause an object to move, stop, or change direction.\n- **Motion:** The act of moving or changing position.\n- **Surface:** The outer or uppermost layer of an object.\n- **Work:** The transfer of energy when a force is applied to an object, causing it to move.\n\n## 🌡️ Extension Activities\n\n1. Conduct a hands-on investigation where students push or pull objects across different surfaces (e.g., carpet, wood, tile) and observe the effects of friction.\n2. Explore ways to reduce friction, such as using wheels or lubricants, and compare the ease of movement.\n3. Design and build a simple machine, such as a pulley or lever, to help move a heavy object with less force.",
    "grade4": "## 📸 Photo Description\n\nThe photo shows two people pushing a heavy wooden block across a wooden floor. There are visible lines or grooves on the floor, indicating that the block is sliding across the surface.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific concept illustrated in this photo is friction. Friction is the force that opposes the motion of two surfaces sliding against each other. As the people push the wooden block, it experiences friction with the floor, which creates a force that slows down or resists the motion of the block. Friction is an important force in our everyday lives, affecting how objects move and interact with different surfaces.\n\n## 📚 Core Science Concepts\n\n1. **Friction**: The force that opposes the motion of two surfaces sliding against each other.\n2. **Forces**: Pushes or pulls that can cause an object to change its motion or shape.\n3. **Energy**: The ability to do work or cause change, which can be transferred from one form to another.\n\n<pedagogical-tip>\nEncourage students to explore the concept of friction through hands-on activities. For example, have them try pushing objects across different surfaces, such as wood, carpet, and tile, and observe how the friction changes. This will help them understand the relationship between the surfaces and the force of friction. Additionally, you can ask students to predict how changing the weight of the object or the surface material would affect the amount of friction.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Provide diagrams or models that illustrate the concept of friction and how it affects the motion of objects.\n- **Kinesthetic Learning**: Incorporate activities that allow students to physically experience friction, such as sliding objects across different surfaces or using sandpaper to create friction.\n- **Multimodal Instruction**: Combine visual, auditory, and kinesthetic learning opportunities to reinforce the understanding of friction.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-PS3-1]]: Use evidence to construct an explanation relating the speed of an object to the energy of that object.\n- [[NGSS:DCI:4-PS3-2]]: Make observations to provide evidence that energy can be transferred from place to place by sound, light, heat, and electric currents.\n- [[NGSS:CCC:Cause and Effect]]: Cause-and-effect relationships are routinely identified, tested, and used to explain change.\n\n## 💬 Discussion Questions\n\n1. What do you think is happening in this photo? (Bloom's: Understand, DOK: 1)\n2. How do you think the friction between the wooden block and the floor is affecting the motion of the block? (Bloom's: Analyze, DOK: 2)\n3. What would happen if the floor was made of a different material, like smooth tile or rough sandpaper? (Bloom's: Evaluate, DOK: 3)\n4. How could you design an experiment to test the effects of friction on the motion of an object? (Bloom's: Create, DOK: 4)\n\n## 📖 Vocabulary\n\n1. **Friction**: The force that opposes the motion of two surfaces sliding against each other.\n2. **Force**: A push or pull that can cause an object to change its motion or shape.\n3. **Motion**: The act or process of moving or changing position.\n4. **Energy**: The ability to do work or cause change.\n5. **Surface**: The outer layer or boundary of an object.\n6. **Resistance**: The opposition to the passage or flow of something.\n\n## 🌡️ Extension Activities\n\n1. Investigate how friction affects the motion of objects on different surfaces, such as wood, metal, or sand. Have students design and conduct experiments to test their hypotheses.\n2. Explore how friction can be reduced or increased, and discuss the practical applications of controlling friction (e.g., brakes, tires, lubricants).\n3. Discuss the role of friction in everyday life, such as how it affects the way we walk, the operation of machines, or the design of transportation systems.",
    "grade5": "## 📸 Photo Description\n\nThe photo shows two objects sliding against each other on a surface. One object is a metal block, and the other is a wooden block. The metal block is being pushed across a wooden surface, creating friction between the two materials.\n\n## 🔬 Scientific Phenomena\n\nThe photo demonstrates the concept of friction, which is the force that opposes the motion of two surfaces as they slide against each other. Friction is a result of the roughness or unevenness of the surfaces in contact. As the metal block slides across the wooden surface, the tiny bumps and ridges on the surfaces create a force that slows down the motion of the block.\n\n## 📚 Core Science Concepts\n\n1. **Friction**: The force that opposes the motion of two surfaces sliding against each other.\n2. **Force**: A push or pull that can cause an object to change its speed, direction, or shape.\n3. **Energy**: The ability to do work or cause change, which can be converted from one form to another.\n\n<pedagogical-tip>\nEncourage students to observe the photo closely and ask them to describe what they see happening. Prompt them to think about why the metal block is slowing down as it slides across the surface. This will help them understand the concept of friction and how it affects the movement of objects.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Provide additional images or diagrams that demonstrate the concept of friction, such as a person pushing a heavy object or a car sliding on a wet road.\n- **Hands-on Activities**: Allow students to experiment with friction by having them slide different objects across various surfaces and observe the differences in how they move.\n- **Collaborative Learning**: Encourage students to work in pairs or small groups to explore the concept of friction and share their findings with the class.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-PS2.B]]: The gravitational force of Earth acting on an object near Earth's surface pulls that object toward the planet's center.\n- [[NGSS:DCI:3-PS2.A]]: Forces and motion can be experienced in everyday life. The motion of an object can be described by its speed and the direction in which it is moving.\n- [[NGSS:CCC:Cause and Effect]]: Cause-and-effect relationships are routinely identified, tested, and used to explain change.\n\n## 💬 Discussion Questions\n\n1. What is happening in the photo? (Bloom's: Remember) (DOK: 1)\n2. Why do you think the metal block is slowing down as it slides across the surface? (Bloom's: Analyze) (DOK: 2)\n3. How does the friction between the two surfaces affect the motion of the block? (Bloom's: Understand) (DOK: 2)\n4. What other examples of friction can you think of in your everyday life? (Bloom's: Apply) (DOK: 3)\n\n## 📖 Vocabulary\n\n1. **Friction**: The force that opposes the motion of two surfaces sliding against each other.\n2. **Force**: A push or pull that can cause an object to change its speed, direction, or shape.\n3. **Motion**: The act of moving or changing position.\n4. **Surface**: The outside or top layer of an object or material.\n5. **Energy**: The ability to do work or cause change, which can be converted from one form to another.\n6. **Gravity**: The force that attracts objects with mass towards each other.\n\n## 🌡️ Extension Activities\n\n1. Conduct experiments to investigate the effects of different materials and surfaces on the amount of friction.\n2. Explore how the shape and weight of an object can affect the amount of friction it experiences.\n3. Investigate the role of friction in everyday activities, such as walking, riding a bicycle, or using a zipper."
  }
}