{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "imagePath": "images/physical-science/p30.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Waves, Water, and Pushing Forces at the Beach\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Pushing forces:** Waves are large bodies of water being pushed by wind and energy, creating movement and motion.\n- **Motion and direction:** Water moves in different directions—upward, forward, and splashing—showing how forces change the direction of objects.\n- **Energy transfer:** Sunlight creates energy that warms the water and sand, and wave energy causes water to crash and move.\n- **Properties of materials:** Water is a liquid that can splash, spray, and move; rocks are solid and stay in place even when water pushes against them.\n\n---\n\n## Lesson Title\n\n**Splashing Waves: Pushing Water at the Beach**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total)\n- **NGSS Standards:** \n  - K-PS2-1 (Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object)\n  - K-PS3-1 (Make observations to determine the effect of sunlight on Earth's surface)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** how pushing forces make water move and splash.\n2. **Compare** the effects of strong and gentle pushes on water movement.\n3. **Predict** what will happen when they push water with different amounts of force.\n4. **Identify** rocks and sand as materials that stay still even when water pushes them.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or projected photograph of waves crashing on rocks\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or printed poster at student eye level. Allow 30 seconds of silent looking time.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you see happening to the water in this picture?\" (Encourage: splashing, moving, going up in the air)\n   - \"What do you think is pushing that water so high?\" (Answers might include: wind, the ocean, the rocks)\n   - \"Have you ever felt water splash on you? Where? How did it feel?\" (Build on beach or bathtub experiences)\n   - \"Do you think those big black rocks are moving? Why or why not?\" (Guide toward: rocks are too heavy/strong)\n\n3. **Wonder prompt:** \"I wonder what would happen if we could make our own splashing water. Let's try pushing water like the ocean does!\"\n\n4. **Record students' predictions** on chart paper: \"How will the water move if we push it?\" Keep this visible for later comparison.\n\n**Transition:** Now we're going to create our own splashing waves using water and containers, just like the ocean is doing in this picture!\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- 4-5 shallow plastic bins or trays (one per small group)\n- Water (pre-filled bins to avoid spill time; fill to 3-4 inches)\n- Large spoons or wooden dowels\n- Small plastic cups\n- Towels for spill cleanup\n- Optional: food coloring (one color per group for visibility)\n- Aprons or old shirts for students\n\n**Activity:**\n\n1. **Organize students into small groups** (3-4 per bin). Assign one \"water pusher\" to start; others observe and then rotate.\n\n2. **Give clear student directions:**\n   - \"Put on your apron to stay dry.\"\n   - \"Stand around the water bin, but don't touch the water yet.\"\n   - \"One person will use the spoon to push the water gently—just a little push. Watch what happens.\"\n   - \"Now, try a bigger, stronger push with the spoon. What's different?\"\n   - \"Use the cup to scoop water and pour it into the bin. Does this make the water splash too?\"\n   - \"Trade jobs so everyone gets to push!\"\n\n3. **Connection to photograph:** \"The ocean waves are like your spoon—something is pushing the water hard, and it splashes up just like in our picture!\"\n\n4. **What students should record/document:**\n   - Observe and describe: Does the water move more with a gentle push or a strong push?\n   - Draw a simple picture showing gentle waves vs. big splashes (stick figures pushing are fine).\n   - Use words: gentle, strong, splash, wave, move.\n\n**Teacher Role:**\n- Circulate among groups and ask: \"What did you notice when you pushed gently?\" and \"What happened with a big push?\"\n- Refrain from saying \"good job\" only; instead ask: \"How was the big push different from the gentle push?\"\n- Ensure safety—no dunking hands or throwing water.\n- Have towels ready and normalized for spills (frame as \"part of science\").\n\n**Expected Student Outcomes:**\n- Students discover that **stronger pushes create bigger splashes** and water moves more.\n- Students discover that **gentle pushes make smaller waves**.\n- Students make observations without adult-provided answers.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with photographs and student drawings from Explore\n- Picture cards of push, pull, force, wave, splash\n- The original beach photograph\n- Whiteboard for recording vocabulary\n\n**Activity:**\n\n1. **Group share-out:** Gather students in a circle. Ask:\n   - \"Who can show with your hands what a gentle push looked like?\" (Demonstrate together)\n   - \"Who can show a strong push?\" (Demonstrate together)\n   - \"What did the water do differently?\"\n\n2. **Introduce key vocabulary** using student-friendly definitions and the photograph:\n\n   | Vocabulary | Student-Friendly Definition | Connection to Photo |\n   |---|---|---|\n   | **Push** | Using force to move something away from you | \"Your spoon pushed the water just like the wind pushes the ocean waves\" |\n   | **Force** | A push or pull that makes something move | \"The ocean has a big force that pushes all that water\" |\n   | **Wave** | Water that moves up and down in the ocean | \"See the big wave in the picture splashing on the rocks?\" |\n   | **Splash** | When water jumps up and sprays around | \"When you pushed hard, your water splashed just like the beach picture\" |\n   | **Strong** | A big, powerful push | \"A strong push makes a big splash\" |\n   | **Gentle** | A soft, light push | \"A gentle push makes a small ripple\" |\n\n3. **Make connections:** Point to the photograph and say: \"In this picture, the ocean made a strong force that pushed the water into a big wave. It crashed on those rocks and made a huge splash! Your spoon did the same thing on a smaller scale.\"\n\n4. **Check for understanding:**\n   - \"Show me with your spoon hand: make a strong push motion.\"\n   - \"Show me a gentle push motion.\"\n   - \"Point to where the water is splashing in our picture.\"\n   - \"Does anyone remember: what made the splash bigger—a gentle push or a strong push?\" (Call on several students)\n\n**Vocabulary Chart:** Create and display a visual anchor chart with drawings/pictures showing each term. Leave it posted throughout the unit.\n\n**Expected Student Outcomes:**\n- Students use the term **push** correctly in context.\n- Students understand that **strong pushes and gentle pushes have different effects**.\n- Students connect their water exploration to the ocean waves in the photograph.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Plastic cups (clear, if possible)\n- Water in bins (from Explore phase, or refresh)\n- Small objects to test: foam ball, plastic boat, rubber duck, stone/pebble, plastic cup\n- Chart paper: \"What Moves? What Stays Still?\"\n- Markers\n\n**Activity:**\n\n1. **Introduce the challenge:** \"Remember how the rocks in the picture didn't move even when the big waves pushed them? Let's test what the water can push and what it can't push!\"\n\n2. **Student investigation directions:**\n   - \"Pick one object. Place it gently in the water.\"\n   - \"Use your spoon to push the water toward that object with a gentle push.\"\n   - \"Does the object move? Does it float or sink?\"\n   - \"Now try a strong push. What happens now?\"\n   - \"Trade objects and try again!\"\n\n3. **Record findings:** For each object, draw and label:\n   - Does it move or stay still?\n   - Does it float or sink?\n   - Did a strong push move it more than a gentle push?\n\n4. **Create a class chart:** \"What Moves in Water? What Stays Still?\"\n   - Sort the tested objects into two columns.\n   - Discuss: \"Why do you think the stone stays still? Why does the boat move?\"\n\n5. **Connect to real world:** \"At the beach, the sand and shells move a little when waves push, but the big rocks stay put. Let's see what happens with our objects—are they more like sand or like rocks?\"\n\n**Teacher Role:**\n- Facilitate object testing by asking: \"What did you predict would happen?\" then \"What actually happened?\"\n- Encourage hands-on exploration without correcting; let discovery unfold.\n- Ask: \"Could a really, really strong push move a rock?\" to deepen thinking.\n- Use think-pair-share: \"Turn to your partner and explain why the ball moved but the pebble didn't.\"\n\n**Expected Student Outcomes:**\n- Students apply the concept of **force to new objects**.\n- Students discover that **mass/weight matters**—lighter objects move more easily than heavier ones.\n- Students make predictions and test them.\n- Students deepen understanding of cause and effect.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (ongoing during lesson):**\n- Observe and record during Explore and Elaborate phases using a simple checklist:\n  - ☐ Student makes observations about water movement\n  - ☐ Student compares gentle vs. strong pushes\n  - ☐ Student uses vocabulary: push, splash, wave, strong, gentle\n  - ☐ Student makes predictions about object movement\n\n**Exit Ticket / Summative Assessment (end of lesson):**\n\nUse **one of these two methods** based on class needs:\n\n**Option A: Visual/Verbal (best for Kindergarten)**\nShow the beach photograph again and ask:\n1. \"Point to the water that is moving. Why is it moving?\" (Listen for: push, waves, force, ocean)\n2. \"Show me with your hands: is this a gentle push or a strong push?\" (Point to the big splash)\n3. \"If you had a gentle push, would it make a big splash like this? Why or why not?\"\n4. \"What do you think the rocks are saying? 'Please move me!' or 'I'm staying right here!'? Why?\"\n\n**Option B: Drawing/Writing**\nProvide a paper divided into two sections:\n- **Left side:** Draw yourself making a **gentle push** on water. Label if possible: gentle, small splash.\n- **Right side:** Draw yourself making a **strong push** on water. Label: strong, big splash.\n\n**Success Criteria for Mastery:**\n- ✓ Student correctly demonstrates difference between gentle and strong pushes\n- ✓ Student uses at least 2 vocabulary words (push, splash, wave, strong, gentle, force)\n- ✓ Student makes a reasonable prediction about water movement based on force applied\n- ✓ Student recognizes that **stronger pushes cause bigger effects**\n\n**How to Determine if Students Met Learning Objectives:**\n- **Objective 1 (observe water movement):** Student points to or describes water moving/splashing in photo and during activity\n- **Objective 2 (compare gentle vs. strong):** Student demonstrates or explains that strong pushes create bigger splashes\n- **Objective 3 (predict):** Student makes a guess about what will happen before trying (even if incorrect; learning is in testing)\n- **Objective 4 (identify materials):** Student recognizes that some objects move and some don't; rocks stay still\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Pre-teach vocabulary** one-on-one before the lesson using the photograph and simple props (spoon, cup of water). Use repetition and gesture.\n\n2. **Partner with a peer** during Explore phase. Assign a buddy who can model the pushing motion and describe what they observe. Scaffold with sentence stems: \"The water moved when I pushed ____\" or \"A strong push made the water ____.\"\n\n3. **Simplify the Elaborate phase:** Provide only 2-3 objects to test instead of 5. Focus on one clear comparison: foam ball (moves) vs. rock (doesn't move). Use repetition and ask the same questions multiple times with these simpler choices.\n\n### Challenge (for advanced learners):\n\n1. **Predict and explain:** Before each push, have students predict: \"Will this object move? Why?\" Then test and discuss accuracy. Ask follow-up: \"What would happen if you pushed even harder?\" or \"What if we used a bigger spoon?\"\n\n2. **Introduce direction:** Beyond just force strength, ask: \"Can you push the water in different directions? Can you make the water go left? Right? In a circle?\" This ties to K-PS2-1's \"different directions of pushes.\"\n\n3. **Real-world connection task:** Show pictures of different beaches (rocky shores, sandy shores, cliff shores). Ask: \"Where do you think the biggest splashes happen? Why? Which rocks would move easier—tiny pebbles or giant boulders? Why?\" Encourage drawing and explaining.\n\n---\n\n## Extension Activities\n\n1. **\"Make a Beach\" Discovery Station**\n   - Set up a bin with sand and water. Provide spoons, cups, and small objects.\n   - Students explore: \"How does pushing water in sand look different from pushing water in empty bins?\"\n   - Record: Does water soak into sand? Do objects sink faster in sand? Do splashes look different?\n   - Connects to real beach exploration.\n\n2. **Story and Movement Activity: \"Be the Ocean\"**\n   - Read a simple beach picture book (e.g., *The Seashore Book* by Charlotte Russ or *Listening Walk* by Paul Showers).\n   - Play wave music (calm, then crescendo).\n   - Students move like gentle waves (slow, swaying), then strong waves (bigger, faster movements).\n   - Narrate: \"Gentle waves pushed the water... Now a strong storm makes HUGE waves!\"\n   - Connects physical science to creative expression and vocabulary reinforcement.\n\n3. **Family Homework: \"Push Hunt\"**\n   - Send home a simple sheet with pictures: a child pushing a swing, wind pushing a tree, water pushing a boat.\n   - Ask families: \"Find one push in your home! Draw it. Tell someone what is being pushed.\"\n   - Brings concept home and builds parent engagement.\n   - Optional: \"If you visit a beach, watch the waves and remember our splashing experiment!\"\n\n---\n\n## Teacher Notes\n\n- **Safety:** This lesson involves water, so have towels available and normalize spills as part of science. Assign a \"dry station\" for students who prefer not to get wet; they can observe and record.\n- **Timing:** If your session is interrupted, you can split this into two days: Day 1 (Engage + Explore), Day 2 (Explain + Elaborate + Evaluate).\n- **Real-world connection:** If possible, take a virtual beach tour or show a video of real ocean waves during Explain phase. Seeing actual waves strengthens the connection.\n- **Vocabulary anchor chart:** Keep this visible throughout the week and reference it in other lessons (e.g., \"Remember our 'push' and 'force' words?\").\n\n---\n\nThis lesson brings the energy and excitement of the ocean photograph directly into your classroom through water exploration, ensuring Kindergarteners discover cause-and-effect through their own hands and observations!",
  "inputTokens": 2383,
  "outputTokens": 3857,
  "cost": 0.021668,
  "generatedAt": "2026-02-13T00:17:31.729Z"
}