{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "imagePath": "images/physical-science/p30.jpg",
  "content": "### Visible Elements in Photo\n- Dark, angular rocks of varying sizes scattered across sand/beach\n- Ocean waves with white foam crashing against the rocks\n- Sandy beach in the foreground\n- Calm water visible behind the wave action\n- Clear sky in the background\n\n### Reasonable Inferences\n- **From rocks + crashing waves**: The rocks are being eroded and displaced by wave force, suggesting a natural barrier or breakwater effect.\n- **From rock arrangement + sand**: Rocks provide protection to the beach behind them, implying they reduce water energy reaching the shore.\n- **From wave height + rock size**: Larger waves may overtop or move smaller rocks, indicating force thresholds exist for different rock sizes.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\n*Make a rock wall to stop the water!*\nUse rocks and sand to build a wall at the beach that keeps water away from a safe spot on the shore. Test your wall by pouring water toward it. Does your wall hold? Can you make it stronger?\n\n**3-5 Version:**\nDesign a coastal barrier using rocks and sand that reduces water energy reaching a protected zone 15 cm behind the barrier. Your structure must:\n- Withstand at least 3 waves of water splashed at it from 30 cm away\n- Use only rocks (max 10 cm diameter), sand, and water\n- Keep the protected zone at least 50% drier than an unprotected control area after wave testing\n\nSuccess = barrier remains stable and protected zone shows measurable dryness difference.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real-world coastal erosion and protection challenge with no solution in sight. Students must first observe the problem (waves destroying beaches), identify what's needed (protection), and *then* design a barrier. The photo prompts questions (\"Why are those rocks there?\" \"Does the wall actually work?\") rather than suggesting a ready-made solution.\n\n---\n\n### Suggested Materials\n1. Rocks or pebbles (mixed sizes, sourced from playground or landscaping supplier)\n2. Sand or fine soil\n3. Water (bucket or spray bottle for controlled testing)\n4. Shallow tray or container (to contain water during testing)\n5. Ruler or measuring tape (to verify barrier height and protected zone distance)\n\n---\n\n### Estimated Time\n**One 40-50 minute session** (K-2: design + test once; 3-5: design + test multiple trials + measure results)  \n*Optional extension:* Two sessions if students iterate and redesign based on first test results.\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem reflecting a need or want that includes specified criteria for success and constraints on materials, time, or cost*) by asking students to design a structure that solves a visible, real-world problem with measurable constraints.",
  "inputTokens": 1803,
  "outputTokens": 667,
  "cost": 0.005138,
  "generatedAt": "2026-02-09T13:29:16.105Z"
}