{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "imagePath": "images/physical-science/p30.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Waves, Forces, and Splashing Shores\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Waves and Motion:** Ocean waves demonstrate how energy moves through water, causing visible motion and splashing as the wave hits the rocks.\n- **Unbalanced Forces:** The force of moving water colliding with stationary rocks causes the water to change direction and splash upward, demonstrating unbalanced forces.\n- **Impact and Energy Transfer:** The collision between the wave and rocks shows how energy from one object can be transferred to another, creating dramatic motion and spray.\n- **Material Properties:** The rocks (hard, solid) and water (liquid, flowing) interact differently when the wave force acts upon them, showing how object properties affect motion outcomes.\n\n---\n\n## Lesson Title\n\n**Splashing Science: How Waves Push and Move Things**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 75-90 minutes (can be split into two 45-minute sessions)\n- **NGSS Standards:** \n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object\n  - 3-PS2-2: Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how a force (moving water) causes objects (rocks) to change motion or direction.\n2. Predict what will happen when a force acts on an object in different ways.\n3. Explain that unbalanced forces cause objects to move, change speed, or change direction.\n4. Demonstrate understanding by creating a model that shows how a force (moving water) affects the motion of objects.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of waves crashing on rocks.\n\n**Materials:**\n- Printed photograph (enlarged or displayed on screen) of waves crashing on rocks\n- Chart paper and marker\n\n**Activity:**\n\n1. **Display the Photograph:** Project or display the image of waves hitting the rocky shore. Allow students 30 seconds of silent observation before speaking.\n\n2. **Spark Curiosity with Guided Questions:**\n   - \"What do you see happening in this picture?\" (Students observe the white water spraying, rocks, ocean)\n   - \"What is making that water go UP in the air like that?\" (Guide them to think: the wave is pushing it)\n   - \"If you were standing on those rocks, what would you feel? Why?\" (Lead them to sense: the water pushing, cold spray, force)\n   - \"Do you think the rocks moved when the wave hit them? Why or why not?\" (Encourage thinking about what's stronger)\n\n3. **Wonder Prompt:** \"I wonder what would happen if we made our own 'wave' in a container and let it hit something. What do you think would happen?\" \n\n4. **Record Predictions:** Write 2-3 student predictions on chart paper. Don't confirm or deny—just record and save for later.\n\n**Transition:** \"Let's find out! We're going to make our own waves and see how they push things around.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover how moving water (a force) causes objects to move.\n\n**Materials per group (groups of 3-4):**\n- 1 shallow rectangular container (clear plastic storage bin or aluminum baking pan, approximately 12\" × 8\")\n- 1 small plastic cup or container filled with water\n- 4-5 small objects of varying weights: plastic block, wooden block, small plastic figure, foam piece, light plastic cup\n- 1 small rock or pebble (fist-sized or smaller)\n- Measuring tape (optional, for recording distance)\n- Paper towels for cleanup\n- Recording sheet (provided below)\n\n**Activity: \"Make a Wave and Predict What Moves\"**\n\n**Step-by-Step Student Directions:**\n\n1. **Set Up:** Place the rock in the center of the container. Arrange the small objects around the rock at different distances (some very close, some farther away).\n\n2. **Make a Wave:** Pour the water from the cup quickly into the container to create a wave that hits the rock. Observe what happens.\n\n3. **Observe and Record:** \n   - Which objects moved? Which didn't?\n   - How far did each object move?\n   - Did some objects move more than others?\n   - Record observations on your sheet with drawings or words.\n\n4. **Repeat and Predict:** Before each new trial, predict which objects will move if you pour the water faster, slower, or from a different height. Then test your prediction.\n\n5. **Test Variables:** Try:\n   - Pouring water faster vs. slower\n   - Pouring from higher up vs. lower\n   - Placing objects at different distances from the rock\n\n**Recording Sheet Template:**\n\n```\nOur Wave Experiment\n\nWhat we predicted would move: _______________________________\n\nWhat actually moved: _______________________________\n\nObjects that moved the MOST: _______________________________\n\nObjects that moved the LEAST: _______________________________\n\nWhat we learned: When water moves fast, it ________________\n___________________________________________________________\n```\n\n**Teacher Role:**\n- Circulate and observe without immediately correcting.\n- Ask guiding questions: \"Why do you think that object didn't move?\" \"What would happen if you poured faster?\"\n- Encourage students to make observations, not conclusions yet.\n- Ensure safe water handling; have towels accessible.\n\n**Expected Student Outcomes:**\n- Students will observe that faster-moving water causes larger motion changes.\n- Students will notice that heavier/denser objects resist movement more than lighter ones.\n- Students will record observations about which objects moved and which didn't.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to physical science concepts.\n\n**Materials:**\n- Chart paper and markers\n- The photograph of waves on rocks\n- Student recording sheets from Explore phase\n- Visual anchor chart with key vocabulary (pre-made or created together)\n\n**Activity:**\n\n1. **Group Share-Out:** Invite 2-3 groups to share what they observed:\n   - \"What moved when you poured the water?\"\n   - \"What didn't move? Why not?\"\n   - Record common observations on chart paper.\n\n2. **Introduce Key Vocabulary:** Write each term on chart paper and create a simple visual for each.\n\n   **Vocabulary:**\n\n   - **Force:** A push or pull that makes something move, stop, or change direction. *Example: The water pushed the block.*\n   - **Motion:** When something moves or changes position. *Example: The block slid across the container.*\n   - **Unbalanced Force:** A push or pull that is stronger on one side, which causes something to move or change how it moves. *Example: The water force pushed the block, and there was no equal force pushing back.*\n   - **Balanced Force:** Pushes and pulls that are equal and opposite, so nothing moves. *Example: If two people push a box with equal strength from opposite sides, the box doesn't move.*\n   - **Direction:** The way something moves (left, right, up, down, forward, backward). *Example: The water made the block move sideways.*\n\n3. **Connect to the Photograph:**\n   - Show the wave image again. \"Remember the water splashing up on the rocks? That's a FORCE—the water pushing. When the water hits, it's an UNBALANCED FORCE because the water pushes harder than anything is pushing back.\"\n   - \"Watch what MOTION happens—the water spray goes UP and sideways. The rocks don't move much because they're so heavy, but the water does!\"\n\n4. **Make Connections to Explore Activity:**\n   - \"Your lighter objects were like the water spray—easy to push and move. Your heavier objects were like the rocks—they need a much stronger force to move.\"\n\n5. **Check for Understanding:**\n   - Ask students: \"If I push a book with a little force, what happens?\" (It doesn't move much.) \"If I push really hard, what happens?\" (It moves more.) \"That's because the stronger the force, the more motion we see.\"\n   - Thumbs up/sideways/down: \"Do you understand that moving water is a force?\" \n\n**Expected Student Outcomes:**\n- Students can use the terms \"force\" and \"motion\" in context.\n- Students understand that unbalanced forces cause objects to move.\n- Students can explain what they observed using the new vocabulary.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply force and motion concepts to design their own investigation.\n\n**Materials:**\n- Large shallow bins or baking pans (1 per group)\n- Water\n- Various loose objects: marbles, plastic beads, foam chips, paper scraps, small blocks\n- Funnels, cups, or spray bottles for creating \"forces\"\n- Ramps (optional: cardboard, wood planks)\n- Chart paper for \"Design Challenge\"\n- Markers\n\n**Activity: \"Design Your Own Wave Experiment\"**\n\n**Challenge Prompt:**\n\"Imagine you're a scientist who studies waves at the beach. Your job is to test: **What kind of FORCE makes objects move the farthest?** Should you pour water fast or slow? From high up or low? From far away or close to the objects?\"\n\n**Student Directions:**\n\n1. **Plan:** Discuss with your group and write down your hypothesis:\n   - \"We think if we _________________ (change how we pour), the objects will move _________________ (more/less/farther).\"\n\n2. **Design:** Decide on ONE variable you'll change (speed, height, distance). Change only that one thing.\n\n3. **Test:** Perform your experiment and measure or count how far objects move.\n\n4. **Present:** Create a simple poster or tell the class what kind of force worked best and why.\n\n**Teacher Role:**\n- Provide the design challenge question on chart paper.\n- Ask: \"What will you change?\" and \"How will you measure if it worked?\"\n- Encourage groups to test their hypotheses rather than guess.\n- Help students see that fair testing means changing only one thing at a time.\n\n**Expected Student Outcomes:**\n- Students apply the concept of unbalanced forces to a new scenario.\n- Students predict and test outcomes with one variable.\n- Students communicate their findings using force and motion vocabulary.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of forces, motion, and how they relate to the original photograph.\n\n**Activity:**\n\n**Formative Assessment Throughout Lesson:**\n- Observe student predictions and recordings during Explore (Do they predict reasonably?)\n- Listen to vocabulary use during Explain (Do they use \"force\" and \"motion\" correctly?)\n- Monitor Elaborate group work (Can they design a fair test?)\n\n**Exit Ticket (Summative Assessment):** \n\nProvide each student with a card showing:\n- Picture of the ocean wave hitting rocks (same original photo or similar)\n- Three questions (students can answer with words, drawings, or a mix):\n\n**Exit Ticket Questions:**\n\n1. **\"What FORCE is acting in this picture?\"** \n   - Success: Student identifies water/wave moving/pushing\n\n2. **\"What MOTION do you see happening?\"**\n   - Success: Student describes water moving up, rocks shifting, or spray going in a direction\n\n3. **\"If the wave were bigger and stronger, what would happen?\"**\n   - Success: Student predicts more motion/objects moving farther/more spray\n\n**Success Criteria:**\n\n- **Developing:** Student identifies that water is moving.\n- **Proficient:** Student explains that moving water is a force and causes motion/change in direction.\n- **Advanced:** Student predicts how changes in the force would change the motion and explains using correct vocabulary.\n\n**How to Determine if Objectives Were Met:**\n- Can students identify and explain unbalanced forces (Objective 1)?\n- Can students make predictions about motion (Objective 2)?\n- Can students explain causality—that force causes motion (Objective 3)?\n- Can they demonstrate this in a model (Objective 4)?\n\n---\n\n## Differentiation\n\n### Support (Struggling Learners)\n\n1. **Simplified Vocabulary Chart:** Create a word wall with pictures for each term (force = arrow pushing; motion = object moving). Let students reference it throughout the lesson.\n\n2. **Guided Exploration:** Assign a teacher aide or advanced peer to work with the group. Provide a simplified recording sheet with sentence starters:\n   - \"The water moved the ___________.\"\n   - \"The ___________ did not move because ___________.\"\n\n3. **Concrete Demonstration:** Before independent work, do one full cycle of the Explore activity together as a whole class so students understand the procedure.\n\n### Challenge (Advanced Learners)\n\n1. **Multi-Variable Testing:** Ask advanced groups to test TWO variables at once (e.g., \"Does pouring faster AND from higher up create even more motion?\") and explain which variable had more effect.\n\n2. **Quantitative Measurement:** Provide measuring tape and ask students to measure and record exact distances objects move. Create a data table and compare results across groups.\n\n3. **Real-World Connection:** Challenge: \"Waves at the beach can move rocks and sand. Why don't huge ocean waves move the biggest boulders? What other forces might be at play?\" (This opens thinking about friction, mass, multiple forces.)\n\n---\n\n## Extension Activities\n\n1. **Ramp and Rolling:** Set up a ramp with a cart or ball. Have students investigate how the HEIGHT of the ramp (strength of the force) changes how far the object rolls. Connect: \"Is a bigger ramp like a bigger wave?\"\n\n2. **Wind Force Investigation:** Use a fan or blow on objects to create a \"wind force.\" Investigate which objects move with weak wind vs. strong wind. Discuss: \"Waves are moving water, but wind is moving air. Do they follow the same rules about forces?\"\n\n3. **Design Challenge - Build a Barrier:** \"Rocks at the beach protect the shore from wave damage. Can you build a barrier with blocks or cups to protect objects in your water container from the 'wave' force? Test your design!\"\n\n4. **Photograph Scavenger Hunt:** Find or draw 5 pictures showing forces in nature (wind blowing leaves, water flowing, etc.). Label the force and the motion you see.\n\n5. **Cause and Effect Chain:** Create a visual showing: \"Strong wave → Pushes water → Water hits rocks → Water splashes up and sideways → Objects move.\" Draw or cut and paste to show the chain of cause and effect.\n\n---\n\n## Notes for Teacher\n\n- **Safety:** Ensure water stays contained. Have towels and a designated cleanup area ready. Students should not splash intentionally.\n- **Preparation:** Pre-fill water containers and arrange materials in advance to maximize instructional time.\n- **Pacing:** This lesson can be split across two days: Day 1 (Engage, Explore, begin Explain), Day 2 (finish Explain, Elaborate, Evaluate). Adjust timing based on your class's needs.\n- **Connection to Prior Learning:** If students have studied pushes and pulls in earlier lessons, reference that: \"Remember how we learned that pushes move things? The wave is a BIG push!\"\n- **Real-World Tie:** On a sunny day, take students outside to observe wind moving leaves, grass, or light objects. Use the same force/motion vocabulary.\n\n---\n\nThis lesson grounds all learning directly in the observable phenomena of the photograph while scaffolding student understanding from concrete exploration to abstract vocabulary and predictive thinking—appropriate for Third Grade physical science.",
  "inputTokens": 2376,
  "outputTokens": 3668,
  "cost": 0.020716,
  "generatedAt": "2026-02-13T00:19:31.189Z"
}