{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "imagePath": "images/physical-science/p30.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Waves, Water, and Rocks\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Properties of Materials:** Rocks and sand have different observable properties (hardness, color, texture, size). The dark rocks appear harder and denser than the sand around them.\n- **Force and Motion:** Waves exert a pushing force on objects. The splashing water demonstrates how moving water applies force to create motion and spray.\n- **Energy Transfer:** Wave energy is transferred from the ocean to the rocks and sand, causing movement and change in the environment.\n- **Cause and Effect:** The crashing waves cause observable changes to the shoreline (water movement, spray, sound).\n\n---\n\n## Lesson Title\n\n**Crashing Waves: Exploring Forces and Materials at the Beach**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes (two 45-minute sessions, or one extended 90-minute block)\n- **NGSS Standards:** \n  - 2-PS1-1: Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n  - 2-PS1-2: Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe the properties of different materials (rocks, sand, water) using sensory words.\n2. Explain how waves create a pushing force that affects objects in the ocean.\n3. Classify materials based on their observable properties (hard/soft, heavy/light, rough/smooth).\n4. Predict how different materials respond to the force of moving water.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed color copy of the photograph (or display on screen/projector)\n- Chart paper and markers (for recording observations and predictions)\n\n**Activity:**\n\n1. **Display the Photograph:** Show students the image on the board or projector. Allow 30 seconds of silent observation before asking any questions.\n\n2. **Initial Observations:** Ask students to turn to a partner and describe what they see without using the words \"wave\" or \"water\" yet. (This encourages descriptive language.)\n\n3. **Guided Discussion Questions:**\n   - \"What do you see happening in this picture? What is moving?\"\n   - \"Can you point to something hard in the picture? Can you point to something soft?\"\n   - \"What do you think made that big splash? What was the pushing force?\"\n   - \"If you could touch the rocks and the sand, what would they feel like? Would they feel the same or different?\"\n\n4. **Wonder Prompt:** \"I wonder what would happen if we made our own waves in a tub of water and put rocks and sand in the way. What do you think would happen?\"\n\n5. **Record Predictions:** Write student predictions on chart paper. Save for the Elaborate phase.\n\n**Transition:** \"Let's find out by doing our own investigation with water, rocks, and sand!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- One clear plastic tub or container (12\" × 8\" minimum) per pair or small group\n- Water (enough to fill tubs halfway)\n- Small rocks (approximately 2-3 per tub, varied sizes)\n- Sand (approximately 1 cup per tub)\n- Wooden blocks or spoons (for making waves)\n- Paper towels for cleanup\n- Observation recording sheet (see below)\n- Optional: spray bottles filled with water (for a second investigation)\n\n**Activity:**\n\n**Part A: Wave Investigation (Pairs or Small Groups)**\n\n1. **Setup (2 minutes):** Each group receives:\n   - One tub filled halfway with water\n   - 2-3 rocks placed on the bottom\n   - A thin layer of sand (about ½ inch) on the bottom\n\n2. **Student Directions (Read aloud and model first):**\n   - \"You are going to make waves by moving your hand side to side in the water. Move slowly at first, then faster.\"\n   - \"Observe what happens to the rocks. Observe what happens to the sand. Draw or write what you see on your observation sheet.\"\n   - \"Make a BIG wave by moving the water really fast. What happens now? Is it different? Record it.\"\n   - \"Try to push the rocks with the wave. Can you move them? How far?\"\n\n3. **Recording Instructions:** Students draw or write on a **two-column observation sheet:**\n   - **Column 1:** \"When I made small waves, I saw...\"\n   - **Column 2:** \"When I made big waves, I saw...\"\n\n4. **Teacher Role:**\n   - Circulate and ask guiding questions: \"What's moving? Why did that happen? Is the rock moving the same as the sand?\"\n   - Avoid directly telling students what to observe; instead, redirect: \"What did YOU notice?\"\n   - Prompt students to describe using words like *push, force, movement, hard, soft, heavy, light*.\n\n5. **Expected Student Outcomes:**\n   - Students observe that rocks move less than sand.\n   - Students notice that bigger waves create more movement.\n   - Students recognize water as a pushing force.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper and markers\n- Photograph (displayed again)\n- Vocabulary cards with pictures (optional)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 3-4 groups: \"What happened when you made waves? What moved? What didn't move?\"\n   - Record observations on chart paper in two categories:\n     - **Rocks:** didn't move much / hard / heavy\n     - **Sand:** moved around / soft / light\n\n2. **Introduce Key Vocabulary (10 minutes):**\n   - Use student observations to introduce and define terms:\n\n| **Term** | **Student-Friendly Definition** |\n|----------|--------------------------------|\n| **Force** | A push or a pull that makes something move |\n| **Wave** | Moving water that pushes things |\n| **Properties** | What something looks like, feels like, or acts like (hard, soft, rough, smooth, heavy, light) |\n| **Material** | What something is made of (rock, sand, water, plastic) |\n\n3. **Connect to Photograph:**\n   - Display the beach photograph again.\n   - Point to the rocks: \"These rocks are *hard*. The waves pushed them, but they didn't move much because they are so *heavy*.\"\n   - Point to the sand: \"The sand is *soft* and *light*. The waves pushed it around more easily.\"\n   - Point to the spray: \"This is the *force* of the wave. It's a big push!\"\n\n4. **Check for Understanding:**\n   - Ask: \"Is a rock hard or soft?\" (hard)\n   - Ask: \"Is sand heavy or light?\" (light)\n   - Ask: \"What made the water splash in the picture?\" (the force of the wave)\n   - Ask: \"Did the rocks move as much as the sand in our tub?\" (no)\n\n5. **Expected Student Outcomes:**\n   - Students use vocabulary correctly in simple sentences.\n   - Students connect exploration to the photograph.\n   - Students understand that different materials have different properties and respond differently to forces.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Same tubs from Explore phase (or refill with water)\n- Rocks, sand, and water\n- Additional materials: plastic beads, foam, pebbles, shells, aluminum foil\n- Observation sheet: \"Which Material Gets Pushed the Most?\"\n- Spray bottle (full) per group (optional second investigation)\n\n**Activity:**\n\n**Option A: Testing Different Materials (Recommended)**\n\n1. **Setup:** Place several different materials at the bottom of the tub: sand, rocks, foam pieces, plastic beads, shells, aluminum foil balls.\n\n2. **Student Directions:**\n   - \"Make waves of the SAME size and push them toward each material.\"\n   - \"Which material moves the most? Which moves the least?\"\n   - \"Rank the materials from 'moves the most' to 'moves the least.'\"\n   - \"Why do you think some materials moved more than others?\"\n\n3. **Recording:** Students draw or list materials in order on their elaboration sheet.\n\n4. **Discussion Question:** \"Which materials would be BEST for stopping waves at a beach? Why? Would you choose sand, rocks, or foam?\"\n\n**Option B: Using Spray Bottles (Simplified Version)**\n\n1. Students predict which material would scatter when sprayed.\n2. Spray each material and observe.\n3. Discuss: \"Did the hard rocks scatter like the soft sand? Why or why not?\"\n\n**Teacher Role:**\n- Guide students to reason about *why* materials respond differently (hardness, weight, size).\n- Ask: \"What property of the rock keeps it from moving?\" (It's hard and heavy.)\n- Ask: \"What property of the sand makes it move?\" (It's soft, light, and made of tiny pieces.)\n\n**Expected Student Outcomes:**\n- Students classify materials by their response to force (water/waves).\n- Students explain predictions using properties of materials.\n- Students connect properties to how materials behave.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of forces, material properties, and their relationship.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- Observe during Explore: Do students accurately describe what happens to rocks vs. sand?\n- Listen during Explain: Do students use new vocabulary appropriately?\n- Monitor during Elaborate: Can students predict outcomes based on material properties?\n\n**Exit Ticket (Summative):**\n\nDisplay the beach photograph one final time. Ask students to complete **one** of the following (choose based on student level):\n\n**Version A (Support):**\n- Draw a rock and a pile of sand.\n- Under the rock, write or say: \"The wave pushed it a ______ (little/lot).\"\n- Under the sand, write or say: \"The wave pushed it a ______ (little/lot).\"\n\n**Version B (Grade-Level):**\n- \"If a big wave pushed the rocks and sand at the beach, what would happen? Would the rocks move or stay the same? Would the sand move or stay the same? Why?\"\n- (Students write or draw with 2-3 sentences.)\n\n**Version C (Challenge):**\n- \"Use the word *force* and *property* to explain why rocks and sand move differently in waves.\"\n- (Students write a complete sentence or two.)\n\n**Success Criteria:**\n- ✓ Student correctly identifies that rocks move less than sand.\n- ✓ Student uses the word *wave*, *push*, or *force* to explain motion.\n- ✓ Student recognizes that hard/heavy materials move less than soft/light materials.\n\n**Expected Student Outcomes:**\n- 80% of students accurately compare how rocks and sand respond to waves.\n- Most students use at least one vocabulary word correctly.\n- Students demonstrate understanding that material properties affect how things move.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Vocabulary:** Use only *hard*, *soft*, *push*, and *move*. Introduce *wave* and *force* through repeated exposure without formal definition.\n\n2. **Guided Observation:** Pair students with stronger partners. Provide sentence frames:\n   - \"The rocks are _______.\"\n   - \"The sand is _______.\"\n   - \"The wave pushed the sand more than the rocks because _______.\"\n\n3. **Reduced Recording:** Instead of drawing/writing detailed observations, students point to pictures of rocks and sand and state: \"Which one moved more?\" Then place a checkmark next to their answer.\n\n### Challenge (For Advanced Learners)\n\n1. **Comparative Investigation:** Ask: \"Which size rock moves the most—a big one or a small one? Test it and explain your prediction.\" (Introduces the variable of *size* alongside properties.)\n\n2. **Real-World Application:** \"If you were building a beach house, would you want to build it on sand or on rocks? Why?\" Students explain using properties and forces.\n\n3. **Extended Vocabulary:** Introduce *erosion* as a preview concept: \"Waves push sand away. This is called erosion. Can you show erosion happening in your tub?\"\n\n---\n\n## Extension Activities\n\n1. **Beach Diorama Design:**\n   - Students create a small model beach in a shoebox or tub using sand, rocks, clay, and other materials.\n   - They predict which parts would be damaged by big waves and explain why.\n   - Real-world connection: Building a resilient shoreline.\n\n2. **Sorting and Classifying Game:**\n   - Collect 8-10 classroom objects (pencil, eraser, block, marble, feather, sponge, coin, paperclip).\n   - Students sort by properties: hard/soft, heavy/light, rough/smooth.\n   - Connect to the lesson: \"Would waves push a hard pencil or a soft feather more?\"\n\n3. **Story Writing:**\n   - Students write or dictate a short story: \"The Adventures of Rocky the Rock and Sandy the Grain of Sand During a Big Wave.\"\n   - Story should describe how each material responds to the wave force.\n   - Incorporates literacy with science reinforcement.\n\n---\n\n## Teacher Notes\n\n- **Safety:** Ensure water play is supervised. Have towels accessible for spills.\n- **Material Prep:** Collect rocks before the lesson (a beach walk or craft store works well). Use sand from a sandbox or purchase play sand.\n- **Pacing:** If time is limited, combine Engage and Explore into a single 30-minute session, or eliminate Option B in Elaborate.\n- **Connection to Photograph:** Repeatedly reference the beach image throughout the lesson. Ask, \"Remember the rocks and sand at the beach? That's what we saw happen in our tubs!\"\n- **Vocabulary Support:** Display word cards with pictures during the Explain phase and leave them up for the remainder of the unit.\n\nThis lesson is fully aligned with 2-PS1-1 and 2-PS1-2, using observable properties of materials and testing how different materials respond to force (water/waves).",
  "inputTokens": 2382,
  "outputTokens": 3407,
  "cost": 0.019417,
  "generatedAt": "2026-02-13T00:18:50.564Z"
}