{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "imagePath": "images/physical-science/p30.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Waves Crash and Splash\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Waves and Water Motion:** Ocean waves demonstrate the movement of energy through water, creating visible motion that crashes against rocks and sends water high into the air.\n- **Force and Motion:** The crashing waves show force (the push of the wave) causing motion (splashing water droplets moving through the air).\n- **Properties of Materials:** Dark rocks and light-colored water droplets highlight how different materials reflect light differently, making some objects easy to see against others.\n- **Light and Visibility:** The bright splash contrasts sharply with the darker rocks, demonstrating how light helps us see objects and their movement.\n\n---\n\n## Lesson Title\n\n**Splashing Waves: How Water Moves and Makes Things Happen**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 75–90 minutes (two 40-minute sessions, or one extended block with break)\n- **NGSS Standards:** \n  - 1-PS4-1 (Sound and vibration—waves create motion)\n  - 1-PS4-3 (Light interacting with materials—visibility of water droplets)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n- Observe and describe how waves make water move in different ways.\n- Predict what will happen when water hits an object in its path.\n- Identify that movement (motion) is caused by a push or pull (force).\n- Use words like \"splash,\" \"crash,\" and \"spray\" to describe wave action and compare their observations to the photograph.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Large printed or projected color copy of the photograph (p30.jpg)\n- Chart paper and marker\n- Optional: small cup of water for demonstration\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see it clearly. Say: *\"Look at this picture. Something amazing is happening here! What do you see?\"*\n\n2. **Facilitate initial observations** (don't explain yet):\n   - *\"What color is the water? What color are the rocks?\"*\n   - *\"Can you see water moving? How do you know?\"*\n   - *\"What do you think made the water go so high up in the air?\"*\n\n3. **Encourage wonder and predictions:**\n   - *\"Have you ever been to the beach or seen big waves? What happened when the wave hit something?\"*\n   - *\"I wonder: If you were standing on those rocks, what might happen to you? Why do you think that?\"*\n\n4. **Create a class \"Wonder Wall\":** On chart paper, write down 2–3 student predictions or questions about what makes waves splash and move. Example: *\"Does the wave push the water?\" or \"Where does all that water go?\"*\n\n**Transition:** *\"Today, we're going to do our own water experiments to discover how waves and water move, just like in this picture!\"*\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate and discover wave motion and force through hands-on experimentation.\n\n**Materials (per group of 3–4 students):**\n- 1 shallow rectangular plastic basin or large aluminum baking pan (filled with water to 2 inches)\n- 1 smooth rock or block (approximately 3–4 inches)\n- Paper towels (for cleanup)\n- Optional: liquid dish soap (1 teaspoon per basin) to see waves better\n- Observation sheet (printed, or drawn together as a class): simple 3-box template labeled \"Before,\" \"During,\" \"After\"\n\n**Activity:**\n\n**Teacher Setup (2 minutes before students start):**\n- Organize students into groups and set up basin stations at tables.\n- Model the activity once with the whole group: *\"Watch as I push the water gently. What happens? Now I'm going to create a bigger push. What do you notice?\"*\n\n**Student Directions (read aloud and model; students work in groups):**\n\n1. *\"Look at your water and the rock. Draw or describe what you see in the 'Before' box.\"*\n\n2. *\"Now, gently push the water with your hand toward the rock. What happens? Does the water move? Does it splash?\"* (Let students try 2–3 times, gently.)\n\n3. *\"Draw or describe what you see in the 'During' box.\"*\n\n4. *\"Now make a bigger push—really move your hand fast. Watch what happens to the water and the rock!\"* (Students observe splashing, water droplets, wave action.)\n\n5. *\"Draw or describe what you see in the 'After' box. Did the water move differently when you pushed harder?\"*\n\n6. *\"Turn to a friend and tell them what happened. Use words like 'splash,' 'wave,' 'pushed,' and 'moved.'\"*\n\n**Teacher Role:**\n- Circulate to each group and ask guiding questions:\n  - *\"What did the water do when you pushed it?\"*\n  - *\"Did it move the same way each time, or was it different?\"*\n  - *\"Do you see water droplets? What made them fly through the air?\"*\n- Do **not** explain concepts; allow students to discover through observation.\n- Redirect if students are rough-housing; keep the focus on observation and gentle scientific testing.\n- If a basin spills, normalize it: *\"Great scientists make messes sometimes! That's okay.\"*\n\n**Expected Student Outcomes:**\n- Students discover that pushing water creates waves and splashing.\n- Students notice that bigger pushes create bigger splashes.\n- Students observe water droplets moving through the air (light reflecting off droplets).\n- Observation sheets show attempts to represent wave motion and changes.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect exploration to the photograph using teacher-led discussion.\n\n**Materials:**\n- The original photograph (still displayed)\n- Observation sheets from Explore phase\n- Chart paper with vocabulary words (pre-written or added together)\n- Optional: short video clip (1–2 minutes) of actual ocean waves crashing on rocks for comparison\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 2–3 groups to describe what happened in their basins.\n   - Listen for student language and affirm efforts: *\"You used the word 'splash!' That's exactly right!\"*\n   - Ask: *\"How was what happened in your basin like the big waves in this photograph?\"*\n\n2. **Introduce Key Vocabulary (7 minutes):**\n   - Display each word with a picture, gesture, or action. Use student language from their observations.\n\n   **Vocabulary:**\n   - **Wave:** Moving water that goes up and down. *\"When you pushed the water, you made tiny waves. The ocean makes giant waves!\"*\n   - **Splash:** Water flying through the air in many little drops. *\"In the picture, the wave is splashing on the rocks!\"*\n   - **Force:** A push or pull. *\"Your hand pushing the water was a force. It made the water move.\"*\n   - **Motion:** Movement from one place to another. *\"The water moved across the basin—that's motion!\"*\n\n3. **Connect Back to the Photograph (5 minutes):**\n   - Point to the photograph: *\"Look at all these water droplets flying in the air. What made them happen? A big wave—with lots of force—hit the rocks. The force of the wave pushed the water so hard that it splashed way up into the air, just like your water in the basin!\"*\n   - Ask: *\"Do you see why the rocks are darker and the water droplets are bright white? The light is bouncing off the water droplets, making them easy to see.\"*\n\n4. **Check for Understanding:**\n   - Ask: *\"Who can show me a pushing motion with their arm? That's force!\"*\n   - Ask: *\"Can you point to something in the photograph that is moving? That's motion!\"*\n   - Ask: *\"If I push the water really hard, what will happen? If I push it gently, what will happen?\"* (Students predict and show understanding of cause-effect.)\n\n**Expected Student Outcomes:**\n- Students use new vocabulary correctly in simple sentences.\n- Students make the connection between their basin activity and the ocean photograph.\n- Students understand that force causes motion.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply wave and force concepts in a new context and deepen understanding.\n\n**Materials:**\n- Same basins and water from Explore phase\n- Additional small objects: plastic cups, blocks, sponges, rubber ducks, plastic boats (1 per group)\n- Observation chart: drawn on paper with columns: *Object / What We Predicted / What Happened / Words to Describe*\n\n**Activity:**\n\n1. **Challenge Prompt:** *\"Now you're going to be wave scientists! We're going to put different objects in the path of your water waves and see what happens. When the wave hits the object, it might move, it might splash, or it might stay still. Let's find out!\"*\n\n2. **Student Directions:**\n   - *\"Place your object in the middle of the water in your basin.\"*\n   - *\"Before you make a wave, predict: 'What do you think will happen to this object when the wave hits it? Will it move? Will the water splash?'\"* (Students draw or tell a partner.)\n   - *\"Now, make a wave by pushing the water toward the object. Watch what happens!\"*\n   - *\"Did the object move? Did it float? Did the water splash? Draw or write what you saw.\"*\n   - *\"Try again with a bigger push. Is the motion different?\"*\n\n3. **Compare Objects:**\n   - If time allows, have groups test 2–3 different objects and compare results.\n   - *\"Which object moved the most? Which one stayed still? Why do you think that happened?\"*\n\n4. **Real-World Connection:** \n   - Ask: *\"In the ocean photograph, the rocks didn't move. But other things in the ocean—like seaweed, fish, boats, or surfers—might move a lot when waves hit them. Why do you think the rocks stayed still?\"* (Heavy, strong, big.)\n\n**Teacher Role:**\n- Encourage risk-taking and curiosity: *\"What if we try this? What might happen?\"*\n- Ask questions that promote thinking: *\"Why do you think the water splashed more this time?\"*\n- Document student observations (photos or notes) for assessment.\n\n**Expected Student Outcomes:**\n- Students apply understanding of force and motion to new materials.\n- Students predict and test, showing cause-and-effect thinking.\n- Students use vocabulary in context (wave, splash, force, motion).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of wave motion, force, and the connection to the photograph.\n\n**Activity:**\n\n**Formative Assessment (throughout lesson):**\n- **Observation during Explore:** Note which students accurately describe water motion and use directional language (push, move, go).\n- **Vocabulary Check during Explain:** Listen for correct use of \"wave,\" \"splash,\" \"force,\" and \"motion\" in student responses.\n- **Questioning during Elaborate:** Ask follow-up questions like *\"Why did the water do that?\" and \"What made it move?\"* to gauge understanding of cause-and-effect.\n\n**Summative Assessment—Exit Ticket (5–10 minutes):**\n\nAdminister one of the following (choose based on your class):\n\n**Option A: Picture and Label**\n- Provide a simple drawing or printed photo of a wave hitting a rock.\n- Ask students to label or point to: the wave, the splash, the force, and something that is moving.\n- Accept drawings, oral responses, or pointing.\n\n**Option B: Oral Response**\n- Ask each student individually or in small groups:\n  1. *\"What happens when a wave hits the rocks in the ocean?\"*\n  2. *\"What does the word 'splash' mean? Can you show me with your hand?\"*\n  3. *\"Did your water move when you pushed it? What made it move?\"*\n- Record yes/no and note student language.\n\n**Option C: Draw and Write/Tell**\n- Students draw their own picture of a wave splashing on rocks.\n- They label or dictate: *\"The wave has... The water splashes because...\"*\n\n**Success Criteria:**\n\n✓ Students can describe wave motion using words like \"move,\" \"push,\" \"splash,\" or \"wave.\"\n\n✓ Students understand that a push (force) makes water move (motion).\n\n✓ Students can identify objects in the photograph that are moving or splashing.\n\n✓ Students can predict what will happen when a wave hits an object and observe the results.\n\n**Expected Student Outcomes:**\n- Most First Graders will demonstrate understanding through observable actions (showing a pushing motion), using vocabulary, and describing splashing or movement.\n- Some students may draw or dictate detailed observations; others may simply point or use one-word answers—both are valid for this grade level.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified Vocabulary:** Use only 2 key words consistently: \"wave\" and \"splash.\" Pair these with gestures (hand motions) every time. Example: *\"Let's make a big SPLASH!\"* (clap hands to represent splash).\n\n2. **Hand-Over-Hand Guidance:** During Explore, physically guide a student's hand to push the water gently, then watch together. Narrate: *\"We pushed the water. Look—it moved! There's the splash!\"*\n\n3. **Reduced Complexity in Elaborate:** Instead of testing multiple objects, let this group focus on one object and one push (gentle), then celebrate their observation: *\"Great scientists observed carefully!\"*\n\n### Challenge (for advanced learners):\n\n1. **Deeper Prediction and Testing:** Ask: *\"What if we used really salty water instead? What if we made the water colder? Do you think the splash would be different? Let's test your idea!\"* (Supports scientific inquiry and hypothesis testing.)\n\n2. **Comparative Language:** Encourage use of comparative words: *\"This splash is bigger/smaller/higher/lower than the last one. Why do you think that happened?\"*\n\n3. **Real-World Problem-Solving:** *\"Ocean waves are dangerous for swimmers. How could we protect someone from a big splash? Could a rock wall help? Could a net? Draw or build your idea.\"* (Connects to engineering and safety.)\n\n---\n\n## Extension Activities\n\n1. **Sensory Science Journal:** Over 2–3 days, students draw and dictate observations about water in different contexts: a raindrop hitting a puddle, water splashing in a sink, rain on a window. Ask: *\"What moved? What made it move? How is this like our ocean waves?\"* (Builds pattern recognition.)\n\n2. **Water and Light Investigation:** Return to basins with water. Shine a flashlight or turn off lights and use a window's sunlight on the splashing water. Ask: *\"Do the water droplets look different when light hits them? Why?\"* (Connects to 1-PS4-3 and the brightness visible in the photograph.)\n\n3. **Wave Story and Drawing:** Read a simple book about ocean waves or the beach (e.g., *Wave* by Suzy Lee or a nature picture book). Students draw their own wave pictures and dictate or write: *\"My wave splashes because...\"* (Integrates literacy and reinforces concepts.)\n\n4. **Movement Drama:** Play music and ask students to move their bodies like waves: *\"First, be gentle waves. Now be big, crashing waves! What made you move differently? The music—it was faster and louder, like a big force!\"* (Kinesthetic learning and energy connections.)\n\n---\n\n## Notes for the Teacher\n\n- **Safety First:** Establish water-table expectations (water stays in the basin, gentle hands, immediate cleanup of spills). Consider aprons or old clothes.\n- **Photo Visibility:** Ensure all students can see the photograph clearly multiple times throughout the lesson. Revisit it during Explain and Elaborate phases to maintain connection.\n- **Vocabulary Scaffolding:** For English Language Learners, use visuals (drawings, photos) paired with words every time. Repeat key words across all 5E phases.\n- **Inclusive Participation:** Students with fine-motor challenges can observe and describe what a partner does; students with hearing needs should sit close during whole-group instruction.\n- **Real-World Relevance:** If your school is near a beach, lake, or creek, consider a field trip as a culminating experience. If not, a video of real ocean waves (1–2 minutes) during Explain phase is a powerful anchor.\n\nThis lesson meets First Grade physical science standards by engaging students in observation, prediction, and discovery of waves, force, and motion—concrete phenomena they can see, experience, and replicate in the classroom.",
  "inputTokens": 2380,
  "outputTokens": 3997,
  "cost": 0.022365,
  "generatedAt": "2026-02-13T00:18:16.095Z"
}