{
  "id": 68,
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "content": "## 📸 Photo Description\n\nThis photo captures a dynamic coastal scene where powerful waves are crashing against a line of large, dark, angular rocks. The water is a mix of gray and white, indicating a turbulent sea. The most prominent feature is the large splash of white water and sea spray erupting upwards as the wave hits the rocks. The foreground consists of a gravel or pebble-covered shore. The sky is a pale, overcast gray, suggesting a cool or windy day. The image shows the interaction between the water and the solid rock.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the interaction between moving water and a solid surface, resulting in the transfer of kinetic energy. The large waves are a form of mechanical energy. When a wave hits a rock, its kinetic energy is transferred to the rock. This transfer causes the water to splash upwards and outwards, and it can also lead to erosion over time. The white color of the sea spray is due to air being trapped in the turbulent water, scattering light in all directions.\n\n## 📚 Core Concepts\n\n1\\.  **Energy Transfer:** The kinetic energy of the moving water is transferred to the rock upon impact. This energy can cause the rock to move slightly and is responsible for the splash and spray.  \n2\\.  **Mechanical Forces:** The force of the water moving against the rock is a mechanical force. This force is strong enough to break apart rocks over long periods, a process called erosion.  \n3\\.  **Properties of Matter:** The water is a liquid that flows and splashes. The rocks are solids that are hard and can be broken down by the force of the water. The interaction shows how different states of matter behave when they meet.\n\n<pedagogical-tip>  \nUse a simple simulation or model\\! Have students use a large bowl of water and a block of clay or a rock. They can push the object through the water to observe the splash and wave patterns. This hands-on model helps them visualize how the water's energy is transferred and how the shape of the object affects the splash.  \n</pedagogical-tip>\n\n<udl-suggestions>  \n\\- **Visual Modeling:** Provide a diagram or video of a wave hitting a rock for students who need visual support.  \n\\- **Kinesthetic Learning:** Have students act out the roles of water molecules and rocks to understand energy transfer.  \n\\- **Sensory Exploration:** Play a recording of ocean waves crashing to help students connect the sound to the visual phenomenon.  \n\\- **Differentiated Materials:** Provide tactile models of waves and rocks for students to explore.  \n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n\\- [[NGSS:DCI:3-PS2.A]]: Forces and Motion  \n\\- [[NGSS:DCI:3-ESS2.A]]: Earth's Systems  \n\\- [[NGSS:CCC:Energy]]: Energy can be transferred in different ways  \n\\- [[NGSS:CCC:Patterns]]: Observing patterns in natural events like erosion  \n\\- [[NGSS:PE:3-5-ETS1-1]]: Define a simple design problem involving forces and motion\n\n## 💬 Discussion Questions\n\n1\\.  What happened to the water when the wave hit the rock? (Bloom's: Recall) (DOK: 1)  \n2\\.  Why do you think the water splashed up so high? (Bloom's: Understand) (DOK: 2)  \n3\\.  How might the water hitting the rocks be like a hammer hitting a nail? (Bloom's: Analyze) (DOK: 3)  \n4\\.  What do you think will happen to the rocks over a very long time because of the waves? (Bloom's: Evaluate) (DOK: 4)\n\n## 📖 Vocabulary\n\n* **Energy:** The ability to make things move or change.  \n* **Force:** A push or a pull that can make something move.  \n* **Erosion:** The process of wearing away rock or soil by water, wind, or ice.  \n* **Kinetic Energy:** The energy of moving things.  \n* **Splash:** The sudden burst of liquid when something hits it.",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis photo shows a large wave crashing against some rocks near the shore. We can see the powerful wave hitting the rocks and causing a big splash of water and white foam to shoot up into the air. The rocks look dark and jagged, and the sky appears gray and cloudy, suggesting it may be a windy or stormy day.\n\n## 🔬 Scientific Phenomena\n\nIn this photo, we are seeing the force of the moving water, or the kinetic energy of the wave, being transferred to the solid rocks. When the wave hits the rocks, the force causes the water to splash up and outwards in all directions. This shows how energy can be transferred from one object (the wave) to another (the rocks).\n\n## 📚 Core Science Concepts\n\n1. **Force:** The wave crashing against the rocks is an example of a force - a push or pull that can make something move or change shape.\n2. **Energy Transfer:** The kinetic energy of the moving wave is transferred to the rocks, causing the dramatic splash.\n3. **States of Matter:** The water is a liquid that can flow and splash, while the rocks are a solid material that the water interacts with.\n\n<pedagogical-tip>\nTo help young students understand these concepts, try using a hands-on demonstration. Fill a container with water and have students gently push a block or rock through the water to see the splash. Discuss how the force of their push is transferred to the water, causing it to move and splash.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Supports:** Provide images or videos of waves crashing against rocks to support visual learners.\n- **Multisensory Exploration:** Allow students to feel the force of moving water by having them splash water with their hands.\n- **Flexible Grouping:** Encourage students to work together to explore the concepts through guided small-group activities.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-PS2.A]]: Forces and Motion\n- [[NGSS:CCC:Energy]]: Energy can be transferred in various ways\n\n## 💬 Discussion Questions\n\n1. What do you notice happening when the wave hits the rocks? (Bloom's: Remembering, DOK: 1)\n2. Why do you think the water splashes up so high? (Bloom's: Understanding, DOK: 2)\n3. How is the force of the wave on the rocks similar to pushing a toy car? (Bloom's: Analyzing, DOK: 3)\n4. What do you think would happen to the rocks over a long time if the waves kept hitting them? (Bloom's: Evaluating, DOK: 4)\n\n## 📖 Vocabulary\n\n- **Force:** A push or a pull that can make something move or change.\n- **Kinetic Energy:** The energy of moving things, like the wave.\n- **Splash:** The sudden burst of liquid when something hits the water.\n- **Solid:** A type of matter that has a fixed shape and volume, like the rocks.\n- **Liquid:** A type of matter that can flow and take the shape of its container, like the water.\n- **Transfer:** To move something from one place to another, like the energy from the wave to the rocks.\n\n## 🌡️ Extension Activities\n\n1. Experiment with different objects (blocks, toys, etc.) and observe how they interact with water when pushed or dropped. Discuss the differences in the splashes.\n2. Create a model or draw a diagram showing how the energy from the wave is transferred to the rocks.\n3. Go on a nature walk and observe other examples of water interacting with solid objects, such as rivers, waterfalls, or puddles.",
    "grade1": "## 📸 Photo Description\n\nThe photo shows a large wave crashing against a rocky coastline. The wave is sending a big splash of white, foamy water up into the air as it hits the rocks. The rocks are dark and jagged, and the water is a mix of gray and white, showing how turbulent and powerful the wave is.\n\n## 🔬 Scientific Phenomena\n\nThis photo demonstrates the force of moving water and how it interacts with solid objects like rocks. The wave has a lot of kinetic energy, or energy of motion. When the wave hits the rocks, that energy is transferred to the rocks, causing the dramatic splash. The force of the water against the rocks can also slowly wear them down over time, a process called erosion.\n\n## 📚 Core Science Concepts\n\n1. **Force:** The wave hitting the rocks is an example of a force, which is a push or pull that can make something move or change.\n2. **Energy Transfer:** The kinetic energy of the moving water is transferred to the rocks when the wave hits, causing the splash.\n3. **Properties of Matter:** The water is a liquid that can flow and splash, while the rocks are solids that are hard and can be worn down over time.\n\n<pedagogical-tip>\nUse a hands-on demonstration to help students understand the concepts. Set up a small container of water and let students gently push a block or rock into the water to see the splash. Discuss how the force of their push is like the force of the wave hitting the rocks.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide a diagram or video showing the interaction between waves and rocks to support visual learners.\n- **Tactile Exploration:** Allow students to explore different objects (like blocks and rocks) in water to experience the force and energy transfer.\n- **Verbal Engagement:** Encourage students to describe what they observe and ask questions to support verbal/linguistic learners.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-PS2.A]]: Forces and Motion\n- [[NGSS:DCI:1-PS4.A]]: Wave Properties\n- [[NGSS:CCC:Energy]]: Energy can be transferred in different ways\n\n## 💬 Discussion Questions\n\n1. What do you see happening in the photo? (Bloom's: Remembering, DOK: 1)\n2. Why do you think the water splashes up so high when it hits the rocks? (Bloom's: Understanding, DOK: 2)\n3. How is the wave's energy transferred to the rocks? (Bloom's: Analyzing, DOK: 3)\n4. What might happen to the rocks over a long period of time due to the waves? (Bloom's: Evaluating, DOK: 4)\n\n## 📖 Vocabulary\n\n- **Force:** A push or pull that can make something move or change.\n- **Energy:** The ability to make things move or change.\n- **Kinetic Energy:** The energy of moving things, like the wave.\n- **Splash:** The sudden burst of liquid when something hits it.\n- **Erosion:** The process of wearing away rock or soil over time.\n- **Matter:** Anything that has mass and takes up space, like water and rocks.\n\n## 🌡️ Extension Activities\n\n1. Conduct a simple experiment where students push objects (like blocks or rocks) into water and observe the splash patterns.\n2. Have students create their own wave models using materials like containers, water, and objects to represent the coastline.\n3. Investigate how the shape and size of rocks might affect how the waves interact with them, leading to different splash patterns.",
    "grade2": "## 📸 Photo Description\n\nThis photo shows a large wave crashing against a rocky shoreline. The wave is a towering wall of water, topped with white, foaming spray. As the wave hits the rocks, it creates a massive splash, sending water and mist high into the air. The rocks are dark and jagged, providing a sturdy barrier against the power of the waves. The sky is gray and cloudy, suggesting a stormy or windy day.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the concept of force, specifically the force of moving water (the wave) interacting with a solid surface (the rocks). When the wave hits the rocks, the kinetic energy of the moving water is transferred to the rocks, causing the dramatic splash and spray. The force of the water hitting the rocks is strong enough to overcome the resistance of the solid surface, creating this powerful interaction.\n\n## 📚 Core Science Concepts\n\n1. **Force:** A force is a push or pull that can make something move, stop, or change direction. In this image, the force of the moving water (the wave) is interacting with the force of the stationary rocks.\n2. **Energy Transfer:** As the wave hits the rocks, the kinetic energy of the moving water is transferred to the rocks, causing the splash and spray.\n3. **Interaction of Matter:** This image shows the interaction between the liquid (water) and the solid (rocks), demonstrating how different states of matter behave when they come into contact.\n\n<pedagogical-tip>\nTo help students understand the concepts in this photo, use a hands-on demonstration with a container of water and a solid object (like a block or a rock). Have students gently push the object through the water and observe the splash. Discuss how the force of the moving object (the student's hand) is transferred to the water, causing the splash. Then, have students try pushing the object harder and observe the differences in the splash.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide visual aids, such as diagrams or animations, to help students understand the concept of force and energy transfer.\n- **Kinesthetic Learning:** Encourage students to physically act out the interaction between the water and the rocks, using their bodies to demonstrate the forces and energy transfer.\n- **Differentiated Instruction:** Offer different materials for students to explore the concept of force, such as various objects of different shapes and sizes that they can push through water.\n- **Multimodal Presentation:** Incorporate audio, such as the sound of waves crashing, to help students connect the visual information with their other senses.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS3-1]] - Plan and conduct an investigation to determine the effect of placing objects of different shapes in the path of a beam of light and the effect of placing objects of different materials in the path of a beam of light.\n- [[NGSS:DCI:2-PS3-2]] - Demonstrate and explain that pushing or pulling an object can change the speed or direction of its motion and can start or stop it.\n- [[NGSS:CCC:Cause-and-Effect]] - Explain how the shape and material of objects affect the way light behaves and how objects move.\n\n## 💬 Discussion Questions\n\n1. What do you notice happening to the water when it hits the rocks? (Bloom's: Remembering, DOK: 1)\n2. Why do you think the water splashes up so high when it hits the rocks? (Bloom's: Understanding, DOK: 2)\n3. How is the force of the water hitting the rocks similar to a ball hitting a wall? (Bloom's: Analyzing, DOK: 3)\n4. What do you think would happen to the rocks over time if the waves continued to crash against them? (Bloom's: Evaluating, DOK: 4)\n\n## 📖 Vocabulary\n\n1. **Force:** A push or pull that can make something move, stop, or change direction.\n2. **Energy:** The ability to do work or make things happen.\n3. **Kinetic Energy:** The energy of something that is moving.\n4. **Interaction:** When two or more things come together and affect each other.\n5. **Solid:** A state of matter that has a fixed shape and volume, like a rock.\n6. **Liquid:** A state of matter that has a fixed volume but can change shape, like water.\n\n## 🌡️ Extension Activities\n\n1. **Exploring Different Forces:** Have students experiment with different types of forces, such as pushing or pulling objects, and observe how the objects move or change.\n2. **Designing a Wave Barrier:** Challenge students to design and build a model of a structure that could protect a coastal area from the force of crashing waves.\n3. **Investigating Erosion:** Encourage students to explore the concept of erosion by observing the effects of water or wind on different materials over time, such as by placing rocks or soil in a stream or under a fan.",
    "grade3": "## 📸 Photo Description\n\nThis photo shows a powerful wave crashing against a rocky shoreline. The wave has crashed into a large, jagged rock, causing the water to erupt upwards in a dramatic splash. The water appears gray and foamy, indicating the turbulent force of the wave. The rocks in the foreground are dark and angular, contrasting with the white spray of the wave. The overcast sky and gloomy atmosphere suggest a stormy, windy day.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the concept of force and how it can transfer energy. The moving wave, which has kinetic energy, collides with the stationary rock. This collision causes the wave's energy to be transferred to the rock, resulting in the spectacular splash. The force of the wave against the rock is a mechanical force that can lead to the gradual erosion of the rock over time.\n\n## 📚 Core Science Concepts\n\n1. **Force**: The push or pull that can make something move or change direction. The wave exerts a force on the rock, causing the splash.\n2. **Energy Transfer**: The kinetic energy of the moving wave is transferred to the rock upon impact, causing the water to splash upwards.\n3. **Erosion**: The gradual wearing away of the rock by the repeated force of the waves over time. This is a slow process that can reshape the coastline.\n\n<pedagogical-tip>\nEngage students in a hands-on demonstration to help them visualize the concept of force and energy transfer. Have them use their hands to \"push\" against a wall or table, then observe the resulting motion and splash. Discuss how the force of their push is similar to the wave hitting the rock in the image.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Provide diagrams or animations to help students visualize the energy transfer and force involved in the wave-rock interaction.\n- **Kinesthetic Learning**: Allow students to act out the wave-rock collision using their bodies or small-scale models.\n- **Varied Representations**: Encourage students to draw or create 3D models to represent the scientific concepts.\n- **Flexible Grouping**: Pair students to discuss and explore the phenomena, allowing for peer-to-peer learning.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-PS2.A]] - Forces and Motion: Patterns of motion can be used to predict future motion.\n- [[NGSS:DCI:3-ESS2.A]] - Earth's Systems: Climates are the result of complex interactions involving the Earth's surface and atmosphere.\n- [[NGSS:CCC:Energy]] - Energy can be transferred in various ways and between objects.\n- [[NGSS:CCC:Patterns]] - Observed patterns in nature can be used to make predictions.\n\n## 💬 Discussion Questions\n\n1. What do you think caused the large splash of water? (Bloom's: Understand, DOK: 2)\n2. How do you think the force of the wave affected the rock? (Bloom's: Analyze, DOK: 3)\n3. If the waves continued to hit the rock over a long time, what do you think might happen to the rock? (Bloom's: Evaluate, DOK: 4)\n4. Can you think of other examples in nature where you have seen something similar to the wave-rock interaction in this photo? (Bloom's: Create, DOK: 4)\n\n## 📖 Vocabulary\n\n- **Force**: A push or a pull that can make something move or change direction.\n- **Kinetic Energy**: The energy of a moving object, such as the wave in the image.\n- **Collision**: When two objects come together with force, like the wave and the rock.\n- **Erosion**: The gradual wearing away of rocks or soil by natural forces like water, wind, or ice.\n- **Mechanical Force**: A force that acts on an object, causing it to move, change shape, or change direction.\n- **Splash**: The sudden burst of liquid when something, like the wave, hits a surface.\n\n## 🌡️ Extension Activities\n\n1. Have students experiment with making their own waves and observing how they interact with different objects, such as blocks or toy cars. Discuss how the shape and size of the object affects the splash.\n2. Conduct a class experiment on erosion by placing different materials (rocks, soil, sand) in trays and using water to simulate the effects of waves over time. Observe and record the changes.\n3. Invite students to research famous coastal landmarks and how they have been shaped by the forces of waves and erosion over time. Have them create a presentation or model to share their findings.",
    "grade4": "## 📸 Photo Description\n\nThis photo shows a dramatic scene of crashing waves against large, rugged rocks along a coastline. Powerful waves with white, foaming tops are colliding with the dark, angular rocks, causing large splashes of water and sea spray to erupt into the air. The rocks appear weathered and worn, suggesting the continuous action of the waves over time. The sky is overcast, giving the scene a stormy, moody atmosphere.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the transfer of kinetic energy as the moving waves collide with the solid rocks. The kinetic energy of the waves is converted into other forms of energy, such as potential energy in the rising water spray and thermal energy through the force of impact. This energy transfer can lead to the gradual erosion of the rocks over time, as the repeated impacts wear down the rock surface.\n\n## 📚 Core Science Concepts\n\n1. **Forces and Motion:** The crashing waves exert a strong force on the rocks, causing the water to splash and the rocks to be worn down over time.\n2. **Energy Transfer:** The kinetic energy of the moving water is transferred to the rocks, causing the water to splash upward and the rocks to be slowly eroded.\n3. **Properties of Matter:** The interaction between the liquid water and the solid rocks demonstrates how different states of matter can affect each other through the application of force.\n\n<pedagogical-tip>\nEngage students in a hands-on demonstration to help them visualize the energy transfer process. Have them use a container of water and various objects (e.g., rocks, blocks) to model how the kinetic energy of the \"waves\" is transferred to the \"rocks.\" Encourage them to observe and describe the resulting splashes and changes to the objects.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide diagrams or animations to help students visualize the energy transfer and erosion processes.\n- **Multisensory Experiences:** Incorporate audio recordings of ocean waves to enhance the sensory connection to the phenomenon.\n- **Flexible Grouping:** Allow students to work collaboratively to explore the concepts through discussions and hands-on activities.\n- **Varied Responses:** Offer students multiple ways to demonstrate their understanding, such as drawings, models, or written explanations.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-PS3.A]]: Explaining Energy\n- [[NGSS:DCI:4-PS3.B]]: Conservation of Energy and Energy Transfer\n- [[NGSS:DCI:4-ESS2.A]]: Earth's Materials and Systems\n- [[NGSS:CCC:Cause and Effect]]: Cause and effect relationships can be used to explain change.\n\n## 💬 Discussion Questions\n\n1. What happens when the waves hit the rocks? (Bloom's: Remember) (DOK: 1)\n2. How does the energy of the moving water affect the rocks? (Bloom's: Understand) (DOK: 2)\n3. What evidence in the image suggests that the waves have been hitting the rocks for a long time? (Bloom's: Analyze) (DOK: 3)\n4. How could the energy transfer between the waves and rocks be used to do work or generate power? (Bloom's: Evaluate) (DOK: 4)\n\n## 📖 Vocabulary\n\n- **Force:** A push or pull that can cause an object to move, stop, or change direction.\n- **Kinetic Energy:** The energy of motion, possessed by an object that is moving.\n- **Potential Energy:** The stored energy of an object due to its position or state.\n- **Erosion:** The process by which the surface of the Earth is worn away by the action of water, wind, ice, or other natural agents.\n- **Matter:** Anything that has mass and occupies space.\n- **Conservation of Energy:** The principle that energy can neither be created nor destroyed, but can only be transformed or transferred.\n\n## 🌡️ Extension Activities\n\n1. **Modeling Erosion:** Have students create their own model of coastal erosion using a shallow tray, water, and different materials (e.g., sand, gravel, clay) to represent the land and rocks. Encourage them to observe and record the changes over time.\n2. **Designing a Wave-Powered Generator:** Challenge students to design a simple device that could harness the energy of the waves to generate electricity or perform other useful work.\n3. **Exploring the Effects of Wave Shape:** Investigate how the shape and size of the waves (e.g., tall, short, steep, gentle) affect the energy transfer and erosion process. Students can experiment with different wave patterns and observe the results.",
    "grade5": "## 📸 Photo Description\n\nThis image shows a powerful wave crashing against a rocky coastline. The wave is a towering wall of churning, white water that is slamming into the large, dark rocks along the shore. The impact of the wave creates a huge spray of water and sea foam erupting upwards, reaching several feet into the air. The rocky shore is covered in smaller stones and pebbles, and the overcast, gray sky suggests a cold, windy day.\n\n## 🔬 Scientific Phenomena\n\nThis photograph demonstrates the concept of forces acting on matter. The large, crashing wave represents a powerful force - the kinetic energy of the moving water. When this wave hits the solid, unmoving rocks, the force of the water is transferred to the rocks. This transfer of energy causes the dramatic splashing and spraying effect we see in the image. The force of the water is strong enough to temporarily push the rocks back and disrupt their stationary state. Over time, this repeated force can also gradually erode and break down the rocks.\n\n## 📚 Core Science Concepts\n\n1. **Forces and Motion:** The crashing wave represents a force (the kinetic energy of the moving water) that is interacting with the stationary rocks, causing them to move and the water to splash up.\n\n2. **Energy Transfer:** The kinetic energy of the wave is transferred to the rocks upon impact, causing the dramatic spray and splash effect.\n\n3. **Properties of Matter:** The water is a liquid that can flow and splash, while the rocks are solid objects that resist the force of the water.\n\n<pedagogical-tip>\nTo help students visualize and understand the concepts in this image, try setting up a simple hands-on demonstration. Have students gently push a solid object (like a block or a rock) through a tub of water to observe the splash pattern. Discuss how the shape and force of the object interacting with the water creates the splash. This tactile experience will reinforce the key ideas of forces, energy transfer, and the properties of matter.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids:** Provide diagrams or videos showing the motion of waves and the impact on rocks to support students who learn best visually.\n- **Kinesthetic Learning:** Encourage students to act out the roles of the waves and rocks, using their bodies to demonstrate the energy transfer.\n- **Multimodal Presentation:** Combine the visual image with audio recordings of crashing waves to engage students' senses and help them connect the concepts.\n- **Differentiated Materials:** Offer physical models of waves and rocks for students to explore and manipulate, especially for those who need more concrete, hands-on experiences.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-PS2.B]]: Types of Interactions (Forces and Motion)\n- [[NGSS:DCI:5-PS3.D]]: Energy in Chemical Processes and Everyday Life\n- [[NGSS:CCC:Energy]]: The way forces interact can change the energy of objects.\n\n## 💬 Discussion Questions\n\n1. What happened to the water when it hit the rocks? (Bloom's: Remembering, DOK: 1)\n2. Why do you think the water splashed up so high? (Bloom's: Understanding, DOK: 2)\n3. How is the force of the water on the rocks similar to a hammer hitting a nail? (Bloom's: Analyzing, DOK: 3)\n4. What do you think might happen to the rocks over a long period of time due to the waves? (Bloom's: Evaluating, DOK: 4)\n\n## 📖 Vocabulary\n\n- **Force:** A push or pull that can make something move or change.\n- **Kinetic Energy:** The energy of moving things, like the crashing wave.\n- **Energy Transfer:** The movement of energy from one object to another, such as from the wave to the rocks.\n- **Erosion:** The process of wearing away or breaking down rocks and soil over time, often by the action of water, wind, or ice.\n- **Solid:** A state of matter that has a fixed shape and volume, like the rocks.\n- **Liquid:** A state of matter that can flow and take the shape of a container, like the water.\n\n## 🌡️ Extension Activities\n\n1. **Wave Tank Exploration:** Set up a small wave tank or container of water and have students experiment with different objects (rocks, sticks, etc.) to observe how the water interacts with them. Encourage them to observe the patterns of splashing and energy transfer.\n\n2. **Erosion Simulation:** Create a simple erosion simulation by placing a tray of soil or sand at an angle and slowly pouring water over it. Observe how the water gradually wears away and moves the soil/sand. Discuss how this relates to the erosion of rocks over time.\n\n3. **Engineering Challenge:** Task students with designing and building a structure (using materials like clay, sticks, or paper) that can withstand the \"force\" of moving water. Test their designs by pouring water over them and observe how well they hold up."
  }
}