{
  "id": 68,
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p30.jpg",
  "content": "## 📸 Photo Description\n\nOcean waves crash against dark rocks on a beach, creating white foam and spray. The water hits the rocks with great force, sending water droplets high into the air. You can see the sandy beach in front of the rocks and the ocean stretching far away.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the **Anchoring Phenomenon** of wave energy transfer and erosion. Ocean waves carry energy from wind across great distances. When this moving water hits solid objects like rocks, the energy is transferred on impact, creating the dramatic splash and spray visible in the photo. Over long periods of time, this constant force of water hitting rocks breaks them down into smaller pieces, which eventually become the sand on beaches. This is a perfect example of how energy can be transferred from one object to another and how forces can change the shape of Earth's surface.\n\n## 📚 Core Science Concepts\n\n1. **Energy Transfer**: Moving water carries energy that gets transferred when it hits objects like rocks\n2. **Forces and Motion**: The force of moving water can change the motion of objects and break apart materials\n3. **Weathering and Erosion**: Water constantly hitting rocks breaks them down over time, creating smaller rock pieces and sand\n4. **States of Matter**: Water exists as a liquid in the ocean but creates tiny droplets in the air when it splashes\n\n<pedagogical-tip>Use this image to help students make the connection between everyday experiences (like splashing in a bathtub) and larger Earth processes. Ask them to think about what happens when they jump in a pool - the same energy transfer is happening here, just on a much bigger scale!</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to explore this concept by having them create wave motions with their arms, use a spray bottle to demonstrate water droplets, or shake a container with water and small rocks to simulate the erosion process. This gives kinesthetic learners a hands-on way to understand the phenomena.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In**: At the molecular level, water molecules are constantly moving and bumping into each other. When waves crash, these tiny particles hit the rock surface with tremendous force, gradually wearing away microscopic pieces of the rock's surface.\n\n2. **Zoom Out**: This wave action is part of the global water cycle and ocean current systems. Winds across entire ocean basins create these waves, and the erosion happening here contributes to the formation of beaches, coastal changes, and sediment that travels hundreds of miles through ocean currents.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"Rocks are too hard for water to break them.\"\n   **Reality**: Water may seem soft, but when it moves with force over long periods of time, it can break down even the hardest rocks.\n\n2. **Misconception**: \"The splashing water just bounces off and doesn't change anything.\"\n   **Reality**: Each wave carries away tiny pieces of rock, and over many years, this creates significant changes to coastlines and beaches.\n\n3. **Misconception**: \"Waves only move up and down.\"\n   **Reality**: Waves carry energy forward across the ocean, even though the water itself mostly moves in circular motions.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 3-PS2-1 - Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object\n- **Disciplinary Core Ideas**: [[NGSS:DCI:3-PS2.A]] Forces and Interactions, [[NGSS:DCI:2-ESS1.C]] The History of Planet Earth\n- **Crosscutting Concepts**: [[NGSS:CCC:Cause and Effect]], [[NGSS:CCC:Energy and Matter]]\n\n## 💬 Discussion Questions\n\n1. What do you think would happen if these waves hit the rocks every day for 100 years? (Bloom's: Analyze | DOK: 3)\n\n2. Where do you think the energy in these waves came from originally? (Bloom's: Analyze | DOK: 2)\n\n3. How is this wave crashing similar to what happens when you throw a ball against a wall? (Bloom's: Apply | DOK: 2)\n\n4. What evidence can you see in the photo that shows energy is being transferred? (Bloom's: Evaluate | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Energy**: The ability to cause motion or create change in matter\n* **Force**: A push or pull that can change how objects move\n* **Erosion**: The process of breaking down rocks and moving the pieces to new places\n* **Transfer**: To move something from one place or object to another\n* **Impact**: When one object hits another object with force\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math Connection - Measurement & Data**: Have students measure the height of wave splashes by taking photos at the same location over several days. They can create a bar graph showing which day had the biggest splashes. This connects to 3.MD.B.3 (Represent and interpret data).\n\n2. **ELA Connection - Descriptive Writing**: Ask students to write a short story or poem describing what it \"feels like\" to be a water droplet in a crashing wave. They can use sensory words (wet, cold, fast, loud) to describe the journey of water from the ocean to the rocks. This builds vocabulary and creative expression skills.\n\n3. **Social Studies Connection - Coastal Communities**: Discuss how people who live near the ocean experience waves and erosion. Students can research or discuss how communities protect their beaches and homes from wave erosion, introducing concepts of human-environment interaction and adaptation.\n\n4. **Art Connection - Mixed Media**: Students can create an artistic representation of wave energy using various materials (paint, sand, tissue paper, blue fabric) to show the movement and power of water. This helps them express scientific understanding through creative means.\n\n## 🚀 STEM Career Connection\n\n1. **Geologist/Earth Scientist**: Geologists study rocks, soil, and how Earth changes over time. A geologist might visit beaches like the one in this photo to understand how waves shape the coastline and what the rocks tell us about Earth's history. They help us predict changes to beaches and protect coastal communities. **Average Salary: $92,000/year**\n\n2. **Oceanographer**: Oceanographers study the ocean, waves, currents, and how water moves around Earth. They use tools and boats to measure waves and understand how ocean energy affects beaches and sea life. Some oceanographers even work to protect beaches from erosion. **Average Salary: $75,000/year**\n\n3. **Coastal Engineer**: Coastal engineers design walls, barriers, and other structures to protect beaches and towns from strong waves and erosion. They use science and math to figure out how to stop waves from washing away sand and rocks, keeping people safe. **Average Salary: $85,000/year**\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Patricia Whitehouse\n- The Magic School Bus at the Waterworks by Joanna Cole\n- National Geographic Readers: Storms by Miriam Goin",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nBig waves crash into dark rocks by the ocean. The water splashes high into the air. Sand covers the ground near the rocks.\n\n## 🔬 Scientific Phenomena\n\nThis image shows the **Anchoring Phenomenon** of wave erosion and weathering. Ocean waves carry tremendous energy that constantly pounds against rocky coastlines. The force of moving water breaks off small pieces of rock over time, gradually wearing them down and changing their shape. The splashing action also moves sand and smaller rock pieces around the beach, demonstrating how water can transport materials from one place to another.\n\n## 📚 Core Science Concepts\n\n1. **Forces and Motion:** Moving water creates a pushing force that can move rocks and sand\n2. **Weathering:** Water breaks down rocks into smaller pieces over long periods of time\n3. **Energy Transfer:** Waves carry energy from the ocean and release it when they hit the shore\n4. **Material Properties:** Some materials (like rocks) are harder to move than others (like sand)\n\n<pedagogical-tip>Use sensory experiences to help kindergarteners understand forces. Have students push against a wall to feel how they create force, then connect this to how waves push against rocks.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways to represent wave motion through body movements, sound effects, and visual demonstrations. Let students act out being waves crashing into \"rock\" students to engage kinesthetic learners.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** At the tiny level, water molecules are constantly bumping into the rock surface, loosening microscopic pieces and carrying them away grain by grain.\n\n2. **Zoom Out:** This beach is part of a massive ocean system where waves travel thousands of miles, carrying energy from storms and wind patterns across entire continents before reaching this shore.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception:** \"Rocks never change because they are hard.\"\n   **Clarification:** Even hard rocks change over time when water hits them again and again.\n\n2. **Misconception:** \"Waves only move water.\"\n   **Clarification:** Waves can move sand, shells, and small rocks too because they are very strong.\n\n3. **Misconception:** \"The ocean stays in one place.\"\n   **Clarification:** Ocean water is always moving and can carry things from far away places.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation:** K-2-ETS1-1 Ask questions, make observations, and gather information about a situation people want to change\n- **Disciplinary Core Ideas:** [[NGSS:DCI:K-2-ETS1.A]] (Asking Questions and Defining Problems)\n- **Crosscutting Concepts:** [[NGSS:CCC:Cause and Effect]], [[NGSS:CCC:Patterns]]\n\n## 💬 Discussion Questions\n\n1. What do you think happens to the rocks when waves hit them every day? (Bloom's: Analyze | DOK: 2)\n2. How might the beach look different after many years of waves? (Bloom's: Evaluate | DOK: 3)\n3. What other things in nature can change rocks? (Bloom's: Apply | DOK: 2)\n4. Why do you think some rocks are smooth and others are rough? (Bloom's: Analyze | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Wave:** Moving water that goes up and down in the ocean\n* **Force:** A push or pull that can move things\n* **Erosion:** When water or wind wears away rocks and soil\n* **Weathering:** When rocks break into smaller pieces over time\n* **Energy:** The power to make things move or change\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math - Patterns & Counting:** Have students count rocks of different sizes on the beach and create patterns with them (big, small, big, small). Graph which rocks are smooth vs. rough to practice data collection and comparison.\n\n2. **ELA - Descriptive Language & Storytelling:** Read books about ocean animals and create class stories about \"the life of a rock.\" Students can dictate or draw what happens to a rock as waves crash on it, developing sequencing and cause-and-effect language skills.\n\n3. **Art - Texture Exploration & Collage:** Students create textured artwork by rubbing crayons over rough rocks and smooth rocks (rock rubbings), then glue collected sand and small pebbles onto paper to make beach scenes, exploring different surface textures.\n\n4. **Social Studies - Community Helpers:** Discuss people who work at beaches and oceans (lifeguards, marine biologists, beach cleanup workers). Take a virtual or real beach walk to observe how community members care for our natural spaces.\n\n## 🚀 STEM Career Connection\n\n1. **Marine Biologist:** A scientist who studies ocean animals and plants. They visit beaches and go in boats to learn about fish, crabs, whales, and other creatures that live in the water. They help keep the ocean healthy for all living things. *Average Salary: $65,000 USD*\n\n2. **Geologist:** A scientist who studies rocks, soil, and how the Earth changes over time. They look at rocks on beaches to understand how waves and weather shape our planet. They help us learn about Earth's past and predict changes in the future. *Average Salary: $95,000 USD*\n\n3. **Ocean Engineer:** A person who designs and builds things that work in the ocean, like boats, docks, and tools to protect beaches from big waves. They use science and math to solve problems and keep people safe near the water. *Average Salary: $108,000 USD*\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Suzy Lee\n- The Magic School Bus on the Ocean Floor by Joanna Cole\n- A House for Hermit Crab by Eric Carle",
    "grade1": "## 📸 Photo Description\n\nBig waves crash into dark rocks by the ocean. The water splashes high into the air. You can see foam and bubbles where the water hits the rocks.\n\n## 🔬 Scientific Phenomena\n\nThis image shows the **Anchoring Phenomenon** of wave energy transfer and erosion. Ocean waves carry energy from wind across the water's surface. When waves hit solid objects like rocks, the water's kinetic energy is transferred upon impact, creating dramatic splashing and spray. Over time, this repeated force breaks down rock surfaces through mechanical weathering, gradually changing the shape of coastlines.\n\n## 📚 Core Science Concepts\n\n1. **Energy Transfer:** Waves carry energy from one place to another and release it when they crash\n2. **Force and Motion:** Moving water pushes against rocks with great force\n3. **Weathering:** Water slowly breaks down rocks over long periods of time\n4. **States of Matter:** Water exists as liquid droplets and foam (tiny air bubbles in water)\n\n<pedagogical-tip>Use hand motions to help students understand wave energy - have them move their arms in wave motions and then \"crash\" their hands together to show energy transfer.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to experience wave motion through kinesthetic activities like using a rope to create waves, water tables, or even making waves with a blanket.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** At the molecular level, water molecules are constantly moving and bouncing off each other. When waves crash, these tiny particles hit the rock surface millions of times, slowly wearing away microscopic pieces of mineral.\n\n2. **Zoom Out:** This coastal erosion is part of the larger rock cycle and ocean system. Eroded materials become sediment that travels through ocean currents, eventually forming new beaches and land formations elsewhere on Earth.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception:** \"Rocks are too hard for water to break them\"\n   **Clarification:** Water is very powerful when it moves fast and hits repeatedly over long periods of time\n\n2. **Misconception:** \"The splashing water just disappears\"\n   **Clarification:** The water falls back down into the ocean and continues moving in the wave cycle\n\n3. **Misconception:** \"Waves only happen during storms\"\n   **Clarification:** Waves happen all the time because wind is always blowing somewhere on the ocean\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation:** 1-PS4-1: Plan and conduct investigations to provide evidence that vibrating materials can make sound and that sound can make materials vibrate\n- **Disciplinary Core Ideas:** [[NGSS:DCI:1-PS4.A]] - Sound can make matter vibrate, and vibrating matter can make sound\n- **Crosscutting Concepts:** [[NGSS:CCC:Cause and Effect]] - Simple cause and effect relationships\n\n## 💬 Discussion Questions\n\n1. What do you think makes the waves move toward the rocks? (Bloom's: Analyze | DOK: 2)\n2. How do you think these rocks might look different after many years of waves hitting them? (Bloom's: Evaluate | DOK: 3)\n3. What sounds do you think you would hear if you were standing near these crashing waves? (Bloom's: Apply | DOK: 2)\n4. Where does the splashing water go after it hits the rocks? (Bloom's: Understand | DOK: 1)\n\n## 📖 Science Vocabulary\n\n* **Wave:** Moving water that carries energy from one place to another\n* **Energy:** The power to make things move or change\n* **Force:** A push or pull on something\n* **Erosion:** When water or wind slowly wears away rocks and soil\n* **Foam:** Bubbles of air mixed with water\n* **Impact:** When one thing hits another thing hard\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math - Measurement & Counting:** Have students count how many rocks they can see in the photo, or measure the height of the splash using non-standard units (like handspans or blocks stacked together). Create a simple bar graph showing \"big waves\" vs. \"small waves.\"\n\n2. **ELA - Descriptive Writing & Sensory Language:** Read books about the ocean, then have students draw and write simple sentences describing what they see, hear, and feel at the beach using sensory words like \"splashing,\" \"wet,\" \"loud,\" and \"cold.\"\n\n3. **Social Studies - Community Helpers:** Discuss lifeguards and coast guard workers who help keep people safe at the beach. Take a virtual field trip to a local beach or aquarium to learn about ocean communities and coastal habitats.\n\n4. **Art - Water Movement & Color Mixing:** Students can paint or use watercolors to create their own ocean waves, experimenting with blues, whites, and greens. Have them use sponges to create foam and splash effects on paper, mimicking the photograph's dynamic movement.\n\n## 🚀 STEM Career Connection\n\n1. **Ocean Scientist (Marine Biologist):** Ocean scientists study the plants, animals, and rocks in the ocean. They watch waves and learn how they affect the coastline and sea creatures. Some ocean scientists even dive underwater! **Average Salary: $65,000/year**\n\n2. **Geologist:** Geologists are rock scientists! They study how rocks change and break down over time due to waves, wind, and weather. They help us understand coastlines and predict where erosion might happen. **Average Salary: $93,000/year**\n\n3. **Beach Engineer:** Beach engineers design and build structures like breakwaters and seawalls to protect beaches and towns from big waves and erosion. They use science to figure out how to stop rocks and sand from washing away. **Average Salary: $87,000/year**\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Kimberly Brubaker Bradley\n- The Magic School Bus at the Waterworks by Joanna Cole\n- Water Is Water by Miranda Paul",
    "grade2": "## 📸 Photo Description\n\nBig waves crash into dark rocks by the ocean. Water sprays high into the air when it hits the rocks. The rocks are wet and shiny from all the splashing water.\n\n## 🔬 Scientific Phenomena\n\nThis image shows the **Anchoring Phenomenon** of wave energy transfer and erosion. Ocean waves carry energy from wind across the water's surface. When waves hit solid objects like rocks, the water's kinetic energy is transferred on impact, causing dramatic splashing and spray. Over long periods, this constant force gradually breaks down and reshapes the rocky coastline through mechanical weathering and erosion.\n\n## 📚 Core Science Concepts\n\n1. **Energy Transfer**: Moving water carries energy that gets released when it hits something solid\n2. **Forces and Motion**: Waves push against rocks with great force, demonstrating how motion can cause change\n3. **Weathering and Erosion**: Water slowly breaks down rocks over time through repeated impacts\n4. **States of Matter**: Water exists as liquid in waves and tiny droplets in spray\n\n<pedagogical-tip>Use kinesthetic learning by having students clap their hands together repeatedly to simulate how waves hitting rocks over and over can cause changes - start gently, then increase force to show how energy affects impact.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to experience wave energy: show video clips with sound, use hand motions to mimic waves, and let students feel the vibration of a drum to represent wave energy moving through water.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** At the molecular level, water molecules are constantly moving and bouncing off each other. When waves crash, these tiny particles slam into the rock surface, and some water molecules break apart rock minerals bit by bit.\n\n2. **Zoom Out:** This coastline is part of Earth's water cycle system. Waves are created by wind patterns across entire ocean basins, and the erosion happening here helps create sand that travels to beaches hundreds of miles away.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"Rocks are too hard for water to break them.\"\n   **Reality**: Water can break rocks, but it takes a very long time - thousands of years of waves hitting rocks can wear them down.\n\n2. **Misconception**: \"Waves only move up and down.\"\n   **Reality**: Wave energy moves forward through the water, carrying power from one place to another.\n\n3. **Misconception**: \"The splashing water disappears.\"\n   **Reality**: The water falls back down into the ocean and becomes part of the next wave.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 2-PS1-1 Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties\n- **Disciplinary Core Ideas**: [[NGSS:DCI:2-PS1.A]] - Different materials can be described by their observable properties\n- **Crosscutting Concepts**: [[NGSS:CCC:Patterns]] - Patterns in the natural world can be observed and used as evidence\n\n## 💬 Discussion Questions\n\n1. What do you think happens to the rocks after many years of waves hitting them? (Bloom's: Predict | DOK: 2)\n\n2. How is the energy of ocean waves similar to the energy of a bouncing ball? (Bloom's: Compare | DOK: 2)\n\n3. Why do you think the water sprays so high when it hits the rocks? (Bloom's: Analyze | DOK: 2)\n\n4. What other things in nature show the same kind of pattern as these waves? (Bloom's: Apply | DOK: 1)\n\n## 📖 Science Vocabulary\n\n* **Wave**: Moving water that carries energy from one place to another\n* **Energy**: The power to make things move or change\n* **Erosion**: When rocks and soil get worn away by water, wind, or ice\n* **Force**: A push or pull that can make objects move or change shape\n* **Impact**: When one thing hits another thing with force\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math - Measurement & Patterns**: Have students measure how high the water splashes using a simple ruler or string. Create a chart to record splashes from different sized rocks. Students can look for patterns: \"Do bigger rocks make bigger splashes?\"\n\n2. **ELA - Descriptive Writing & Onomatopoeia**: Ask students to write or draw pictures using words that sound like the actions they see: \"splash,\" \"crash,\" \"whoosh,\" and \"spray.\" Create a class poem together using these sound words to describe the waves hitting the rocks.\n\n3. **Social Studies - Coastal Communities**: Discuss how people who live near the ocean experience waves and rocky beaches. Talk about lighthouses, harbors, and how communities protect their shorelines from erosion. Students can locate oceans and beaches on a map.\n\n4. **Art - Movement & Color**: Have students create mixed-media artwork showing wave motion using blue paint, white spray bottles, and dark paper for rocks. Students can also draw before-and-after pictures showing how rocks change over thousands of years from wave erosion.\n\n## 🚀 STEM Career Connection\n\n1. **Geologist**: A geologist studies rocks and how they change over time. This scientist might visit rocky coastlines like the one in the photo to measure erosion, collect rock samples, and understand how waves reshape our Earth. *Average Salary: $90,000-$95,000*\n\n2. **Oceanographer**: An oceanographer studies the ocean and its waves. They learn about how waves form, how strong they are, and how they affect the land and animals living nearby. Some oceanographers work on boats to study real waves! *Average Salary: $85,000-$100,000*\n\n3. **Coastal Engineer**: A coastal engineer designs structures like seawalls and breakwaters to protect beaches and towns from wave damage and erosion. They use science to understand wave energy and create solutions that keep communities safe. *Average Salary: $80,000-$105,000*\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Kimberly Brubaker Bradley\n- The Magic School Bus at the Waterworks by Joanna Cole\n- What Is the Water Cycle? by Robin Johnson",
    "grade3": "## 📸 Photo Description\n\nOcean waves crash against dark rocks on a beach, creating white foam and spray. The water hits the rocks with great force, sending water droplets high into the air. You can see the sandy beach in front of the rocks and the ocean stretching far away.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the **Anchoring Phenomenon** of wave energy transfer and erosion. Ocean waves carry energy from wind across great distances. When this moving water hits solid objects like rocks, the energy is transferred on impact, creating the dramatic splash and spray visible in the photo. Over long periods of time, this constant force of water hitting rocks breaks them down into smaller pieces, which eventually become the sand on beaches. This is a perfect example of how energy can be transferred from one object to another and how forces can change the shape of Earth's surface.\n\n## 📚 Core Science Concepts\n\n1. **Energy Transfer**: Moving water carries energy that gets transferred when it hits objects like rocks\n2. **Forces and Motion**: The force of moving water can change the motion of objects and break apart materials\n3. **Weathering and Erosion**: Water constantly hitting rocks breaks them down over time, creating smaller rock pieces and sand\n4. **States of Matter**: Water exists as a liquid in the ocean but creates tiny droplets in the air when it splashes\n\n<pedagogical-tip>Use this image to help students make the connection between everyday experiences (like splashing in a bathtub) and larger Earth processes. Ask them to think about what happens when they jump in a pool - the same energy transfer is happening here, just on a much bigger scale!</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to explore this concept by having them create wave motions with their arms, use a spray bottle to demonstrate water droplets, or shake a container with water and small rocks to simulate the erosion process. This gives kinesthetic learners a hands-on way to understand the phenomena.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In**: At the molecular level, water molecules are constantly moving and bumping into each other. When waves crash, these tiny particles hit the rock surface with tremendous force, gradually wearing away microscopic pieces of the rock's surface.\n\n2. **Zoom Out**: This wave action is part of the global water cycle and ocean current systems. Winds across entire ocean basins create these waves, and the erosion happening here contributes to the formation of beaches, coastal changes, and sediment that travels hundreds of miles through ocean currents.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"Rocks are too hard for water to break them.\"\n   **Reality**: Water may seem soft, but when it moves with force over long periods of time, it can break down even the hardest rocks.\n\n2. **Misconception**: \"The splashing water just bounces off and doesn't change anything.\"\n   **Reality**: Each wave carries away tiny pieces of rock, and over many years, this creates significant changes to coastlines and beaches.\n\n3. **Misconception**: \"Waves only move up and down.\"\n   **Reality**: Waves carry energy forward across the ocean, even though the water itself mostly moves in circular motions.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 3-PS2-1 - Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object\n- **Disciplinary Core Ideas**: [[NGSS:DCI:3-PS2.A]] Forces and Interactions, [[NGSS:DCI:2-ESS1.C]] The History of Planet Earth\n- **Crosscutting Concepts**: [[NGSS:CCC:Cause and Effect]], [[NGSS:CCC:Energy and Matter]]\n\n## 💬 Discussion Questions\n\n1. What do you think would happen if these waves hit the rocks every day for 100 years? (Bloom's: Analyze | DOK: 3)\n\n2. Where do you think the energy in these waves came from originally? (Bloom's: Analyze | DOK: 2)\n\n3. How is this wave crashing similar to what happens when you throw a ball against a wall? (Bloom's: Apply | DOK: 2)\n\n4. What evidence can you see in the photo that shows energy is being transferred? (Bloom's: Evaluate | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Energy**: The ability to cause motion or create change in matter\n* **Force**: A push or pull that can change how objects move\n* **Erosion**: The process of breaking down rocks and moving the pieces to new places\n* **Transfer**: To move something from one place or object to another\n* **Impact**: When one object hits another object with force\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math Connection - Measurement & Data**: Have students measure the height of wave splashes by taking photos at the same location over several days. They can create a bar graph showing which day had the biggest splashes. This connects to 3.MD.B.3 (Represent and interpret data).\n\n2. **ELA Connection - Descriptive Writing**: Ask students to write a short story or poem describing what it \"feels like\" to be a water droplet in a crashing wave. They can use sensory words (wet, cold, fast, loud) to describe the journey of water from the ocean to the rocks. This builds vocabulary and creative expression skills.\n\n3. **Social Studies Connection - Coastal Communities**: Discuss how people who live near the ocean experience waves and erosion. Students can research or discuss how communities protect their beaches and homes from wave erosion, introducing concepts of human-environment interaction and adaptation.\n\n4. **Art Connection - Mixed Media**: Students can create an artistic representation of wave energy using various materials (paint, sand, tissue paper, blue fabric) to show the movement and power of water. This helps them express scientific understanding through creative means.\n\n## 🚀 STEM Career Connection\n\n1. **Geologist/Earth Scientist**: Geologists study rocks, soil, and how Earth changes over time. A geologist might visit beaches like the one in this photo to understand how waves shape the coastline and what the rocks tell us about Earth's history. They help us predict changes to beaches and protect coastal communities. **Average Salary: $92,000/year**\n\n2. **Oceanographer**: Oceanographers study the ocean, waves, currents, and how water moves around Earth. They use tools and boats to measure waves and understand how ocean energy affects beaches and sea life. Some oceanographers even work to protect beaches from erosion. **Average Salary: $75,000/year**\n\n3. **Coastal Engineer**: Coastal engineers design walls, barriers, and other structures to protect beaches and towns from strong waves and erosion. They use science and math to figure out how to stop waves from washing away sand and rocks, keeping people safe. **Average Salary: $85,000/year**\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Patricia Whitehouse\n- The Magic School Bus at the Waterworks by Joanna Cole\n- National Geographic Readers: Storms by Miriam Goin",
    "grade4": "## 📸 Photo Description\n\nLarge waves crash against dark rocks near the shore, creating white foam and spray. The powerful water hits the rocks and splashes high into the air. You can see how the ocean's energy moves the water against the solid rocks on the beach.\n\n## 🔬 Scientific Phenomena\n\nThis image shows the **Anchoring Phenomenon** of wave energy transfer and collision forces. When ocean waves move toward shore, they carry energy from wind across the water. As waves hit the rocks, the water's kinetic energy transfers into the rocks and changes direction, creating the dramatic splash and spray. The force of moving water demonstrates how energy can be transferred from one object to another through collisions.\n\n## 📚 Core Science Concepts\n\n1. **Energy Transfer**: Moving water carries energy that transfers to rocks when they collide\n2. **Forces and Motion**: Waves demonstrate how forces can change the direction and speed of moving objects\n3. **Cause and Effect**: Wind energy creates waves, which then create splashing when they hit barriers\n4. **Properties of Water**: Water can exist as liquid droplets in spray and foam during wave action\n\n<pedagogical-tip>Use slow-motion videos of waves crashing to help students observe the energy transfer that happens too quickly to see in real time. This helps make the invisible phenomenon of energy transfer visible.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to demonstrate wave energy: kinetic learners can create waves in water tables, visual learners can draw energy transfer diagrams, and auditory learners can describe the sounds of crashing waves.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** At the molecular level, water molecules are constantly moving and bouncing off each other. When waves crash, millions of water molecules suddenly change direction and speed, creating the kinetic energy we see as splashing.\n\n2. **Zoom Out:** This wave action is part of Earth's water cycle system. Ocean waves help move water into the atmosphere through evaporation from spray, transport energy across ocean basins, and gradually shape coastlines through erosion over thousands of years.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"The water in waves moves forward toward the shore.\"\n   **Reality**: Water molecules mostly move up and down in circles; it's the energy that moves forward through the water.\n\n2. **Misconception**: \"Bigger rocks always stop waves completely.\"\n   **Reality**: Wave energy can go around, over, and through rock barriers, though rocks do absorb and redirect much of the energy.\n\n3. **Misconception**: \"Waves only happen in oceans.\"\n   **Reality**: Any moving liquid can create waves when energy is added, including lakes, rivers, and even water in bathtubs.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 4-PS3-1 - Use evidence to construct an explanation relating the speed of an object to the energy of that object\n- **Disciplinary Core Ideas**: [[NGSS:DCI:PS3.A]] Energy and Matter, [[NGSS:DCI:PS3.B]] Conservation of Energy and Energy Transfer\n- **Crosscutting Concepts**: [[NGSS:CCC:Energy and Matter]], [[NGSS:CCC:Cause and Effect]]\n- **Science and Engineering Practice**: Constructing Explanations and Designing Solutions\n\n## 💬 Discussion Questions\n\n1. What do you think would happen if these waves hit sand instead of rocks? (Bloom's: Analyze | DOK: 2)\n\n2. Where do you think the energy in these waves originally came from? (Bloom's: Evaluate | DOK: 3)\n\n3. How might the size of the splash change if the waves were moving faster or slower? (Bloom's: Apply | DOK: 2)\n\n4. What evidence can you see in the photo that shows energy is being transferred? (Bloom's: Analyze | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Energy**: The ability to cause motion or change in matter\n* **Transfer**: When energy moves from one object to another object  \n* **Kinetic energy**: The energy that moving objects have\n* **Force**: A push or pull that can change how objects move\n* **Collision**: When two objects hit each other and energy moves between them\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math - Measurement and Data**: Have students measure the height of wave splashes in photos or videos using a ruler or grid overlay. Create a bar graph comparing splash heights from waves of different sizes. Students can predict and then measure how high splashes might go based on wave speed.\n\n2. **ELA - Descriptive Writing**: Ask students to write vivid descriptions of the wave crashing scene using sensory words (what they see, hear, feel). Create an acrostic poem using the word \"WAVES\" or \"ENERGY.\" Students can also research and write informative paragraphs about different types of ocean waves.\n\n3. **Social Studies - Coastal Communities**: Explore how people who live near the ocean use wave energy and how waves affect their communities. Students can research lighthouses, harbors, or sea walls built to protect coastal towns from wave damage. Discuss how understanding wave energy helps us build safer communities.\n\n4. **Art - Dynamic Movement**: Have students create paintings or drawings that show movement and energy using splashing water as inspiration. Use watercolor techniques to create the effect of waves and spray. Students can also design their own \"wave barriers\" using art materials and test them in a water table to see which designs work best.\n\n## 🚀 STEM Career Connection\n\n1. **Oceanographer** - An oceanographer is a scientist who studies the ocean, including how waves form, move, and affect sea life and coastlines. They use special equipment to measure waves and understand ocean energy. Oceanographers help us learn how to protect our oceans and predict dangerous storms. *Average Salary: $63,000-$75,000 per year*\n\n2. **Coastal Engineer** - A coastal engineer designs and builds structures like sea walls, jetties, and breakwaters to protect beaches and towns from wave damage. They use their knowledge of wave energy and forces to create structures that are strong enough to withstand crashing waves. *Average Salary: $68,000-$85,000 per year*\n\n3. **Renewable Energy Technician** - A renewable energy technician works with wave energy devices that capture the power of ocean waves and convert it into electricity for homes and businesses. These professionals help develop clean energy solutions using the same wave energy you see in this photo. *Average Salary: $55,000-$70,000 per year*\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Patricia J. Murphy\n- The Magic School Bus Ups and Downs: A Book About Floating and Sinking by Joanna Cole\n- National Geographic Readers: Waves by Anne Schreiber",
    "grade5": "## 📸 Photo Description\n\nOcean waves crash powerfully against dark rocks along a shoreline, creating white foam and spray that shoots high into the air. The rocky coastline shows how moving water can hit solid surfaces with great force, while pebbles and sand cover the beach area.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the **Anchoring Phenomenon** of wave energy transfer and erosion. Ocean waves carry kinetic energy from wind across vast distances of water. When these moving waves encounter the solid rocky shore, they transfer their energy through collision, creating the dramatic splash and spray visible in the photo. Over time, this constant pounding breaks down rock particles through mechanical weathering, gradually reshaping coastlines through the process of erosion.\n\n## 📚 Core Science Concepts\n\n1. **Energy Transfer**: Waves carry kinetic energy from one place to another, transferring it when they hit obstacles like rocks or shorelines.\n\n2. **Forces and Motion**: The moving water exerts force on stationary rocks, demonstrating Newton's laws of motion in action.\n\n3. **Weathering and Erosion**: Repeated wave action mechanically breaks down rock surfaces, carrying away small particles and gradually changing the landscape.\n\n4. **States of Matter**: Water demonstrates fluid properties as it moves, splashes, and flows around solid rock formations.\n\n<pedagogical-tip>Use this image to help students make the connection between energy they can see (the dramatic splash) and energy they cannot see (the sound waves, vibrations in the ground, and the slow process of rock breakdown happening over time).</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to experience wave energy: play audio recordings of crashing waves, let them feel vibrations by tapping on their desks, and use slow-motion videos to help students see the details of energy transfer that happen too quickly to observe in real-time.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In**: At the molecular level, water molecules are constantly moving and colliding with each other and the rock surface. When waves hit rocks, the impact creates compression forces that work into tiny cracks in the rock, eventually causing pieces to break away grain by grain.\n\n2. **Zoom Out**: This coastal erosion is part of the larger rock cycle and Earth's surface processes. Material eroded from these rocks will be transported by ocean currents, potentially forming new sedimentary deposits elsewhere, while tectonic forces may eventually create new mountains from ocean floor sediments.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"Rocks are too hard for water to break them down.\"\n   **Clarification**: While individual water drops are weak, the repeated force of millions of water molecules hitting rocks over long periods creates enough energy to break even the hardest stones.\n\n2. **Misconception**: \"Waves only move water up and down.\"\n   **Clarification**: Waves actually move energy across the water surface, while water particles move in circular motions, allowing energy to travel great distances.\n\n3. **Misconception**: \"Erosion happens quickly like in the picture.\"\n   **Clarification**: The splash happens instantly, but the actual erosion process takes thousands of years of repeated wave action to create significant changes.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 5-ESS1-2: Develop a model using an example to describe ways the geosphere, biosphere, hydrosphere, and atmosphere interact.\n- **Disciplinary Core Ideas**: [[NGSS:DCI:5-PS1.A]], [[NGSS:DCI:5-ESS2.A]], [[NGSS:DCI:2-ESS1.C]]\n- **Crosscutting Concepts**: [[NGSS:CCC:Energy and Matter]], [[NGSS:CCC:Stability and Change]]\n\n## 💬 Discussion Questions\n\n1. What evidence do you see that energy is being transferred from the water to the rocks? (Bloom's: Analyze | DOK: 2)\n\n2. How might this coastline look different after 100 years of wave action, and what processes would cause those changes? (Bloom's: Evaluate | DOK: 3)\n\n3. Where do you think the energy in these waves originally came from? (Bloom's: Apply | DOK: 2)\n\n4. What would happen if we built a wall to block these waves, and how might that affect the energy transfer? (Bloom's: Create | DOK: 3)\n\n## 📖 Science Vocabulary\n\n* **Kinetic Energy:** The energy that moving objects have because they are in motion.\n* **Erosion:** The process where wind, water, or ice wears away rocks and soil and moves them to new places.\n* **Mechanical Weathering:** The physical breaking apart of rocks without changing what they are made of.\n* **Energy Transfer:** When energy moves from one object or place to another object or place.\n* **Force:** A push or pull that can change how objects move or their shape.\n\n## 🔗 Cross-Curricular Ideas\n\n1. **Math - Measuring and Graphing**: Have students research wave heights and frequencies, then create bar graphs comparing wave sizes during different seasons or weather conditions. Students could also calculate how many years it takes to erode a certain amount of rock if given the erosion rate per year.\n\n2. **ELA - Descriptive Writing**: Ask students to write detailed narratives describing what they see, hear, and feel while standing on this rocky beach during a storm. They could use sensory language and metaphors to bring the scene to life, then share their writing with the class.\n\n3. **Social Studies - Human Geography**: Explore how coastal communities adapt to wave erosion and design protective structures. Students could research famous eroded coastlines around the world (like the cliffs of Dover or the California coast) and learn how people live safely in these dynamic environments.\n\n4. **Art - Movement and Motion**: Have students create mixed-media artwork or sculptures inspired by the energy and motion in waves. They could use water, paint, sand, and rocks to recreate the crashing wave effect, exploring how artists represent dynamic forces in their work.\n\n## 🚀 STEM Career Connection\n\n1. **Coastal Engineer**: Coastal engineers design and build structures like seawalls, breakwaters, and dams to protect beaches and communities from erosion and flooding caused by waves and storms. They study how water moves and how rocks break down to create solutions that keep people safe. **Average Salary: $92,000/year**\n\n2. **Geologist**: Geologists study rocks, minerals, and Earth's processes like erosion and weathering. They examine coastlines to understand how landscapes change over time and predict future changes. Some geologists help protect important historical sites or predict natural disasters. **Average Salary: $95,000/year**\n\n3. **Ocean Scientist (Oceanographer)**: Ocean scientists study waves, currents, and how water interacts with land. They use equipment to measure wave energy and understand how oceans shape our planet. Some work to protect marine environments and predict storms. **Average Salary: $88,000/year**\n\n## 📚 External Resources\n\n**Children's Books:**\n- Waves by Patricia Whitehouse\n- Seashore by Steve Parker\n- The Magic School Bus on the Ocean Floor by Joanna Cole"
  }
}