{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p31.jpg",
  "imagePath": "images/physical-science/p31.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Shadows, Sunlight, and Flags\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Sunlight creates shadows:** The American flag and clock on the building cast dark shadows on the light-colored stone surface, demonstrating that objects block sunlight and create shadows.\n- **Movement and direction matter:** The flag is moving/waving, showing how direction of motion changes; the shadow position changes based on where the sunlight comes from.\n- **Materials affect light:** The opaque stone, metal, and fabric of the buildings and flag block light differently than transparent glass windows, showing that some materials let light through and others don't.\n- **Energy from the sun:** Sunlight is an energy source that travels from the sun to Earth, warming surfaces and creating visible effects like shadows.\n\n---\n\n## Lesson Title\n\n**Dancing Shadows and the Sunny City**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 75–90 minutes (two sessions of 35–45 minutes each)\n- **NGSS Standards:** K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface; K-PS2-1: Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object (applied to flag movement)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Make observations about how sunlight creates shadows on surfaces.\n2. Describe what happens to a shadow when sunlight direction changes.\n3. Compare how different objects (opaque vs. clear materials) block or let sunlight pass through.\n4. Explain that the sun is an energy source that warms Earth's surface and creates shadows.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture students' interest in shadows and sunlight by exploring the photograph together.\n\n**Materials:**\n- Printed or projected photograph (p31.jpg) of the urban buildings, flag, and clock\n- Chart paper or whiteboard for recording observations\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or projector where all students can see it clearly. Say: \"Friends, look at this picture. It's taken outside in the sunshine. I want you to look very carefully. What do you notice?\"\n\n2. **Ask these guiding questions** to spark curiosity (pause for thinking time after each):\n   - \"Do you see any dark shapes on this building? What are those dark shapes?\"\n   - \"Why do you think those dark shapes are there? Where is the sun in this picture?\"\n   - \"Look at the flag—it's moving! What do you think makes the flag wave and move?\"\n   - \"If we moved the flag to a different place, what would happen to its shadow?\"\n\n3. **Invite predictions:** \"I'm wondering... if we made our own shadow right now with a sunny window or outside, would it look the same as the shadow in the picture? Or would it be different? What do you think?\"\n\n4. **Record student observations** on chart paper using drawings and simple words (e.g., \"Shadow,\" \"Dark,\" \"Sun,\" \"Flag moves\").\n\n**Transition:** \"Let's go find our own shadows and see what we can learn about them!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate how sunlight creates shadows and how shadows change.\n\n**Materials:**\n- Access to a sunny window or outdoor sunny area (essential)\n- Small objects: toys, blocks, cutout shapes (flag shapes if possible), books\n- White paper or poster board\n- Flashlights (as backup for indoor exploration)\n- Chart for recording: \"Our Shadow Discoveries\" with columns for \"Object,\" \"Shadow Shape,\" and \"What Changed\"\n\n**Activity:**\n\n**Setting:** Conduct this activity near a bright sunny window or outdoors in direct sunlight.\n\n**Step-by-step student directions:**\n\n1. \"Find a partner or small group. You're going to be shadow detectives!\"\n\n2. \"Pick one object from the table—maybe a toy, a block, or a shape.\" (Teacher demonstrates with a stuffed animal.)\n\n3. \"Hold your object up to the sunlight coming through the window (or in front of your body in the sunshine). Look at the wall or ground behind it. What do you see? Draw or point to the shadow you made.\"\n\n4. \"Now, move your object to a different spot. The sun is in the same place, but your object moved. What happened to the shadow? Is it bigger? Smaller? In a different place? Show your partner.\"\n\n5. \"Move your object again—hold it higher, then lower. Does the shadow change again? How?\"\n\n6. \"Switch! Let your partner pick an object and try the same thing.\"\n\n7. **Documentation:** Students draw or point out shadows on paper. Teacher circulates and records student observations on the class chart (e.g., \"When Maya moved the doll higher, the shadow got bigger\").\n\n**Teacher Role:**\n- Facilitate without giving answers; use open-ended questioning: \"What did you notice?\" \"What changed?\" \"Why do you think that happened?\"\n- Ensure all students have a turn.\n- Encourage students to compare their shadows: \"Whose shadow is darker?\" \"Which shadow is bigger?\"\n- If outdoors, have students trace shadows with chalk on pavement.\n\n**Expected Student Outcomes:**\n- Students discover that objects create shadows in sunlight.\n- Students notice that moving an object changes its shadow's size, position, or direction.\n- Students begin to understand that sunlight must hit an object to make a shadow.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce vocabulary and help students make sense of their observations.\n\n**Materials:**\n- Chart paper with vocabulary and pictures\n- The original photograph (p31.jpg)\n- Optional: simple diagram showing sun, object, and shadow (teacher-drawn or printed)\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Gather students in a circle with the photograph visible.\n   - Ask: \"What did you discover about shadows? What changed when you moved your object?\"\n   - Record key observations on a new chart: \"What We Learned About Shadows.\"\n   - Point out examples in the photo: \"Look at the flag's shadow on the building. See how it's dark? That's because the sun is shining on the flag from that direction.\"\n\n2. **Introduce Vocabulary (7–10 minutes):**\n   Use simple language and visual support (point to the photograph and classroom examples):\n\n   - **Shadow:** A dark shape that forms when an object blocks sunlight. Point to the shadow in the photo. \"This dark area is a shadow. The sun can't shine through the flag, so it makes a shadow.\"\n   \n   - **Sunlight:** Energy from the sun that comes to Earth. It makes things bright and warm. \"The sunlight is what makes those shadows. Without sunlight, there would be no shadows.\"\n   \n   - **Object:** Something you can see and touch. \"The flag and the clock are objects. They make shadows.\"\n   \n   - **Block:** To stop something from moving through. \"The flag blocks the sunlight, so a shadow appears.\"\n\n3. **Connect Back to the Photo (3–5 minutes):**\n   - Point to the clock on the building: \"This clock is an object. The sun is shining on it. Where is its shadow?\"\n   - Point to the flag: \"This flag moves (like you discovered with your objects). When it moves, its shadow moves too!\"\n   - Trace the dark shadows visible on the stone building: \"These dark shapes are shadows made by the buildings and the flag.\"\n\n4. **Check for Understanding:**\n   - Ask: \"Show me with your hands—where would the shadow go if I held my toy here?\" (Teacher points to different positions.)\n   - Ask: \"Can you find something in our classroom that is making a shadow right now?\"\n   - Thumbs up/sideways/down: \"Do you understand what a shadow is?\"\n\n**Vocabulary List:**\n- **Shadow:** A dark shape that appears when sunlight is blocked by an object.\n- **Sunlight:** Light energy from the sun that travels to Earth.\n- **Object:** A thing you can touch and see, like a toy or flag.\n- **Block:** To stop light from passing through.\n- **Move/Direction:** To change position; where something is going (left, right, up, down).\n\n**Expected Student Outcomes:**\n- Students can identify and name shadows.\n- Students understand that sunlight creates shadows.\n- Students use vocabulary in context: \"The shadow moved when I moved my object.\"\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding by creating their own shadow art and exploring how shadows change in different situations.\n\n**Materials:**\n- Paper (white, black, or colored)\n- Markers, crayons, or colored pencils\n- Scissors (optional, teacher-managed)\n- Flashlights (for alternative/indoor activity)\n- Tape\n- Optional: shadow puppet templates (simple animal or flag shapes)\n\n**Activity Option 1: Shadow Outline Art (Primary Activity)**\n\n1. \"You're going to create shadow art! In the sunny window (or outside), hold an object up to the light and trace around its shadow.\"\n\n2. Demonstrate: Hold a toy block in sunlight and trace its shadow on paper. Show students the outline created.\n\n3. \"Now it's your turn. Find a sunny spot, pick an object, and trace its shadow on your paper. You can trace it multiple times in different positions!\"\n\n4. \"After you trace it, you can draw what the object is, or color in the shadow, or add more details.\"\n\n5. Students create shadow outline art and display it.\n\n**Activity Option 2: Shadow Puppet Show (Alternative/Indoor)**\n\n1. If outdoor access is limited, use flashlights indoors.\n\n2. \"Shine a flashlight at an object (or at a cutout shape). The shadow appears on the wall or paper behind it.\"\n\n3. \"Move the light closer—what happens to the shadow?\" (Shadow gets bigger.)\n\n4. \"Move the light farther away—what happens now?\" (Shadow gets smaller.)\n\n5. Students discover that changing the light source's distance changes shadow size.\n\n**Teacher Role:**\n- Circulate and ask: \"What shadow shape did you make?\" \"What happens if you turn your object?\" \"Is the shadow the same size every time?\"\n- Encourage students to make predictions: \"If I move the light closer, what will happen?\"\n- Facilitate peer sharing: \"Show your friend your shadow art. Is their shadow the same as yours?\"\n\n**Expected Student Outcomes:**\n- Students create visual evidence of shadow understanding.\n- Students discover that shadow size and position change based on object position and light direction.\n- Students engage in creative application of learning.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of shadows and sunlight effects.\n\n**Activity:**\n\n**Formative Assessment (throughout all phases):**\n- **Observation Checklist:** As students explore, note:\n  - ✓ Can identify a shadow in the environment\n  - ✓ Describes what happens when an object moves (shadow changes)\n  - ✓ Uses vocabulary (shadow, sunlight, object, block)\n  - ✓ Makes accurate predictions about shadow changes\n\n**Exit Ticket / Summative Assessment (end of lesson, 5 minutes):**\n\nGather students and ask these questions. Accept verbal responses (record on chart or mentally note):\n\n1. **\"Show me a shadow in our classroom right now. What made that shadow?\" (Students point and explain.)**\n   - Success: Student identifies a real shadow and mentions sunlight or an object blocking light.\n\n2. **\"If I move this toy closer to the window, what will happen to its shadow? Will it stay the same, get bigger, or get smaller?\" (Students respond with a prediction, then test it.)**\n   - Success: Student makes a reasonable prediction and explains thinking.\n\n3. **\"Can we make shadows on a cloudy day? Why or why not?\"** (Accept reasoning about sunlight.)\n   - Success: Student connects shadows to the presence of sunlight.\n\n4. **\"Look at the photo again. Can you find the shadow of the flag? How do you know it's a shadow?\"**\n   - Success: Student points to a dark area and uses vocabulary (blocks light, dark shape, etc.).\n\n**Success Criteria for Learning Objectives:**\n- **Objective 1:** Students accurately identify 2+ shadows in the environment and explain that sunlight creates them.\n- **Objective 2:** Students demonstrate understanding that shadows change position and size when the object or light source moves.\n- **Objective 3:** Students use vocabulary (shadow, sunlight, block, object) in verbal or written responses.\n- **Objective 4:** Students make a prediction about shadow changes and test it successfully.\n\n**Expected Student Outcomes:**\n- All students can identify shadows and name them.\n- Most students can explain that the sun makes shadows.\n- Most students can predict shadow changes when objects move.\n- Some students may connect shadows to the direction of sunlight (advanced understanding).\n\n---\n\n## Differentiation\n\n### Support (for students who need scaffolding):\n\n1. **Simplified Language & Visuals:**\n   - Use consistent, simple words: \"dark shape\" instead of \"shadow\" initially.\n   - Pair vocabulary with clear photo examples and real objects in the room.\n   - Use hand gestures to show movement: \"Sun goes here... object goes here... shadow goes here.\"\n\n2. **Structured Exploration:**\n   - Pair struggling students with a peer buddy or adult during Explore.\n   - Provide one object at a time rather than choice (reduces cognitive load).\n   - Use a template with pictures: draw the object and draw where the shadow goes.\n\n3. **Repeated Opportunities:**\n   - Visit the sunny window multiple times over several days.\n   - Review the photograph and chart observations frequently.\n   - Use consistent anchor: \"Remember when we found shadows by the window?\"\n\n### Challenge (for advanced learners):\n\n1. **Investigate Variables:**\n   - \"What happens if you use different light sources (flashlight vs. sunlight)? Are the shadows different?\"\n   - \"Try to make the tiniest shadow you can. Then make the biggest shadow. What's the trick?\"\n   - Challenge: Make a shadow that's bigger than the object itself.\n\n2. **Connect to Daytime Changes:**\n   - \"Where is the sun now? Where would the flag's shadow be if the sun moved to a different place in the sky?\"\n   - \"Can you predict where your shadow will be in one hour? Let's check!\"\n   - Explore: Trace shadows at different times of day and compare.\n\n3. **Creative Problem-Solving:**\n   - \"How could we use shadows to make art or send a message?\"\n   - \"If you wanted to block all the sunlight from reaching this area, what would you use? Why?\"\n   - Design a shadow puppet theater and perform a short story.\n\n---\n\n## Extension Activities\n\n1. **Shadow Tracing Over Time:**\n   - On a sunny day, trace an object's shadow every hour (10 a.m., 11 a.m., 12 p.m., 1 p.m.).\n   - Compare the tracings. Discuss: \"Why did the shadow move?\" and \"What does this tell us about the sun?\"\n   - Display results on a class bulletin board with the title \"Our Sun's Journey.\"\n\n2. **Outdoor Shadow Hunt:**\n   - Take a class walk (sunny day preferred) to find shadows around the school.\n   - Photograph or sketch shadows found: tree shadows, building shadows, playground equipment shadows.\n   - Discuss: \"Which shadows are long? Which are short? Why are they different?\"\n   - Create a class book: \"Shadows Around Our School.\"\n\n3. **Shadow Puppet Story Theater:**\n   - Use shadows and a light source to tell a familiar story (e.g., \"The Three Little Pigs\" or \"The Very Hungry Caterpillar\").\n   - Students create simple shapes from cardboard or hands and perform behind a sheet with backlighting.\n   - Reinforces concepts: blocking light, movement, direction, shadow changes.\n   - Builds confidence and engagement through play.\n\n---\n\n## Teacher Notes\n\n- **Safety:** Ensure students do not look directly at the sun. Always supervise near windows and outdoor areas.\n- **Timing:** If full outdoor access isn't possible, sunny windows work well. Flashlights are an effective backup for indoor exploration.\n- **Prior Knowledge:** This lesson assumes students have basic exposure to sunlight but may not understand shadows formally.\n- **Cultural Connection:** Mention that shadow puppets are used in storytelling traditions around the world, bridging science and social-emotional learning.\n- **Follow-Up:** This lesson connects naturally to K-PS3-2 (designing a structure to reduce sunlight warming). A follow-up could explore how different materials affect shade and warmth.\n\n---\n\nThis lesson grounds abstract concepts in concrete, hands-on discovery appropriate for Kindergarten learners while maintaining rigorous NGSS alignment.",
  "inputTokens": 2383,
  "outputTokens": 3960,
  "cost": 0.022183,
  "generatedAt": "2026-02-13T00:21:47.127Z"
}