{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p31.jpg",
  "imagePath": "images/physical-science/p31.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Shadows, Light, and the Flag in the City\n\n## Core Science Concepts from Image Analysis\n- **Light and shadows:** The flag is visible because light illuminates it; the buildings create shadows in the background.\n- **How objects block light:** The tall buildings between the sun and the ground create dark shadows, while the flag stands in bright light.\n- **Properties of light:** Light travels in straight lines and can be blocked by solid objects (buildings, the flag pole).\n- **Observing light sources and illuminated objects:** The American flag is only visible because light shines on it; without light, we wouldn't be able to see it.\n\n---\n\n## Lesson Title\n**Shadows and Light: Why Can We See the Flag?**\n\n---\n\n## Lesson Overview\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes total, can be split across two days)\n- **NGSS Standards:** \n  - 1-PS4-2: Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated.\n  - 1-PS4-3: Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light.\n\n---\n\n## Learning Objectives\nStudents will be able to:\n1. **Observe and describe** how light helps us see objects (like the flag in the photograph).\n2. **Predict and test** what happens when light is blocked by different materials.\n3. **Explain** that objects need light to be seen, using evidence from investigations.\n4. **Compare and classify** materials based on whether light passes through them or creates shadows.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed color copy of the photograph (or project on whiteboard/screen)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it so all students can see clearly. Point to the flag and ask:\n   - \"What do you see in this picture?\" (Allow students to describe the flag, buildings, and sky.)\n   \n2. **Ask curiosity-sparking questions:**\n   - \"Why can we see the flag so clearly? Why is it bright?\"\n   - \"Why are the buildings behind the flag darker? Why do those dark places happen?\"\n   - \"If it were nighttime and there were no sun, could we still see the flag the same way? Why or why not?\"\n   - \"What do you think is making the flag visible to us?\"\n\n3. **Prediction prompt:** \"I wonder... if we covered the flag with a blanket or cardboard, would we still be able to see it? Why do you think that?\"\n\n4. **Record student responses** on chart paper. Accept all ideas without judgment—this activates prior thinking.\n\n**Transition:** \n\"Great questions! Today, we're going to do investigations to discover how light helps us see things—just like light helps us see that flag!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Flashlights (1 per pair or small group—5-6 flashlights)\n- Various objects to test: plastic cup, tissue paper, aluminum foil, construction paper, clear plastic wrap, thick cardboard\n- White wall or white sheet hanging at student height\n- Dark corner of classroom or small cardboard box to create a darker area\n- Paper and crayons for recording observations\n\n**Activity:**\n\n**Setup:** Divide class into small groups of 2-3 students. Set up a \"light investigation station\" with one flashlight, a white surface (wall or sheet), and 2-3 test materials per group.\n\n**Student Directions (teacher reads aloud and demonstrates first):**\n1. \"Pick up your flashlight and shine it at the white wall. What do you see?\"\n2. \"Now, hold a piece of tissue paper in front of the flashlight beam. Shine it at the wall. What happens? Can light get through the tissue? What do you see on the wall?\"\n3. \"Try aluminum foil next. Hold it in front of the flashlight beam. Shine it at the wall. Does light get through this? What happens?\"\n4. \"Try the clear plastic wrap. Does light go through it?\"\n5. \"Try thick cardboard. What happens?\"\n6. **Recording:** \"Draw or write which materials let light pass through (you can see light on the wall) and which materials block light (you see a shadow or darkness).\"\n\n**Connection to Photograph:**\n- Teacher narrates: \"Just like the flag in the picture needs light from the sun to be seen, these objects need light from the flashlight to show up. Some things let light pass through; some things block light and make shadows.\"\n\n**Teacher Role:**\n- Circulate among groups; ask guiding questions: \"What do you notice? Is light coming through that material? What's happening on the wall?\"\n- Do NOT tell students the answers; let them observe and discover.\n- Ensure all students get a turn to hold the flashlight and test materials.\n\n**Expected Student Outcomes:**\n- Students should discover that some materials let light pass through (tissue, clear plastic), while others block light (cardboard, foil, construction paper).\n- Students should see shadows or dark areas when light is blocked.\n- Students should make simple drawings or marks indicating \"light goes through\" or \"light is blocked.\"\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper from Engage phase\n- The photograph (displayed again)\n- Visual anchor chart (teacher-created, showing light paths and shadows)\n- Flashlight for demonstration\n\n**Activity:**\n\n1. **Group share-out:** Gather students in a circle. Ask:\n   - \"What did you discover about the tissue paper?\" (Light went through!)\n   - \"What about the cardboard?\" (Light was blocked; we saw a shadow.)\n   - \"Why do you think that happened?\" (Validate student thinking.)\n\n2. **Introduce key vocabulary** using the photograph as reference:\n\n   **Vocabulary List:**\n   - **Light:** Something that helps us see. It comes from the sun, flashlights, and lamps. (Point to the bright flag in the photo.)\n   - **Shadow:** A dark place made when light is blocked by something. (Point to the dark buildings behind the flag.)\n   - **Blocked:** When something stands in the way and stops light from passing through.\n   - **Bright:** When lots of light is shining on something, so we can see it clearly. (Point to the flag.)\n   - **Dark:** When there is no light or very little light; things are hard to see.\n\n3. **Make connections:** \n   - \"The flag in this picture is bright because sunlight shines on it. The buildings are dark because they block the sunlight behind them—they make shadows. Just like your cardboard blocked the flashlight!\"\n\n4. **Check for understanding:**\n   - Hold up the flashlight: \"If I turn off this flashlight, will you be able to see the materials on the table?\"\n   - Point to the shadowy buildings: \"Why is that dark area there? What's blocking the light?\"\n   - Show a picture of the flag again: \"Why can we see the flag so well?\"\n\n**Expected Student Outcomes:**\n- Students can use the words \"light,\" \"shadow,\" \"bright,\" and \"dark\" in simple sentences.\n- Students can explain that objects are seen when light shines on them.\n- Students can identify that shadows are made when light is blocked.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Flashlights (same as Explore)\n- Dark room or closed-off area\n- Small objects: toy animals, blocks, pencils, books\n- White wall or sheet\n- Hand shadows are a bonus activity\n\n**Activity:**\n\n**Shadow Puppet Theater:**\n\n1. Dim the lights in a corner of the classroom or use a cardboard box as a \"theater.\"\n\n2. **Teacher demonstrates:** Shine a flashlight on the wall. Make a hand shadow. Ask: \"What's making this shadow? How did the light get blocked?\"\n\n3. **Student turn:** Pairs of students take turns:\n   - One student shines the flashlight at the wall.\n   - The other student holds an object (toy animal, block) between the light and the wall.\n   - The light is blocked, creating a shadow of the object on the wall.\n   - Students describe what they see: \"The shadow is dark!\" \"The light is blocked by the toy!\"\n\n4. **Application question:** \"Just like the buildings block sunlight and make shadows in our photograph, what's blocking the light here? What's making the shadow?\"\n\n5. **Challenge:** \"Can you make a big shadow? A tiny shadow? How do you do that?\" (Students discover that moving closer to light makes bigger shadows; moving farther makes smaller shadows.)\n\n**Teacher Role:**\n- Facilitate turns; ask: \"What happened when you moved the object closer to the light? Did the shadow change?\"\n- Celebrate discoveries: \"You found that light makes shadows when things block it!\"\n\n**Expected Student Outcomes:**\n- Students can create shadows intentionally.\n- Students can describe that shadows are made when light is blocked.\n- Students can predict what will happen when they change the position of an object.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (throughout the lesson):**\n- Observe student responses during Explore: Can they identify which materials block light?\n- Listen to vocabulary use during Explain: Are students using \"light,\" \"shadow,\" \"bright,\" and \"dark\" appropriately?\n- Watch Shadow Puppet activity: Can students predict and explain shadow changes?\n\n**Exit Ticket / Summative Assessment (given at end of lesson, can be verbal or drawn):**\n\nShow students the original photograph and ask ONE of the following (adjust based on student readiness):\n\n**Question 1 (basic):** \"Why can we see the flag in this picture? What is shining on it?\" \n- ✓ Acceptable answer: \"The sun/light is shining on it\" or \"Light helps us see it.\"\n\n**Question 2 (intermediate):** \"Why is there a dark shadow behind the flag? What is blocking the light?\"\n- ✓ Acceptable answer: \"The buildings are blocking the light\" or \"Something is in the way of the light.\"\n\n**Question 3 (advanced):** \"If it was nighttime and there was no sun, would we see the flag the same way? Why or why not?\"\n- ✓ Acceptable answer: \"No, because there would be no light\" or \"We need light to see things.\"\n\n**Success Criteria:**\n- Student can identify that light helps us see objects (1-PS4-2).\n- Student can explain that shadows are made when light is blocked (1-PS4-3).\n- Student can use vocabulary (light, shadow, bright, dark) in context.\n\n**Expected Student Outcomes:**\n- 80% of students can correctly answer an exit ticket question about light and shadows.\n- Students can point to evidence from the photograph to support their answers.\n\n---\n\n## Differentiation\n\n### Support (Struggling Learners)\n1. **Simplified vocabulary:** Use only \"light\" and \"shadow\" for students struggling with language. Demonstrate these words repeatedly with pointing and gestures.\n2. **Partner pairing:** Pair struggling students with more verbal peers during Explore and Elaborate. Have stronger students model describing what they observe.\n3. **Reduced choice in materials:** Instead of 6 materials, test only 3 (tissue, foil, cardboard). Fewer choices reduce cognitive load.\n4. **Verbal response option:** Allow students to answer exit ticket questions orally rather than drawing, if writing is a barrier.\n\n### Challenge (Advanced Learners)\n1. **Extended investigation:** Ask: \"Can you find materials around the classroom that let light through? Materials that block light? Can you sort them into two groups?\" This applies the concept to a new context.\n2. **Shadow size exploration:** \"What happens to the shadow when you move the object very close to the light? Very far from the light? Can you predict before you try?\"\n3. **Layering materials:** \"What if you put two pieces of tissue paper in front of the light? What about three? Does more material block more light?\" (This touches on light intensity without using that term.)\n\n---\n\n## Extension Activities\n\n1. **\"Light Hunt\" Around School:**\n   - Take students on a walk around the school/classroom to find sources of light (windows, lamps, flashlights) and shadows they create.\n   - Students point and say: \"That lamp makes light!\" or \"That shadow is made because the tree blocks the sun!\"\n   - Take photos or draw pictures for a class book: *\"Where Is Light and Shadow?\"*\n\n2. **Color and Light:**\n   - Repeat the shadow activity, but this time place colored plastic wrap (red, blue, yellow) between the flashlight and the wall.\n   - Ask: \"What color is the light now? Did the colored material change the light?\" \n   - (This connects to 1-PS4-3 about different materials affecting light.)\n\n3. **Flag Investigation at Home:**\n   - Send home a simple worksheet: \"Find an object at home that is bright (lots of light on it). Draw it. Then find a place with a shadow. Draw that too.\"\n   - Students bring back drawings to share. Create a classroom display: *\"Light and Shadows at Home.\"*\n\n---\n\n## Notes for Teacher\n\n- **Safety:** Remind students never to shine flashlights in each other's eyes.\n- **Pacing:** This lesson can be taught in one 90-minute session OR split into two 45-minute sessions (Engage/Explore on Day 1; Explain/Elaborate/Evaluate on Day 2).\n- **Photograph value:** The photograph of the flag serves as an anchor for all discussions. Return to it frequently so students can ground abstract concepts (light, shadow) in a concrete, real-world example.\n- **Vocabulary reinforcement:** Post your vocabulary anchor chart in the classroom and refer to it throughout the week. Repetition builds retention for First Grade.",
  "inputTokens": 2380,
  "outputTokens": 3337,
  "cost": 0.019065,
  "generatedAt": "2026-02-13T00:22:21.242Z"
}