{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p31.jpg",
  "imagePath": "images/physical-science/p31.jpg",
  "content": "# Engineering Design Challenge: Tall Building Flag Display\n\n### Visible Elements in Photo\n- Three tall commercial buildings (brick, glass, and metal) of varying heights arranged close together\n- An American flag mounted on a pole between the buildings, visibly affected by wind\n- A large clock face embedded in a tan/cream-colored stone structure (appears to be a shorter building or pedestal)\n- Rectangular window patterns and vertical metal ribbing on building facades\n- The flag fabric is actively moving/rippling, indicating wind force\n\n### Reasonable Inferences\n- **From the flag's movement**: Wind is a significant force in this urban canyon; structures here must be stable enough to display objects without them falling or breaking.\n- **From the tall buildings close together**: The narrow space between buildings may create wind tunneling effects, making conditions unpredictable.\n- **From the clock placement**: Structures in public spaces need secure mounting systems to hold components safely and keep them visible/functional.\n\n### Engineering Task\n\n**K-2: Make a Flag Pole That Stands Tall**\nBuild a tall, sturdy tower using blocks, straws, or sticks that can hold a small paper flag at the top. Your flag should wave in the air without your tower falling over. How tall can you make it before it tips?\n\n**3-5: Design a Stable Flag Display System**\nDesign and build a structure that holds a flag or fabric securely at a height of at least 30 cm, using only paper tubes, wooden sticks, tape, and string. Your structure must:\n- Stand upright without leaning\n- Support a 20 cm × 20 cm paper flag at its peak\n- Remain stable when you gently blow air at it (simulating wind)\n- Use no more than 5 connectors (tape joints or tied sections)\n\nTest your design by creating a wind-tunnel effect (fan on low speed, 1 meter away) and record whether the flag stays attached and the tower stays upright for 30 seconds.\n\n### EDP Phase Targeted\n**Ask / Define Problem** — This is the best starting point because the photo shows a real-world problem: how to safely and securely display an object (flag) in a challenging environment (tall buildings with wind forces). Students can identify the problem (\"How do we keep things stable up high?\") before imagining solutions.\n\n### Suggested Materials\n- Paper towel tubes or PVC pipes (for tower frame)\n- Wooden craft sticks or dowels\n- Masking tape or duct tape\n- String or fishing line\n- Paper or fabric scraps (for flag)\n- Tape measure\n- Optional: small fan for wind simulation\n\n### Estimated Time\n**45–60 minutes** (one 45-minute session for K-2; one 50-minute session for 3-5 including test cycles)\n\n### Why This Works for Teachers\nThis task directly supports **NGSS ETS1.A** (defining engineering problems by identifying criteria and constraints) and **ETS1.B** (designing solutions by planning and testing), as students must identify what makes a tall structure stable and test their design against a simulated wind force.",
  "inputTokens": 1803,
  "outputTokens": 701,
  "cost": 0.005308,
  "generatedAt": "2026-02-09T13:29:25.569Z"
}