{
  "title": "Force",
  "category": "physical-science",
  "imageFile": "p31.jpg",
  "imagePath": "images/physical-science/p31.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Forces in Motion — Exploring Shadows, Gravity, and Light\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Shadows and Light:** The clock face casts a shadow on the building surface, demonstrating how light travels in straight lines and creates shadows when an object blocks light.\n- **Gravitational Force:** The flag hangs downward due to Earth's gravitational pull; even though wind affects the flag's motion, gravity continuously pulls it toward Earth.\n- **Material Properties:** The brick, stone, and metal materials visible have different colors, textures, and reflective qualities that affect how light interacts with them.\n- **Forces and Motion:** Wind applies a force to the flag, causing it to move and wave, illustrating how forces change an object's motion and direction.\n\n---\n\n## Lesson Title\n\n**Shadows, Gravity, and Moving Flags: Forces and Light in the City**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 5-PS2-1 (Support an argument that the gravitational force exerted by Earth on objects is directed down)\n  - 5-PS3-1 (Use models to describe that energy in animals' food was once energy from the sun) — *connection through light energy*\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Explain that gravity is a force that pulls objects toward Earth and is always directed downward.\n2. Demonstrate how light travels in straight lines and creates shadows when an object blocks its path.\n3. Describe how forces (such as wind or gravity) cause changes in an object's motion or position.\n4. Use evidence from observations and investigations to support statements about forces and motion in the real world.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about forces (gravity and wind) and light (shadows) visible in an urban photograph.\n\n**Materials:**\n- Photograph displayed on interactive board or printed copies (one per pair)\n- Chart paper and markers\n- Flashlight or desk lamp (for preview of shadow activity)\n\n**Activity:**\n\n1. **Display the photograph** on the board and allow 30 seconds of silent observation. Ask students to notice details without speaking.\n\n2. **Ask these focus questions to spark curiosity:**\n   - \"What do you notice is hanging in this picture? Why do you think it hangs that way?\"\n   - \"Do you see the clock face on the building? What do you notice about the dark shadows around the numbers?\"\n   - \"The flag appears to be waving and moving. What do you think is making it move?\"\n   - \"If you held a piece of paper up to a light, what would happen? How is this similar to the shadows you see on the building?\"\n\n3. **Wonder Prompt:** \"I wonder... if we could control the light and wind, what would happen to the shadows and the flag's movement?\"\n\n4. **Record student ideas** on chart paper under two columns: *\"What Makes Things Move?\"* and *\"How Are Shadows Made?\"* Validate all contributions without correcting misconceptions yet.\n\n**Transition:** \"Great questions! Today, we're going to become investigators and test our ideas about shadows, gravity, and forces that make things move — just like the flag and clock shadow in this photo.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate gravity and shadows through hands-on exploration.\n\n**Materials:**\n- Flashlights or desk lamps (one per pair of students)\n- Objects of various shapes and sizes (toy blocks, pencils, erasers, toy figures, balls)\n- White poster board or white paper (taped to walls at student height)\n- Pencils or colored pencils\n- Gravity investigation stations: small containers with water, floating objects (foam, corks), sinking objects (rocks, metal washers), string, tape\n- Notebooks or data recording sheets\n\n**Activity:**\n\n**Station 1: Shadow Investigation (12 minutes)**\n\n1. **Setup:** Pair students. Darken one corner of the classroom or use a shadow box. Place white poster board as a \"screen\" or use a whiteboard as a backdrop.\n\n2. **Student Directions:**\n   - \"Place one object between the flashlight and the poster board.\"\n   - \"Turn on the flashlight and observe the shadow. Draw the shadow shape on your paper.\"\n   - \"Now move the flashlight closer to the object. What happens to the shadow? Record what you observe.\"\n   - \"Move the flashlight farther away. Draw the new shadow and describe what changed.\"\n   - \"Try a different object. Predict what its shadow will look like before you shine the light. Were you right?\"\n\n3. **Recording:** Students draw 3–4 shadows and write one sentence about each: \"When the light was close, the shadow was ___. When the light was far, the shadow was ___.\"\n\n**Station 2: Gravity Investigation (8 minutes)**\n\n1. **Setup:** Students move to a water table or containers with water.\n\n2. **Student Directions:**\n   - \"Place each object into the water one at a time. Observe what happens.\"\n   - \"Some objects float, and some sink. Why do you think this happens?\"\n   - \"Drop objects from your hand and watch where they go. In which direction does everything fall?\"\n   - \"Try throwing an object up. Where does it come back down?\"\n\n3. **Recording:** Students complete a chart:\n   - Object name | Floats or Sinks? | Direction it fell (up or down?)\n\n**Teacher Role:**\n- Circulate and observe without offering answers.\n- Ask probing questions: *\"What did you notice? Why do you think that happened? What would happen if you...?\"*\n- Resist the urge to explain; allow students to make observations and form preliminary ideas.\n- Ensure safety: supervise water activity and flashlight use.\n\n**Expected Student Outcomes:**\n- Students discover that shadows change size and shape based on light position.\n- Students observe that all objects fall toward the ground (downward), regardless of their properties.\n- Students predict and test, building foundational understanding of forces.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and explain the science concepts observed during exploration.\n\n**Materials:**\n- Chart paper with key vocabulary terms (written large)\n- Photograph displayed again on board\n- Student notebooks\n- A simple diagram showing: light source → object → shadow\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2–3 pairs to share one shadow observation and one gravity observation.\n   - Ask: *\"What patterns did you notice?\"* Guide students to recognize that shadows change with light position and all objects fall downward.\n\n2. **Introduce Vocabulary (7 minutes):**\n\n   **Vocabulary with Student-Friendly Definitions:**\n\n   - **Gravity:** A force that pulls all objects toward Earth. It's like an invisible magnet that Earth has — it always pulls things down.\n   \n   - **Force:** A push or pull that can make something move, change speed, or change direction. Wind is a force. Gravity is a force.\n   \n   - **Shadow:** A dark shape made when an object blocks light from reaching a surface. Shadows are always on the opposite side of the light source.\n   \n   - **Light:** Energy that travels in straight lines. It lets us see things. When light can't reach a place because something blocks it, we see a shadow.\n   \n   - **Motion:** Movement from one place to another. Forces cause motion, or they can stop motion or change how something is moving.\n\n3. **Connect Back to the Photograph (5 minutes):**\n   - Point to the clock shadow: *\"The sun is the light source. The clock face blocks the light, and that creates the shadow we see. The shadow is long and dark because of how the light hits the clock.\"*\n   - Point to the flag: *\"The flag is moving because the wind is pushing it — wind is a force. But gravity is also pulling the flag downward. Both forces are acting on it at the same time!\"*\n   - Point to the buildings: *\"All these buildings stay standing because gravity pulls them down, and the ground pushes back up to support them.\"*\n\n4. **Check for Understanding:**\n   - Ask: *\"If we moved the sun (or flashlight) to a different spot, what would happen to the shadow?\"*\n   - Ask: *\"If I throw this ball into the air, what force brings it back down?\"*\n   - Accept all responses; affirm correct thinking, and gently clarify misconceptions.\n\n**Expected Student Outcomes:**\n- Students understand that gravity is a downward-directed force.\n- Students can explain that shadows form when light is blocked by an object.\n- Students recognize that forces cause motion and change.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding of forces and shadows to a new, real-world scenario.\n\n**Materials:**\n- Outdoor space (or simulate with indoor setup) or window access\n- Large objects that cast visible shadows (flag, stick, student body)\n- Measuring tapes or meter sticks\n- Clipboards and data sheets\n- Optional: digital camera or tablet to photograph shadows at different times\n\n**Activity:**\n\n**Real-World Application: Shadow Investigation Outdoors (or Simulated)**\n\n1. **Set the Scenario:** *\"In the photograph, the clock's shadow tells us where the sun is. Shadows actually help us understand how the sun moves throughout the day. Let's be shadow scientists!\"*\n\n2. **Student Task:**\n   - Go outside (or to a window with sunlight) with a partner.\n   - Choose one object to observe (e.g., a flagpole, a stick placed upright, a student standing still).\n   - **Measure and record** the length of the shadow.\n   - **Sketch the shadow** on paper, noting its direction and shape.\n   - Predict: *\"If we come back outside in one hour, do you think the shadow will be the same size and direction? Why or why not?\"*\n\n3. **Return to Class and Discuss:**\n   - *\"Why do shadows change throughout the day?\"* (The sun's position changes; light comes from different angles.)\n   - *\"How does understanding gravity and light help us explain real-world things like this?\"*\n\n4. **Extension Question:** *\"If the flag in the photograph hangs downward due to gravity, but wind pushes it, what does that tell us about forces? Can more than one force act on an object at the same time?\"* (Yes — multiple forces act simultaneously.)\n\n**Teacher Role:**\n- Facilitate the outdoor investigation; ask guiding questions.\n- Help students see the connection between their lab observations and real-world phenomena.\n- Celebrate discoveries and encourage deeper thinking.\n\n**Expected Student Outcomes:**\n- Students apply their understanding of light and shadows to a natural phenomenon (changing shadows).\n- Students recognize that multiple forces (gravity and wind) act on objects simultaneously.\n- Students begin to see science concepts in their everyday environment.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of forces, gravity, and shadows using formative and summative strategies.\n\n**Formative Assessment (During Lesson):**\n- **Observation:** Circulate during Explore phase and note whether students can describe what they observe about shadow size/direction and object falling direction.\n- **Questioning:** Use the check-for-understanding questions in the Explain phase to gauge comprehension.\n- **Student Recording:** Review student drawings and notes from Explore stations for accuracy and evidence of thinking.\n\n**Summative Assessment: Exit Ticket (5 minutes)**\n\nProvide each student with a slip of paper or digital form with these prompts. Collect at the end of Lesson 2.\n\n**Exit Ticket Questions:**\n\n1. **Draw and Label:** Draw a picture showing the sun, a tree, and the tree's shadow. Label where the light is coming from and point to the shadow.\n\n2. **Explain in Sentences:** \n   - What is gravity? Use the word \"force\" in your answer.\n   - Name one thing in the photograph that gravity is pulling downward.\n\n3. **Force and Motion:**\n   - The flag in the photograph is moving. Name two forces that could be acting on the flag.\n\n4. **Real-World Application:**\n   - If you stood outside at noon and again at 3 PM, would your shadow be the same length? Why or why not?\n\n**Success Criteria:**\n\n- **Developing:** Student identifies that shadows exist and objects fall down, but explanations lack detail or use of vocabulary.\n- **Proficient:** Student correctly explains that gravity pulls downward (is a force), shadows form when light is blocked, and can identify 1–2 forces causing motion.\n- **Advanced:** Student provides detailed, multi-part explanations; recognizes multiple forces acting simultaneously; applies concepts to new scenarios; uses vocabulary accurately and naturally.\n\n**Expected Student Outcomes:**\n- 80% of students correctly identify gravity as a downward force.\n- 80% of students can explain how shadows form using light and objects.\n- 70% of students can name at least one force causing the flag's motion.\n- Student responses demonstrate transfer of understanding to new situations (e.g., predicting shadow changes, identifying forces).\n\n---\n\n## Differentiation\n\n### Support (Struggling Learners)\n\n1. **Simplified Recording Sheets:** Provide graphic organizers with sentence frames:\n   - *\"When the light was close, the shadow was _____ (big/small).\"*\n   - *\"Gravity pulls objects _____.\" (down/up)*\n   - Offer pre-drawn shadow shapes; students match them to objects instead of drawing independently.\n\n2. **Partner Shadowing:** Assign stronger students as partners. Have them model the investigation while the struggling learner observes first, then participates with support.\n\n3. **Reduced Vocabulary Load:** Focus on 2–3 key terms (gravity, shadow, force) rather than 5. Use consistent repetition with visuals. Provide a \"Word Wall\" with images and simple definitions students can reference.\n\n4. **Hands-On Repetition:** Allow extra time at both investigation stations. Provide a third, simpler station (e.g., \"Drop Test\") where students simply drop objects and observe direction of fall, building confidence before moving to more complex tasks.\n\n### Challenge (Advanced Learners)\n\n1. **Investigate Variables:** Challenge students to test how *angle* of light affects shadow size. *\"If the light comes from different angles, which angle makes the longest shadow? Can you predict why?\"* Encourage hypothesis testing and data analysis.\n\n2. **Multi-Force Scenarios:** Pose complex scenarios: *\"A flag hangs down due to gravity, but wind pushes it sideways. If I drew arrows for each force, which direction would the flag actually move?\"* Students sketch force diagrams.\n\n3. **Real-World Research:** Assign independent investigation: *\"Research how sundials work. How do shadows and the sun's movement help tell time?\"* Present findings to class using the photograph as a reference.\n\n4. **Deeper Vocabulary and Mechanisms:** Introduce terms like *refraction* or *angle of incidence*. Challenge students to explain why shadows look sharper in some lighting conditions and blurred in others.\n\n---\n\n## Extension Activities\n\n1. **Shadow Puppet Theater (At-Home or In-Class):**\n   - Students create shadow puppets using hands, objects, and a light source.\n   - They perform a short skit showing how shadows change as objects move closer/farther from light.\n   - Connection: Reinforces understanding that shadow size and position depend on light source location and object position.\n\n2. **Gravity Scavenger Hunt:**\n   - Around the classroom or school, hide objects and challenge students to photograph or sketch *\"evidence of gravity\"* — things pulled downward, hanging from gravity, or sitting on surfaces because of gravity.\n   - Students present findings with explanations: *\"This is evidence of gravity because...\"*\n   - Connection: Transfers gravity learning to real-world observation.\n\n3. **Design a Flag (Engineering Challenge):**\n   - Challenge: *\"Design a flag that will move with the wind (force) but also shows that gravity pulls downward. Sketch your design and explain how forces affect it.\"*\n   - Students test designs with a fan or by waving them outdoors.\n   - Connection: Deepens understanding of multiple forces and real-world applications; integrates engineering practices.\n\n---\n\n## Teacher Notes\n\n- **Safety Reminder:** Supervise all water activities and flashlight use. Ensure students do not shine flashlights in eyes.\n- **Pacing:** If students are particularly engaged in exploration, it's acceptable to extend Explore time by 5–10 minutes and shorten Elaborate slightly.\n- **Photograph Revisit:** Return to the photograph at the end of each session. Ask: *\"Now that we've investigated, what do you notice that you didn't before?\"* This reinforces learning and builds observation skills.\n- **Real-World Connection:** Encourage families to notice shadows and identify forces at home (hanging plants, waving flags, falling rain, etc.). Bring observations back to class.\n\n---\n\nThis lesson plan transforms a single urban photograph into a gateway for understanding fundamental forces in physics. Fifth graders will see their world differently — noticing how light, gravity, and motion interact all around them.",
  "inputTokens": 2442,
  "outputTokens": 4035,
  "cost": 0.022617,
  "generatedAt": "2026-02-13T00:25:14.594Z"
}