{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p34.jpg",
  "imagePath": "images/physical-science/p34.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Freezing and Melting in Winter\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Water changes form through heating and cooling:** The icicles in the photograph show water frozen into solid form, demonstrating how cooling causes water to change from liquid to solid.\n- **Properties of materials change with temperature:** Ice (frozen water) has observable different properties than liquid water—it is hard, clear, pointy, and holds its shape.\n- **Reversibility of phase changes:** The icicles can melt back into water when warmed, and water can freeze again when cooled, showing that some changes caused by temperature can be reversed.\n- **Observable physical properties:** Students can observe and describe the appearance, shape, texture, and structure of ice as a material with specific characteristics.\n\n---\n\n## Lesson Title\n\n**Icicles and Ice: Making and Melting Winter Water**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 2-PS1-4: Construct an argument with evidence that some changes caused by heating or cooling can be reversed and some cannot.\n  - 2-PS1-1: Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Describe what happens to water when it gets very cold and when it gets warm.\n2. Observe and record observable properties of ice (frozen water) and liquid water.\n3. Explain that freezing water into ice is a change that can be reversed by adding heat.\n4. Use evidence from exploration to argue that ice and water are the same material in different forms.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Projected photograph of icicles\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n**Display and Introduction:**\nProject the photograph of icicles on the board or screen. Allow students 30 seconds of silent observation. Then say: *\"This is a photo from a very cold winter day. What do you see hanging from the top?\"*\n\n**Discussion Questions:**\n1. *\"What are these long, pointy things made of? What do you think they are?\"* (Guide students to say water or ice.)\n2. *\"How did water become ice? What had to happen?\"* (Expected answer: It got very cold.)\n3. *\"Have you ever seen icicles or ice outside? What did they feel like?\"* (Activate prior experience.)\n4. *\"What would happen to these icicles if the sun came out and warmed them up?\"* (Expected answer: They would melt into water.)\n\n**Wonder Prompt:**\n*\"I wonder if we can make our own ice right here in the classroom and then turn it back into water again. Do you think we can? Let's find out!\"*\n\n**Transition:**\n*\"Let's do an experiment where we freeze water into ice and watch what happens when we warm it up.\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Small plastic cups (one per student)\n- Water (room temperature)\n- Freezer or access to very cold environment\n- Popsicle sticks\n- Warm water (teacher-prepared, about 110°F or warm to touch but safe)\n- Paper towels\n- Recording sheets (simple drawing template with two boxes: \"Ice\" and \"Water\")\n- Crayons or colored pencils\n\n**Activity:**\n\n**Before the activity, prepare:** Freeze cups of water with popsicle sticks overnight, or use the first session to set them up for freezing during lunch/recess so they are ready by Explore time.\n\n**Step-by-Step Student Directions:**\n\n1. *\"Each of you has a cup with water that has been frozen solid in the freezer. Carefully take out your ice. What do you see? What does it feel like?\"*\n\n2. *\"On your recording sheet, in the box labeled 'Ice,' draw what your ice looks like. Use words too if you can. Is it hard or soft? Is it clear or cloudy? What shape is it?\"* (Students observe, touch, describe the solid properties of ice for 3-4 minutes.)\n\n3. *\"Now I'm going to give you a cup of warm water. Carefully put your ice into the warm water and watch what happens. Don't take your eyes off it!\"*\n\n4. *\"What is happening to the ice? Talk with a partner about what you see.\"* (Students observe melting for 5-7 minutes.)\n\n5. *\"In the 'Water' box on your sheet, draw what happened. Is it still ice? What does it look like now?\"*\n\n**How this connects to the photograph:**\n*\"Remember the icicles in that picture? On a warm day, the sun would warm them up just like this warm water is warming your ice. The icicles would melt into water drops, just like your ice is melting right now.\"*\n\n**What students should record or document:**\n- Drawings of ice properties (hard, clear, solid, has shape)\n- Drawings of water after melting (liquid, flowing, clear, poured)\n- Optional: simple words or labels (e.g., \"hard,\" \"cold,\" \"liquid,\" \"dripping\")\n\n**Teacher Role:**\n- Circulate and ask guiding questions rather than providing answers: *\"What is changing?\"* *\"Is the ice still ice or something different?\"* *\"Why do you think that happened?\"*\n- Ensure students handle materials safely and warm water is appropriately warm (test first).\n- Ask students to predict before revealing the outcome: *\"What do you think will happen next?\"*\n\n**Expected Student Outcomes:**\n- Students observe and document that ice (solid, hard, holds shape) transforms into water (liquid, flows, takes the shape of the container) when warmed.\n- Students notice that the ice does not disappear—it becomes something different.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper with vocabulary words and images\n- Student recording sheets from Explore\n- Large cup of water and access to a freezer or ice\n- Real icicle picture (projected photo again)\n\n**Activity:**\n\n**Group Share-Out:**\n1. *\"Let's talk about what happened in our experiment. Who wants to share what you discovered about your ice?\"* Allow 4-5 students to share observations. Write key words they use on chart paper (e.g., \"melted,\" \"cold,\" \"warm,\" \"hard,\" \"liquid\").\n\n2. *\"Everyone's ice turned into water! Here's the amazing part: the ice didn't disappear. The water just changed form.\"*\n\n3. Show the icicle photo again. *\"This happened to those icicles too. When winter turned to spring and it got warmer, those icicles melted into water, just like your ice did.\"*\n\n**Key Vocabulary Introduction:**\nCreate a visual anchor chart with pictures/examples:\n\n| **Term** | **Student-Friendly Definition** |\n|----------|--------------------------------|\n| **Freezing** | When water gets very, very cold and becomes hard ice that you can hold. |\n| **Melting** | When ice gets warm and turns into water that you can pour. |\n| **Solid** | Something hard that has its own shape and doesn't flow (like ice). |\n| **Liquid** | Something wet that flows and pours (like water). |\n| **Reversible** | A change that can happen again and again—you can freeze water into ice, and then melt it back into water again. |\n\n**Connections Back to the Photograph and Explore:**\n*\"The icicles in this picture are solid ice. On a warm day, the sun heats them up, and they melt into water, just like your ice melted in the warm water. And guess what? If that water froze again on a cold night, it could become icicles again. That's called a reversible change—it can go back and forth!\"*\n\n**Check for Understanding Strategy:**\nAsk the following yes/no and open-ended questions:\n- *\"If I freeze water again, would it become ice?\"* (Expected: Yes)\n- *\"Can we reverse this change? Can we turn the water back into ice?\"* (Expected: Yes, by putting it in a freezer)\n- *\"Tell a neighbor: what made the ice turn into water?\"* (Listen for: \"warm water,\" \"heat,\" \"warmth\")\n\n**Expected Student Outcomes:**\nStudents understand that:\n- Ice and water are the same material (water) in different forms.\n- Cooling causes water to become solid (freezing); heating causes ice to become liquid (melting).\n- Freezing and melting are reversible changes.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Ice cubes in a tray or container\n- Room-temperature water in cups\n- Hot water in a thermal container (teacher-handled only, ~130°F)\n- Cold water from a refrigerator\n- Three clear cups per pair of students\n- Thermometers or temperature-sensitive strips (optional)\n- Observation recording sheet\n- Chart showing different temperatures: \"Very Cold,\" \"Cool,\" \"Warm,\" \"Very Hot\"\n\n**Activity:**\n\n**Scenario Application:**\n*\"Now you're going to become ice scientists and test three different temperatures of water. We want to figure out: Does ice melt faster in cold water, room-temperature water, or warm water? This will help us understand what temperature causes the fastest melting.\"*\n\n**Student Directions:**\n1. Students work in pairs. Each pair receives three cups labeled \"Cold,\" \"Room Temperature,\" and \"Warm.\"\n\n2. *\"Put one ice cube in each cup of water. Predict: which one do you think will melt first? Write or draw your prediction.\"*\n\n3. *\"Now watch for 5-10 minutes. Which ice cube is melting the fastest? Which is melting the slowest? What's happening?\"*\n\n4. *\"Record what you observe in each cup. Draw or write which one is winning the 'melt race'!\"*\n\n**Real-World Connection:**\n*\"If you wanted to keep ice cream frozen all day outside on a hot summer day, what temperature of place would you put it in? What about if you wanted to make ice cream melt fast for a smoothie? This is why freezers are very cold and refrigerators are less cold!\"*\n\n**Teacher Role:**\n- Set up the experiment so students focus on observation, not safety hazards (teacher handles hot water).\n- Ask: *\"Why is one melting faster?\"* *\"What's different about each cup?\"* *\"Could we slow down the melting by using even colder water?\"*\n- Encourage predictions and comparisons: *\"Is this what you thought would happen?\"*\n\n**Expected Student Outcomes:**\n- Students observe and record that ice melts faster in warmer water than in cold or room-temperature water.\n- Students apply the concept that heat (warmth) causes melting.\n- Students begin to understand that the *amount* of heat matters—more heat = faster melting.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (Throughout the Lesson):**\n- **Observation:** Circulate during Explore and Elaborate. Listen to student language. Do they use vocabulary correctly? Do they describe reversible change? Checklist: ☐ Uses \"freeze/melting\" language; ☐ Explains ice came from water; ☐ Predicts reversal.\n- **Questioning:** Ask individual students, *\"If I took this water and put it in the freezer, what would happen?\"* Do they respond that it would freeze back into ice?\n- **Recording Sheets:** Review drawings and labels. Do students depict the difference between solid and liquid?\n\n**Exit Ticket (End of Lesson):**\nProvide each student with a simple one-page exit ticket with pictures and three questions:\n\n**Exit Ticket:**\n1. *\"Draw or write: What is ice made of?\"* \n   - Expected answer: Water / ice is frozen water\n   \n2. *\"Circle the correct answer: Ice gets warm and turns into ___.\"*\n   - A) Vapor  B) Water  C) Rock  *(Correct: B)*\n   \n3. *\"Can you freeze water into ice again after it melts? Circle: YES or NO\"*\n   - Expected answer: YES (reversible change)\n\n**Success Criteria for Student Understanding:**\n- ✓ Students accurately describe what ice is made of (water).\n- ✓ Students explain that melting ice turns it into water.\n- ✓ Students demonstrate understanding that freezing is reversible by correctly predicting that water can freeze again.\n- ✓ Students use vocabulary: freezing, melting, ice, solid, liquid (at least 3 of 5).\n- ✓ Students make a connection between the icicle photo and the classroom experiment.\n\n**Expected Student Outcomes:**\n- 80% of students will correctly identify that ice is frozen water.\n- 75% of students will explain that heat/warmth causes ice to melt.\n- 70% of students will recognize that freezing is a reversible change.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners):\n\n1. **Simplified Recording Sheets:** Provide pre-drawn pictures of ice and water for students to label (e.g., word banks with options: \"hard,\" \"soft,\" \"cold,\" \"flows\").\n\n2. **Sentence Stems:** Offer sentence starters to help students explain: *\"Ice is _____ (cold/hard). When I add warm water, the ice _____ (melts). Now it is _____ (water/liquid).\"*\n\n3. **One-on-One Observation:** Pair struggling students with a strong peer or paraprofessional during Explore to provide language modeling and guided observation. Ask: *\"What do you see happening? Can you touch it? What does it feel like now?\"*\n\n### Challenge (For Advanced Learners):\n\n1. **Predict and Test:** Ask advanced students to predict what would happen if ice sat in room-temperature water for 30 minutes vs. warm water for 5 minutes. Have them test and compare quantities of ice remaining.\n\n2. **Temperature and Rate Investigation:** If thermometers are available, have students measure water temperatures in the three cups and record the ice-melting time in each. Can they find a pattern between temperature and melting speed?\n\n3. **Extension Question:** *\"We know ice melts when warmed. But what if water got even colder? What would happen?\"* Introduce the concept that water can freeze at 32°F, but ask: *\"What do you think would happen if water got colder than that?\" (Deeper understanding of freezing point)*\n\n---\n\n## Extension Activities\n\n1. **Reverse the Process:** In a follow-up session, freeze the water that melted from the Elaborate activity by placing it back in a freezer overnight. Have students observe the next day: *\"We turned ice into water. Now we've turned water back into ice! This is a reversible change—it can go back and forth and back and forth.\"* Create a cycle diagram showing Freeze → Melt → Freeze → Melt.\n\n2. **Home Investigation:** Send students home with a simple observation sheet: *\"Watch for ice, snow, or frost this week. Draw what it looks like. When it gets warm, what happens to it? Does it melt?\"* Students return with drawings and observations to share with the class.\n\n3. **Icicle Growing Challenge:** If winter weather permits, create a \"Icicle Garden\" outside the classroom. Students drip water from a string or container in freezing conditions (or use a spray bottle on cold nights) and observe icicles forming over several days. Document growth with photos or drawings. This reinforces that water freezes when cold and connects directly back to the original photograph.\n\n---\n\n## Teacher Notes for Success\n\n- **Timing:** Ensure ice is fully frozen before the Explore phase. If using first session to freeze, set up cups at the beginning and use lunch/recess time for freezing.\n- **Safety:** Test warm water temperature on your own skin first. Keep hot water for Elaborate phase teacher-controlled only.\n- **Vocabulary Repetition:** Use freezing/melting language consistently throughout the lesson and in all future discussions of water and temperature.\n- **Connection to NGSS 2-PS1-4:** This lesson directly addresses the standard by providing evidence that freezing and melting are reversible changes caused by heating and cooling.",
  "inputTokens": 2382,
  "outputTokens": 3936,
  "cost": 0.022062,
  "generatedAt": "2026-02-13T00:31:58.384Z"
}