{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p34.jpg",
  "imagePath": "images/physical-science/p34.jpg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Icicles and the Movement of Energy\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Heat Energy Transfer:** Water changes state from liquid to solid (ice) as heat energy is removed from the environment, and ice melts back to water when heat energy is added.\n- **Properties of Matter:** Ice has different physical properties than liquid water (hardness, shape, how it moves or falls); these properties depend on temperature and the presence or absence of heat energy.\n- **Gravity and Motion:** Icicles hang downward due to the force of gravity pulling them; water droplets fall and freeze layer by layer, building longer icicles over time.\n- **Energy and Temperature:** Temperature indicates the amount of thermal (heat) energy present; colder temperatures cause water to freeze into icicles, while warmer temperatures cause them to melt.\n\n---\n\n## Lesson Title\n\n**Icicles: How Cold Changes Water and Makes It Fall**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes total if combined)\n- **NGSS Standards:**\n  - **4-PS3-2:** Make observations to provide evidence that energy can be transferred from place to place by sound, light, heat, and electric currents.\n  - **4-PS3-1:** Use evidence to construct an explanation relating the speed of an object to the energy of that object.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** how water changes into ice when heat energy is removed and how ice can change back to water when heat energy is added.\n2. **Explain** that icicles form when water freezes and that gravity pulls the icicles downward.\n3. **Predict** what will happen to an icicle when it is exposed to different amounts of heat energy.\n4. **Design and test** a simple model that shows how icicles form and change due to temperature and heat energy.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n#### Objective\nCapture student interest and activate prior knowledge about freezing, melting, and gravity using the dramatic photograph of icicles.\n\n#### Materials\n- Photograph displayed on projector or interactive board (large, clear image)\n- Chart paper and markers\n- No other materials needed for this phase\n\n#### Activity\n\n**Display and Introduction:**\nDisplay the icicle photograph on the board or projector. Tell students: *\"Today, we're going to be detectives and figure out how these amazing icicles formed and why they look the way they do.\"*\n\n**Discussion Questions (read slowly, allow 30-40 seconds of think time per question):**\n\n1. **\"What do you notice about the icicles in this picture? Describe their shape and where they are hanging.\"**\n   - *Expected responses:* They are long and pointy; they hang down; they look like spikes; they are clear/transparent.\n\n2. **\"Why do you think these icicles are shaped like long sticks instead of puddles on the ground?\"**\n   - *Hint if needed:* Think about what happens when you drop things—where do they go?\n   - *Expected responses:* Gravity pulls them down; they fall because of something pulling them.\n\n3. **\"Have you ever seen something cold and hard turn into something wet? What was it?\"**\n   - *Expected responses:* Ice cream melts; ice cubes melt in water; icicles melt when it gets warm.\n\n4. **\"If this icicle was sitting in a warm classroom, what do you predict would happen to it?\"**\n   - *Expected responses:* It would melt; it would turn to water; it would drip.\n\n**Wonder Prompt:**\nWrite on chart paper: *\"I wonder... How does an icicle grow longer and longer? What has to happen for water to turn into ice? Why does an icicle hang down instead of standing up?\"*\nInvite students to share one of their own \"I wonder\" questions about icicles.\n\n#### Transition\n*\"Great questions! Now, let's become ice scientists and do an experiment to figure out how water turns into ice, just like in the picture.\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n#### Objective\nStudents investigate state changes and gravity through hands-on experimentation with freezing and melting water.\n\n#### Materials\n**Per student pair or small group (prepare before lesson):**\n- 1 clear plastic cup or small beaker\n- Water (at room temperature)\n- Food coloring (optional, but recommended for visibility—use 1-2 drops per cup)\n- 1 pencil or wooden stick (to act as string/support)\n- 1 rubber band or piece of tape\n- Access to a freezer (prepare this ahead: pre-fill several cups with colored water and place in freezer 2-4 hours before class)\n- Paper towels\n- 1 thermometer (one per pair or group to share)\n- Observation sheet (see \"Expected Student Outcomes\" for format)\n\n#### Activity\n\n**Setup (Teacher does this before or with students' help):**\nBefore the lesson, fill 3-4 cups with water and a drop of food coloring and place them in a freezer for 2-4 hours. Have these ready to retrieve during the Explore phase.\n\n**Student Investigation Steps:**\n\n1. **Prediction (2 minutes):**\n   - Show students a fresh cup of room-temperature colored water.\n   - Ask: *\"What do you think will happen to this water if we put it in a very cold freezer overnight? Draw and write your prediction on your observation sheet.\"*\n\n2. **Observation Phase 1—Frozen Water (5 minutes):**\n   - Distribute the pre-frozen cups to each group. (The water should be partially or fully frozen—ice on top or throughout.)\n   - Students observe the frozen water and describe it on their sheet: *\"What do you see? What does the ice feel like? Is it hard or soft? Can you break it? What color is it?\"*\n   - Have groups use thermometers to measure the temperature of the ice. Record it.\n\n3. **Phase 2—Adding Heat Energy (8 minutes):**\n   - Tell students: *\"Now, we're going to add heat energy to the ice and watch what happens.\"*\n   - Each group places their frozen cup in a warm location (sunny windowsill, near a lamp, or under a heat lamp—NOT over a flame for safety).\n   - Alternatively, teacher demonstrates by holding a cup under warm (not hot) running water or placing it on a warm surface, with students observing closely.\n   - Students observe every 1-2 minutes and record what they see: *\"Is the ice melting? Can you see water forming? Is it happening fast or slow?\"*\n   - Measure temperature again after 3-5 minutes.\n\n4. **Phase 3—Gravity and Dripping (5 minutes):**\n   - As the ice melts, students observe water dripping from the cup.\n   - Ask: *\"Why does the water drip down instead of float up? What force is pulling it down?\"*\n   - If possible, hold up a pencil vertically and ask: *\"If water froze on this pencil, which way would the icicle point—up or down? Why?\"*\n   - Students draw and label the direction of gravity in their observation sheet.\n\n#### Teacher Role\n- Circulate between groups, asking probing questions: *\"What changed from before? What energy do you think caused that change? Can you feel the heat?\"*\n- Do **not** tell students the answers; guide them to notice the changes themselves.\n- Help with thermometer readings if needed.\n- Keep the room safe by ensuring no hot water or unsafe heat sources are used.\n\n#### Expected Student Outcomes\n**Students should record/produce:**\n- A prediction drawing and sentence\n- Descriptions of what frozen water looks like and feels like\n- Temperature readings (before and after heating)\n- Observations of melting (with drawings and words)\n- A diagram showing gravity pulling the water downward\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n#### Objective\nIntroduce formal vocabulary and connect observations back to the photograph and the 5E concepts.\n\n#### Materials\n- Chart paper with vocabulary words written large\n- Completed observation sheets from Explore phase\n- Photograph of icicles (displayed again)\n- 1 sample cup with partially melted ice (if time allows, use from Explore phase)\n\n#### Activity\n\n**Group Share-Out (5 minutes):**\n- Ask 2-3 groups to share what they observed: *\"What happened when we added heat? How did the ice change?\"*\n- Record key words they use on chart paper (e.g., \"melted,\" \"got wet,\" \"dripped,\" \"got warmer,\" \"fell down\").\n\n**Introduce Vocabulary (7 minutes):**\nDisplay and define these terms with Fourth Grade-friendly language:\n\n1. **Heat Energy:** The energy that makes things warm. When something has more heat energy, it gets warmer. When it loses heat energy, it gets colder.\n   - *Connection:* \"When we put the ice near the warm lamp, we added heat energy, and the ice melted into water.\"\n\n2. **Freezing:** The process where liquid water becomes solid ice because heat energy is removed (the water gets cold enough).\n   - *Connection:* \"In the icicle picture, freezing happened because the temperature outside was very cold.\"\n\n3. **Melting:** The process where solid ice becomes liquid water because heat energy is added (the ice gets warm enough).\n   - *Connection:* \"In our experiment, melting happened when we added warmth to the ice.\"\n\n4. **Gravity:** An invisible force that pulls all objects downward toward Earth.\n   - *Connection:* \"Gravity is why the icicles in the picture hang down. Gravity also pulled the water droplets downward as they froze, making the icicles grow longer.\"\n\n5. **Temperature:** A measure of how much heat energy something has. We use a thermometer to measure temperature in degrees.\n   - *Connection:* \"Our thermometer showed that the ice was very cold (low temperature) and the melting ice became warmer (higher temperature) when we added heat.\"\n\n**Connection Back to the Photograph (3-5 minutes):**\n- Display the icicle photograph again.\n- Ask: *\"Now that we've done our experiment, how do you think these icicles formed? Use one of our vocabulary words in your answer.\"*\n- Guide students to say something like: *\"Water froze (freezing happened) because it was very cold outside (low temperature, no heat energy). Gravity pulled the water and ice downward, so the icicles grew pointing down.\"*\n- Explain: *\"On cold winter days, water drips from roofs and gutters. Because the temperature is so low outside, the water freezes into ice as it drips. Gravity keeps pulling it down, so each tiny layer of frozen water stacks on top of the last one, making the icicle longer and longer.\"*\n\n**Check for Understanding:**\nAsk students to turn and talk to a partner: *\"If I brought a warm hairdryer to an icicle hanging outside, what would happen? Use the word 'melting' or 'heat energy' in your answer.\"*\nListen to 2-3 pairs share. If misconceptions arise, clarify using the vocabulary.\n\n#### Vocabulary\n1. **Heat Energy** — The energy that makes things warm; when something has more heat energy, it is warmer.\n2. **Freezing** — The process where liquid water turns into solid ice when heat energy is removed and temperature gets very cold.\n3. **Melting** — The process where solid ice turns into liquid water when heat energy is added and temperature gets warmer.\n4. **Gravity** — An invisible force that pulls objects downward toward Earth.\n5. **Temperature** — A measure of how hot or cold something is; we use a thermometer to measure it.\n\n#### Expected Student Outcomes\nStudents should:\n- Use the vocabulary words correctly in sentences or drawings.\n- Explain that freezing and melting are caused by adding or removing heat energy.\n- Understand that gravity pulls icicles downward.\n- Predict that adding heat energy (warmth) to an icicle would cause it to melt.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n#### Objective\nStudents apply their understanding of heat energy transfer and state change to a new, real-world scenario.\n\n#### Materials\n- 3-4 different heat sources or environments (prepared before class):\n  - **Station 1:** Cup with ice in a freezer or ice bucket (cold environment)\n  - **Station 2:** Cup with ice on a windowsill or under a lamp (warm environment)\n  - **Station 3:** Cup with ice at room temperature (neutral environment)\n  - Optionally, **Station 4:** Cup with ice and a piece of salt on top (fastest melting—shows that adding salt speeds up melting due to temperature change)\n- Observation chart (one per pair)\n- Pencils\n- Optional: stopwatches or a timer\n\n#### Activity\n\n**Scenario Introduction:**\n*\"Imagine you are a scientist studying how to make icicles disappear. You have three (or four) different locations where you can put the icicle. Which location would make the icicle melt the fastest? Let's test!\"*\n\n**Station Rotation Activity (12-15 minutes):**\n\n1. **Divide the class** into 3-4 small groups (one per station).\n2. **Each group rotates through all stations** (3-4 minutes per station).\n3. **At each station, students:**\n   - Place their labeled cup with ice in that environment.\n   - Observe and record: *\"How fast is the ice melting? Is it very slow, slow, medium, or fast? Why do you think that is?\"*\n   - Measure temperature with a thermometer and record it.\n   - Draw a picture of how much ice remains.\n\n4. **Comparison Discussion (3-5 minutes):**\n   - Bring the class back together.\n   - Ask: *\"Which location melted the ice the fastest? Which was the slowest? Why?\"*\n   - Guide students to recognize: *\"The warmest location had the most heat energy, so the ice melted the fastest. The coldest location had very little heat energy, so the ice melted the slowest.\"*\n\n**Real-World Connection:**\n*\"Now think about a real icicle hanging outside your house. In winter, which is colder—the shady side of your house or the sunny side? Where would icicles melt faster? Why?\"*\nAllow students to discuss and reason aloud.\n\n#### Teacher Role\n- Set up stations before the lesson.\n- Monitor each station to ensure accurate observations.\n- Ask guiding questions: *\"What is different about this location compared to the last one? Can you feel the difference in temperature? How does that affect the ice?\"*\n- Encourage students to make comparisons between stations.\n\n#### Expected Student Outcomes\nStudents should:\n- Observe that ice melts faster in warmer environments (more heat energy).\n- Record temperature at each station and notice the relationship between temperature and melting speed.\n- Use the vocabulary words (\"heat energy,\" \"melting,\" \"temperature\") to explain their observations.\n- Predict that a sunny, warm location would melt an icicle faster than a cold, shady location.\n\n---\n\n### 5. EVALUATE\n\n#### Objective\nAssess student understanding of heat energy transfer, state changes, and gravity.\n\n#### Activity\n\n**Formative Assessment (Throughout Lesson):**\n- **Listen to partner discussions** during Explain and Elaborate phases for correct use of vocabulary and reasoning.\n- **Review observation sheets** for accurate descriptions and predictions.\n- **Ask questions during circulation:** *\"Why did the ice melt? Where did the water come from? Why does it drip down?\"* Evaluate responses for understanding of energy transfer and gravity.\n\n**Exit Ticket (Summative Assessment):**\nDistribute this brief written assessment at the end of the lesson. Students may draw and write, depending on writing ability.\n\n**Exit Ticket Prompt:**\n*\"You are going to leave a frozen water bottle outside on a cold winter day. In 2-3 hours, the sun comes out and the day gets much warmer. What will happen to your frozen water bottle? Explain your answer using the words 'heat energy' or 'melting' or 'temperature.'\"*\n\n**Alternative (for non-writers or ELL students):**\nShow a picture of ice cubes in a cup in the sun. Ask: *\"Is the ice getting more heat energy or less heat energy? What will happen next?\"*\n\n#### Success Criteria\nStudents demonstrate proficiency if they:\n\n1. **Correctly predict** that the ice will melt when heat energy is added (the day warms up).\n2. **Use at least one vocabulary word** correctly (heat energy, melting, temperature, freezing, or gravity).\n3. **Explain the \"why\"** with a reason related to temperature or heat energy (e.g., *\"The sun made it warmer, so the heat energy melted the ice.\"*).\n\n#### Expected Student Outcomes\n- **Proficient:** Students explain that the ice melts because heat energy from the sun causes a temperature change. They use vocabulary correctly.\n- **Developing:** Students predict melting will occur but give vague reasons (e.g., *\"It will melt because it's warm\"*). They may use vocabulary inconsistently.\n- **Beginning:** Students predict a state change but cannot explain the connection to heat energy or temperature. Vocabulary is not used or is used incorrectly.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Pre-teach vocabulary** before the lesson using real objects (ice cube, cup of hot water) so students can connect words to concrete experiences.\n\n2. **Simplify the Explore activity** by providing only two conditions: a freezer (very cold) and a windowsill (warm). Reduce the observation sheet to 3-4 simple drawings instead of written descriptions. Pair students with a more verbal partner to support recording.\n\n3. **Use sentence starters for explanations:**\n   - *\"The ice melted because ___.\"*\n   - *\"Gravity pulled the water ___.\"*\n   - *\"Heat energy makes things ___.\"*\n   Provide word banks with vocabulary words and simple phrases to choose from.\n\n4. **Provide a visual anchor chart** with pictures of freezing (ice cube → water) and melting (ice cube → water) with vocabulary labels posted throughout the lesson.\n\n### Challenge (For Advanced Learners)\n\n1. **Investigate variables:** Ask advanced students to design their own experiment: *\"What if we added food coloring to the water before freezing? What if we used hot water instead of warm water? Would the ice melt faster?\"* Have them form a hypothesis, test it, and explain their results using cause-and-effect reasoning.\n\n2. **Explore the concept of \"rate of melting\":** Ask: *\"Can you measure how many centimeters of ice melt every minute? Can you create a graph showing the icicle getting shorter over time?\"* This introduces data collection and graphing in a meaningful context.\n\n3. **Connect to real-world phenomena:** *\"Why do salt trucks spread salt on icy roads in winter? Research and explain how salt affects the melting point of ice.\"* (This extends to chemistry but remains grounded in the energy concept.)\n\n4. **Predict and test:** *\"If an icicle was partially in the sun and partially in the shade, which part would melt first? Why? Let's design an experiment to find out.\"*\n\n---\n\n## Extension Activities\n\n### Extension 1: The Icicle Growth Investigation\n**Time: 20-30 minutes (can be done over 2-3 days)**\n\nHave students create a model icicle by:\n- Suspending a wet string or rope vertically in a freezer overnight.\n- Observing and measuring how the string becomes encased in ice.\n- Discussing why icicles grow downward in \"real life\" by dripping water accumulating and freezing (gravity + freezing = longer icicles).\n- Comparing their model to the photograph.\n\n**NGSS Connection:** 4-PS3-2 (observing that temperature change transfers energy); 4-PS3-1 (relating gravity's effect on motion).\n\n---\n\n### Extension 2: Energy Transfer in Different Materials\n**Time: 20-30 minutes**\n\nStudents test which materials transfer heat energy fastest to ice:\n- Place ice cubes on different materials (aluminum foil, plastic wrap, wood, cloth).\n- Measure which ice cube melts fastest.\n- Discuss: *\"Some materials conduct heat energy better than others. Which material was a good heat conductor?\"*\n\n**Real-world connection:** This explains why metal ice scrapers work better than plastic ones for removing ice from windows.\n\n**NGSS Connection:** 4-PS3-2 (heat energy transfer).\n\n---\n\n### Extension 3: Icicle Lifecycle Story\n**Time: 15-20 minutes (writing/drawing activity)**\n\nStudents create a comic strip or illustrated story showing an icicle's \"life\":\n1. Rain falls from a cloud.\n2. Water freezes on a roof or gutter (freezing).\n3. More water drips and freezes, making it longer (growth via gravity and freezing).\n4. The sun comes out; the icicle melts (melting).\n5. The water falls to the ground.\n\nStudents label each step with vocabulary words and energy ideas (heat energy added/removed, gravity pulling down).\n\n**NGSS Connection:** 4-PS3-2 (energy transfer and state change).\n\n---\n\n## Final Notes for the Teacher\n\nThis lesson is designed to make abstract concepts (heat energy, gravity, state change) concrete through direct observation and safe, simple experimentation. The photograph provides the \"why\" motivation—students want to understand the real icicles they see in winter. The hands-on exploration lets them discover the concepts, and the vocabulary introduction gives them language to discuss what they've learned.\n\n**Safety reminders:**\n- Use only warm (not hot) water or low-heat sources. Never use a flame or anything that could burn students.\n- Ensure freezers are accessible and safe.\n- Wash hands after activity.\n- Supervise thermometer use if using glass thermometers.\n\n**Timing flexibility:**\n- This lesson can be split into two 45-minute sessions: Day 1 (Engage, Explore, half of Explain) and Day 2 (rest of Explain, Elaborate, Evaluate).\n- Or taught in one 90-minute block.\n\n**Vocabulary poster:**\nCreate a visual anchor chart with the five vocabulary terms and illustrations (real photos or student drawings) and keep it posted throughout the unit for reference.",
  "inputTokens": 2458,
  "outputTokens": 5319,
  "cost": 0.029053000000000002,
  "generatedAt": "2026-02-13T00:33:28.681Z"
}