{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p34.jpg",
  "imagePath": "images/physical-science/p34.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Icicles and Freezing\n\n## Core Science Concepts from Image Analysis\n\n- **Phase changes:** Water transitions between liquid and solid states when temperature drops below freezing (32°F/0°C), as visible in the icicle formation.\n- **Gravity and matter:** Liquid water is pulled downward by gravitational force, forming hanging icicles that grow as more water freezes in a vertical arrangement.\n- **Heat transfer and energy:** Energy is removed from water through cooling, causing the particles in water to slow down and bond into a crystalline solid structure.\n- **Properties of materials:** Ice (solid water) has different properties than liquid water—it is rigid, has a crystalline structure, and can hang from surfaces without flowing like liquid water would.\n\n---\n\n## Lesson Title\n\n**Freezing Fall: How Water Becomes Ice and Gravity Pulls It Down**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes total)\n- **NGSS Standards:** \n  - 5-PS1-3 (Make observations and measurements to identify materials based on their properties)\n  - 5-PS2-1 (Support an argument that the gravitational force exerted by Earth on objects is directed down)\n  - 5-PS1-1 (Develop a model to describe that matter is made of particles too small to be seen)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe the properties of ice and compare them to the properties of liquid water.\n2. Explain how cooling water causes it to change from a liquid to a solid (ice).\n3. Predict and demonstrate how gravity pulls water and ice downward, creating icicle-like formations.\n4. Use models to show how particles in water slow down and arrange differently when temperature decreases.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about freezing water and gravity.\n\n**Materials:**\n- Photograph of icicles (displayed on projector, interactive whiteboard, or printed copies)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or distribute printed copies. Allow 30 seconds of silent observation.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you notice about these pointy ice shapes? What are they, and how do you think they formed?\"\n   - \"Why do all these icicles hang downward instead of pointing upward or sideways?\"\n   - \"If you touched an icicle, what do you think it would feel like compared to the water from a water fountain?\"\n   - \"How is an icicle different from a regular ice cube from an ice tray? What made them different shapes?\"\n\n3. **Prediction prompt:** \"If it gets very cold outside tonight, and water drips from a roof into your backyard, what do you predict will happen to that water? Draw or describe what you think you'll see.\"\n\n4. **Record student predictions** on chart paper under the heading \"Our Icicle Predictions.\" Keep this visible for comparison at the end of the lesson.\n\n**Transition:** \"Today, we're going to make our own mini icicles in the classroom and discover exactly why they form the way they do.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate phase change and gravity through a hands-on icicle-building activity.\n\n**Materials (per group of 3-4 students):**\n- 1 clear plastic cup (9 oz)\n- 1 string (12 inches long, cotton or wool works best)\n- Water\n- Salt (table salt, ~2-3 tablespoons per group)\n- Food coloring (optional, for visibility)\n- Paper towels\n- Tape\n- Shallow tray or cookie sheet\n- Access to a freezer (or ice bath with rock salt if freezer unavailable)\n- Thermometer (1 per group)\n- Pencils or wooden sticks\n\n**Activity: \"Build a Mini Icicle\"**\n\n**Step-by-step student directions:**\n\n1. Fill your plastic cup about three-quarters full with water. Add 3-4 drops of food coloring if desired (this helps you see what's happening).\n\n2. Measure and record the **starting temperature** of the water with a thermometer. Write this in your observation sheet.\n\n3. Tape one end of the string to a pencil or stick and lay the pencil across the top of the cup so the string hangs into the water. The string should touch the bottom of the cup.\n\n4. Predict: \"What do you think will happen if we cool this water down really fast?\" Write or draw your prediction.\n\n5. **Create a freezing mixture:** Pour salt onto crushed ice in a shallow tray (or your teacher will provide this). This creates a mixture much colder than just ice.\n\n6. Carefully place your cup into the salt-ice mixture. Do NOT let salt water get into your cup.\n\n7. **Record observations every 2-3 minutes for 15 minutes:**\n   - What does the string look like?\n   - Where is ice forming first?\n   - Why do you think ice is forming on the string instead of in the middle of the cup?\n   - Is the ice growing downward, upward, or both? Why?\n\n8. Measure the water temperature again. Write down the new temperature.\n\n9. After 15 minutes, carefully remove your cup and examine your string. Describe the ice formations you see.\n\n**How this connects to the photograph:** Just like in the picture, your ice should form downward because gravity pulls the water and ice down. The cold temperature slows down water particles until they lock into solid ice.\n\n**What students should record:**\n- Starting and ending temperatures\n- Labeled sketches showing where ice formed and in what direction\n- Observations about the texture and appearance of ice\n- Answers to guiding questions about why ice formed on the string\n\n**Teacher Role:**\n- Circulate and ask: \"What direction is your ice growing? Why do you think that is?\"\n- Resist explaining phase change; instead, prompt: \"What changed about the water? How is it different now?\"\n- Help students measure accurately without giving answers about temperature or freezing points.\n- Ensure safety with ice and salt mixtures.\n\n**Expected Student Outcomes:**\nStudents should observe ice forming on the string with downward growth patterns, note temperature drops, and begin to connect cooling with ice formation.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and scientific explanations for phase change and gravity.\n\n**Materials:**\n- Chart paper with vocabulary terms\n- Student observation sheets from Explore phase\n- Photograph of icicles (displayed again)\n- Optional: animated video clip of freezing water (30-60 seconds from a reputable source like National Geographic Kids)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 2-3 groups to show their icicles and describe what they observed.\n   - Ask: \"What did you notice about the direction the ice grew?\"\n   - Record key phrases students use on chart paper.\n\n2. **Direct instruction with vocabulary (10 minutes):**\n\n   Present these **five key vocabulary terms** with student-friendly definitions:\n\n   - **Freezing:** When a liquid (like water) gets so cold that it turns into a solid (like ice). This happens at 32°F or 0°C.\n   - **Phase change:** When matter changes from one form to another, like from liquid to solid.\n   - **Gravity:** An invisible force that pulls objects downward toward the Earth.\n   - **Particle:** Tiny, tiny pieces of matter that are too small to see, but everything is made of them.\n   - **Crystalline structure:** The organized, repeating pattern that particles form when they freeze into a solid. Ice crystals have this pattern, which is why ice looks different from liquid water.\n\n3. **Make connections (5 minutes):**\n   - Point to the photograph again. \"In this picture, you see icicles hanging down because gravity pulled the water downward as it froze. The water particles slowed down because it was so cold, and they locked together into ice.\"\n   - Show how their mini icicles match the photograph: same downward growth pattern, same reason (gravity + freezing).\n   - Use a simple diagram on the board showing water particles (circles) moving fast, then slow, then locked together in rows.\n\n4. **Check for understanding:**\n   - Ask: \"If I poured warm water on an icicle, what would happen? Why?\"\n   - Ask: \"Why do icicles always point downward and not sideways?\"\n   - Have students turn to a partner and explain in their own words: \"What is freezing?\"\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Freezing** | When liquid water becomes solid ice because it gets very cold. |\n| **Phase change** | When something changes form, like water turning into ice. |\n| **Gravity** | The invisible force that pulls objects down toward Earth. |\n| **Particle** | A teeny-tiny piece of something; everything is made of particles. |\n| **Crystalline structure** | The organized way particles line up when they freeze into ice. |\n\n**Expected Student Outcomes:**\nStudents should understand that freezing is a phase change caused by cooling, gravity pulls water downward, and particles arrange differently in solid ice versus liquid water.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply phase change and gravity concepts to a new scenario.\n\n**Materials:**\n- Images of real-world freezing scenarios (provided by teacher or student-found)\n- Chart paper and markers\n- Optional: photos of frost, frozen lakes, icicles from different climates\n\n**Activity: \"Freezing in the Real World\"**\n\n1. **Scenario introduction (2 minutes):**\n   Display 2-3 real-world images: icicles on gutters, ice stalactites in caves, frozen waterfalls, frost on leaves.\n   Ask: \"Where else in nature does freezing happen? How is it the same as or different from our icicles?\"\n\n2. **Small group challenge (10 minutes):**\n   Assign each group one scenario:\n   - **Group A:** Icicles forming on roof gutters during winter\n   - **Group B:** Ice forming on the edges of a frozen lake (growing outward from the shore)\n   - **Group C:** Frost forming on grass blades early in the morning\n\n   **Each group must:**\n   - Explain what they observe (draw or describe the shape/direction).\n   - Answer: \"Where did the water come from?\"\n   - Answer: \"Why did it freeze? What had to happen to the temperature?\"\n   - Answer: \"How did gravity or lack of gravity affect the shape?\"\n\n3. **Gallery walk or presentations (5 minutes):**\n   Groups share their thinking. Class discusses similarities (all involve freezing and temperature drop) and differences (different water sources, different shapes due to gravity's direction).\n\n4. **Connect to icicles:** \"Our mini icicles in the Explore phase showed us the same science happening in nature!\"\n\n**Teacher Role:**\n- Facilitate group discussions without correcting; encourage reasoning.\n- Guide with questions: \"What had to be cold? Where did the water come from?\"\n- Prompt for gravity connections: \"Is water always pulled straight down? How did that affect the shape?\"\n\n**Expected Student Outcomes:**\nStudents recognize that freezing and gravity apply to real-world scenarios; they can explain phase change and gravitational effects in contexts beyond the classroom icicles.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student mastery of learning objectives.\n\n**Formative Assessment (during lesson):**\n- **Observation during Explore:** Did students accurately record temperatures and observe ice formation patterns?\n- **Think-pair-share during Explain:** Could students explain freezing and gravity to a partner?\n- **Group work during Elaborate:** Did groups apply concepts to new scenarios with reasoning?\n\n**Summative Assessment: Exit Ticket**\n\nProvide each student with a sheet containing these prompts (students answer in writing or with drawings):\n\n**Exit Ticket: \"Icicles and Freezing\"**\n\n1. **What causes water to freeze into ice?** (What has to happen?)\n\n2. **Why do icicles hang downward instead of pointing sideways or upward?** Use the word \"gravity\" in your answer.\n\n3. **Draw or describe:** If the temperature outside suddenly became much warmer, what do you predict would happen to the icicles in the picture? Explain your prediction.\n\n4. **True or False?** Ice and liquid water are made of the same tiny particles (called water particles), but they are arranged differently because of temperature. Explain your answer.\n\n**Success Criteria:**\n\n- ✓ Student identifies cooling/temperature drop as the cause of freezing.\n- ✓ Student explains that gravity pulls icicles downward.\n- ✓ Student predicts melting and provides reasoning.\n- ✓ Student demonstrates understanding that particles behave differently at different temperatures.\n\n**Expected Student Outcomes:**\nStudents demonstrate mastery if they:\n- Correctly explain freezing as a phase change caused by cooling.\n- Link gravity to the downward direction of icicles.\n- Show understanding of particle behavior during phase changes.\n- Apply concepts to predict outcomes in new scenarios.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified vocabulary cards:** Provide laminated cards with the five vocabulary terms and pictures. Students can reference these during Explain and Elaborate phases.\n\n2. **Guided observation sheet:** Create a partially filled observation sheet during Explore with sentence starters:\n   - \"The temperature started at _____ and ended at _____.\"\n   - \"Ice formed on the string because _____.\"\n   - \"The ice grew downward because _____.\"\n\n3. **Partner pairing:** Pair struggling students with stronger communicators during group share-outs and elaborate activities. Assign a specific role (e.g., \"You draw what we observe; I'll write the words\").\n\n### Challenge (for advanced learners)\n\n1. **Investigate variables:** Challenge advanced students to hypothesize: \"Does salt water freeze at the same temperature as fresh water? How could we test this?\" Provide materials for a mini-investigation comparing freezing points.\n\n2. **Particle model extension:** Ask students to create a detailed particle diagram showing how water particles move at different temperatures (room temperature, 32°F, freezing mixture temperature). Have them explain particle motion using kinetic energy language.\n\n3. **Real-world research project:** Have students research and present on how freezing affects infrastructure (e.g., pothole formation, burst pipes, ice dams). Challenge them to explain the role of gravity and phase change in each scenario.\n\n---\n\n## Extension Activities\n\n### Extension 1: \"Icicle Races\"\nCreate a competitive \"freeze race\" where groups build multiple icicles using different variables (different string materials, different freezer temperatures, different water solutions). Students predict which will freeze fastest and collect data. This reinforces the relationship between temperature and freezing rate.\n\n**Time:** One 30-minute session | **Materials:** Strings (cotton, wool, nylon), ice, salt, water, thermometers\n\n---\n\n### Extension 2: \"Gravity Investigations\"\nStudents test whether gravity affects freezing in all directions. Provide containers where they can orient water-filled strings horizontally or at angles. Challenge them to predict and observe ice formation in different orientations. They'll discover that gravity pulls downward regardless, but icicle shapes change based on water flow direction.\n\n**Time:** One 30-minute session | **Materials:** Various containers, strings, ice, salt, water, pencils/sticks at different angles\n\n---\n\n### Extension 3: \"Phase Change Comic Strip\"\nStudents create a 4-6 panel comic strip showing the journey of a water molecule from liquid in a cloud, to falling rain, to freezing into an icicle, to melting back into water. Each panel includes labels and explanations of what is happening to the particle and where gravity is acting. This integrates literacy with science and reinforces particle theory.\n\n**Time:** One 45-minute session or homework | **Materials:** Paper, colored pencils, rulers, vocabulary cards for reference\n\n---\n\n## Teacher Notes\n\n- **Safety reminder:** Salt-ice mixtures get very cold. Supervise students closely and remind them not to touch the mixture directly; use the cup as a barrier.\n- **Timing:** If freezer access is limited, prepare a salt-ice bath in a cooler the night before. Alternatively, use the outdoor temperature if it's winter and cold enough.\n- **Vocabulary scaffolding:** Introduce \"phase change\" as a unifying concept. Freezing, melting, evaporation, and condensation are all phase changes—this builds toward upper elementary and middle school chemistry.\n- **Real-world connection:** On the next snowy or icy day after this lesson, take students outside to observe actual icicles. Discuss what they see using the vocabulary from the lesson.\n\n---\n\nThis lesson sequence moves from concrete observation (the photograph and hands-on activity) through guided discovery to abstract thinking (particle models and real-world applications), scaffolding Fifth Grade learners appropriately while meeting the three targeted NGSS standards.",
  "inputTokens": 2442,
  "outputTokens": 4036,
  "cost": 0.022622,
  "generatedAt": "2026-02-13T00:34:10.774Z"
}