{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p34.jpg",
  "imagePath": "images/physical-science/p34.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Icicles and Freezing\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **State changes of matter (solid ice formation):** Water transforms from liquid to solid when temperature drops below freezing, visible in the icicles hanging from the overhang.\n- **Gravity and forces:** Icicles hang downward due to the downward pull of gravity on the solid ice mass.\n- **Temperature and energy transfer:** Heat energy moves away from water, causing it to freeze and form the icicle structures.\n- **Properties of materials (before and after):** The same water that dripped becomes a hard, brittle solid with different physical properties.\n\n---\n\n## Lesson Title\n\n**Freezing Water: Exploring How Liquids Turn to Solids**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 40-minute sessions (80 minutes total)\n- **NGSS Standards:** \n  - 3-PS1-3: Identify and describe that matter can be solid, liquid, or gas; observe and describe the states of matter and explain changes in the state of matter.\n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object (gravity pulling icicles down).\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Describe what happens to water when it gets very cold and explain why icicles form.\n2. Identify gravity as a force that pulls the icicles downward and keeps them hanging.\n3. Predict what will happen to an icicle when it is brought to a warm room.\n4. Compare the properties of liquid water and solid ice (hard, cold, shape).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Activate curiosity about freezing water and icicles using the photograph.\n\n**Materials:**\n- Printed photograph of icicles (or displayed on projector/smartboard)\n- Chart paper and marker\n- Small cup of ice cubes (pre-made)\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see. Tell students: \"This is a real photo taken outside someone's house during winter. I want you to look carefully and tell me what you see.\"\n\n2. **Ask these discussion questions** (pause for responses after each):\n   - \"What are all these pointy, clear things hanging down? Have you ever seen anything like this?\"\n   - \"Why do you think they are hanging down and not pointing up?\"\n   - \"Do you think these are hard or soft? What makes you think so?\"\n   - \"Where does the water come from that makes icicles?\"\n\n3. **Activate prior knowledge** by asking: \"When we leave a glass of water in the freezer, what happens to it? Can anyone describe it?\"\n\n4. **Introduce the wonder prompt:** \"Today we're going to investigate: What makes water freeze into ice? And why do icicles hang down the way they do?\"\n\n**Transition:** \"Let's explore this question by doing an experiment with water and ice.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate freezing through hands-on observation and simple experimentation.\n\n**Materials:**\n- Clear plastic cups (one per student or pair)\n- Water (room temperature)\n- Food coloring (optional, for visibility)\n- Ice cubes (crushed and whole)\n- Small paper cups or containers\n- Freezer access (or pre-frozen water samples in coolers with ice)\n- Droppers or small spoons\n- Observation worksheets (see below)\n- Thermometer (class tool, teacher-led)\n\n**Activity:**\n\n1. **Divide students into pairs.** Distribute one cup of room-temperature water and food coloring to each pair.\n\n2. **Part A – Observing Ice Melting (Reverse of Freezing):**\n   - Have each pair add 2–3 ice cubes to their water cup.\n   - Ask: \"What do you notice happening to the ice? Touch the cup. How does it feel?\"\n   - Students observe for 5 minutes, recording on worksheet: \"The ice is getting ___\" and \"The water is getting ___.\"\n   - Teacher explains: \"The warm room is giving heat energy to the ice, turning it from solid back to liquid.\"\n\n3. **Part B – Observing a Frozen Water Sample (or prediction):**\n   - Show students a pre-frozen cup of water (solid ice block) or a large ice cube.\n   - Ask: \"What was this before it froze? How is it different from the liquid water we poured?\"\n   - Students feel the outside of the container and record: \"Frozen water is ___,\" \"Liquid water is ___.\"\n\n4. **Part C – Gravity Investigation (optional, time-permitting):**\n   - Place a small ice cube on an angled surface or hold it up with tape.\n   - Ask: \"Why does it stay there? What is pulling it down?\"\n   - Drop the ice cube and observe its fall.\n   - Record: \"Ice falls down because __________.\"\n\n**Teacher Role:**\n- Circulate and ask prompts: \"What's changing? Why is that happening?\"\n- Avoid directly answering; guide students to observe themselves.\n- Assist with recording but encourage students to write their own observations.\n\n**Expected Student Outcomes:**\n- Students observe that ice is harder and colder than liquid water.\n- Students notice ice melts when it warms up.\n- Students describe gravity pulling objects downward.\n- Worksheet evidence of observations recorded in student-friendly language.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Formalize understanding with vocabulary and connect to the photograph.\n\n**Materials:**\n- Chart paper with vocabulary words\n- Photograph (redisplayed)\n- Visual aids showing water, ice, and icicles\n- Thermometer (to show temperature concept)\n\n**Activity:**\n\n1. **Facilitate a group share-out:**\n   - \"What did you discover about ice and water? What was different?\"\n   - Call on 4–5 student pairs to share one observation each.\n   - Record responses on chart paper.\n\n2. **Introduce vocabulary with demonstrations:**\n\n   **Vocabulary:**\n   - **Solid:** Matter that has a definite shape and doesn't change (like ice). \"Ice is a solid because it keeps its pointy shape—it doesn't slump like water.\"\n   - **Liquid:** Matter that flows and takes the shape of its container (like water). \"Water is a liquid because it moves and fills up the cup.\"\n   - **Freezing:** When liquid water gets so cold it turns into solid ice. \"Freezing happens when water loses heat energy.\"\n   - **Melting:** When solid ice gets warmer and turns back into liquid water. \"Melting is the opposite of freezing.\"\n   - **Gravity:** An invisible force that pulls things downward. \"Gravity is like an invisible hand pulling the icicles down.\"\n\n3. **Connect back to the photograph:**\n   - Point to the icicles: \"These are frozen water—they are solids. Water dripped from the roof when it was wet. But then it got very, very cold, and the water froze into ice. Gravity pulled the water down as it froze, which is why icicles hang and point down.\"\n   - Ask: \"Why are there no icicles in the summer?\" (It's too warm; ice melts back to liquid.)\n\n4. **Check for understanding:**\n   - Hold up an ice cube: \"Is this a solid or a liquid?\"\n   - Show water in a cup: \"Is this a solid or a liquid?\"\n   - Ask: \"What force is pulling this ice cube down if I drop it?\" (Gravity.)\n   - Use thumbs up/sideways/down for student confidence.\n\n**Expected Student Outcomes:**\n- Students correctly identify solids and liquids.\n- Students use the word \"freezing\" to describe water turning to ice.\n- Students explain that gravity pulls icicles (and all objects) downward.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Apply freezing and gravity concepts to a new scenario.\n\n**Materials:**\n- Water\n- Small plastic bags (or containers)\n- String\n- Freezer access (or pre-made frozen bags)\n- Thermometer\n- Chart paper titled \"Predictions\"\n\n**Activity:**\n\n1. **Introduce a real-world challenge:** \"We're going to create our own icicle! But instead of waiting for winter outside, we'll make one in the freezer.\"\n\n2. **Guided prediction activity:**\n   - Show students a bag of water.\n   - Ask: \"If we hang this bag of water in the freezer, what will happen? Draw or write your prediction.\"\n   - Discuss predictions: \"How long do you think it will take? How will it look when it freezes?\"\n\n3. **Execution (if time and freezer access permit):**\n   - Fill small plastic bags halfway with water and food coloring.\n   - Hang bags in a freezer (or show a pre-made frozen version).\n   - Ask: \"Why does the water freeze faster in the freezer?\" (Freezer is much colder; it removes heat energy quickly.)\n   - Optional: Observe for 10–15 minutes if freezer is accessible, or check a pre-made sample.\n\n4. **Discussion of results:**\n   - Compare the artificial icicle to the photograph: \"How are they the same? How are they different?\"\n   - Ask: \"What is pulling this frozen water down?\" (Gravity.)\n   - Discuss: \"Will this icicle melt if we take it out of the freezer?\" (Yes, because it will get warmer.)\n\n**Teacher Role:**\n- Facilitate predictions without judgment.\n- Ask guiding questions: \"Why do you think that will happen? What gives ice its shape?\"\n- Help students see the connection between cold temperatures and freezing.\n\n**Expected Student Outcomes:**\n- Students make and justify predictions about freezing.\n- Students observe or predict the formation of ice structures.\n- Students apply the concept of gravity to their creation.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of states of matter, freezing, and gravity.\n\n**Formative Assessment (throughout lesson):**\n- **Observation checklist** during Explore phase: Are students accurately describing ice and water? Are they noticing differences?\n- **Vocabulary check** during Explain: Can students correctly label objects as solid or liquid?\n- **Discussion responses** during Elaborate: Do student predictions show understanding of freezing and cold?\n\n**Summative Assessment – Exit Ticket (end of Day 2):**\n\nProvide each student with a paper containing three simple questions (with space to draw or write):\n\n1. **\"I see a cup of water left in the freezer all night. What will happen to it? Draw or write what you think.\"**\n   - Success criteria: Student indicates water will turn to ice (frozen/solid).\n\n2. **\"Why do icicles hang down and not stick up?\"**\n   - Success criteria: Student mentions gravity, pulling down, or \"heavy.\"\n\n3. **\"Is ice a solid or a liquid? How do you know?\"**\n   - Success criteria: Student correctly identifies ice as solid and provides a reason (hard, keeps its shape, cold, etc.).\n\n**Expected Student Outcomes:**\n- At least 70% of students correctly identify freezing and gravity concepts.\n- Students use vocabulary terms (solid, liquid, freezing, gravity) appropriately.\n- Students can explain the connection between cold temperatures and icicle formation.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n1. **Reduce vocabulary load:** Focus on \"solid\" and \"liquid\" only in first lesson; introduce \"freezing\" in second session.\n2. **Use a word bank:** Provide sentence frames like \"Ice is a ___\" or \"Gravity pulls ___\" to scaffold written responses.\n3. **Pair with a stronger reader:** Ensure students with reading difficulties are paired with a peer who can help interpret instructions and worksheets.\n4. **Hands-on practice:** Allow extra time to touch and observe ice and water before moving to explanation; some students need more tactile exploration.\n\n### Challenge (for advanced learners):\n1. **Temperature investigation:** Provide thermometers and ask students to measure water temperature before and after freezing; graph the temperature changes.\n2. **Extend the gravity concept:** Ask: \"How would icicles look on the moon where gravity is weaker? Why?\" Have them draw and explain.\n3. **Explore other freezing points:** Introduce the concept that different liquids freeze at different temperatures. Can they hypothesize about salt water vs. fresh water?\n4. **Reverse engineering:** Ask: \"How long would it take to melt an icicle at different room temperatures?\" Have them design and conduct an experiment.\n\n---\n\n## Extension Activities\n\n1. **Seasonal photo comparison:** Display photos of icicles from various climates and seasons. Ask: \"Where do icicles form? When do they form? Why don't we see icicles in summer?\" Create a class chart showing conditions needed for icicles.\n\n2. **Ice structure investigation:** Provide clear ice cubes and magnifying glasses. Ask students to observe and draw the crystalline structure of ice. Discuss: \"Why does ice form in patterns? Does all ice look the same?\"\n\n3. **Freezing point exploration (Home activity):** Send home a simple worksheet: \"Fill a cup with water and place it in your freezer. Check it every hour and draw what happens. When did it freeze completely?\" Have students share results and create a class graph of freezing times.\n\n4. **Real-world applications:** Introduce why freezers are important (food preservation), why we salt icy roads (lowers freezing point), or how ice skating works. Have students draw and label an application of freezing or melting.\n\n---\n\n**Teacher Notes:**\n- This lesson is designed for flexibility. If freezer access is limited, pre-make frozen water samples in advance to demonstrate results.\n- The photograph of icicles is most relevant in winter/cold climates. If teaching in warm regions, emphasize the real-world connection: \"This happens in places where it gets very cold.\"\n- Return to the photograph frequently throughout the lesson—it's your concrete visual anchor for abstract concepts like freezing and gravity.\n- Safety reminder: Allow students to observe ice from a distance if it has become slippery; do not allow unsupervised access to freezers.",
  "inputTokens": 2376,
  "outputTokens": 3389,
  "cost": 0.019321,
  "generatedAt": "2026-02-13T00:32:34.342Z"
}