{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p34.jpg",
  "imagePath": "images/physical-science/p34.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Icicles and Sunlight\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Sunlight's effect on matter:** Water transforms from solid ice to liquid when warmed by the sun's energy, visible as melting icicles dripping from the shelter\n- **States of matter transitions:** Ice is a solid form of water that can melt into a liquid, demonstrating how temperature (from solar energy) causes material changes\n- **Temperature and energy:** The sun's warmth causes physical changes in solid materials without adding new substances\n- **Contrast and observation:** The bright white icicles against darker evergreen trees help students see how sunlight creates visible changes in the environment\n\n---\n\n## Lesson Title\n\n**Melting Magic: How Sunlight Changes Ice**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 90 minutes across two 45-minute sessions (or flexible over 2 days)\n- **NGSS Standards:** \n  - K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface\n  - K-PS2-1: Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object (as ice melts and drips)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n- **Observe and describe** what happens to ice when sunlight warms it\n- **Identify sunlight** as an energy source that causes changes in solid materials\n- **Predict** what will happen to ice in different light conditions (sunny vs. shaded)\n- **Compare** how ice melts at different rates based on warmth from the sun\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about icicles and connect to the photograph's visible melting.\n\n**Materials:**\n- Large display of the icicle photograph (printed 8.5\" × 11\" or projected on screen)\n- Real icicle OR ice cube shaped like an icicle (if possible; otherwise use clear photographs)\n- Chart paper and marker\n\n**Activity:**\n\n1. **Display the photograph** prominently. Point to the long, pointed icicles and say: *\"Look at this amazing picture! What do you see hanging down?\"*\n\n2. **Ask these guiding questions:**\n   - \"What is this white, pointy stuff?\" (Allow students to identify ice/icicles)\n   - \"Why do you think it looks wet or drippy at the bottom?\" (Encourage observations about dripping water)\n   - \"Where is the sun in this picture?\" (Guide them to notice this was taken in sunlight; the icicles are bright/white)\n   - \"What happens to ice when it gets warm?\" (Activate prior knowledge about melting)\n\n3. **Wonder prompt:** Show or hold up an ice cube. Say: *\"If we put this ice cube in the sunshine, what do you think will happen? Will it stay the same, or will it change?\"* Have students make predictions aloud and record a few on chart paper (write their exact words).\n\n4. **Transition:** *\"Let's do an investigation where we watch ice change in the sun, just like those icicles in the picture!\"*\n\n**Expected Engagement:** Students should show curiosity about the melting process and make at least one prediction.\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how sunlight affects ice through hands-on observation.\n\n**Materials:**\n- 2 clear plastic cups per student pair\n- Ice cubes (frozen water) — make the day before\n- Warm water in a container (teacher-prepared, safe temperature ~100°F)\n- Paper towels\n- Markers and labels (\"Sunny Spot\" and \"Shady Spot\")\n- Access to a sunny windowsill or outdoor sunny area AND a shaded indoor location\n- Simple data sheets (see \"Expected Student Outcomes\")\n\n**Activity:**\n\n1. **Set up two stations** visible in the classroom:\n   - **Station A (Sunny):** A windowsill or place in direct sunlight\n   - **Station B (Shady):** A location away from direct light (under a shelf, in a corner, or outside in shade)\n\n2. **Direct students:**\n   - *\"You and your partner will put ice cubes in two cups. We'll place one cup where the sun shines bright, and one cup where it's dark and cool.\"*\n   - Place an ice cube in each cup; label them with student names\n   - Students carry cups to each station and predict which will melt faster\n   - **Record predictions** on the data sheet (teacher scribe or student draw/circle)\n\n3. **Observe over 15-20 minutes:**\n   - Students return to check on their ice cubes every 5 minutes\n   - Each time, they **touch the outside of the cup** (not inside) and describe: \"Is the ice still hard? Is there more water? Is it smaller?\"\n   - Teacher circulates and asks: *\"What do you notice? Is your prediction coming true?\"*\n   - **Document observations** by drawing or circling pictures on the sheet:\n     - Big ice cube (not melted), smaller ice cube (partly melted), mostly water (mostly melted)\n\n4. **Teacher role:** \n   - Facilitate safe cup placement\n   - Ask open-ended questions (\"What changed?\" \"Which melted faster?\")\n   - Do NOT tell students the answer; guide them to notice\n   - Record student language verbatim for later discussion\n\n**Expected Student Outcomes:** \n- Students observe ice cubes melting faster in sunlight than in shade\n- They notice water pooling in the sunny cup first\n- Simple drawings or circled pictures show understanding that sunlight caused change\n- Student quotes like: \"My sunny one is getting water faster!\" or \"The shade one is still ice!\"\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to energy concepts.\n\n**Materials:**\n- Completed data sheets from Explore phase\n- Chart paper with predictions (from Engage)\n- Photograph displayed again\n- Picture cards showing ice → water transition (or simple drawings teacher creates)\n- Real ice cube (if not used already)\n\n**Activity:**\n\n1. **Group share-out:**\n   - Have 3-4 student pairs share their observations: *\"What did you notice? Which cup melted faster?\"*\n   - Record responses on chart paper: \"The sunny cup melted faster!\" \"The shady one still had ice!\"\n   - Celebrate accurate predictions: *\"Great prediction! You were right!\"*\n\n2. **Introduce vocabulary with Kindergarten-friendly definitions:**\n\n   | **Term** | **Kid-Friendly Definition** |\n   |----------|---------------------------|\n   | **Ice** | Frozen water that is hard and cold |\n   | **Melt** | When ice gets warm and turns into water |\n   | **Sunlight** | Energy from the sun that makes things warm |\n   | **Energy** | The power to make something move or change |\n   | **Solid** | Something hard that doesn't change shape (like ice) |\n\n3. **Make connections:**\n   - Point to the photograph: *\"See the icicles? The sun is shining on them, so they're melting. That's what happened to your ice cubes in the sunny spot!\"*\n   - Show the ice cube or a picture: *\"Ice is solid. When sunlight makes it warm, it melts and becomes water that can drip.\"* (Mime dripping with your fingers)\n   - Draw or show a simple diagram: ☀️ → ❄️ → 💧 (Sun → Ice → Water)\n\n4. **Check for understanding:**\n   - Ask: *\"When we put ice in the sun, what happens? Does it stay ice, or does it change?\"* (Students should answer: *\"It melts!\" or \"It turns into water!\"*)\n   - Show the photograph again: *\"Are these icicles melting or staying frozen? Why?\"* (Students should say: *\"They're melting because the sun is warming them!\"*)\n\n**Vocabulary Reference Poster:**\nLeave a visual chart in the classroom with pictures and the terms above for ongoing reference.\n\n**Expected Student Outcomes:**\n- Students can name ice, melt, and sunlight\n- Students verbally explain: \"Sunlight makes ice melt into water\"\n- Students point to evidence in both the photograph and their experimental data\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding by predicting and testing how to change the melting speed using different variables.\n\n**Materials:**\n- Ice cubes (fresh batch, if possible)\n- Clear plastic cups\n- Different \"treatments\": aluminum foil, black construction paper, white construction paper, plastic wrap, plain cup\n- Sunny windowsill or outdoor sunny space\n- Stopwatch or timer (visual; can use a sand timer for Kindergarten)\n- Simple prediction/result charts with pictures\n\n**Activity:**\n\n1. **Introduce a new question:**\n   - *\"We learned sunlight melts ice. But what if we cover the ice? Can we slow down the melting?\"*\n   - Show different materials: foil, black paper, white paper, wrap\n\n2. **Make predictions:**\n   - *\"If we wrap ice in foil, will it melt fast or slow? What if we use black paper? What if we use white paper?\"*\n   - Have students **vote** by standing in different corners: \"Fast Melters\" vs. \"Slow Melters\"\n   - Record their guesses on a chart with pictures\n\n3. **Quick investigation (10 minutes):**\n   - Place 4-5 cups of ice in a sunny spot, each wrapped differently\n   - After 10 minutes, unwrap and check\n   - Let students touch the cups and compare: *\"Which is coldest? Which melted the most?\"*\n\n4. **Discuss:**\n   - *\"What blocked the sunlight? Why did wrapping it slow the melting?\"*\n   - Connect: *\"If we cover ice with foil, the sun can't touch it, so it stays cold longer!\"*\n\n5. **Teacher role:**\n   - Facilitate predictions and setup\n   - Ask: \"Why do you think that one melted less?\"\n   - Guide (don't tell): \"What does the black paper do? Does it help the sun reach the ice?\"\n\n**Expected Student Outcomes:**\n- Students predict that coverings slow melting\n- Students observe that darker or reflective materials affect melting rate\n- Student reasoning: \"Foil kept it cold because the sun couldn't reach it\"\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess understanding of sunlight's effect on ice and evidence of energy transfer.\n\n**Formative Assessment (ongoing during Explore & Elaborate):**\n- **Observation checklist:**\n  - ☐ Student makes a prediction about which cup melts faster\n  - ☐ Student describes changes observed (e.g., \"The sunny one has more water\")\n  - ☐ Student uses vocabulary: ice, melt, sunlight\n  - ☐ Student correctly identifies sunlight as the cause of melting\n\n**Exit Ticket / Summative Assessment (end of lesson):**\n\nConduct brief individual or small-group interviews (2 minutes per student). Ask:\n\n1. **\"Show me the sunny cup and the shady cup from our experiment. Which one melted more? Why?\"**\n   - ✓ **Success:** Student points to sunny cup and says: \"Because sunlight made it warm!\" or \"The sun made the ice melt\"\n   - ◐ **Partial:** Student identifies the correct cup but struggles with the \"why\" (may need more time)\n   - ✗ **Not yet:** Student cannot identify which melted faster\n\n2. **\"Look at this picture of the icicles again. Is the sun helping them melt? How do you know?\"**\n   - ✓ **Success:** Student says: \"Yes, the sun is warm\" and/or \"They're dripping water because it's sunny\"\n   - ◐ **Partial:** Student agrees the sun is helping but cannot fully explain\n   - ✗ **Not yet:** Student does not connect sun to melting\n\n3. **\"If we put ice in a dark closet with no sun, what would happen? Would it melt or stay hard?\"**\n   - ✓ **Success:** Student says: \"Stay hard\" or \"Not melt because no sun\"\n   - ◐ **Partial:** Student is unsure but can guess\n   - ✗ **Not yet:** Student does not understand that sunlight is necessary\n\n**Success Criteria:**\n- Students answer at least 2 of the 3 questions at the \"✓ Success\" level\n- Students can identify ice and water and explain basic melting\n- Students demonstrate that sunlight is the cause (not guessing/luck)\n\n**Document Results:**\n- Record checkmarks on a class roster\n- Keep photos of student data sheets and observations\n- Save student quotes for evidence\n\n---\n\n## Differentiation\n\n### Support (For Students Needing Extra Help)\n\n1. **Simplified vocabulary and repeated exposure:**\n   - Use only two vocabulary terms: **ice** and **melt** in early sessions\n   - Create a visual word wall with picture cards and the word\n   - Repeat the terms in every activity (\"The ice is melting. Melt. The sun makes it melt.\")\n\n2. **Guided observation with visual checklist:**\n   - Provide a picture-based observation sheet with boxes to check instead of drawing\n   - Show pictures of \"still ice,\" \"some water,\" \"mostly water\" and have student point to or circle what they see\n   - Pair with a peer buddy who can model checking the cup\n\n3. **Hands-on language support:**\n   - Let students hold the cup (safe temperature) and feel the temperature difference between sunny and shady cups\n   - Teach tactile vocabulary: \"Hot cup in the sun. Cold cup in the shade.\"\n   - Provide sentence starters: *\"The sun makes the ice...___\"* (expect: warm, melt, water)\n\n### Challenge (For Advanced Learners)\n\n1. **Predict and explain with multiple variables:**\n   - Ask: *\"What if we used a very thick ice cube instead of a thin one? Would it melt faster or slower? Why?\"*\n   - Have students predict and test; discuss how size affects melting time\n   - Introduce sequencing: \"First the ice is solid. Then it starts to melt. Last it becomes all water.\"\n\n2. **Investigate reflective vs. absorptive materials:**\n   - Provide white, black, and clear cups (not covered) in the sun\n   - Ask: *\"Which color gets warmest from the sun?\"*\n   - Guide discovery that darker colors absorb more heat; lighter colors reflect it\n   - Connection: *\"That's why wearing a white shirt on a sunny day keeps you cooler!\"*\n\n3. **Extend to real-world scenarios:**\n   - Show pictures of glaciers or snow in mountains\n   - Ask: *\"Why do snowy mountains melt faster in spring when the sun gets brighter?\"*\n   - Challenge: *\"What if we lived where it's always sunny? Would ice stay frozen? Why or why not?\"*\n\n---\n\n## Extension Activities\n\n### Extension 1: **Icicle Prediction Game**\n- Display the original photograph again\n- Ask: *\"Where on this roof do you think the icicles will melt first?\"*\n- Students predict: sunny spots, north-facing edges, shaded areas\n- Discuss: *\"Icicles hanging from metal gutters melt faster because metal gets hot in the sun. Icicles in shadows stay frozen longer.\"*\n- Have students draw where they think icicles will melt and explain to a partner\n\n### Extension 2: **Ice Cube Art**\n- Freeze water with food coloring in small cups\n- Place colored ice cubes in sunny and shady windowsills\n- As they melt, observe how the colored water spreads and mixes\n- Students draw the \"before and after\" and describe: *\"The sun's warmth made the ice release its color into the water!\"*\n- Extend: *\"Could we use ice cubes to water plants? The water comes from melted ice!\"*\n\n### Extension 3: **Seasonal Icicle Investigation (Spring/Summer Follow-Up)**\n- After winter, revisit the question: *\"Do we see icicles in spring when the sun is warmer? Why not?\"*\n- Search for real icicles (or photos) and discuss: *\"The warmer spring sun melts icicles faster, so they don't stay on roofs as long.\"*\n- Create a class calendar: *\"When do icicles form? When do they melt?\"* (connects to seasons and energy)\n- Homework: *\"Ask your family: When did you last see icicles? What time of year was it?\"*\n\n---\n\n## Teacher Notes\n\n- **Safety reminder:** Use safe, warm (not hot) water if needed. Test all ice in advance for small pieces. Monitor handling of cups.\n- **Timing flexibility:** If students are highly engaged in Explore, extend it. Shorten Elaborate if needed.\n- **Photograph connection:** Return to the icicle photograph at least once per phase to reinforce that the lesson is about what they're seeing in the real world.\n- **Documentation:** Take photos of student data sheets and quote students during share-outs. This evidence supports assessment and parent communication.\n- **Follow-up:** If students enjoyed this, plan a lesson on **snow and sun** (K-PS3-1) or **shadows and sunlight** using the same photograph.",
  "inputTokens": 2383,
  "outputTokens": 4137,
  "cost": 0.023067999999999998,
  "generatedAt": "2026-02-13T00:30:34.097Z"
}