{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p6.jpg",
  "imagePath": "images/physical-science/p6.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Exploring Rust and Chemical Changes\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Properties of Materials:** The photograph shows objects with visible changes in appearance (rust formation), demonstrating how materials can change color, texture, and surface characteristics over time.\n- **Evidence of Force and Motion:** Branches, nails, and metal pieces scattered on weathered wood suggest the effects of wind, gravity, and environmental forces that move and redistribute objects.\n- **Cause and Effect Relationships:** The rusty appearance of metal objects indicates a reaction with environmental factors (oxygen, moisture), showing a clear cause-and-effect relationship between materials and their surroundings.\n- **Stability and Change:** The degradation of materials (wood weathering, metal rusting) demonstrates how matter changes when exposed to natural conditions over time.\n\n---\n\n## Lesson Title\n\n**Mystery of the Rusty Treasures: How Materials Change**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 3-PS2-1 (Plan and conduct investigation to provide evidence of effects of balanced and unbalanced forces on motion)\n  - 3-PS1-2 (Understand that matter can be broken down and recombined, with properties that change) *Note: Using PS2-1 as primary; PS1 concepts woven throughout*\n  - Primary focus: **3-PS2-1** (Forces and motion; cause-and-effect of environmental factors on object changes)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** changes in the appearance and properties of metal and wood materials when exposed to different environmental conditions.\n2. **Identify cause-and-effect relationships** between exposure to air and water and the formation of rust on metal objects.\n3. **Plan and conduct a simple investigation** to test how different conditions affect the speed of rust formation.\n4. **Predict and explain** how forces in nature (wind, water, gravity) can move objects and change materials over time.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph of weathered materials.\n\n**Materials:**\n- Photograph of rusty objects and weathered wood (projected or printed)\n- Chart paper and markers\n- Teacher-prepared \"Mystery Box\" (optional): Contains actual rusty nails, a clean nail, and a weathered branch\n\n**Activity:**\n\n1. **Display the photograph.** Project or display the image prominently. Allow students 30 seconds of silent observation to process what they see.\n\n2. **Launch with a mystery question:** \"This picture was taken outside where the sun, wind, and rain could reach these things. What do you notice about how these objects look different from something brand new?\"\n\n3. **Guide observations with specific questions:**\n   - \"What colors do you see? Where do you see brown, orange, and white coloring?\"\n   - \"Some of these metal nails and branches look shiny or smooth, and some look bumpy and rough. What might have happened to them?\"\n   - \"If I showed you a brand-new shiny nail from a hardware store, how would it be different from the nails in this picture?\"\n   - \"Do you think the wind and rain had anything to do with how these objects changed? Why?\"\n\n4. **Activate prior knowledge:** Ask students, \"Who has seen something rusty or broken down before? What did it look like? How do you think it got that way?\"\n\n5. **Wonder prompt:** \"I wonder... if we left different materials outside (or in water) for a few days, what would happen to them? Would they all change the same way? Let's investigate!\"\n\n**Transition:** \"Now we're going to do an experiment where we can watch materials change—just like what happened to these treasures in the photograph.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate rust formation and material changes through hands-on experimentation.\n\n**Materials (per group of 3-4 students):**\n- 4 glass jars (or clear plastic cups)\n- Water\n- Paper towels\n- 4 steel nails or metal paper clips (same type for consistency)\n- Masking tape and markers (for labeling)\n- 1 small piece of wood (craft stick or pencil) — one per group\n- Optional: vegetable oil, plastic wrap\n- Safety goggles (if available)\n- Observation recording sheets (provided template below)\n\n**Setup (Teacher prepares beforehand):**\n- Label four jars/cups: A (dry air), B (water only), C (soapy water), D (water + salt)\n- Pre-fill as follows:\n  - Jar A: Leave empty (dry air control)\n  - Jar B: Fill with plain tap water\n  - Jar C: Fill with tap water + a drop of dish soap\n  - Jar D: Fill with tap water + one teaspoon of salt\n\n**Student Activity Directions (Read aloud and post visually):**\n\n1. \"Place one clean nail in each jar. Make sure the nail in Jar A is sitting on a dry paper towel (not touching water).\"\n\n2. \"Place one wood stick in Jar B (the water jar). Observe if it changes.\"\n\n3. \"Draw a picture of what each nail looks like RIGHT NOW on your observation sheet. Use colors to show if it's shiny, silver, or has any spots.\"\n\n4. \"Write or draw what you PREDICT will happen to each nail after 3-5 days. Which one do you think will get rusty first? Why?\"\n\n5. \"Leave the jars in a safe place where they won't be knocked over. You will observe them again tomorrow and the day after.\"\n\n**Recording Sheet Template (Third Grade-friendly):**\n```\nNAME: ________________________     DATE: __________\n\nRUSTY NAILS INVESTIGATION\n\nJar A (Dry):\nDay 1 Drawing: [SPACE FOR DRAWING]\nPrediction: What will happen? ___________________\n\nJar B (Water Only):\nDay 1 Drawing: [SPACE FOR DRAWING]\nPrediction: What will happen? ___________________\n\nJar C (Soapy Water):\nDay 1 Drawing: [SPACE FOR DRAWING]\n\nJar D (Salt Water):\nDay 1 Drawing: [SPACE FOR DRAWING]\n\nMy Biggest Question: What makes nails get rusty? ________\n```\n\n**Teacher Role:**\n\n- Circulate among groups, asking guiding questions: \"Why do you think the salt water might make rust faster?\" \"What do you notice the nail needs to change?\"\n- Do **not** confirm or deny predictions; encourage thinking: \"That's an interesting idea. Let's watch and see what happens.\"\n- Ensure each student contributes at least one prediction or observation.\n- Take photos of each group's setup for comparison at end of lesson.\n\n**Expected Student Outcomes:**\n\n- Students will observe rust beginning to form within 24-48 hours, particularly in Jars B and D (water conditions).\n- Students will develop initial explanations: \"Water makes rust\" or \"Salt makes rust happen faster.\"\n- Each student will record at least one prediction and description per day.\n- Students will notice that the dry nail (Jar A) changes much more slowly (if at all).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to scientific concepts after exploration.\n\n**Materials:**\n- Chart paper with vocabulary\n- Pictures from Explore phase (or actual jars if within 24-48 hours of setup)\n- Whiteboard/markers for concept mapping\n\n**Activity:**\n\n1. **Share observations (5 minutes):** Ask each group to share ONE thing they noticed about their nails so far. List observations on chart paper: \"Water makes rust,\" \"Salt water turned orange faster,\" \"The dry nail is still shiny,\" etc.\n\n2. **Introduce key vocabulary (8 minutes):** Teach each term with student-friendly definitions and point to photographic evidence.\n\n   **Vocabulary:**\n   - **Rust:** A brown, reddish powder that forms on metal when it touches air and water for a long time. (Point to the photograph's rusty nails.)\n   - **Reaction:** When two things mix together and cause a change. Rust is a reaction between metal, air, and water.\n   - **Condition:** Something in the environment (like wet, dry, hot, cold) that affects how something changes.\n   - **Evidence:** Proof or a clue that shows something happened. Rust is evidence that metal has been in water.\n   - **Weathering:** The slow breaking down of rocks and materials by wind, water, and time. (Point to the weathered wood in the photograph.)\n\n3. **Make explicit connections (5 minutes):**\n   - \"Remember the photograph at the beginning? Those nails looked just like our rusty nails because they were left outside where rain and air could reach them—the same conditions as our Jar B!\"\n   - \"The wood in that picture also changed. What might have caused the wood to look gray and rough? Wind, rain, and sun—just like weathering!\"\n   - \"Your investigation is helping us understand how things in nature change over time.\"\n\n4. **Check for understanding:**\n   - Ask: \"If we found a rusty nail on the ground, what does that tell us about where it's been?\" (Answer: It's been wet and in the air.)\n   - \"Which jar do you think created conditions most like the photograph?\" (Jar B or D—water present.)\n\n**Expected Student Outcomes:**\n\n- Students can use the word \"rust\" correctly to describe what they observe.\n- Students understand that rust is a **reaction** caused by **conditions** (water + air + metal).\n- Students can point to evidence (their nails, the photograph) that supports explanations.\n- Students are beginning to see patterns: Water speeds up rust formation.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply concepts to a new context and deepen understanding through extension investigation.\n\n**Materials:**\n- Additional jars/cups (optional)\n- Steel wool pads or steel scrubbing sponges\n- Aluminum foil pieces\n- Copper pennies or wire\n- Water, salt, vinegar\n- Recording sheet (see below)\n- Magnifying glasses (optional but helpful)\n\n**Activity: \"Will ALL Metals Rust the Same Way?\"**\n\n1. **Pose the new problem:** \"We discovered that steel nails rust in water. But do you think OTHER metals rust the same way? Let's test different metals to find out!\"\n\n2. **Student investigation (guided):**\n   - Groups choose ONE different metal to test alongside a steel nail (options: aluminum foil, copper penny, steel wool).\n   - Place their chosen metal in a jar of salt water (the condition we found makes rust fastest).\n   - Predict: \"Will this metal rust like the nail did? Why or why not?\"\n   - Observe for 2-3 days and compare to the steel nail.\n\n3. **Real-world connection:** \"Look at the photograph again. You see different kinds of metal here—nails, screws, maybe wire. Do you think they ALL rusted at the same speed? Or did some change faster than others? Your investigation will help us figure this out!\"\n\n4. **Graphing extension (optional, if time permits):** Create a simple bar graph or picture graph showing \"Which metals got rusty?\" Yes/No columns.\n\n**Teacher Role:**\n\n- Pose guiding questions: \"How is your metal changing? Is it the same color as before?\"\n- Encourage comparisons: \"How is this metal's change different from the steel nail?\"\n- Redirect to observations: \"Let's measure how much rust formed. Is there more rust today than yesterday?\"\n\n**Expected Student Outcomes:**\n\n- Students discover that different metals react differently (e.g., aluminum may not rust the same way as steel).\n- Students develop more nuanced explanations: \"Steel rusts fast, but aluminum might not rust as much.\"\n- Students apply their investigation method to a new question independently.\n- Students produce comparative data (drawings, descriptions, or simple measurements).\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of cause-effect relationships, properties of materials, and evidence-based reasoning.\n\n**Formative Assessment (ongoing throughout lesson):**\n\n- **Observation checklist** during Explore: Does each student record predictions? Do they describe what they see accurately?\n- **Question responses** during Explain: Listen for correct use of vocabulary (rust, reaction, condition, evidence).\n- **Group discussions:** Do students reference the photograph and their jars when explaining ideas?\n\n**Summative Assessment: Exit Ticket or Reflection Sheet**\n\n**Provide this at the end of the final session (after 3-5 days of observation):**\n\n```\nNAME: ________________________     DATE: __________\n\nRUSTY NAILS EXIT TICKET\n\n1. Look at your jars. Which jar had the most rust?\n   ☐ Jar A (dry)    ☐ Jar B (water)    ☐ Jar C (soapy)    ☐ Jar D (salt water)\n\n2. Why do you think that jar had the most rust?\n   (Draw a picture or write 1-2 sentences. HINT: Think about water and air.)\n\n   _____________________________________________________________\n   _____________________________________________________________\n\n3. If you left nails outside (like in the photograph), what would happen to them?\n   _____________________________________________________________\n\n4. Can you use this word in a sentence: RUST\n   _____________________________________________________________\n\nCHALLENGE: If you wanted to STOP a nail from getting rusty, what would you do?\n_____________________________________________________________\n```\n\n**Success Criteria:**\n\n- ✅ **All students can:** Identify which condition(s) cause rust to form and explain using \"water\" and \"air.\"\n- ✅ **Most students can:** Use the term \"rust\" correctly and describe a cause-and-effect relationship (e.g., \"Water makes nails rust\").\n- ✅ **Some students can:** Predict future outcomes and explain reasoning using multiple pieces of evidence (the photograph, their observations, and vocabulary).\n\n**Expected Student Outcomes:**\n\n- Exit tickets show students understand the relationship: **water + air + metal = rust**.\n- Students can point to their investigation as proof/evidence.\n- Students recognize real-world applications (why the photograph shows rusty objects, how to prevent rust).\n- Students demonstrate scientific thinking by testing and observing rather than guessing.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified Recording Sheet:** Provide a template with word banks and yes/no options instead of open-ended writing. Example: \"The nail looks: ☐ Shiny ☐ Rusty ☐ Bumpy\"\n\n2. **Vocabulary Anchor Chart:** Create and keep visible a chart with pictures + words (rust, water, metal, change) so students can reference as they talk and write.\n\n3. **Buddy System:** Pair with a stronger reader/observer during Explore phase. Assign specific roles: one student draws, one predicts, both describe observations together.\n\n4. **Reduced Jars:** Have some students observe only 2 jars (dry air and water) instead of all 4, reducing cognitive load.\n\n### Challenge (for advanced learners):\n\n1. **Variables Investigation:** Ask, \"What else might change how fast rust forms?\" Students design their own test: Does **temperature** matter? Does **light** matter? Does **salt amount** matter? They set up additional jars and track results.\n\n2. **Rust Prevention Design:** \"How could you keep a nail from getting rusty?\" Students brainstorm and test: coating with oil, plastic wrap, painting, etc. They collect data on which method works best.\n\n3. **Real-World Connection:** Research and present: \"Why do cars rust? How do people stop cars from rusting?\" Write or draw a 3-4 sentence explanation connecting to their investigation.\n\n---\n\n## Extension Activities\n\n1. **Weathering Walk:** Take students on a short outdoor walk to find examples of weathering and rust in the school environment (rusty playground equipment, weathered wood, peeling paint, oxidized metal). Record observations with photos or sketches, then discuss: \"How long do you think it took for that to happen?\"\n\n2. **Rust Prevention Design Challenge:** Provide students with various materials (plastic wrap, foil, oil-soaked paper, paint, wax paper) and ask them to design a \"rust-proof container\" for a nail. Test in salt water over 3-5 days. Graph which methods worked best. Connect to real-world applications: \"This is how car manufacturers protect cars!\"\n\n3. **Time-Lapse Photo Project (take-home extension):** Send home a nail and a small jar of water with instructions for families to take photos daily for one week, creating a time-lapse sequence of rust formation. Students can assemble photos into a flip-book or present as a slideshow: \"Watch the Rust Grow!\"\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing:** This lesson spans multiple days (3-5) due to rust formation timeline. Plan accordingly. Consider setting up jars on Monday to observe Wed-Fri, or adjust to your schedule.\n- **Safety:** Ensure students wear safety goggles if using sharp nails. Handle nails carefully. Wash hands after handling materials.\n- **Photo Documentation:** Take photos of jars on Days 1, 3, and 5. Use these for absent students or as reference during discussions.\n- **Connection to Forces (3-PS2-1):** While rust formation is a chemical concept, the lesson addresses PS2-1 by having students **observe cause-and-effect patterns** (environmental conditions causing material changes) and predict future motion/changes based on patterns—core ideas of PS2.\n- **Real-world Relevance:** Rust is something Third Graders encounter in playgrounds, bikes, cars, and nature. This relevance makes the abstract concept of chemical reactions concrete and meaningful.",
  "inputTokens": 2376,
  "outputTokens": 4197,
  "cost": 0.023361,
  "generatedAt": "2026-02-13T00:37:00.471Z"
}