{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p6.jpg",
  "imagePath": "images/physical-science/p6.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Sunlight and Shadows\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Sunlight creates shadows:** Direct sunlight shining on three-dimensional objects (branches and circular objects) creates dark shadows on the wooden surface, demonstrating how light travels in straight lines.\n- **Objects have different properties:** The photograph shows objects with varying colors, sizes, shapes, and textures (shiny coins, rough branches, smooth wood), which interact differently with light.\n- **Sunlight warms surfaces:** The wooden surface and various objects are exposed to direct sunlight, demonstrating how solar energy affects Earth's surfaces.\n- **Light and shadow patterns change:** The position and length of shadows suggest different times of day or angles of sunlight, showing how the sun's position affects what we see.\n\n---\n\n## Lesson Title\n\n**Sunny Shadows: Exploring Light and Dark**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total)\n- **NGSS Standards:** \n  - K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface\n  - K-PS2-1: Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object (shadow tracking as observing light direction)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and describe how sunlight creates shadows on surfaces.\n2. Identify objects that make shadows when sunlight shines on them.\n3. Compare how shadows look when light comes from different directions.\n4. Explain that sunlight makes some places bright and some places dark.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed photograph (large format, at least 11\" × 14\") or displayed on a screen/smartboard\n- Pointer stick or laser pointer (for directing attention safely)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the smartboard or as a large printed poster where all students can see clearly from the carpet.\n\n2. **Introduce with wonder:** Say: \"Look at this picture! Someone took a photo outside on a sunny day. What do you notice? What's bright? What's dark?\"\n\n3. **Ask these specific discussion questions (one at a time, allowing think-pair-share time):**\n   - \"Do you see any dark shapes on the wooden floor? What might they be?\" (Guide toward shadows without naming them yet)\n   - \"Where is the sun in this picture? How do you know the sun is shining?\" (Encourage observations about brightness)\n   - \"What things made these dark shapes? Can you point to a branch? Can you point to a circle thing?\"\n   - \"Why do you think some parts of the wood are bright and some are dark?\"\n\n4. **Prediction prompt:** Say: \"Watch what happens when I move this stick slowly across the picture. Do you think the shadow will move too? Let's find out!\"\n\n5. **Record student wonderings** on chart paper: \"What we wonder about shadows...\" Expect responses like \"Why are they dark?\" \"Can I make a shadow?\" \"Do shadows go away?\"\n\n**Transition:** \"Today, we're going to be shadow detectives! We're going outside to find shadows just like the ones in this picture, and we're going to make our own!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- One sunny outdoor location (playground, field, or patio) or sunny classroom window\n- One object per student (toys, pencils, blocks, balls, dolls) — variety is important\n- Optional: chalk for outdoor marking\n- Large paper or clipboards for each student to sketch what they observe\n- Crayons (brown, black, yellow)\n\n**Activity:**\n\n**Part A: Shadow Hunt (10 minutes)**\n\n1. **Before going outside**, give each student an object and say: \"You are a shadow detective. Your job is to find the shadow your object makes in the sunlight. Remember, shadows are the dark shapes made by light!\"\n\n2. **Outside (or in sunny window area):** Have students hold their object in the sunlight and observe its shadow on the ground or on paper.\n\n3. **Student directions (model first):**\n   - \"Hold your object up where the sun is shining on it.\"\n   - \"Look down. Do you see a dark shadow?\"\n   - \"Move your object slowly. Does the shadow move too?\"\n   - \"Now put your object down. Can you stand on your shadow?\"\n\n4. **Documentation:** Students sketch or trace their shadow on paper and color it with dark crayons. Encourage them to draw what they see: \"Draw the bright part where the sun is shining. Draw the dark shadow part.\"\n\n**Part B: Shadow Play (10 minutes)**\n\n1. **Return to classroom or position students facing a sunny window.**\n\n2. **Introduce shadow exploration:** \"Now let's change where the light comes from and see what happens to our shadows!\"\n\n3. **Student directions:**\n   - \"Hold your object in front of the bright window (sunny spot).\"\n   - \"Look at your shadow. Where is it now?\"\n   - \"Move your object to the side. What happens?\"\n   - \"Move your object up high. What happens to the shadow?\"\n\n4. **Teacher prompts (don't answer, just wonder aloud):**\n   - \"I see your shadow changed! Why do you think that happened?\"\n   - \"Your shadow got bigger/smaller/moved. What did you do to make that happen?\"\n\n5. **Recording:** Students draw 2-3 different positions of their object and shadow on the same paper.\n\n**Teacher Role:** \n- Circulate and ask open-ended questions rather than correct observations\n- Use phrases like \"Tell me what you see...\" and \"What happens when you...?\"\n- Ensure all students safely position themselves relative to light sources\n- Encourage peer observation: \"Show a friend your shadow. Is theirs the same?\"\n\n**Expected Student Outcomes:**\n- Students discover that objects make shadows when light shines on them\n- Students observe that shadows change position and size when the object or light direction moves\n- Students create drawings showing at least two different shadow positions\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Student drawings from Explore phase\n- Chart paper with three labeled pictures: sun, object, shadow\n- One flashlight and a small object for demonstration\n- Visual vocabulary cards with pictures (sun, shadow, light, dark)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):** \n   - Invite 3-4 students to show their shadow drawings and describe what they found\n   - Ask: \"What did you discover? Did your shadow move? Why?\"\n   - Affirm observations: \"You're right! Shadows ARE dark!\"\n\n2. **Teacher explanation with demonstration (8 minutes):**\n   - Darken the classroom slightly or use a corner with less light\n   - Hold up the object and flashlight\n   - Say: \"Watch carefully. I have light (show flashlight) and an object (show object). When light shines on the object, what happens?\"\n   - Shine the light on the object and show the shadow on the wall\n   - Move the light source slowly and say: \"See? When the light moves, the shadow moves too!\"\n   - Repeat with the light at different angles: above, to the side, behind\n   - Say: \"The shadow is a dark shape. It shows us where the light CANNOT reach because the object is in the way.\"\n\n3. **Introduce vocabulary with picture cards:**\n\n**Vocabulary:**\n\n- **Shadow:** A dark shape made when light cannot reach a spot because something is in the way\n- **Sunlight:** Light energy that comes from the sun; it makes things bright and warm\n- **Light:** Energy that helps us see; it travels from a bright place to darker places\n- **Dark:** Places where light is not shining; the opposite of bright\n- **Object:** Any thing we can see and touch (a ball, a stick, a toy)\n\n4. **Connect back to the photograph:**\n   - Display the original photograph again\n   - Point to shadows: \"These dark shapes are shadows, just like the ones you made!\"\n   - Point to bright areas: \"The light from the sun made these bright spots.\"\n   - Point to branches: \"The branches are objects that blocked the light.\"\n\n5. **Check for understanding (2 minutes):**\n   - Hold up picture cards and ask: \"Is this a shadow?\" (Show bright area, dark area, sunny patch)\n   - Ask: \"What do we need to make a shadow?\" (Light and an object)\n   - Thumbs up/sideways/down: \"Do you feel like a shadow detective now?\"\n\n**Expected Student Outcomes:**\n- Students use the word \"shadow\" correctly to describe dark shapes\n- Students understand that shadows are made when light cannot reach a place\n- Students can identify sunlight as the light source in the photograph and outdoors\n- Students can explain the basic requirement for a shadow (light + object)\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Chart paper with the question: \"Where would you find shadows?\"\n- Picture cards or classroom objects (ball, book, stuffed animal, block, cup)\n- Optional: small masks, puppets, or cutout shapes\n- Pencils and paper for recording ideas\n\n**Activity:**\n\n**Option A: Shadow Hunt Around the Classroom**\n\n1. **Explain:** \"Now you're shadow detectives inside! Let's find all the shadows in our classroom.\"\n\n2. **Student activity:**\n   - Walk around the classroom in small groups\n   - Identify shadows cast by windows, furniture, decorations\n   - Stand in sunny spots and observe their own shadows again\n   - Point and say: \"I found a shadow from the _____ (object)!\"\n\n3. **Chart shadows found:** As a group, create a list or picture chart: \"Shadows we found: window shadow, table shadow, my shadow, toy shadow...\"\n\n4. **Discussion:** \"Why do some parts of our classroom have shadows and other parts don't?\" (Lead toward: sunlight is coming from windows in certain places)\n\n**Option B: Shadow Art & Storytelling**\n\n1. **Introduce shadow puppets:** \"We can make shadows tell stories!\"\n\n2. **Demonstrate:** Using a window or flashlight, create a simple shadow puppet (hand shadow of a bunny, duck, or mountain)\n\n3. **Student activity:**\n   - In pairs or small groups, students use their hands or objects to create shadow shapes on a white paper or wall\n   - Encourage them to make stories: \"This is a shadow dog running. Watch the shadow dog jump!\"\n   - Other students watch and guess what the shadow is\n\n4. **Recording:** Students sketch their favorite shadow puppet they made or saw\n\n**Teacher Role:**\n- Facilitate the shadow hunt by asking: \"Look at this dark area. What object made this shadow?\"\n- For shadow puppets, narrate student actions: \"Oh! The shadow bird is flying across the paper!\"\n- Encourage creativity and prediction: \"What shadow could you make next?\"\n\n**Expected Student Outcomes:**\n- Students identify multiple shadows in different locations\n- Students understand that shadows form wherever objects block sunlight\n- Students demonstrate that they can control shadow creation (through movement and positioning)\n- Students apply shadow concepts to creative play and storytelling\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (ongoing, during all phases):**\n- **Observation checklist** (use during Explore and Elaborate):\n  - ☐ Student identifies objects that make shadows\n  - ☐ Student observes that shadows change when object/light moves\n  - ☐ Student uses the word \"shadow\" appropriately\n  - ☐ Student can find shadows in different locations\n  - ☐ Student makes connections between sunlight and shadows\n\n**Exit Ticket / Summative Assessment (5 minutes, at end of lesson):**\n\nUse one or more of these strategies:\n\n1. **Show-Me Assessment:**\n   - Hold up an object in sunlight (indoors at window)\n   - Ask: \"Show me the shadow with your finger.\"\n   - Ask: \"Can you make the shadow move? How?\"\n\n2. **Simple Interview Questions (ask 1-2 per student):**\n   - \"What is a shadow? Can you tell me or show me?\"\n   - \"How did you make a shadow today?\"\n   - \"Where else have you seen shadows?\"\n\n3. **Picture Response:**\n   - Show the original photograph again\n   - Ask: \"Point to a shadow. Point to the sunlight. Point to something that made a shadow.\"\n\n4. **Thumbs Up/Sideways/Down Reflection:**\n   - \"I understand what a shadow is.\" (thumbs up/sideways/down)\n   - \"I can find shadows.\" (thumbs up/sideways/down)\n   - \"I know that sunlight makes shadows.\" (thumbs up/sideways/down)\n\n**Success Criteria for Understanding:**\n- ✓ Student correctly identifies at least two shadows in images or environment\n- ✓ Student can state: \"A shadow is made when light cannot reach a spot\" or similar\n- ✓ Student demonstrates that moving an object or light changes the shadow\n- ✓ Student understands that sunlight is needed for shadows to form\n- ✓ Student identifies the relationship: sunlight + object = shadow\n\n**Expected Student Outcomes:**\n- Kindergarteners may not explain shadows with complex reasoning, but should demonstrate:\n  - Recognition of shadows as dark shapes\n  - Understanding that objects make shadows\n  - Ability to find and track shadows\n  - Connection between sunlight and shadow formation\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary reinforcement:** Provide picture cards of \"sun,\" \"shadow,\" and \"light\" throughout the lesson. Use repetitive, consistent language. Practice just one vocabulary word deeply rather than five.\n\n2. **Guided exploration with hand-over-hand support:** Pair with a peer or teacher assistant. Physically guide the student to hold an object in sunlight and trace the shadow together. Reduce the number of variables (e.g., always use the same object and light source first).\n\n3. **Concrete, tactile experiences:** Let students touch shadows on walls and paper. Use a bright, high-contrast shadow (dark object, very bright light) so the shadow is unmistakable. Reduce distractions in the exploration space.\n\n### Challenge (for advanced learners):\n\n1. **Comparative exploration:** Ask: \"Do different objects make different-shaped shadows? Why?\" Have students collect multiple objects and predict which will make the biggest/smallest shadow. Record predictions and test them systematically.\n\n2. **Time-based observation:** If weather permits, have students trace the same object's shadow at the beginning of a lesson and the end, then compare the positions. Ask: \"Why did the shadow move? What moved—the sun or the object?\"\n\n3. **Shadow engineering:** Challenge students to arrange objects to create a specific shadow pattern or message. \"Can you make a shadow picture? Can you arrange these blocks to make the letter 'A' with a shadow?\"\n\n---\n\n## Extension Activities\n\n1. **Shadow Comparisons at Different Times:** Photograph the same outdoor spot (with shadows) at different times of day (morning, midday, afternoon if possible). Display photos and ask: \"Are the shadows the same? Why are they different? What moved?\" This extends understanding of sunlight direction and Earth's movement.\n\n2. **Shadow Hunt Scavenger Hunt:** Create a classroom scavenger hunt where students find and photograph (or point to) 5-10 shadows during one week. Create a classroom poster: \"Our Shadow Collection\" with drawings or photos. This reinforces concept application and provides repeated exposure.\n\n3. **Storybook Connection:** Read a shadow-themed picture book such as *My Shadow* by Robert Louis Stevenson (adapted for K) or *Bear Shadow* by Frank Asch. Students compare the shadows in the book to shadows they've observed and create their own shadow story with drawings.\n\n4. **Shadow Puppet Theater:** Create a simple puppet theater using a white sheet or white paper, a light source, and cutout shapes. Invite family members to a mini-performance where kindergarteners tell shadow stories. This applies learning to a real-world performance context.\n\n---\n\n## Notes for Teacher Implementation\n\n- **Safety:** Ensure students never look directly at sunlight. Use indirect observation or shadowed areas. When using flashlights, keep them pointed down or at objects, not at eyes.\n- **Weather dependency:** The Explore phase works best on sunny days. Have an indoor alternative ready (use bright windows or flashlights if outdoor conditions aren't ideal).\n- **Classroom management:** Keep groups small during the shadow hunt and puppet activities (4-5 students per teacher/aide) to maximize engagement and safety.\n- **Pacing:** Kindergarteners may need more time to process observations. Allow silent observation time before asking questions. Some students may prefer to watch others first before participating.\n- **Documentation:** Take photos of student shadows and drawings for formative assessment records and to share with families.\n\n---\n\nThis lesson grounds abstract concepts of light and shadow in concrete, observable, joyful experiences that align with Kindergarten's sensory and exploratory learning style.",
  "inputTokens": 2383,
  "outputTokens": 4060,
  "cost": 0.022683000000000002,
  "generatedAt": "2026-02-13T00:34:55.427Z"
}