{
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p6.jpg",
  "imagePath": "images/physical-science/p6.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Shadows in Sunshine\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Light and shadows:** Objects block light and create shadows when illuminated by the sun; shadows change in size and darkness depending on light position\n- **Properties of materials:** Different materials (wood, metal, circular objects) interact with light differently; some materials are opaque (block light) while others may be translucent\n- **Observation and evidence:** Visual patterns can be observed and used to make conclusions about how light behaves\n- **Light travels in straight lines:** The way shadows form shows that light moves in straight paths from the sun\n\n---\n\n## Lesson Title\n\n**Sunny Shadows: How Light Makes Dark Shapes**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 40-minute sessions (or spread across three 30-minute sessions)\n- **NGSS Standards:** \n  - 1-PS4-2: Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated\n  - 1-PS4-3: Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Observe and describe what happens to objects when light shines on them and blocks the light\n2. Identify that different objects make different shadow shapes and sizes\n3. Explain that objects in sunlight can make dark shapes called shadows on the ground\n4. Predict how a shadow will change when an object moves in the sunlight\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about shadows using the photograph of objects and their shadows on wood.\n\n**Materials:**\n- Projected or printed photograph (enlarged if possible)\n- Chart paper and markers\n- Sunny window or outdoor access\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or printed poster. Allow students to look silently for 10 seconds.\n\n2. **Facilitate observation discussion** with these questions:\n   - \"What do you see on the wood? Can you point to something brown and something that looks lighter?\"\n   - \"Do you see any dark shapes? What do you think made those dark shapes?\"\n   - \"Why are some shapes big and some shapes small?\"\n   - \"Where do you think the sun is in this picture? How do you know?\"\n\n3. **Generate predictions:** Ask, \"If I put a toy outside in the sunshine right now, what do you think would happen? Would anything dark appear near it?\" Record student ideas on chart paper with pictures/words.\n\n4. **Personal connection:** Ask, \"Has anyone ever seen their own shadow? When did you see it?\"\n\n**Transition:** \"Great observers! Today we're going to go outside (or to the sunny window) and make our own shadows, just like the objects in this picture!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how objects create shadows by placing objects in sunlight and observing the results.\n\n**Materials:**\n- Small classroom objects (plastic toys, wooden blocks, balls, pencils, leaves, sticks)\n- White paper or light-colored butcher paper\n- Sunny outdoor space or bright windowsill\n- Clipboards and paper for recording observations\n- Crayons or colored pencils\n\n**Activity:**\n\n**Step-by-step student directions:**\n\n1. \"Find a partner. Each pair gets one small object and some white paper.\"\n\n2. \"Go to our sunny spot. Place your paper flat on the ground (or on the windowsill).\"\n\n3. \"Hold or place your object so the sun's light shines on it. Look at the ground (or paper). What do you see next to your object?\"\n\n4. \"Now move your object to a different spot in the sun. What happens to the dark shape? Does it change?\"\n\n5. \"Try three different objects. For each one, trace or draw the shadow shape you see on your paper. Write or draw: What was the object? What did the shadow look like?\"\n\n6. \"Come back inside. Draw a picture of what you found.\"\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"Is the shadow bigger or smaller than your object?\" \"What happens when you move it?\" \"Does the shadow stay the same shape?\"\n- Do NOT say \"That's a shadow\" directly — let students describe what they see\n- Encourage careful observation without directing conclusions\n\n**Expected Student Outcomes:**\n- Students will observe that objects in sunlight create dark shapes\n- Students will notice that shadow shapes change when objects move\n- Students will attempt to draw/record what they observed\n- Students will use descriptive language: \"dark,\" \"big,\" \"small,\" \"long,\" \"pointy,\" etc.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and help students understand the science of how shadows form.\n\n**Materials:**\n- Chart paper with vocabulary words and simple illustrations\n- Student drawings from Explore phase\n- Original photograph\n- Flashlight and small object for demonstration\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 4-5 student pairs to show their drawings and describe what they observed\n   - Ask: \"What was the same about all the shadows?\" Guide toward: they're all dark, they're all near the object\n   - Ask: \"What was different?\" Guide toward: different shapes, different sizes\n\n2. **Introduce and define vocabulary (7 minutes):**\n   - Use a simple demonstration: Shine a flashlight on a toy while students watch the dark shape appear\n   - Introduce terms with visual examples and student-friendly definitions:\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition | Visual |\n|------|----------------------------|--------|\n| **Shadow** | A dark shape that appears when light cannot pass through an object | Point to shadow in photo |\n| **Light** | Energy that comes from the sun or a light bulb and helps us see things | Flashlight beam |\n| **Opaque** | A material that light cannot pass through; it blocks light | Show wooden block |\n| **Sunlight** | Light that comes from the sun | Point to sunny window |\n| **Block** | To stand in the way and stop light from passing through | Object in front of light |\n\n3. **Connect back to the photograph (3-5 minutes):**\n   - Show the original photo again\n   - Say: \"These objects are **blocking** the **sunlight**. When sunlight is blocked, it makes a dark **shadow** on the wood. The wood is **opaque** — the light cannot go through it.\"\n   - Point to different shadows: \"This branch makes a thin shadow. This round object makes a round shadow. The sun is making all these shadows.\"\n\n4. **Check for understanding:**\n   - Ask: \"If I put my hand in the sun, will a shadow appear? Why?\" (Yes, because my hand blocks the light)\n   - Ask: \"Can I see a shadow at night outside with no light?\" (No, because there's no light to block)\n\n**Expected Student Outcomes:**\n- Students will use the word \"shadow\" correctly\n- Students will understand that objects block light to make shadows\n- Students will recognize that you need light to make a shadow\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of shadows and light to a new context and explore variables.\n\n**Materials:**\n- Flashlight (or light source)\n- Various small objects (rubber ball, pencil, leaf, toy figure)\n- White wall or butcher paper\n- Ruler or measuring stick\n\n**Activity:**\n\n**Challenge: Making Different Shadow Sizes**\n\n1. \"Now we know objects make shadows. But can we make the same object's shadow bigger or smaller?\"\n\n2. Demonstrate with a flashlight:\n   - Hold a small toy close to the light source, showing the large shadow on the wall\n   - Move the toy farther away, showing the shadow gets smaller\n   - Ask: \"What changed? The object is still the same, but the shadow is different!\"\n\n3. **Student investigation:**\n   - Give pairs a flashlight, a white wall/paper, and one object\n   - Directions: \"Make your object's shadow. Now move the object closer to the light. Did the shadow change? Draw what you see.\"\n   - \"Now move your object far from the light. Did the shadow change again? Draw this too.\"\n\n4. **Record observations:**\n   - Students draw two pictures: \"Shadow when close to light\" and \"Shadow when far from light\"\n   - Write or draw words: bigger, smaller, same\n\n5. **Share findings:**\n   - Invite 3-4 students to show their drawings and explain what happened\n   - Highlight: \"The object didn't change, but the **light** made the shadow different!\"\n\n**Teacher Role:**\n- Ask: \"Why do you think the shadow got bigger when the object moved closer?\" \n- Affirm observations without overexplaining\n- Guide toward understanding that light position changes shadow size\n\n**Expected Student Outcomes:**\n- Students will observe that moving an object relative to light changes the shadow\n- Students will begin to recognize variables (distance, light source, object)\n- Students will use descriptive vocabulary: bigger, smaller, longer, shorter\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of light, shadows, and how objects block light.\n\n**Formative Assessment (ongoing throughout lesson):**\n- **Observation checklist** during Explore and Elaborate phases:\n  - ✓ Student accurately describes what a shadow is\n  - ✓ Student predicts shadow changes\n  - ✓ Student uses vocabulary: light, shadow, block\n  - ✓ Student makes observations about how shadows change\n\n**Exit Ticket/Summative Assessment (5-10 minutes):**\n\nAdminister one of the following based on class needs:\n\n**Option A (Picture and words):**\nShow a simple drawing of the sun, an object, and the ground. Ask:\n- \"Draw where the shadow would be\"\n- \"Why will a shadow appear there? Use words: light, block, shadow\"\n\n**Option B (Quick response questions):**\nAsk students individually or in small groups:\n1. \"What is a shadow?\" (Accept: dark shape, something light can't go through, when something blocks light)\n2. \"I'm going to hold this toy in the sunlight. What will happen?\" (Shadow will appear)\n3. \"If I move the toy closer to the light, what happens to the shadow?\" (Gets bigger/larger)\n\n**Option C (Draw and label):**\n- Give students a blank paper\n- Say: \"Draw the sun in the sky. Draw an object. Draw the shadow it makes. Label: sun, object, shadow\"\n\n**Success Criteria:**\n- Student can identify a shadow as a dark shape\n- Student understands that light is needed to make a shadow\n- Student recognizes that objects block light to create shadows\n- Student can predict what happens to shadows when objects move (emerging: may be inconsistent)\n\n**Expected Student Outcomes:**\n- Most students will identify and describe shadows correctly\n- Most students will explain that shadows appear when light is blocked\n- Some students will begin to understand shadow changes with movement\n- A few students may still conflate \"dark\" with \"shadow\" (clarify in follow-up)\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Reduce language load:** Pair students with stronger communicators. Use mostly pointing and \"show me\" instead of verbal explanations. Simplify questions to yes/no: \"Do you see a dark shape?\" \"Is the shadow bigger now?\"\n\n2. **Scaffold observation:** Provide a simple picture card showing what they're looking for (a dark shape next to an object). Guide students to match what they see to the card.\n\n3. **Simplify vocabulary focus:** Concentrate on just \"shadow\" and \"light.\" Save \"opaque\" and \"block\" for later reinforcement. Use repeated exposure with pointing: \"This is light. This is a shadow.\"\n\n### Challenge (for advanced learners):\n\n1. **Explore multiple variables:** Ask: \"What else changes the shadow besides moving the object? What if you use different light sources (flashlight, desk lamp, sunlight)? Do the shadows look different?\"\n\n2. **Shadow length investigation:** Provide a ruler. Have students measure shadows at different times or different distances, recording data with tally marks or drawings. Ask: \"Is the long object's shadow always longer than the short object's shadow?\"\n\n3. **Creative shadow art:** Challenge students to arrange multiple objects to create interesting shadow patterns. Ask: \"Can you make a shadow picture? Can you make overlapping shadows? What do they look like?\"\n\n---\n\n## Extension Activities\n\n1. **Shadow puppet theater:** Create a simple shadow theater using a flashlight and a white sheet or paper screen. Have students create shapes with their hands and predict what shadows will appear. Extend by asking: \"Can you make a shadow look like an animal? What materials work best?\" (Connects to opaque/translucent exploration)\n\n2. **Shadow time-lapse observation:** If outdoors space permits, trace or photograph shadows of the same object at different times (morning, midday, afternoon). Create a display showing how shadows change throughout the day. Ask: \"Why did the shadow get longer? Why did it move?\" (Introduction to sun's apparent movement)\n\n3. **Exploring translucent materials:** Provide a variety of materials (plastic bag, waxed paper, fabric, glass, cardboard). Have students predict which will make a shadow and which will let some light through. Test with a light source. Introduce: \"Some things block ALL the light (opaque). Some things let SOME light through (translucent).\" Record findings with drawings.\n\n---\n\n## Notes for Teacher\n\n- **Timing flexibility:** This lesson works well spread across 2-3 days to allow for rest between outdoor/light activities\n- **Weather consideration:** If outdoor sunlight is unavailable, use a bright window or multiple flashlights indoors\n- **Safety reminder:** Never look directly at the sun; always supervise light source handling\n- **Language development:** Many first graders will struggle with \"because\" explanations—accept simple observations as evidence of understanding\n- **Connection to prior knowledge:** Many students will have seen their own shadows—leverage this daily experience throughout the lesson",
  "inputTokens": 2380,
  "outputTokens": 3296,
  "cost": 0.018860000000000002,
  "generatedAt": "2026-02-13T00:35:30.506Z"
}