{
  "id": 72,
  "title": "Matter",
  "category": "physical-science",
  "imageFile": "p6.jpg",
  "content": "## 📸 Photo Description\n\nThis photo shows a weathered wooden surface covered with a dense collection of nails and other metal objects. The nails are of various types, including common nails, brads, and screw heads. Many of the nails appear to be rusted, showing reddish-brown and grayish textures. The metal objects are embedded in the wood, some with their heads exposed, others partially embedded. The wood itself shows visible grain and signs of weathering, such as cracks and splinters. The overall scene suggests a long-term interaction between the metal and the organic wood material.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the scientific phenomenon of **chemical change due to corrosion**. The metal nails are undergoing a chemical reaction with oxygen and water in the environment. This reaction, known as oxidation, results in the formation of iron oxide (rust). The visible changes in color and texture of the metal are evidence of this chemical transformation. The wood provides a surface that can trap moisture, creating the ideal conditions for this reaction to occur over time.\n\n## 📚 Core Concepts\n\n1\\.  **Chemical Change**: A process where one or more substances are transformed into different substances. In this case, iron metal reacts with oxygen and water to form rust (iron oxide), which is a different substance with different properties.  \n2\\.  **Corrosion**: A specific type of chemical change where a metal is deteriorated by a chemical reaction with its environment. This is often an oxidation reaction.  \n3\\.  **Properties of Materials**: The physical and chemical properties of a substance (like the color and texture of the nails) can change over time due to interactions with other materials or environmental factors.  \n4\\.  **Environmental Influences**: The conditions of the environment (like the presence of water and oxygen) can affect how quickly materials change. The wood's ability to absorb water contributes to the corrosion process.\n\n<pedagogical-tip>  \nIncorporate a hands-on investigation with \"rusting\" nails. Provide students with a jar of water, a nail, and a paper towel. Have them observe the nail in water over several days. Discuss changes in color and texture. To extend, have them place a second nail in a dry jar and a third in a jar with a desiccant. Compare results after a week. This makes the abstract concept of chemical change tangible and observable.  \n</pedagogical-tip>\n\n<udl-suggestions>  \n\\- **Multiple Means of Representation**: Show a time-lapse video of a nail rusting or use a simulation to visualize the molecular changes.  \n\\- **Multiple Means of Engagement**: Connect to students' experiences by asking them to bring in objects from home that might rust or have changed over time.  \n\\- **Multiple Means of Expression**: Have students create a \"Rust Report\" describing the changes they observed, including a drawing of the final state.  \n</udl-suggestions>\n\n## 🎓 Zoom In / Zoom Out Concepts\n\n1\\.  **Zoom In**: At the microscopic level, the iron atoms in the nail are reacting with oxygen atoms from the air and water molecules. This breaks the metallic bonds and forms new chemical bonds, creating iron oxide (Fe₂O₃). The process involves electrons being transferred from the iron atoms to the oxygen atoms.  \n2\\.  **Zoom Out**: This scene is an example of how materials interact with their environment over time. It connects to broader concepts like weathering, the natural cycle of materials, and how human-made objects (like buildings or bridges) are affected by environmental conditions. It also relates to the conservation of matter, as the iron atoms are not destroyed but are rearranged into a different compound.\n\n## 🤔 Potential Student Misconceptions\n\n1\\.  **Misconception:** Students might think the rust is just dirt or a coating that can be easily washed off.    \n    **Clarification:** Rust is a new substance formed through a chemical reaction. It is not dirt and cannot be easily washed away; it is part of the nail itself.  \n2\\.  **Misconception:** Students might believe that only iron rusts.    \n    **Clarification:** While iron is a common example, other metals like aluminum and copper also undergo corrosion, though the products are different (e.g., aluminum oxide, patina on copper).  \n3\\.  **Misconception:** Students might think the rust is only caused by water.    \n    **Clarification:** Rust requires both water and oxygen. This is why a nail in a dry environment does not rust.\n\n## 🌐 NGSS Connections\n\n\\- [[NGSS:DCI:5-PS1-1]]: Develop a model to describe that matter is made of atoms and molecules.  \n\\- [[NGSS:DCI:5-PS1-2]]: Measure and graph quantities to provide evidence that regardless of the changes that occur when materials are mixed, heated, cooled, or broken, the total mass is conserved.  \n\\- [[NGSS:DCI:5-PS1-3]]: Make observations and measurements to identify materials based on their properties.  \n\\- [[NGSS:CCC:Energy]]: Matter has properties such as mass, weight, and volume. Matter can be changed by heating or cooling.  \n\\- [[NGSS:CCC:Patterns]]: Observe and predict changes in matter based on patterns of interaction.\n\n## 💬 Discussion Questions\n\n1\\.  What might have caused the metal objects to change color and look so different from when they were new? (Bloom's: Analyze) (DOK: 2)  \n2\\.  Why do you think the wood is covered with so many different types of metal objects? (Bloom's: Evaluate) (DOK: 3)  \n3\\.  How is the change happening to the nails different from a physical change, like breaking a stick? (Bloom's: Analyze) (DOK: 3)  \n4\\.  Can you think of another example of a material changing because of something in its environment? (Bloom's: Apply) (DOK: 2)\n\n## 📖 Vocabulary\n\n* **Corrosion:** A chemical process where a material (like metal) breaks down due to a reaction with its environment.  \n* **Chemical Change:** A process that transforms one substance into a different substance with different properties.  \n* **Oxidation:** A chemical reaction where a substance loses electrons, often involving oxygen.  \n* **Rust:** The common name for iron oxide, a reddish-brown compound formed when iron reacts with oxygen and water.  \n* **Material:** A substance that something is made from, like wood, metal, or plastic.\n\n## 🌍 Extension Activities\n\n\\- **Rust Investigation:** Set up experiments to see how different conditions (dry air, water, saltwater) affect the rate of rusting. Record observations daily.  \n\\- **Material Properties:** Collect various metal objects (e.g., a copper penny, a stainless steel spoon, a zinc-coated nail) and test their properties (magnetism, color, texture).  \n\\- **Historical Connection:** Research the history of nails and their impact on construction and society. Discuss how materials were used differently in the past.",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThe photo shows a wooden surface with many metal nails and objects embedded in it. The nails have a reddish-brown color and appear to be rusted, indicating that they have undergone changes over time. The wood itself looks weathered and aged, with cracks and grooves visible on the surface.\n\n## 🔬 Scientific Phenomena\n\nThe photo demonstrates the process of **corrosion**, where the metal nails are reacting with the environment to form a new substance called **rust**. This chemical change is caused by the metal (iron) in the nails reacting with oxygen and water in the air, creating a reddish-brown compound called iron oxide. The wood provides a surface that traps moisture, creating the ideal conditions for this corrosion process to occur over time.\n\n## 📚 Core Science Concepts\n\n1. **Matter and Its Properties**: The nails and other metal objects in the photo are made of matter, which has different physical and chemical properties. The changes in color and texture of the nails are evidence of a chemical change in the material.\n2. **Chemical Reactions**: The formation of rust is a chemical reaction where the iron in the nails reacts with oxygen and water to create a new substance, iron oxide. This is an example of a chemical change, where the original materials are transformed into different substances.\n3. **Environmental Influences**: The conditions of the environment, such as the presence of moisture and oxygen, can affect how materials change over time. The wood's ability to trap and hold moisture contributes to the corrosion process.\n\n<pedagogical-tip>\nTo help kindergarten students understand the concepts, encourage them to explore and observe different materials in their everyday lives. Bring in various metal objects (e.g., coins, paper clips, nails) and encourage students to observe and describe any changes they notice over time. This hands-on exploration will make the abstract concepts of matter and chemical changes more tangible and relatable.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multiple Means of Representation**: Use visual aids, such as diagrams or models, to illustrate the chemical reaction happening at the molecular level.\n- **Multiple Means of Engagement**: Relate the concept of corrosion to students' personal experiences, such as seeing rust on playground equipment or in their homes.\n- **Multiple Means of Expression**: Allow students to demonstrate their understanding through drawing, creating a physical model, or sharing their observations in small-group discussions.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-PS2-1]] Describe the properties of different materials and how they are used.\n- [[NGSS:DCI:K-PS2-2]] Analyze data to determine if a design solution works as intended to change the speed or direction of an object.\n- [[NGSS:CCC:Patterns]] Observe and describe patterns in the natural and designed world.\n\n## 💬 Discussion Questions\n\n1. What do you notice happening to the metal objects in the photo? (Bloom's: Remembering, DOK: 1)\n2. Why do you think the metal objects have changed color and texture over time? (Bloom's: Understanding, DOK: 2)\n3. Can you think of other examples of materials that might change because of their environment? (Bloom's: Applying, DOK: 2)\n4. How is the change happening to the nails different from breaking a stick? (Bloom's: Analyzing, DOK: 3)\n\n## 📖 Vocabulary\n\n- **Matter**: Anything that has mass and takes up space.\n- **Metal**: A hard, shiny material that conducts heat and electricity.\n- **Corrosion**: The gradual wearing away or breakdown of a material, often due to a chemical reaction with the environment.\n- **Rust**: A reddish-brown compound that forms on the surface of iron or steel when it is exposed to air and moisture.\n- **Chemical Change**: A process that transforms one substance into a different substance with new properties.\n\n## 🌡️ Extension Activities\n\n1. **Rust Experiment**: Set up a simple experiment where students can observe the formation of rust on a nail placed in water, vinegar, or saltwater.\n2. **Material Exploration**: Provide students with different metal objects (e.g., aluminum foil, copper pennies, stainless steel utensils) and have them explore the properties of each material.\n3. **Observe and Draw**: Ask students to observe a metal object in their environment (e.g., a playground swing, a door hinge) and draw a picture of how it changes over time.",
    "grade1": "## 📸 Photo Description\n\nThe photo shows a collection of rusty nails and screws embedded in a weathered wooden surface. The metal objects have a reddish-brown and grayish appearance, indicating they have undergone corrosion over time. The wooden surface has visible cracks, knots, and signs of aging, suggesting it has been exposed to the elements for a long period.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the process of **chemical change due to corrosion**. The metal nails and screws are reacting with oxygen and moisture in the environment, undergoing a chemical reaction that transforms the iron in the metal into a new substance called iron oxide, or rust. This process of oxidation causes the metal to lose its shiny, silvery appearance and instead develop the reddish-brown and grayish colors seen in the image.\n\n## 📚 Core Science Concepts\n\n1. **Materials and Their Properties**: The nails and screws in the image are made of metal, which has specific properties like shiny appearance, hardness, and ability to conduct electricity. Through the process of corrosion, the metal's properties change, and it takes on new characteristics like the reddish-brown color and rough texture of the rust.\n\n2. **Chemical Changes**: Corrosion is a type of chemical change, where the chemical composition of the metal is altered, resulting in the formation of a new substance (iron oxide). This is different from a physical change, where the material's appearance may change but its chemical composition remains the same.\n\n3. **Environmental Interactions**: The wooden surface and the presence of moisture in the environment play a key role in the corrosion process. The wood provides a surface that can trap and hold moisture, creating the ideal conditions for the chemical reaction between the metal and oxygen to occur.\n\n<pedagogical-tip>\nEngage students in hands-on experiments to observe the process of corrosion. Provide them with various metal objects (nails, washers, paperclips) and different environments (water, vinegar, salt water) to compare how the materials change over time. Encourage them to make observations, record data, and draw conclusions about the factors that affect the rate of corrosion.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multiple Means of Representation**: Use visual aids, such as diagrams or animations, to help students understand the chemical changes occurring at the molecular level during the corrosion process.\n- **Multiple Means of Engagement**: Connect the concept of corrosion to students' everyday experiences, such as seeing rust on playground equipment or on their bicycles.\n- **Multiple Means of Expression**: Allow students to demonstrate their understanding of corrosion through various means, such as creating a poster, writing a short story, or building a model.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1-1]] Describe the characteristic properties of solids, liquids, and gases.\n- [[NGSS:DCI:2-PS1-2]] Analyze and classify different materials by their observable properties.\n- [[NGSS:DCI:2-PS1-3]] Make observations to determine the effect of heating or cooling on the shape and properties of materials.\n- [[NGSS:CCC:Patterns]] Observe and describe patterns in the natural and designed world.\n- [[NGSS:CCC:Cause and Effect]] Understand that events have causes that generate observable patterns.\n\n## 💬 Discussion Questions\n\n1. Why do you think the nails and screws have changed color and texture over time? (Bloom's: Analyze, DOK: 2)\n2. How is the change happening to the metal objects different from a physical change, like bending a paperclip? (Bloom's: Analyze, DOK: 3)\n3. What other materials or objects have you seen that have changed due to their environment? (Bloom's: Apply, DOK: 2)\n4. How could we experiment to see what factors might speed up or slow down the corrosion process? (Bloom's: Evaluate, DOK: 3)\n\n## 📖 Vocabulary\n\n- **Corrosion**: A chemical process where a material, such as metal, breaks down due to a reaction with its environment.\n- **Oxidation**: A chemical reaction where a substance loses electrons, often involving oxygen.\n- **Rust**: The reddish-brown compound formed when iron reacts with oxygen and water.\n- **Chemical Change**: A process that transforms one substance into a different substance with different properties.\n- **Property**: A characteristic of a material, such as color, texture, or ability to conduct electricity.\n- **Environment**: The conditions and influences that surround and affect the development of an object or organism.\n\n## 🌡️ Extension Activities\n\n1. **Rust Investigation**: Set up an experiment where students can observe the effects of different environmental conditions (air, water, saltwater) on the rate of rusting for various metal objects.\n2. **Material Exploration**: Have students collect and examine different metal objects, testing their properties (e.g., magnetism, conductivity) and comparing the effects of corrosion on each type of metal.\n3. **Corrosion Prevention**: Discuss ways to prevent or slow down the corrosion process, such as painting, galvanizing, or using rust-resistant alloys, and have students design a solution to protect a metal object from corrosion.",
    "grade2": "## 📸 Photo Description\n\nThe photo shows a wooden surface with numerous metal nails and other small metal objects embedded in it. The nails appear to be in various stages of corrosion, with some appearing rusty and discolored, while others still have a shiny, metallic appearance. The wood itself looks weathered and worn, suggesting the scene has been exposed to the elements for an extended period.\n\n## 🔬 Scientific Phenomena\n\nThe main scientific phenomenon demonstrated in this photo is the process of **corrosion**, which is a type of chemical change that occurs when metal reacts with its environment. The metal nails and objects are undergoing an oxidation reaction, where the iron in the metal is reacting with oxygen and water in the air to form a reddish-brown compound called iron oxide, or rust. This chemical change alters the appearance and properties of the metal over time.\n\n## 📚 Core Science Concepts\n\n1. **Chemical Change**: A chemical change is a process where the chemical composition of a substance is transformed into one or more new substances with different properties. In this case, the iron in the metal is being converted into a new compound, iron oxide, through a chemical reaction.\n\n2. **Corrosion**: Corrosion is a specific type of chemical change where a metal deteriorates due to a reaction with its environment, often involving oxygen and water. This results in the formation of new compounds, like rust, which have different properties than the original metal.\n\n3. **Properties of Materials**: The physical and chemical properties of materials, such as color, texture, and chemical composition, can change over time due to interactions with the environment. The rusting of the metal nails is an example of how a material's properties can be altered through a chemical process.\n\n<pedagogical-tip>\nTo help students understand the concept of chemical change, engage them in a hands-on activity where they can observe the process of rusting. For example, have students place iron nails in different solutions (water, vinegar, salt water) and monitor the changes over time. This will allow them to directly see and experience the chemical transformation that is occurring.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multiple Means of Representation**: Use visual aids, such as diagrams or animations, to help students visualize the atomic-level changes happening during the corrosion process.\n- **Multiple Means of Expression**: Allow students to demonstrate their understanding of chemical change and corrosion through a variety of formats, such as writing, drawing, or creating a physical model.\n- **Multiple Means of Engagement**: Encourage students to explore and investigate corrosion in their everyday lives, such as by observing changes in metal objects around their home or school.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-PS1-1]] - Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n- [[NGSS:DCI:2-PS1-2]] - Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.\n- [[NGSS:CCC:Patterns]] - Observed patterns of forms and events guide organization and classification, and they prompt questions about relationships and causes underlying them.\n\n## 💬 Discussion Questions\n\n1. Why do you think the metal objects in the photo have changed in appearance over time? (Bloom's: Analyze, DOK: 2)\n2. What do you think might be causing the metal to change color and texture? (Bloom's: Analyze, DOK: 2)\n3. Can you think of other examples of materials that might change due to their environment? (Bloom's: Apply, DOK: 2)\n4. How is the change happening to the metal different from simply breaking or cutting a metal object? (Bloom's: Analyze, DOK: 3)\n\n## 📖 Vocabulary\n\n- **Corrosion**: A chemical process where a material, such as metal, breaks down due to a reaction with its environment.\n- **Chemical Change**: A process that transforms one substance into a different substance with different properties.\n- **Oxidation**: A chemical reaction where a substance loses electrons, often involving oxygen.\n- **Rust**: The reddish-brown compound formed when iron reacts with oxygen and water, commonly known as iron oxide.\n- **Material**: A substance that something is made from, like wood, metal, or plastic.\n- **Environment**: The conditions or surroundings in which a person, animal, or plant lives or operates.\n\n## 🌡️ Extension Activities\n\n1. **Rusting Experiment**: Set up an experiment where students can observe the process of rusting over time. Provide them with various metal objects (nails, paper clips, etc.) and place them in different environments (water, salt water, vinegar, etc.) to compare the rate and extent of corrosion.\n\n2. **Material Properties Investigation**: Have students explore the properties of different materials, such as metals, wood, and plastics, and how they might change due to environmental factors. Encourage them to make observations and draw conclusions about the relationship between material properties and the environment.\n\n3. **Historical Perspective**: Discuss how the development and use of different materials, like iron and steel, have shaped human history and influenced the construction of buildings, tools, and other everyday objects. Explore how the understanding of corrosion has led to the development of new materials and techniques to prevent or slow down this process.",
    "grade3": "## 📸 Photo Description\n\nThis photo shows a collection of metal nails and screws embedded in a weathered wooden surface. The nails and screws have various colors, including reddish-brown, gray, and silvery tones, indicating that they have been exposed to the elements for a long time. The wood itself appears rough and cracked, suggesting it has also been affected by the environment.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the scientific phenomenon of **chemical change due to corrosion**. The metal nails and screws are undergoing a chemical reaction with oxygen and water in the environment, causing them to rust. This process, known as oxidation, results in the formation of iron oxide, which gives the metal a reddish-brown appearance. The weathered wooden surface provides a moist environment that contributes to the corrosion process.\n\n## 📚 Core Science Concepts\n\n1. **Chemical Change**: When one or more substances are transformed into different substances with different properties, it is called a chemical change. The rusting of the metal is an example of a chemical change.\n2. **Corrosion**: Corrosion is a specific type of chemical change where a metal deteriorates due to a reaction with its environment, often resulting in the formation of a new compound like rust.\n3. **Properties of Materials**: The physical and chemical properties of a material, such as color and texture, can change over time due to interactions with other substances or environmental factors.\n\n<pedagogical-tip>\nEngage students in a hands-on investigation of the rusting process. Provide them with several nails, containers, and water, and have them observe the changes in the nails over time. This will help them better understand the concept of chemical change and how the environment can affect the properties of materials.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multiple Means of Representation**: Use a time-lapse video or a simulation to visually demonstrate the rusting process and the changes that occur at the molecular level.\n- **Multiple Means of Engagement**: Encourage students to bring in objects from home that have experienced corrosion or changes over time, and have them share their observations with the class.\n- **Multiple Means of Expression**: Allow students to create drawings, models, or written descriptions to explain the rusting process and the changes observed in the materials.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-PS1-1]] Develop a model to describe that matter is made of particles too small to be seen.\n- [[NGSS:DCI:5-PS1-2]] Measure and graph quantities to provide evidence that regardless of the type of change that occurs when a substance is heated, cooled, or mixed, the total weight of the substance does not change.\n- [[NGSS:DCI:5-PS1-3]] Make observations and measurements to identify materials based on their properties.\n- [[NGSS:CCC:Cause_and_Effect]] Cause and effect relationships are routinely identified and used to explain change.\n- [[NGSS:CCC:Energy]] Energy can be transferred in various ways and between objects.\n\n## 💬 Discussion Questions\n\n1. What do you think might have caused the metal objects in the image to change color and appearance over time? (Bloom's: Analyze, DOK: 2)\n2. Why do you think the wood in the image is covered with so many different metal objects? What might this tell us about how the materials have interacted with each other? (Bloom's: Evaluate, DOK: 3)\n3. How is the change happening to the metal objects different from a physical change, like bending a nail? (Bloom's: Analyze, DOK: 3)\n4. Can you think of other examples of materials changing due to their interaction with the environment? (Bloom's: Apply, DOK: 2)\n\n## 📖 Vocabulary\n\n1. **Corrosion**: A chemical process where a material, like metal, breaks down due to a reaction with its environment.\n2. **Chemical Change**: A process that transforms one substance into a different substance with different properties.\n3. **Oxidation**: A chemical reaction where a substance loses electrons, often involving oxygen.\n4. **Rust**: The reddish-brown compound formed when iron reacts with oxygen and water.\n5. **Material**: A substance that something is made from, like wood, metal, or plastic.\n6. **Weathering**: The process of breaking down or changing the surface of a material due to environmental factors.\n\n## 🌡️ Extension Activities\n\n1. **Rust Investigation**: Set up experiments to test how different conditions, such as air, water, or saltwater, affect the rate of rusting. Have students observe and record the changes over time.\n2. **Material Comparison**: Collect various metal objects (e.g., copper penny, stainless steel spoon, zinc-coated nail) and have students investigate their properties, such as magnetism, color, and texture.\n3. **Historical Connections**: Explore the history of nails and their use in construction. Discuss how the materials and methods used in the past have changed over time due to environmental factors and technological advancements.",
    "grade4": "## 📸 Photo Description\n\nThe photo shows a collection of metal nails and fasteners embedded in a weathered wooden surface. The nails have a reddish-brown, crusty appearance, indicating they have undergone corrosion over time. The wood itself has a rough, textured surface, with visible grain patterns and signs of aging. The overall scene suggests a long-standing interaction between the metal and the wooden material.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the scientific phenomenon of **chemical change due to corrosion**. The metal nails are undergoing a chemical reaction with oxygen and water in the environment, a process known as oxidation. This reaction transforms the iron in the nails into a new substance - iron oxide, commonly called rust. The visible changes in color and texture of the metal are evidence of this chemical transformation. The wooden surface provides a porous medium that can trap moisture, creating the ideal conditions for this corrosion process to occur over time.\n\n## 📚 Core Science Concepts\n\n1. **Chemical Change**: A process where one or more substances are transformed into different substances with different properties. In this case, the iron in the nails reacts with oxygen and water to form iron oxide (rust), a new substance.\n2. **Corrosion**: A specific type of chemical change where a metal deteriorates due to a reaction with its environment, often involving oxidation.\n3. **Properties of Materials**: The physical and chemical properties of a substance can change over time due to interactions with other materials or environmental factors, as seen in the changing appearance of the nails.\n\n<pedagogical-tip>\nEngage students in a hands-on investigation of the rusting process. Provide them with various metal objects (nails, paper clips, etc.) and have them observe the changes over time in different environments (dry, water, saltwater). Encourage them to document the changes and discuss the reasons for the differences. This direct observation will help students better understand the concept of chemical change.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multiple Means of Representation**: Use a simulation or time-lapse video to visualize the molecular-level changes during the corrosion process.\n- **Multiple Means of Engagement**: Connect the concept of corrosion to real-world examples, such as the maintenance of bridges, cars, or outdoor structures.\n- **Multiple Means of Expression**: Have students create a \"Rust Report\" that includes drawings, descriptions, and explanations of the changes they observed.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-PS1-2]]: Measure and graph quantities to provide evidence that regardless of the changes that occur when materials are mixed, heated, cooled, or broken, the total mass is conserved.\n- [[NGSS:DCI:5-PS1-3]]: Make observations and measurements to identify materials based on their properties.\n- [[NGSS:CCC:Energy]]: Matter has properties such as mass, weight, and volume. Matter can be changed by heating or cooling.\n- [[NGSS:CCC:Patterns]]: Observe and predict changes in matter based on patterns of interaction.\n\n## 💬 Discussion Questions\n\n1. What evidence in the image suggests that a chemical change has occurred to the metal nails? (Bloom's: Analyze, DOK: 3)\n2. How do you think the wooden surface has contributed to the corrosion process? (Bloom's: Evaluate, DOK: 3)\n3. Can you think of other examples of materials that undergo chemical changes due to their environment? (Bloom's: Apply, DOK: 2)\n4. How might the corrosion of these nails impact the structural integrity of the wooden surface over time? (Bloom's: Analyze, DOK: 3)\n\n## 📖 Vocabulary\n\n- **Corrosion**: A chemical process where a material, such as metal, breaks down due to a reaction with its environment.\n- **Chemical Change**: A process that transforms one substance into a different substance with different properties.\n- **Oxidation**: A chemical reaction where a substance loses electrons, often involving oxygen.\n- **Rust**: The common name for iron oxide, a reddish-brown compound formed when iron reacts with oxygen and water.\n- **Metal**: A hard, shiny material that is a good conductor of heat and electricity, used to make a variety of objects.\n- **Weathering**: The process by which materials, such as rock or metal, are broken down or changed by environmental factors, like wind, rain, or temperature.\n\n## 🌡️ Extension Activities\n\n- **Investigating Corrosion Rates**: Conduct experiments to test how different environmental factors (e.g., humidity, temperature, salt exposure) affect the rate of corrosion on various metal objects.\n- **Comparing Material Properties**: Explore the properties of different metals, such as conductivity, magnetism, and resistance to corrosion, and how these properties influence their uses.\n- **Historical Perspectives**: Research how the development of corrosion-resistant materials, like stainless steel, has impacted the design and construction of buildings, vehicles, and other structures over time.",
    "grade5": "## 📸 Photo Description\n\nThe photo shows a wooden surface with numerous metal objects, primarily nails, embedded in it. The nails appear to be in various stages of corrosion, with some exhibiting reddish-brown rust and others having a more grayish, weathered appearance. The wood itself is also weathered, with visible cracks and grains, suggesting that this scene has been exposed to the elements for an extended period of time.\n\n## 🔬 Scientific Phenomena\n\nThe image demonstrates the process of **corrosion**, a type of chemical change that occurs when metals interact with their environment. Over time, the iron in the nails reacts with oxygen and water, forming a new substance called iron oxide, commonly known as rust. This chemical reaction causes the nails to change color, texture, and structure, as the original metallic properties are transformed.\n\n## 📚 Core Science Concepts\n\n1. **Chemical Change**: A chemical change is a process where one or more substances are transformed into different substances with new properties. The rusting of the nails is an example of a chemical change, as the iron in the nails reacts with oxygen to form a new compound, iron oxide.\n2. **Corrosion**: Corrosion is a specific type of chemical change where a metal deteriorates due to a reaction with its environment. In this case, the nails are undergoing corrosion due to the presence of oxygen and water in the atmosphere.\n3. **Properties of Materials**: The physical and chemical properties of the nails, such as their color, texture, and strength, have changed over time due to the corrosion process. This demonstrates how the environment can affect the properties of materials.\n\n<pedagogical-tip>\nTo help students better understand the concept of chemical change and corrosion, engage them in a hands-on investigation. Provide students with iron nails, water, and other materials, and have them observe the changes that occur over time. Encourage them to document their observations and make connections to the processes they are witnessing.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multiple Means of Representation**: Use visual aids, such as diagrams or animations, to help students visualize the molecular-level changes that occur during the corrosion process.\n- **Multiple Means of Engagement**: Relate the concept of corrosion to students' everyday experiences, such as the rusting of bikes, cars, or other metal objects they encounter.\n- **Multiple Means of Expression**: Allow students to demonstrate their understanding of chemical change and corrosion through various formats, such as creating a poster, writing a scientific explanation, or presenting a model.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-PS1-1]] Develop a model to describe that matter is made of particles too small to be seen.\n- [[NGSS:DCI:5-PS1-2]] Measure and graph quantities to provide evidence that regardless of the type of change that occurs when heating, cooling, or mixing substances, the total weight of matter is conserved.\n- [[NGSS:DCI:5-PS1-3]] Make observations and measurements to identify materials based on their properties.\n- [[NGSS:CCC:Patterns]] Observe and predict changes in matter based on patterns of interaction.\n- [[NGSS:CCC:Energy]] Matter has properties such as mass, weight, and volume. Matter can be changed by heating or cooling.\n\n## 💬 Discussion Questions\n\n1. What changes do you notice in the appearance of the nails over time? (Bloom's: Analyze) (DOK: 2)\n2. Why do you think the nails are in different stages of corrosion? (Bloom's: Evaluate) (DOK: 3)\n3. How is the change happening to the nails different from a physical change, like bending a nail? (Bloom's: Analyze) (DOK: 3)\n4. Can you think of other examples of materials that might undergo a similar chemical change due to their environment? (Bloom's: Apply) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Corrosion**: A chemical process where a material, like metal, deteriorates due to a reaction with its environment.\n- **Chemical Change**: A process that transforms one substance into a different substance with new properties.\n- **Oxidation**: A chemical reaction where a substance loses electrons, often involving oxygen.\n- **Rust**: The reddish-brown compound formed when iron reacts with oxygen and water, also known as iron oxide.\n- **Metal**: A hard, shiny material that conducts electricity and heat, such as iron, copper, or aluminum.\n- **Environment**: The natural surroundings or conditions in which a person, animal, or plant lives or operates.\n\n## 🌡️ Extension Activities\n\n1. **Rust Experiment**: Set up an experiment to investigate how different environmental factors (e.g., water, salt, temperature) affect the rate of rusting. Observe and record the changes over time.\n2. **Material Properties Exploration**: Collect a variety of metal objects and test their properties, such as magnetism, color, and texture. Discuss how the properties of different metals may contribute to their susceptibility to corrosion.\n3. **Historical Perspective**: Research the historical use of nails and other metal objects in construction. Discuss how the understanding of corrosion and material properties has influenced the design and selection of materials over time."
  }
}