{
  "title": "Power Lines",
  "category": "physical-science",
  "imageFile": "power_lines.jpg",
  "imagePath": "images/physical-science/power_lines.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# Complete 5E Lesson Plan: Electricity and Power Lines\n\n### Core Science Concepts from Image Analysis\n\n- **Electricity travels through wires and cables** — The photograph shows multiple wires and cables attached to a utility pole that carry electrical energy to homes and buildings in the community.\n- **Electrical systems use transformers to change voltage** — The large cylindrical device (transformer) visible on the pole converts high-voltage electricity into lower, safer voltages for household use.\n- **Magnetic forces are involved in electrical systems** — Electromagnets in transformers use magnetic interactions (non-contact forces) to transfer energy between circuits without physical touching.\n- **Forces and structures work together** — The pole, insulators, and hardware all work together to support and protect the wires carrying electrical current, demonstrating how structures withstand forces.\n\n---\n\n### Lesson Title\n\n**Invisible Forces: How Electricity Travels to Our Homes**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 50-minute sessions (100 minutes total)\n- **NGSS Standards:** \n  - 3-PS2-3: Ask questions to determine cause and effect relationships of electric or magnetic interactions between two objects not in contact with each other.\n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Explain how electricity travels through wires and cables from power plants to homes without touching the wires directly.\n- Identify and describe the role of a transformer in an electrical system.\n- Ask questions about how magnetic forces work without objects touching each other.\n- Design and test a simple model that demonstrates how forces can be transmitted without direct contact.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student curiosity about electricity and power systems by examining the photograph and activating prior knowledge about how electricity reaches their homes.\n\n- **Materials:**\n  - Projected or printed photograph of utility pole with power lines\n  - Chart paper and markers\n  - Flashlight (to demonstrate that electricity powers lights)\n\n- **Activity:**\n  \n  Display the photograph on a large screen or wall. Ask students to look carefully for 30 seconds without talking, then respond to these questions:\n  \n  1. **\"What do you see in this picture? What are all those wires and that big metal thing doing?\"** (Accept responses about wires, cables, a metal cylinder/transformer, pole, etc.)\n  \n  2. **\"Turn to a partner and discuss: Where does the electricity that powers the lights in your house come from? Do you think it travels through those wires?\"** (Listen for students who mention power plants, wires, or unsure responses.)\n  \n  3. **\"Here's something interesting — the electricity traveling through those wires is VERY strong and dangerous. It doesn't touch us, but it still reaches our homes and lights our rooms. How do you think that's possible?\"** (Guide them to think about invisible forces, magnetic energy, etc.)\n  \n  4. **\"If we can't touch electricity and it can't touch us while it's in the wires, how is it moving? What force might be pushing it?\"** (Introduce the idea that invisible forces — like magnets — move electricity.)\n  \n  Record student \"wonderings\" on chart paper: *\"What powers move electricity?\" \"How do those wires carry invisible energy?\"*\n\n- **Transition:** \"Today, we're going to investigate invisible forces—like magnets—that can move things and carry energy without ever touching. Let's build our own model to see how this works!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate how non-contact forces (magnetic forces) can transfer motion and energy from one object to another, modeling how transformers use invisible magnetic forces.\n\n- **Materials (per group of 2-3 students):**\n  - 2 horseshoe magnets (strong neodymium magnets preferred, but standard classroom magnets work)\n  - Small metal paperclips (10-15 per group)\n  - Aluminum foil sheets (cut into small squares, 2x2 inches)\n  - Paper or plastic cups\n  - Wooden craft sticks or plastic stirrers\n  - Small toy cars or wooden blocks\n  - Metric ruler\n  - Data recording sheet (see below)\n  - Tape\n\n- **Activity:**\n  \n  **Part A: Discovering Magnetic Force Without Touching**\n  \n  1. Give each group one magnet, 5-6 paperclips, and a ruler. Say: \"Place your magnet on the table. Now, without letting your magnet touch the paperclips, see how close you need to get the magnet to make a paperclip move toward it. Measure the distance with your ruler.\"\n  \n  2. Have students try this 3 times and record the farthest distance where the magnet can still \"pull\" a paperclip. Ask: **\"What's happening? The magnet isn't touching the paperclip, but it's moving. What invisible force is doing this?\"** (Guide them to understand: magnetic force works without touching.)\n  \n  3. Now have students place aluminum foil between the magnet and paperclip. Ask: **\"Does the magnetic force still work through the foil? How far away does it work now?\"** Record observations.\n  \n  **Part B: Moving Objects Without Touching (Model of Transformer Energy Transfer)**\n  \n  4. Show students two cups. Say: \"Inside this cup, I'm putting a magnet. In the other cup, I'm putting a paperclip. Watch what happens when I bring the cups close together.\" Move the magnet-cup toward the paperclip-cup; the paperclip will move inside its cup WITHOUT the cups touching.\n  \n  5. Each group now creates their own version: place a magnet inside one cup and a paperclip inside another cup. Gently move the magnet-cup closer to the paperclip-cup. Have students measure how far apart the cups can be and still transfer the \"invisible force.\"\n  \n  6. Challenge: \"Now try to move a toy car using a magnet from underneath a sheet of paper or wood. What happens? Does the force travel through different materials?\" Have students test 2-3 different materials and record which ones allow the magnetic force to work best.\n\n- **Teacher Role:**\n  - Circulate and ask probing questions: *\"Why did that happen?\" \"Can you describe what you see?\" \"What do you think would happen if we added another magnet?\"*\n  - Avoid telling students the answer; instead, guide them to observe and question.\n  - Ensure safety: demonstrate proper magnet handling (no slamming, keep away from electronics).\n  - Help students record observations with sketches and measurements.\n\n- **Expected Student Outcomes:**\n  - Students observe that magnetic force works across a distance without touching.\n  - Students measure and record distances where magnetic attraction works.\n  - Students discover that some materials allow magnetic force to pass through, while others block or weaken it.\n  - Students create a working model showing how energy can be transferred without contact (foundation for understanding transformers).\n\n- **Data Recording Sheet:**\n  \n  *Student Recording Guide:*\n  \n  | Experiment | Distance Magnet Works | Material Used | Notes/Drawing |\n  |---|---|---|---|\n  | Magnet to paperclip (no barrier) | _____ cm | Air | |\n  | Magnet to paperclip (with aluminum foil) | _____ cm | Aluminum foil | |\n  | Magnet in cup to object in another cup | _____ cm | Paper cups | |\n  | Magnet under paper to move toy car | _____ cm | Paper | |\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce formal vocabulary and connect student observations to how electricity and transformers use invisible forces to transfer energy.\n\n- **Materials:**\n  - Chart paper with vocabulary words\n  - Photograph of utility pole\n  - Simple diagram of a transformer (teacher-prepared or from NSTA/Scholastic resources)\n  - Electromagnet demonstration (optional: battery, wire wrapped around a nail, iron filings or paperclips)\n\n- **Activity:**\n  \n  **Group Share-Out:**\n  \n  1. Have 2-3 groups share their observations: *\"What did you learn about how forces can work without touching?\"* Record key phrases on chart paper.\n  \n  2. Connect to the photograph: \"Remember those wires on the utility pole? One of those big metal cylinders is called a **transformer**. Just like your magnets moved the paperclips without touching, transformers use invisible **magnetic forces** to move electricity from one set of wires to another set of wires without them ever touching. The magnetic force transfers the electrical energy!\"\n  \n  3. Show a simple diagram of a transformer (two coils of wire with an iron core between them). Explain: \"Inside the transformer, there are two sets of wire coils. When electricity flows through the first coil, it creates a magnetic field. That magnetic field moves into the second coil—without the wires touching—and creates electricity in the second coil! It's just like your magnet making the paperclip move.\"\n  \n  4. **Optional Electromagnet Demo:** If available, show how wrapping wire around a nail and running electricity through it creates a magnet. Let students feel the magnetic pull. Say: \"Electricity and magnetism are connected! When electricity moves, it makes a magnetic field.\"\n  \n  **Check for Understanding:**\n  \n  Ask students to think-pair-share: *\"How is the magnetic force we tested with our magnets similar to how a transformer works?\"* Listen for students connecting: \"A force moved things without touching\" → \"Transformers use magnetic forces to move electricity without wires touching.\"\n\n- **Vocabulary:**\n  \n  - **Electricity:** A form of energy that travels through wires and powers lights, computers, and machines in our homes and schools.\n  - **Magnet:** An object that has an invisible force around it that can pull or push other metal objects without touching them.\n  - **Magnetic Force:** An invisible push or pull that a magnet creates around itself; it can work across a distance without touching.\n  - **Transformer:** A device (like the large metal cylinder on a power pole) that uses magnetic forces to change the strength of electrical energy so it's safe for our homes.\n  - **Non-Contact Force:** A force that works on an object without physically touching it (examples: magnetic force, gravity, static electricity).\n\n- **Expected Student Outcomes:**\n  - Students understand that magnetic forces work without contact.\n  - Students can explain that transformers use these invisible magnetic forces to move electricity.\n  - Students recognize that electricity and magnetism are related.\n  - Students use the term \"non-contact force\" to describe forces that work across a distance.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply their understanding of non-contact forces to design and test a simple device that uses magnetic forces to solve a problem.\n\n- **Materials (per group):**\n  - 2 horseshoe or bar magnets\n  - String or fishing line\n  - Cups, boxes, or cardboard tubes (to create a container/barrier)\n  - Small objects to move (paperclips, metal washers, foam pieces)\n  - Tape\n  - Design challenge worksheet (below)\n  - Rulers\n\n- **Activity:**\n  \n  **Design Challenge: Create a Magnetic Mover**\n  \n  Present the scenario: \"Imagine you work for a toy company. They want to create a new toy where one magnet on the outside of a box can move an object INSIDE the box without the box falling apart or opening. The magnet never touches the object inside. Can you design this?\"\n  \n  **Student Steps:**\n  \n  1. **Plan:** Sketch your design on paper. Show where the external magnet will be, where the object inside will be, and how they will be positioned. Label your drawing.\n  \n  2. **Build:** Use cardboard, cups, or boxes to create the barrier. Secure one magnet on the outside. Place a metal object (paperclip or washer) inside.\n  \n  3. **Test:** Move your external magnet around the box. Can you make the object inside move? Try moving it in a circle, up and down, side to side. Record what works and what doesn't.\n  \n  4. **Refine:** If it didn't work well, adjust the distance between the magnet and the box, or try a different position. Test again.\n  \n  5. **Challenge Extension:** Make the barrier thicker (add another layer of cardboard). Does your magnet still work? How far can the magnetic force travel through your barrier?\n  \n  **Real-World Connection:** \"This is similar to how scientists and engineers use magnets to move things inside machines without opening them up. Transformers work the same way—the magnetic force moves the energy inside without the wires ever touching!\"\n\n- **Teacher Role:**\n  - Ask questions that guide refinement: *\"What happened when you moved the magnet closer? Farther away? How could you make it work better?\"*\n  - Encourage students to make predictions and test them.\n  - Provide additional materials as needed but allow students to problem-solve.\n  - Celebrate creative solutions and persistence.\n\n- **Expected Student Outcomes:**\n  - Students design a working model of non-contact force energy transfer.\n  - Students test and record whether their design works.\n  - Students refine their design based on evidence and observation.\n  - Students explain how their model relates to how transformers work.\n  - Students demonstrate understanding that magnetic forces can work through barriers.\n\n- **Design Challenge Worksheet:**\n  \n  *Student Name: __________ Date: __________*\n  \n  **My Magnetic Mover Design**\n  \n  1. **Draw your plan:** Sketch the outside magnet, the barrier, and the object inside.\n  \n  2. **Describe your design:** What materials did you use? Where is your magnet? Where is the object inside? ___________________\n  \n  3. **Test Results:**\n     - Did your magnet move the object inside? ☐ Yes ☐ No ☐ Sometimes\n     - What movements worked best? _____________________\n     - What distance did it work at? _____ cm\n  \n  4. **What changed:** What did you adjust to make it work better? _____________________\n  \n  5. **Connection to transformers:** How is your magnetic mover like a transformer? _____________________\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of non-contact forces, magnetic interactions, and how these concepts relate to electricity transfer systems.\n\n- **Activity:**\n  \n  **Formative Assessment (Throughout Lesson):**\n  - Observation: Watch students during Explore phase. Can they identify when the magnetic force works and measure distances accurately?\n  - Questioning: Listen to student responses in Explain phase. Do they use vocabulary correctly (magnetic force, non-contact force, transformer)?\n  - Elaboration: Review Design Challenge worksheets. Can students sketch and describe their design? Do explanations show understanding?\n  \n  **Exit Ticket (Summative Assessment):** Administer after Elaborate phase. Provide each student with a copy and give 5-7 minutes.\n  \n  ---\n  \n  **EXIT TICKET: Forces That Move Without Touching**\n  \n  *Name: _________________ Date: _________*\n  \n  **Question 1:** Draw a picture of a magnet pulling a paperclip. Circle the part of the magnet that pulls the paperclip. Does the magnet touch the paperclip? ☐ Yes ☐ No\n  \n  **Question 2:** What do we call a force that can push or pull something without touching it?\n  ☐ A. A touching force\n  ☐ B. A non-contact force\n  ☐ C. A pushing force\n  ☐ D. A holding force\n  \n  **Question 3:** Look at the picture of the utility pole (show photograph again). The large metal cylinder on the pole is a transformer. How does it use invisible forces to move electricity?\n  *Student writes:* _________________________________\n  \n  **Question 4:** In your design challenge, could your magnet move the object inside the box without touching it? Explain how.\n  *Student writes:* _________________________________\n  \n  **Question 5:** If you wanted your magnet to move an object that was farther away, what could you do?\n  ☐ A. Use a weaker magnet\n  ☐ B. Use a stronger magnet\n  ☐ C. Move the object closer\n  ☐ D. Add more paperclips\n  \n  ---\n  \n  **Success Criteria:**\n  \n  - **Developing (1-2 correct responses):** Student shows emerging understanding of non-contact forces; may confuse magnetic force with other types of forces.\n  - **Proficient (3-4 correct responses):** Student demonstrates solid understanding of magnetic non-contact forces and can apply the concept to transformers.\n  - **Advanced (5 correct responses):** Student shows deep understanding, uses accurate vocabulary, and can explain real-world applications with detail.\n\n- **Expected Student Outcomes:**\n  - Students correctly identify non-contact forces as forces that work without touching.\n  - Students recognize that magnets create invisible forces and understand basic transformer function.\n  - Students can apply their learning to explain how electricity reaches homes using non-contact forces.\n  - Exit ticket responses show conceptual understanding and ability to connect to the utility pole photograph.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Provide a Vocabulary Card with pictures:** Create a reference card with illustrations of magnets, non-contact forces, and transformers. Students can use this during discussions and written responses to help recall and use correct vocabulary.\n\n2. **Simplify the Design Challenge:** Instead of designing from scratch, provide a partially assembled magnetic mover (e.g., magnet already secured, box already built). Ask students to test it, measure distances, and describe what they observe using a sentence frame: *\"The magnet moved the object because _______________.\"*\n\n3. **Pair with a partner:** Allow struggling students to work with a peer or paraprofessional during Explore phase. The partner can help record data, read instructions aloud, and ask guiding questions: *\"What do you see? What happened? Why did it happen?\"*\n\n4. **Reduce the number of variables to test:** Instead of testing multiple materials, focus on one or two (air and aluminum foil). This reduces cognitive load while still building understanding.\n\n**Challenge (for advanced learners):**\n\n1. **Investigate Electromagnets:** Provide battery, wire, nails, and iron filings. Challenge students to create an electromagnet and explore: *\"How is an electromagnet different from a permanent magnet? How does turning electricity ON and OFF change the magnetic force?\"* This connects directly to transformer function.\n\n2. **Design a Multi-Layer Barrier Test:** Ask advanced students to predict and test how many layers of different materials would stop a magnetic force. Have them create a graph showing material thickness versus magnetic strength. Ask: *\"What material is best for blocking magnetic force? Why?\"*\n\n3. **Research and Present:** Ask students to research and present on one of: *\"How do credit card readers use magnetism?\" \"How do maglev trains work?\" \"What is electromagnetism used for in hospitals?\"* This deepens the application of non-contact forces.\n\n4. **Reverse Engineering Challenge:** Show a simple device (e.g., a magnetic pen toy or Newton's cradle with magnets). Challenge students to figure out how it works and present their hypothesis to the class.\n\n---\n\n### Extension Activities\n\n1. **Magnetic Force Field Investigation:** Provide a sheet of paper, dry erase marker, and iron filings (or crush a pencil lead finely). Place a magnet under paper and sprinkle filings on top. Gently shake or tap to reveal the magnetic field pattern. Students sketch the pattern and discuss: *\"Why does the force look strongest at the poles?\"* This visualizes the invisible force field discussed in the lesson.\n\n2. **Build a Magnetic Fishing Game:** Students create a simple fishing game using string, tape, a stick, and a magnet attached to the string. They design and decorate paper \"fish\" with paper clips attached underneath. Challenge: Can they \"catch\" all the fish? This reinforces non-contact force concepts in a playful, game-based context and can be used as a homework craft project.\n\n3. **Electricity and Magnetism Journal Entry:** Have students write or draw in a science journal: *\"I learned that magnetic forces don't touch, but transformers use them to move electricity. One question I still have is...\"* This encourages reflection and identifies misconceptions or curiosities for follow-up instruction. Students could also research and sketch simple answers to their own questions.\n\n4. **Virtual Tour of a Power Plant:** Use videos or interactive websites (search \"power plant for kids\" on PBS Learning Media or Scholastic) to show how electricity is generated, then travels through transformers on utility poles to homes. Students identify the transformer in the video and connect it to the photograph and their investigations.\n\n5. **Community Observation Walk:** If safe and feasible, take students on a walking tour of the neighborhood to identify and count utility poles, transformers, and power lines. Create a simple map marking where they saw transformers. Discuss: *\"Why do we need transformers in different locations? Where do the wires go?\"* This real-world connection reinforces the relevance of the lesson.\n\n---\n\n## Implementation Notes for the Teacher\n\n- **Safety First:** Remind students that real power lines are extremely dangerous and should never be touched or played with. This lesson explores the *concepts* safely in the classroom, not the actual electrical system.\n- **Magnet Strength:** Neodymium magnets are stronger and work better for this lesson, but standard classroom magnets are adequate. Ensure magnets are not near computer equipment, credit cards, or electronics.\n- **Timing Flexibility:** If students become deeply engaged in the Design Challenge, extend Elaborate to a second session. Concepts are still meeting standards even with adjusted timing.\n- **Connection to 3-PS2-1:** While this lesson primarily addresses 3-PS2-3 (non-contact forces), the investigation of balanced/unbalanced forces in Explore and Elaborate phases supports 3-PS2-1. Consider asking: *\"What happens when two magnets push against each other? Is the force balanced or unbalanced?\"*",
  "inputTokens": 221,
  "outputTokens": 5260,
  "cost": 0.0270488,
  "generatedAt": "2026-02-13T07:18:36.004Z"
}