{
  "title": "Power_lines",
  "category": "physical-science",
  "imageFile": "power_lines.jpg",
  "imagePath": "images/physical-science/power_lines.jpg",
  "content": "# Engineering Design Challenge: Utility Pole Power Distribution\n\n### Visible Elements in Photo\n- Wooden utility pole (weathered, vertical support structure)\n- Electrical transformer (cylindrical tank with cylindrical protrusions on top)\n- Multiple black power lines/cables attached at various angles\n- Metal brackets and hardware securing components to pole\n- Clear blue sky (indicating outdoor infrastructure)\n\n---\n\n### Reasonable Inferences\n1. **From transformer and power lines**: This system distributes electrical power from a main source to multiple locations—the lines carry electricity to homes or buildings.\n2. **From multiple cable attachments**: The different lines likely serve different purposes (power delivery, communication, grounding), requiring secure, organized mounting.\n3. **From weathered pole and hardware**: Outdoor infrastructure must withstand wind, weight, and environmental stress without failing.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nYour job is to build a strong pole that holds up wires and a box (like a real power pole). Use a paper towel tube as your pole. You can tape or wrap string around it to hold things on. Make sure your pole doesn't tip over and keeps everything safe and neat. Can you hold up 3 wires and a small container without anything falling?\n\n**3-5 Version:**\nDesign and build a utility pole support system that safely holds and organizes multiple \"power lines\" (strings or wires) at different heights and angles. Your pole must:\n- Support at least 4 lines attached at different points\n- Remain stable with a small weighted container (transformer model) mounted on the upper section\n- Keep lines from crossing or tangling\n- Withstand a gentle sideways push without toppling\n- Use only the materials provided and be constructed in under one class period\n\nSuccess criteria: Pole stands upright, all lines secure, container stays attached, system resists tipping.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real-world infrastructure challenge: how do engineers organize and secure multiple systems (power, communication, grounding) on a single structure while keeping it stable and safe? Students begin by observing the problem (organized attachment, weight distribution, stability) before designing their own solution. The visible complexity naturally prompts the question: *What problem does this design solve?*\n\n---\n\n### Suggested Materials\n- Paper towel tubes or PVC pipe (pole)\n- String, yarn, or electrical tape (power lines)\n- Small plastic container or box (transformer)\n- Metal brackets, clothespins, or cardboard strips (fasteners/hardware)\n- Pennies or sand (added weight to test stability)\n- Wooden blocks or clay base (stabilizer)\n\n---\n\n### Estimated Time\n**One 45-minute session** (or two 30-minute sessions for K-2, allowing time for design sketching, building, and testing with adjustments)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining design problems based on criteria and constraints) by having students identify real-world infrastructure needs and prototype a solution that balances competing demands: stability, organization, and load-bearing capacity.",
  "inputTokens": 2195,
  "outputTokens": 705,
  "cost": 0.005719999999999999,
  "generatedAt": "2026-02-11T01:41:19.365Z"
}