{
  "title": "Properties Of Matter",
  "category": "physical-science",
  "imageFile": "properties_of_matter.jpg",
  "imagePath": "images/physical-science/properties_of_matter.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Exploring Liquids in Containers\n\n### Core Science Concepts from Image Analysis\n\n- **States of Matter (Liquids):** The photograph shows a clear container filled with a yellow liquid (likely coolant or antifreeze), demonstrating how liquids take the shape of their container and have a visible surface.\n- **Properties of Materials:** The different materials visible—plastic containers, metal hoses, rubber tubes, and cloth rags—show that materials have different properties (transparent, opaque, flexible, rigid) that make them useful for different jobs.\n- **Light and Visibility:** The yellow liquid is easily visible because light passes through the transparent plastic container, allowing us to see the contents clearly, while opaque materials (black hoses, metal engine parts) block or reflect light.\n- **Observing and Describing Objects:** Students can examine containers and liquids to describe color, transparency, what materials are used, and how liquids behave differently from solid objects.\n\n---\n\n### Lesson Title\n\n**What's Inside? Exploring Liquids and See-Through Containers**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 35-40 minute sessions\n- **NGSS Standards:** \n  - 1-PS4-2: Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated.\n  - 1-PS4-3: Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Describe what happens when light shines through clear, transparent, and opaque materials.\n- Observe and compare how different materials let light pass through, block light, or change how light looks.\n- Explain that we can see things because light helps us see them.\n- Sort materials into groups based on whether light can pass through them.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about light, containers, and what we can see through different materials.\n\n**Materials:**\n- The photograph (printed or displayed on a screen/projector)\n- Chart paper and markers\n- Flashlight or lamp (to have ready for later)\n\n**Activity:**\n\nDisplay the photograph prominently where all students can see it clearly. Ask students to sit in a circle or gather close to the image.\n\n**Discussion Questions:**\n1. \"What do you see in this picture? What's inside that big clear container?\" (Prompt them to notice the yellow liquid.)\n2. \"Why can we see the yellow liquid? What helps us see it?\" (Guide them to think about light.)\n3. \"Can you see through all the things in this picture? Point to something you can see through and something you cannot see through.\"\n4. \"If that container were completely dark with no light, do you think you could see the yellow liquid inside? What would happen?\"\n\n**Prediction/Wonder Prompt:**\n\"I wonder... if we put different materials in front of a light, which ones would let the light shine through and which ones would block it? Let's find out!\"\n\n**Transition:**\n\"Today we're going to explore how light passes through some materials and gets stopped by others, just like in this picture of the car engine.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how different materials interact with light by observing what happens when light shines through various classroom materials.\n\n**Materials (per small group of 3-4 students):**\n- Flashlight or lamp with a bright bulb\n- Clear plastic cup or clear plastic sheet\n- White paper or tissue paper\n- Dark construction paper or cardboard\n- Aluminum foil\n- Clear plastic bag\n- Frosted plastic sheet (or wax paper)\n- Cloth (dark fabric scrap)\n- A dark corner, closet, or box to create a darker space (or simply dim the classroom lights)\n- Recording sheet with pictures of each material (see template below)\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. **Setup:** Work in small groups. Turn off or dim the lights in your space. One student holds the flashlight, and others hold up each material one at a time.\n\n2. **Light Through Clear Plastic:** Hold the clear plastic cup or sheet in front of the flashlight. What do you see on the other side? Can you see light coming through? Color in or draw what you see on your recording sheet.\n\n3. **Light Through Paper:** Try white paper, then dark construction paper. What's different? Does light come through differently? Record your observations.\n\n4. **Light Through Foil:** Hold the shiny aluminum foil in front of the light. What happens? Does light go through or bounce off? Mark your sheet.\n\n5. **Light Through Frosted Plastic:** Hold the frosted/wax paper in front of the light. Can you see through it clearly, or is it fuzzy? Record.\n\n6. **Light Through Cloth:** Try the dark cloth. What happens to the light? Can you see light on the other side? Record.\n\n7. **Repeat and Notice:** For each material, decide: Does light go *through* it? Does light *bounce off* it? Is it hard to see through? Easy to see through?\n\n**Recording Sheet Template (Pictures + Simple Words):**\n```\nMaterial: ___________\n☐ Light goes through (I can see the light)\n☐ Light does NOT go through (I cannot see the light)\n☐ Hard to see through\n☐ Easy to see through\n```\n\n**How This Connects to the Photograph:**\n\"The big plastic container in the picture is like our clear plastic cup—light shines through it so we can see the yellow liquid inside. The black hoses and metal parts are like our dark paper and foil—they block the light and we can only see their shape.\"\n\n**Teacher Role:**\n- Circulate among groups to ask guiding questions: \"What do you notice? Can you see light coming through? Is it bright or dim?\"\n- Use a think-aloud: \"I'm looking at this clear plastic. Light is coming through it brightly. It's easy to see through.\"\n- Do NOT tell students the answers; let them observe and describe.\n- Help students record their observations with drawings or words they can read aloud.\n\n**Expected Student Outcomes:**\n- Students discover that clear materials let light pass through brightly.\n- Students observe that dark and opaque materials block light or let very little through.\n- Students notice that some materials (frosted, paper) let light through but make it fuzzy or dim.\n- Students record observations using pictures and words on their sheet.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to the science concept of light and materials.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- The photograph (displayed again)\n- Student recording sheets from Explore phase\n\n**Activity:**\n\n**Group Share-Out:**\nGather students back together. Show the photograph again.\n\n\"Let's talk about what you discovered. Who found a material that let light shine brightly through it?\"\n- Allow 2-3 students to share and describe (e.g., \"The clear plastic let lots of light through!\").\n\n\"Who found a material that blocked the light?\"\n- Have 2-3 students share (e.g., \"The dark paper stopped the light!\").\n\n**Introduce Key Vocabulary:**\nWrite each term on chart paper with a simple drawing or the word in large letters. Define each in student-friendly language.\n\n1. **Light:** Energy that helps us see things. When light shines, we can see colors and shapes.\n2. **Transparent (or \"See-Through\"):** Something is transparent when light passes right through it and you can see clearly on the other side. (Gesture to the clear plastic cup in the photo.)\n3. **Opaque (or \"Not See-Through\"):** Something is opaque when light cannot pass through it, so you cannot see through it at all. (Point to the dark hoses and metal parts in the photo.)\n4. **Illuminate:** When light shines on something or through something. It means to light something up.\n\n**Connections Back to Photo and Explore Activity:**\n\"Remember when we shined the light through our clear plastic cup? That was like this clear plastic container in the picture—we could see the yellow liquid inside because light goes through it. The dark hoses and metal parts in this car engine are like our dark paper—they block the light, so we see the shape but not what's inside.\"\n\n**Check for Understanding:**\nAsk quick yes/no or either/or questions:\n- \"Is this clear plastic cup transparent or opaque?\" (Point to the photo.)\n- \"Does light go through the dark cloth, yes or no?\"\n- \"Can we see through aluminum foil? Is it transparent or opaque?\"\n- Have students show thumbs up if they agree or thumbs down if they disagree.\n\n**Expected Student Outcomes:**\n- Students understand that light helps us see things.\n- Students can identify whether materials are transparent or opaque.\n- Students understand that light passes through some materials and not others.\n- Students can use new vocabulary in simple sentences.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of light and materials by designing and testing their own \"see-through\" and \"hide-it\" containers.\n\n**Materials:**\n- Clear plastic cups (one per student or pair)\n- Frosted or translucent plastic sheets\n- Tissue paper (various colors)\n- Dark construction paper\n- Tape or glue stick\n- Small objects to hide (small toy, marble, sticker, button)\n- Flashlight\n- A \"mystery box\" setup (optional: a box with a hole where light shines through to reveal a hidden object)\n\n**Activity:**\n\n**Challenge for Students:**\n\"Now you're a designer! Your job is to make a container that HIDES something inside—so even with light shining, people can't see it. Then you'll make another container where people CAN see inside because light passes through.\"\n\n**Option 1: Hide-It Design**\n1. Wrap a clear plastic cup with dark construction paper or foil to block light.\n2. Put a small object inside (a marble, small toy, etc.).\n3. Have a partner try to see inside with a flashlight—they shouldn't be able to!\n\n**Option 2: See-Through Design**\n1. Wrap a clear plastic cup with clear plastic wrap or tissue paper.\n2. Put a small, colorful object inside.\n3. Have a partner shine a light on it—they should be able to see it clearly!\n\n**Optional Extension: Mystery Light Box**\n- Set up a box with a small hole. Behind the hole, place a hidden object. Shine a flashlight through the hole so the object is illuminated inside the box. Students try to guess what it is based on the shape they see.\n\n**Teacher Role:**\n- Demonstrate how to wrap a cup with paper first.\n- Ask students: \"Why do you think this design will let light through?\" or \"How will this stop the light?\"\n- Facilitate peer sharing: \"Show your neighbor your container. Can they see inside? Why or why not?\"\n\n**Expected Student Outcomes:**\n- Students apply understanding that opaque materials block light and transparent materials let light through.\n- Students create two working designs and can explain why one hides and one shows.\n- Students use vocabulary: transparent, opaque, light, see-through.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of how light interacts with different materials and how visibility depends on light.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- Observe students during Explore: Can they describe what they see when light shines through materials?\n- Listen during Explain: Do students use vocabulary like \"transparent,\" \"opaque,\" and \"light\" correctly?\n- Watch during Elaborate: Can students design containers that match the challenge (hide-it or see-through)?\n- Check recording sheets: Are drawings and words/marks clear?\n\n**Exit Ticket / Summative Assessment:**\n\nAsk students these questions verbally (or with pictures for those not reading yet). Record their responses:\n\n1. **\"Show me with your hands: Is clear plastic transparent or opaque?\"** (Answer: Transparent—it lets light through.)\n2. **\"If you wrap something in dark paper and shine a light on it, will you be able to see inside?\"** (Answer: No, the dark paper blocks the light.)\n3. **\"Point to something in the classroom that light can shine through.\"** (Any transparent object: window, clear cup, plastic bag, etc.)\n4. **\"Why can we see the yellow liquid in the big container in our picture?\"** (Answer: Because the container is clear/transparent and light shines through it.)\n\n**Success Criteria for Understanding:**\n- ✓ Student correctly identifies transparent vs. opaque materials.\n- ✓ Student explains that light helps us see things.\n- ✓ Student describes what happens when light shines through different materials.\n- ✓ Student successfully designs a see-through or hide-it container that works.\n- ✓ Student uses vocabulary: light, transparent, opaque, see-through.\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding that we need light to see.\n- Students correctly sort materials as letting light through or blocking it.\n- Students explain why the clear container in the photograph allows us to see the liquid inside.\n- Students apply learning to new situations (their own designs, classroom objects).\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified Vocabulary:** Use \"see-through\" instead of \"transparent\" and \"not see-through\" instead of \"opaque\" for students not yet ready for formal terms. Provide picture cards with labels.\n\n2. **Guided Exploration:** Pair students with a stronger partner. The teacher or aide can work with the support group, holding materials and asking one question at a time: \"Is light coming through? Can you see to the other side?\" Have students point or say \"yes\" or \"no.\"\n\n3. **Reduced Choice:** Instead of many materials, give only 3 options (clear plastic, white paper, dark paper) and practice with these thoroughly before expanding.\n\n**Challenge (for advanced learners):**\n\n1. **Investigate Brightness Levels:** Instead of just \"light goes through or doesn't,\" have students observe *how much* light comes through. Rank materials from \"most light\" to \"least light.\" Use a simple chart to order them.\n\n2. **Predict and Test:** Show a new material (e.g., wax paper, colored plastic, newspaper). Ask: \"Do you think light will go through this? Why?\" Then test and compare predictions to results.\n\n3. **Design Problem:** \"Design a container that lets us see something pretty inside during the day, but hides it at night when it's dark. What materials will you use? Why?\"\n\n---\n\n### Extension Activities\n\n1. **Sunlight Shadows Exploration:** Take the activity outdoors or to a sunny window. Have students hold materials in front of sunlight and observe shadows on the ground or on paper. Which materials make the darkest shadows? Which let light through and make light shadows? Connect to how light and darkness help us see.\n\n2. **Glow Stick Containers:** (Follow-up lesson) Provide glow sticks or battery-operated tea lights. Have students place them inside clear vs. dark containers. Which containers let the glow shine through? How does the glow look different through each material? This reinforces the concept that light helps us see things, even when it comes from the object itself.\n\n3. **Make a Lighthouse Design:** Students design a tall container (stacked clear cups or a paper towel tube with plastic wrap) with a light source inside. They explore which materials around the sides let the light shine out like a real lighthouse, and which materials would hide the light. They can test their designs at night or in a dark space.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 227,
  "outputTokens": 3696,
  "cost": 0.0192348,
  "generatedAt": "2026-02-13T05:51:06.822Z"
}