{
  "title": "Propane_heater_4 PS3 2",
  "category": "physical-science",
  "imageFile": "propane_heater_4-PS3-2.jpg",
  "imagePath": "images/physical-science/propane_heater_4-PS3-2.jpg",
  "content": "# Engineering Design Challenge: Radiant Heat Barrier\n\n---\n\n### Visible Elements in Photo\n\n- **Perforated metal sheets** (orange/red colored, arranged in a grid pattern with small holes throughout)\n- **Gray support frame or backing** holding the perforated sheets in place\n- **Dark lower section** (likely a heat source or reflective chamber beneath the perforated material)\n- **Blue and orange light** visible in the lower chamber area\n- **Vertical dividers** creating distinct panels within the structure\n\n---\n\n### Reasonable Inferences\n\n1. **From the perforated metal sheets**: This structure is designed to allow air or heat to pass through while protecting or directing that heat—common in heating appliances like space heaters or broilers.\n2. **From the blue and orange light in lower chamber**: A heat source (likely flame or heating element) is present below, suggesting this device generates radiant heat upward through the perforations.\n3. **From the repeating grid pattern**: The holes are uniformly sized and distributed, which indicates the design controls heat distribution and intensity across the surface area.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nDesign a **heat shield** that lets warm air come through but keeps things safe. You have materials like paper, cardboard, and foil. Make a pattern of holes in your shield. Test it by holding your hand near a warm (not hot!) surface with and without your shield. Does your pattern work? Can you feel the heat? Is it gentler with your shield?\n\n**3-5 Version:**\n**Challenge**: Design a perforated heat diffuser that distributes radiant heat evenly across a surface while reducing peak temperature at any single spot.\n\n**Constraints:**\n- Use a sheet of rigid material (foam board, cardboard, or plastic) as your backing.\n- Create a pattern of holes (minimum 20 holes) that allows heat transfer but blocks direct radiation.\n- The diffuser must be at least 6 inches × 6 inches.\n- Test with a heat source placed 4 inches below your design.\n\n**Success Criteria:**\n- Measure surface temperature at 5 different points on top of your diffuser using a non-contact thermometer.\n- The temperature difference between the hottest and coolest spots should be less than 15°C.\n- The diffuser must survive testing without melting, cracking, or warping.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits best because students are viewing a real-world solution (a heat diffuser) and need to first understand *why* such a design exists—what problem does uniform heat distribution solve? Students ask: \"Why are the holes there? What is this protecting? How can we design something similar?\" The perforated structure itself provides visual evidence of a real engineering problem worth solving.\n\n---\n\n### Suggested Materials\n\n1. **Foam board or rigid cardboard sheets** (backing material)\n2. **Drill with bits** or a hole punch (for creating perforations)\n3. **Non-contact thermometer or thermal strips** (for temperature testing)\n4. **Heat source** (safe option: heat lamp, warm water bath, or approved space heater at a distance)\n5. **Ruler and markers** (for planning hole placement and documenting results)\n\n---\n\n### Estimated Time\n\n**K-2**: 40–50 minutes (design sketch 10 min, building 20 min, testing & discussion 15 min)\n\n**3-5**: Two 45-minute sessions (Session 1: research, sketching, & prototype building; Session 2: testing, data collection, & refinement)\n\n---\n\n### Why This Works for Teachers\n\nThis challenge directly supports **NGSS ETS1.A** (defining and delimiting engineering problems) by asking students to identify how a perforated structure solves a real heat-transfer problem, then apply that insight to design their own solution.",
  "inputTokens": 2180,
  "outputTokens": 884,
  "cost": 0.0066,
  "generatedAt": "2026-02-12T20:37:48.821Z"
}