{
  "title": "Propane_heater_4 PS3 2",
  "category": "physical-science",
  "imageFile": "propane_heater_4-PS3-2.jpg",
  "imagePath": "images/physical-science/propane_heater_4-PS3-2.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Exploring Heat and Light Energy\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Heat energy** – The glowing red-orange color indicates thermal energy being released and radiated from a heat source (propane heater with exposed burner coils).\n- **Light energy** – The bright glow visible against the darker background demonstrates light being produced and radiating outward; the mesh holes create a pattern of light transmission.\n- **Energy transformation** – The photograph shows chemical energy (from fuel burning) converting into thermal energy (heat) and radiant light energy (visible glow).\n- **Properties of materials** – The metal mesh material has a specific structure (perforated design) that allows heat and light to pass through while providing support for the heating element; different materials interact with heat and light differently.\n\n---\n\n### Lesson Title\n\n**Glowing Hot: How Heat and Light Travel**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** 60–90 minutes (single 90-minute session or two 45-minute sessions)\n- **NGSS Standards Addressed:**\n  - 3-PS3-2 (*Make observations to construct an evidence-based account of how an object can be seen only when light is available to illuminate it*)\n  - 3-PS3-3 (*Design and build a device that uses light or sound to solve the design problem of alerting other people to the weather*)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** how heat sources produce light energy that we can see and feel.\n2. **Identify and explain** that light travels outward from a source and that different materials interact with light in different ways (some block light, some let it through).\n3. **Predict and test** how the structure of a material (like holes or mesh) affects whether light and heat can pass through it.\n4. **Construct a simple explanation** of how thermal energy (heat) and light energy are related and both come from the same source (the glowing burner).\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about heat and light by examining the photograph and connecting to familiar experiences.\n\n**Materials:**\n- Printed or projected photograph of the propane heater (large enough for all students to see clearly)\n- Chart paper or whiteboard for recording student ideas\n\n**Activity:**\n\n1. **Display the photograph** on a screen or large poster without any introduction. Give students 30 seconds to look silently and observe.\n\n2. **Ask these discussion questions** (pause after each to allow 3–4 students to respond):\n   - \"What do you notice that is *bright* or *glowing* in this picture? What color is the glow?\"\n   - \"Why do you think this object is making light? What could be causing that glow?\"\n   - \"If you could touch this glow, what do you think it would feel like? Why?\"\n   - \"Have you ever seen something glow like this before? Where?\"\n\n3. **Make a Wonder Wall:** Invite students to complete this sentence:\n   - \"I wonder... *why does this heater glow red and orange?*\"\n   - \"I wonder... *does light and heat come from the same place?*\"\n   - Record 3–4 student wonders on chart paper.\n\n4. **Connect to student experience:** Ask, \"Has anyone ever felt heat from a lamp, a sunny window, or a fireplace? Tell a neighbor what you felt.\"\n\n**Transition:** \"Today, we're going to become heat and light detectives! We're going to do some tests to discover how heat and light travel, and why some things let light through and others don't.\"\n\n---\n\n#### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate how light travels through different materials and observe the relationship between heat and light.\n\n**Materials:**\n- 1 LED flashlight or lamp per pair of students (or shared as a class demo)\n- Variety of materials to test: clear plastic wrap, wax paper, newspaper, aluminum foil, construction paper, cotton fabric, mesh strainer or kitchen sieve, clear glass, frosted plastic sheet\n- White poster board or white wall space\n- Masking tape\n- Notebooks or observation sheets with simple drawings of materials to check off\n\n**Activity:**\n\n**Part A: Light Travel Investigation**\n\n1. **Darken the room** (partially, if possible).\n\n2. **Demonstrate the setup:** Hold up the LED flashlight. Shine it at the white poster board so students can see a bright circle of light. Say: \"Watch what happens when I put different things in front of the light.\"\n\n3. **Provide student pairs with the light source.** Have them take turns placing materials in front of it and observing what happens on the poster board:\n   - Does light shine through? (Bright, dim, or blocked?)\n   - What color does the light appear?\n   - Can they see through the material clearly, or is it blurry?\n\n4. **Student recording:** Provide a simple chart:\n   - Material name | Light shines through? (Yes/A little/No) | What we see\n   - Students draw quick pictures or check boxes.\n\n5. **Observation prompt:** \"Which materials let *lots* of light through? Which materials *block* the light? Why do you think that happens?\"\n\n**Part B: Heat and Light Connection (Teacher Demonstration)**\n\n1. **Show a working lamp with an incandescent or halogen bulb** (if available and safe). *Note: Use extreme caution; do not allow students to touch.*\n\n2. **Ask:** \"What do you see? What do you feel?\"\n\n3. **Explain:** \"Both light and heat are coming from the same bulb. The filament (glowing wire) is making both at the same time.\"\n\n4. **Return to the photograph:** \"The heater in the picture works the same way—the burner coils are making light (we see the glow) and heat (we feel the warmth).\"\n\n**Teacher Role:**\n- Circulate among pairs, asking guiding questions: \"What's different about this one compared to the last? Can you see through it the same way?\"\n- Encourage students to use descriptive words: bright, dim, clear, blurry, dark.\n- Prompt thinking: \"Why do you think some materials let light through and others don't?\"\n- Do *not* tell students the answers; instead, ask them to look closely and describe what they observe.\n\n**Expected Student Outcomes:**\n- Students should discover that clear materials let light through, while opaque (solid, dark) materials block light.\n- Students should notice that materials with holes (mesh, wax paper) let *some* light through but make it dimmer or create a pattern.\n- Students should make a connection between the glowing heater and the glowing light bulb—both produce light and heat together.\n- Students should record observations in pictures and simple words.\n\n---\n\n#### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Build shared understanding of heat and light energy using vocabulary and direct connection to the photograph.\n\n**Materials:**\n- Chart paper or whiteboard\n- Photographs of the heater (printed copies for students, one per pair or small group)\n- Picture cards showing: sun, lamp, fire, heater, flashlight\n- Simple diagram showing light rays traveling outward from a source (teacher-prepared)\n\n**Activity:**\n\n1. **Share-Out from Explore:**\n   - Ask 3–4 pairs to report one discovery: \"What did you learn about how light travels through different materials?\"\n   - Record responses on the board in a simple T-chart:\n     - **Light shines through** | **Light gets blocked**\n     - Clear plastic | Aluminum foil\n     - Mesh strainer | Construction paper\n     - Glass | Newspaper\n\n2. **Introduce key vocabulary** using the photograph as a visual anchor:\n\n   **Vocabulary with definitions:**\n   - **Heat energy:** Energy that makes things warm. We can *feel* heat. (Point to the glowing red coils: \"The burner coils are making heat.\")\n   - **Light energy:** Energy that we can *see*. Light travels in straight lines from a source. (Point to the glow: \"We see the bright orange glow—that's light energy.\")\n   - **Light source:** Something that makes light. (Examples: sun, lamp, fire, flashlight, the heater burner.)\n   - **Thermal energy:** Another word for heat energy. Heat comes from a light source that is very, very hot.\n   - **Transparent:** A material that lets light shine through so we can see clearly. (Example: clear plastic.)\n   - **Opaque:** A material that blocks light so we can't see through it. (Example: aluminum foil.)\n\n3. **Make explicit connections:**\n   - Display the photograph again. Say: \"Look at this heater. The red and orange parts are *so hot* that they make light—they glow! The heat and light come from the same place.\"\n   - Show picture cards of other light sources (sun, lamp, fire, flashlight). Ask: \"Do all of these make light? Do any of them make heat too?\" Guide students to see that hot things often make light.\n\n4. **Explain light rays (age-appropriate):**\n   - Use the simple diagram: Draw a light source with arrows pointing outward in all directions.\n   - Say: \"Light travels *away* from the source, like ripples in water. It goes in all directions.\"\n   - Refer to their Explore: \"When we put materials in front of the light, some materials let those light rays pass through, and some block them.\"\n\n5. **Check for Understanding:**\n   - \"If I turn off all the lights in this room, will we be able to see the heater in the photograph?\" (No, we need light.)\n   - \"What can you *feel* from a heater like this?\" (Heat/warmth.)\n   - \"What can you *see* from a heater like this?\" (Light/the glow.)\n   - \"Where does the light and heat come from?\" (The hot burner coils.)\n\n**Expected Student Outcomes:**\n- Students should use the terms *heat*, *light*, *light source*, *transparent*, and *opaque* with basic accuracy.\n- Students should explain that light comes from a source and travels outward.\n- Students should connect the glowing photograph to their own experience with lamps, fires, or the sun.\n- Students should understand that heat and light can come from the same source (a hot object).\n\n---\n\n#### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Apply understanding of light and heat in a new context using a design challenge.\n\n**Materials:**\n- Assorted building materials: cardboard tubes, cups, clear plastic wrap, wax paper, construction paper, aluminum foil, masking tape, scissors\n- LED flashlights or small battery-powered lights (multiple)\n- Open space for building (tables or floor)\n\n**Activity:**\n\n**Design Challenge: Create a \"Light Tunnel\"**\n\n1. **Present the problem:** \"Imagine you want to shine light down a dark hallway, but you want to protect the light source from dust and wind. You need to build a *tunnel* that lets light travel through it, but you also want to be able to *see* the light on the other side. What materials would you use?\"\n\n2. **Student task:**\n   - Students work in pairs or small groups.\n   - They build a simple tube or tunnel using cardboard tubes and one material that lets light through (clear plastic wrap, wax paper, tissue paper, or frosted plastic).\n   - They place a flashlight inside the tunnel and observe how much light shines through.\n   - They test 2–3 different materials and decide which one works *best* (lets the most light through) and *why*.\n\n3. **Student recording:**\n   - Sketch the tunnel they built.\n   - Record: \"Which material lets the most light through? Why?\"\n   - Predict: \"What would happen if we used aluminum foil instead? Why?\"\n\n4. **Share results:** Have pairs show their tunnels and explain their choices. Ask: \"Why does this material work better than that one?\"\n\n5. **Connect back to the heater:** \"The mesh on the heater lets light and heat escape. What if the designers used different materials? How would it change what we see?\"\n\n**Teacher Role:**\n- Ask questions that push thinking: \"What happens if you use two layers instead of one?\" \"Does the color of the material matter?\"\n- Encourage testing and revision: \"Your first tunnel didn't work well—what could you change?\"\n- Facilitate the share-out by asking peers: \"Do you agree? Why or why not?\"\n\n**Expected Student Outcomes:**\n- Students should successfully build a light tunnel and recognize that transparent materials are needed.\n- Students should articulate reasons for their material choices: \"Light shines through this better.\"\n- Students should make predictions about alternative materials based on their understanding of transparent vs. opaque.\n- Students should transfer the concept from the photograph (heater mesh) to their own design.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Determine whether students have met the learning objectives through formative and summative assessment.\n\n**Materials:**\n- Exit ticket sheet (printed or digital)\n- Observation notes from Explore and Elaborate phases\n- Original photograph of the heater\n- Student notebooks from throughout the lesson\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout lesson):**\n- Observe student discussions during Engage: Do students show curiosity and ask questions?\n- Monitor Explore activity: Are students testing materials and describing observations accurately?\n- Listen to student explanations in Explain: Are they using vocabulary correctly? Do they show understanding of the connection between heat and light?\n- Observe Elaborate: Can students apply their understanding to a new design challenge? Do they justify their material choices?\n\n**Summative Assessment: Exit Ticket**\n\n**Provide students with this exit ticket (read aloud; allow drawing or writing):**\n\n1. **Look at this picture of the heater again.** (Show the photograph.)\n   - \"Draw a circle around the part that is making light. Draw a square around the part that lets light shine through.\"\n\n2. **Fill in the blank:**\n   - \"The heater is glowing because the coils are very _______. (cold / hot)\"\n\n3. **True or False:**\n   - \"Light and heat come from the same place in the heater.\" (True/False)\n   - \"Aluminum foil lets light shine through clearly.\" (True/False)\n\n4. **Draw and explain:**\n   - \"Draw a material that lets light shine through. Tell why you chose it.\"\n\n**Success Criteria:**\n\nStudents demonstrate mastery if they:\n- ✓ Correctly identify the glowing coils as the light source\n- ✓ Understand that heat (high temperature) creates light\n- ✓ Recognize that light and heat come from the same source\n- ✓ Classify materials as transparent or opaque with accuracy\n- ✓ Explain their thinking using words like *heat*, *light*, *light source*, and *transparent*\n- ✓ Apply their understanding to the design challenge (Elaborate)\n\n**Expected Student Outcomes:**\n- Most third graders should score 4–5 out of 6 on the exit ticket to show proficiency.\n- Students who answer all questions correctly and provide detailed drawings/explanations show advanced understanding.\n- Students who struggle with material classification or the heat-light connection will need follow-up discussion and re-teaching (see Support strategies in Differentiation).\n\n---\n\n### Differentiation\n\n**Support (for students who struggle):**\n\n1. **Scaffold material testing in Explore:**\n   - Pre-select 3 materials instead of 6–8 (e.g., clear plastic, foil, wax paper).\n   - Pair struggling students with a strong partner for hands-on work.\n   - Provide a simplified observation sheet with pictures of materials and checkboxes: \"Did light shine through? Yes / A little / No\"\n\n2. **Provide sentence frames for explanations:**\n   - \"The light shined through the _______ because it is _______.\"\n   - \"I think the heater glows because _______.\"\n   - Allow students to respond in drawings with teacher scribing.\n\n3. **Use repeated, concrete examples:**\n   - Return to the photograph multiple times.\n   - Compare to familiar items: \"Is this flashlight like the heater? Both have light and heat.\"\n   - Use a physical heater or heat lamp (safely, with supervision) to let students *feel* the heat alongside seeing the light.\n\n**Challenge (for advanced learners):**\n\n1. **Extend the design challenge:**\n   - \"Design a light tunnel that lets light through *and* keeps heat in. What materials would you use? Why?\"\n   - Ask students to draw a diagram showing how light travels through their tunnel, using arrows.\n   - Have them predict: \"If we made the tunnel longer, would more or less light shine at the end? Why?\"\n\n2. **Introduce the concept of light absorption:**\n   - \"Dark colors absorb (take in) more heat and light. Light colors reflect (bounce back) more light. Test this with light and dark construction paper under a lamp.\"\n   - Have students hypothesize: \"Which color would be better for a heater's exterior? Why?\"\n\n3. **Real-world connection:**\n   - \"Some houses have windows with special coatings to let light in but keep heat from escaping. Why would that be useful?\"\n   - Have students brainstorm other objects that use light and heat (ovens, toasters, etc.) and sketch how they work.\n\n---\n\n### Extension Activities\n\n**For early finishers, homework, or follow-up lessons:**\n\n1. **\"Heat and Light Hunt\" (take-home activity):**\n   - Students go home and find 5 objects that make heat and/or light (lamp, heater, oven, sun through window, etc.).\n   - They draw each one and label: \"Gives heat,\" \"Gives light,\" or \"Gives both.\"\n   - They bring drawings back to share with the class.\n   - **NGSS connection:** Observe and describe natural and artificial heat/light sources in the real world.\n\n2. **\"Shadow Detective\" (follow-up lesson, 20–30 minutes):**\n   - Bring the photograph back. Ask: \"Do you see any shadows? Where is the light source? Where is the shadow?\"\n   - Conduct an investigation: Shine a flashlight on objects and use opaque materials to create shadows on a wall.\n   - Students predict what happens when they move the light source closer, farther, or to the side.\n   - **NGSS connection:** Understand that objects can be seen only when light is available; light creates shadows.\n\n3. **\"Design Your Own Safe Heater\" (engineering project, 30–40 minutes):**\n   - Show students pictures of different heater designs (industrial heater, home space heater, etc.).\n   - Present the challenge: \"Design a heater grill that protects people from touching the hot coils but still lets light and heat out so the heater works. Sketch your design and explain your material choices.\"\n   - Students create a labeled diagram with a written explanation.\n   - **NGSS connection:** Design and build a device; apply scientific ideas to solve a real-world problem.\n\n---\n\n## Summary\n\nThis 5E lesson uses the photograph of the glowing propane heater as a concrete, visual anchor for exploring the concepts of heat energy, light energy, and how different materials interact with light. By progressing from observation (Engage), to hands-on investigation (Explore), to explicit vocabulary and concept-building (Explain), to application in a design context (Elaborate), and finally to assessment (Evaluate), students develop a robust, age-appropriate understanding of these foundational physical science ideas. The lesson is highly scaffolded for third graders and includes multiple entry points for differentiation, ensuring all learners can access and build on the core concepts.",
  "inputTokens": 2886,
  "outputTokens": 4633,
  "cost": 0.026050999999999998,
  "generatedAt": "2026-02-12T21:02:10.204Z"
}