{
  "title": "Properties Of Matter",
  "category": "physical-science",
  "imageFile": "properties_of_matter.jpg",
  "imagePath": "images/physical-science/properties_of_matter.jpg",
  "content": "# Engineering Design Challenge: Car Fluid Management System\n\n---\n\n### Visible Elements in Photo\n- A translucent plastic reservoir (coolant or fluid container) with a black screw cap and yellow liquid inside\n- Multiple rubber hoses with metal connectors/clamps attached to engine components\n- A small pink/purple LED illuminated container (upper left) with blue top\n- Dark engine block and mechanical components\n- Metal clamps securing hoses to the system\n\n---\n\n### Reasonable Inferences\n- **From the yellow fluid and sealed container**: Fluids must be stored safely and transferred through a closed system without leaking, suggesting a need for secure connections and proper containment.\n- **From the hoses and clamps**: Flexible tubing needs to be held firmly in place under pressure, implying that fastening mechanisms are critical to system function.\n- **From the LED container**: Some fluids or systems require monitoring or visual indication of status, suggesting a need for indicator feedback.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nYou are a car engineer! Your job is to build a **fluid path** using tubes and connectors that moves water from one container to another without spilling. Use tape, clamps, or clips to hold your tubes in place so they don't wiggle loose. Can you keep all the water inside the tubes from start to finish?\n\n**3-5 Version:**\nDesign a **closed fluid transfer system** that moves liquid from a source reservoir to a destination container using flexible tubing and at least two secure attachment points (clamps or clips). Your system must:\n- Transfer 500 mL of water without any visible leaks at connection points\n- Keep all tubing secured so it does not shift or disconnect when gently tugged\n- Use only gravity or hand-pump pressure (no external power)\n- Be testable and reusable for at least 3 cycles\n\nSuccess = zero spillage, secure connections, and repeatable performance.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real-world fluid management system with a clear engineering need: safely storing and transferring liquids under constraints. Students can observe *why* engineers need hoses, clamps, and sealed containers—answering \"What problem does this solve?\" before designing their own version. The visible problem (preventing leaks in pressurized systems) makes this perfect for the **Ask phase**, where students identify the core challenge before imagining solutions.\n\n---\n\n### Suggested Materials\n1. **Clear plastic tubing** (aquarium tubing, 1/2″ diameter) or rubber hose scraps\n2. **Two plastic bottles or containers** (1-liter milk jugs or recycled containers)\n3. **Metal hose clamps or cable ties** (to secure tubing)\n4. **Tape** (duct tape, electrical tape, or athletic tape)\n5. **Water** and a **funnel** (for filling and testing)\n\n*Optional*: Small hand-pump or syringe (to add pressure simulation for older grades)\n\n---\n\n### Estimated Time\n**45–60 minutes**\n- Ask phase (problem identification): 10 min\n- Design & build: 25–30 min\n- Test & debug: 15–20 min\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) by having students recognize why real machines need sealed, secured fluid systems—and then apply that understanding to their own design, making abstract material science concrete and relevant.",
  "inputTokens": 2330,
  "outputTokens": 791,
  "cost": 0.006285000000000001,
  "generatedAt": "2026-02-09T13:43:10.153Z"
}