{
  "title": "Rainbow Refraction",
  "category": "physical-science",
  "imageFile": "rainbow_refraction.jpg",
  "imagePath": "images/physical-science/rainbow_refraction.jpg",
  "content": "### Visible Elements in Photo\n\n- A rainbow arcing across a partly cloudy sky\n- Paved roads in two directions with vehicles\n- Green grass and landscaped trees lining both sides of the road\n- Street lights (one on each side visible)\n- Clear evidence of rain having just fallen (wet pavement)\n\n### Reasonable Inferences\n\n- **From rainbow + wet pavement**: Water droplets are still suspended in the air or clinging to surfaces; sunlight is hitting them at a specific angle to create the visible spectrum.\n- **From landscape design**: This appears to be a park or recreation area where people gather; water management and drainage systems are in place underground to handle rainfall.\n- **From street lights + roadway**: This is a human-built space designed for safety and visibility, which requires light sources that must work during and after weather events.\n\n### Engineering Task\n\n**K-2 Version:**\nMake a rainbow using water and light! Your job is to create your own rainbow in the classroom or outside. You can use a spray bottle, a hose, a cup of water, or a mirror. Try different spots and times of day. When do you see the colors best? Which colors can you spot?\n\n**3-5 Version:**\nDesign and build a **water-dispersal system** that creates a visible rainbow under controlled conditions. Your system must:\n- Use only water, a light source (sunlight or flashlight), and simple materials (spray bottle, clear container, or hose).\n- Produce a rainbow visible from at least 1 meter away.\n- Work consistently when tested 3 times in a row.\n- Include a written prediction of the best angle between the water droplets, light source, and observer's eye (approximately 42°).\n\nTest your design indoors and outdoors. Which location works better? Why?\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This photo shows a natural phenomenon (rainbow) that appears after a real-world event (rain). Students benefit from first observing and questioning *why* rainbows appear and *when* they can be seen, rather than jumping to a solution. This grounds the engineering challenge in curiosity about light and water.\n\n### Suggested Materials\n\n- Spray bottles or spray hose\n- Clear water in cups or containers\n- Mirrors (optional, for redirecting light)\n- Flashlights or access to direct sunlight\n- White paper or white poster board (to view the rainbow against)\n- Measuring tape (to document viewing distance)\n\n### Estimated Time\n\n**45–60 minutes** (one class period): Includes initial observation/questioning (10 min), design planning (10 min), building and testing (20 min), and reflection on results (10 min).\n\nFor deeper exploration across two sessions, add 20–30 minutes for outdoor testing and angle measurements.\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem*) by asking students to observe a natural light phenomenon and engineer a way to reproduce it under controlled conditions, connecting physics, optics, and systems thinking.",
  "inputTokens": 2329,
  "outputTokens": 696,
  "cost": 0.005809,
  "generatedAt": "2026-02-09T13:44:09.623Z"
}