{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Shadows and the Sun's Energy\n\n### Core Science Concepts from Image Analysis\n\n- **Light travels in straight lines:** The shadow cast by the rock is a direct result of light from the sun traveling in a straight path and being blocked by the object, creating a dark shape on the ground.\n- **Shadows reveal the position and movement of the sun:** The length and direction of the shadow indicate the time of day and the sun's position in the sky, demonstrating how solar energy reaches Earth at different angles.\n- **The sun's energy warms objects and creates observable effects:** The rock surface shows color variations and weathering patterns caused by the sun's heat and energy exposure over time, visible through the moss and lichen growth.\n- **Materials have different properties that affect how they interact with light and energy:** The rock's dense, solid composition blocks light completely, while the grass and moss surrounding it absorb or reflect light differently.\n\n---\n\n### Lesson Title\n\n**Catching Shadows: How Sunlight Creates Energy and Shapes Our World**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 50-minute sessions (100 minutes total)\n- **NGSS Standards:** \n  - 5-PS3-1: Use models to describe that energy in animals' food (used for body repair, growth, motion, and to maintain body warmth) was once energy from the sun.\n  - 5-PS1-3: Make observations and measurements to identify materials based on their properties.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- **Explain** that the sun's energy travels to Earth in straight lines and can be blocked by objects to create shadows.\n- **Use evidence** from observations to describe how the sun's energy affects different materials on Earth's surface (rocks, plants, soil).\n- **Design and conduct** an experiment to measure how shadows change throughout the day, demonstrating the sun's movement and energy delivery.\n- **Support an argument** that all energy for life on Earth, including the energy that sustains plants and animals, originally comes from the sun's light energy.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about sunlight, shadows, and energy.\n\n**Materials:**\n- Photograph of the rock with shadow (displayed via projector or printed copies)\n- Index cards\n- Pencils\n- Direct sunlight or a flashlight (for demonstration)\n\n**Activity:**\n\n1. **Display the photograph** on the projector or distribute printed copies to each pair of students. Ask students to observe for 30 seconds in silence, noticing everything they see.\n\n2. **Facilitate a discovery discussion** using these guiding questions:\n   - \"What do you notice in this photograph? What stands out to you?\" (Accept all responses: rock, shadow, grass, moss, colors, etc.)\n   - \"Where do you think this shadow came from? What created it?\" (Lead toward the sun without providing the answer.)\n   - \"If I told you this photo was taken at noon on a sunny day, where would you expect the shadow to be? Why?\" (Activate thinking about sun position and light direction.)\n   - \"What has happened to this rock over a long time to make it look this way? What role might sunlight play?\" (Connect to weathering and energy effects.)\n\n3. **Prediction prompt:** \"I'm going to show you how shadows work right now. Watch carefully, and then tell me: What do you predict will happen to a shadow if the light source moves?\" \n\n4. **Quick demonstration:** Use a flashlight or position yourself in direct sunlight. Hold your hand up and move the light source around it (or move your hand relative to sunlight). Show how the shadow changes position and size.\n\n5. **Have students record on index cards:** \"What I wonder about shadows and the sun...\" (2-3 sentences). Collect these to revisit during Explain phase.\n\n**Transition:** \"Today, you're going to become shadow detectives. We're going to investigate how shadows work, what they tell us about the sun's energy, and why the sun is so important to life on Earth.\"\n\n---\n\n#### 2. EXPLORE (25 minutes)\n\n**Objective:** Students investigate shadows firsthand and discover the relationship between light, objects, and shadows.\n\n**Materials:**\n- Flashlights (1 per pair of students)\n- Small objects with different shapes (blocks, balls, cups, pencils, coins)\n- White paper or poster board (1 per pair)\n- Rulers\n- Tape\n- Protractors (optional, for advanced students)\n- Outdoor access or large room with windows for natural sunlight\n- Colored pencils or markers\n- Data recording sheets (provided below)\n\n**Activity:**\n\n**Part A: Indoor Shadow Investigation (15 minutes)**\n\n1. **Pair up students.** Distribute materials.\n\n2. **Explain the task:** \"You're going to use a flashlight to create shadows of different objects and measure how the shadow changes when you move the light.\"\n\n3. **Step-by-step directions for students:**\n   - Place one object on white paper.\n   - Shine the flashlight directly over the object (light source directly above). Trace the shadow with a colored pencil.\n   - Move the flashlight to the side (at an angle). Trace the new shadow with a different color.\n   - Move the flashlight very low (almost at ground level). Trace the third shadow.\n   - Measure the length of each shadow with a ruler. Record measurements on the data sheet.\n   - Repeat with 2-3 other objects.\n\n4. **Recording:** Students complete the **Shadow Investigation Data Sheet** with sketches and measurements:\n   - Object name\n   - Shadow length (light directly above)\n   - Shadow length (light at an angle)\n   - Shadow length (light at ground level)\n   - Observations: Which position made the longest shadow? Why do you think that happened?\n\n5. **Discussion during activity:** As students work, ask questions without giving answers:\n   - \"What's different about the shadows as you move the light?\"\n   - \"Why do you think the angle of light affects the shadow?\"\n   - \"Does every object make the same kind of shadow? What's different?\"\n\n**Part B: Outdoor Shadow Observation (10 minutes, if time permits; otherwise assign as homework)**\n\n1. If outdoors in sunlight, students go outside and observe their own shadows:\n   - Notice the direction of their shadow.\n   - Estimate the length (using body height as a reference).\n   - Observe shadows of other objects (trees, buildings, playground equipment).\n   - Discuss: \"How is the shadow created by sunlight different from the shadows we made with flashlights?\"\n\n**Teacher Role:**\n\n- Circulate and facilitate without giving answers. Use questions to guide thinking.\n- Ensure students are recording observations and measurements accurately.\n- Prompt students to compare their shadows: \"What do you notice? Are all shadows the same length? Why or why not?\"\n- Encourage predictions: \"If we move the light even more, what will happen to the shadow?\"\n\n**Expected Student Outcomes:**\n\n- Students discover that shadows form when light is blocked by an object.\n- Students observe that shadow size and position change based on the light source's angle and distance.\n- Students collect data showing the relationship between light angle and shadow length.\n- Students begin to infer that the sun's position in the sky would affect shadows at different times of day.\n\n---\n\n#### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts about light energy, shadows, and the sun's role in Earth systems.\n\n**Materials:**\n- Student shadow data sheets from Explore phase\n- Chart paper or whiteboard\n- Diagram of Earth and sun (showing light rays)\n- Photograph of the rock (displayed again)\n- Vocabulary cards with images\n- Samples of weathered vs. unweathered rock (if available) or photos\n\n**Activity:**\n\n1. **Share-out from Explore (5 minutes):**\n   - Call on 2-3 pairs to share their findings: \"What did you discover about how shadows change?\"\n   - Record responses on chart paper.\n   - Highlight the key discovery: \"The angle of light changes the size and position of the shadow.\"\n\n2. **Introduce formal vocabulary and concepts (8 minutes):**\n\n   **Vocabulary:**\n\n   - **Light energy:** Energy from the sun or other sources that travels in straight lines and can be seen. It's a type of energy that makes things visible.\n   - **Shadow:** A dark area created when an object blocks light. Shadows form only when there is a light source and an object to block it.\n   - **Light source:** Anything that gives off light (the sun, a flashlight, a lamp, a candle).\n   - **Angle of incidence:** The direction from which light hits an object. When light comes from different angles, it creates shadows of different shapes and sizes.\n   - **Solar energy (or energy from the sun):** The light and heat that comes from the sun. This is the source of energy for almost all life on Earth.\n\n3. **Connect back to the photograph (3 minutes):**\n   - Display the rock photograph again.\n   - Point out the shadow: \"This shadow was created by sunlight hitting the rock at a certain angle. The sun's position in the sky determined where this shadow falls and how long it is.\"\n   - Show the weathered patches on the rock: \"Over many years, the sun's energy has warmed this rock, and it has been weathered by wind and water. You can see moss and lichen growing on parts of it because the sun's energy supports all life, including these plants.\"\n\n4. **Check for understanding (2 minutes):**\n   - Ask: \"Can a shadow exist without light?\" (Students should say no.)\n   - Ask: \"Why do you think the rock in our photo has moss and plants growing on and around it?\" (Lead toward: The sun's energy supports plant growth.)\n   - Ask: \"If the sun moved in the sky, what would happen to this rock's shadow?\" (Position and length would change.)\n\n**Expected Student Outcomes:**\n\n- Students understand that shadows are created when light is blocked by objects.\n- Students can explain that the angle of light affects shadow size and direction.\n- Students recognize the sun as the primary energy source.\n- Students begin to connect the sun's energy to supporting life (plants, animals).\n\n---\n\n#### 4. ELABORATE (22 minutes)\n\n**Objective:** Students apply understanding of light energy and shadows to a real-world investigation tracking shadow movement over time.\n\n**Materials:**\n- Chalk or markers\n- Sunny outdoor location with a clear surface (sidewalk, blacktop, grass)\n- Sticks or small objects to create a focal point\n- Meter sticks or measuring tapes\n- Time recording sheets\n- Cameras or phones to document (optional)\n\n**Activity:**\n\n**Shadow Tracking Over Time**\n\n1. **Set up the investigation:** Take students outdoors to a sunny location. Select a clear, open area where shadows will be clearly visible throughout the session.\n\n2. **Establish a shadow reference point:**\n   - Push a stick (6-12 inches tall) into the ground or use a small object as a marker.\n   - Explain: \"We're going to track how this shadow moves and changes. This will show us how the sun moves across the sky.\"\n\n3. **Initial measurement (5 minutes):**\n   - Students measure the shadow length and direction from the stick using a meter stick.\n   - Record: time, shadow length, and direction (use compass directions or relative descriptions: \"pointing toward the building,\" \"pointing toward the playground,\" etc.).\n   - If possible, mark the shadow outline with chalk or tape.\n   - Take a photo or have a student draw the shadow.\n\n4. **Wait and repeat (12-15 minutes):**\n   - Return to the same location 15-20 minutes later (or use observations from earlier/later in the day if time is limited).\n   - Measure the shadow again.\n   - Record the new time, length, and direction.\n   - Compare: \"Did the shadow move? In which direction? Did it get longer or shorter?\"\n   - Discuss the observations: \"Why is the shadow different now?\"\n\n5. **Analysis and conclusion (5 minutes):**\n   - Graph or chart the shadow measurements (length vs. time).\n   - Conclusion prompt: \"What does our data tell us about the sun? How is the sun's position changing?\" (The sun appears to move across the sky, and shadows move with it.)\n   - Connect to energy: \"As the sun moves, its energy hits Earth at different angles. This is why shadows change throughout the day, and it's why the sun's energy reaches different parts of Earth at different times and with different intensities.\"\n\n6. **Return to the rock photo:**\n   - Show the original photograph again.\n   - Ask: \"If we were to look at this rock at a different time of day, how would the shadow be different? Why?\"\n   - Prompt: \"The sun's energy is constantly delivering light and heat to Earth. That energy supports everything—plants grow because of it, animals eat those plants, and we eat both plants and animals. Where did all that energy come from originally?\" (Answer: the sun.)\n\n**Teacher Role:**\n\n- Facilitate the measurements and data recording.\n- Ask guiding questions: \"Is the shadow moving toward or away from [reference point]? Is it getting longer or shorter? What does that tell us about the sun's position?\"\n- Help students make the connection: \"The sun's energy not only creates shadows—it powers life on Earth.\"\n\n**Expected Student Outcomes:**\n\n- Students collect data showing shadow movement over time.\n- Students discover that shadows move and change as the sun's position changes.\n- Students infer that the sun travels across the sky during the day.\n- Students connect shadow movement to the continuous delivery of solar energy to Earth.\n- Students articulate that the sun is the ultimate energy source for life on Earth.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of light energy, shadows, and the sun's role as Earth's primary energy source.\n\n**Formative Assessment (Throughout the Lesson):**\n\n- **Observation during Explore:** Monitor student measurements and ask clarifying questions. Do students recognize that light angle affects shadow size?\n- **Discussion responses in Explain and Elaborate:** Listen for evidence that students understand the sun as an energy source and shadows as results of blocked light.\n- **Data recording accuracy:** Review student data sheets for correct measurements and reasonable observations.\n\n**Summative Assessment (Exit Ticket):**\n\nProvide each student with an **Exit Ticket** with the following questions:\n\n1. **Explain in 2-3 sentences: How is a shadow created? What has to happen?**\n   - Success criteria: Student mentions light, object blocking light, and light being unable to reach an area.\n\n2. **Look at this drawing.** [Show a simple diagram: sun, earth, and rays of light.]\n   **The sun sends energy to Earth in the form of light. Circle or label where shadows would form on Earth. Explain your answer.**\n   - Success criteria: Student circles areas facing away from the sun or areas where objects block light; explanation shows understanding that shadows form where light is blocked.\n\n3. **Why is the sun's energy important for animals? (Think about what animals eat and where that food comes from.)**\n   - Success criteria: Student mentions plants, plants need sunlight, animals eat plants (or animals eat animals that eat plants), therefore sun's energy supports all life.\n\n**Alternative Assessment Options:**\n\n- **Quick sketch-and-label:** Students draw the rock from the original photograph, label the shadow, the sun's direction, and identify which parts have moss/plants. Explain why plants grow where they do relative to sunlight.\n- **Partner explanation:** Pair students; one student explains how shadows work to the other without using the word \"light.\" Partner must guess what the explanation is about.\n- **Mini-poster:** Students create a \"Why Shadows Matter\" poster that shows: (1) how shadows form, (2) how shadow position changes with the sun, and (3) how the sun's energy supports life.\n\n**Success Criteria for Meeting Learning Objectives:**\n\n- ✓ Students can explain that shadows form when light is blocked by an object.\n- ✓ Students can describe how the angle of light affects shadow size and position.\n- ✓ Students can provide evidence (from their measurements or observations) that shadows change as the sun moves.\n- ✓ Students can connect the sun's light energy to supporting life on Earth (through plant growth and food chains).\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified data sheet:** Provide a data collection sheet with visual aids (pictures of angles) and pre-written sentence frames:\n   - \"The light was pointing [direction]. The shadow was [length] long.\"\n   - \"When I moved the light, the shadow became [longer/shorter] because ___.\"\n   - Reduce the number of objects to test (start with 2 instead of 4).\n\n2. **Peer pairing:** Assign struggling learners to work with a patient, capable peer during Explore phase. The partner helps with measurements while the struggling learner focuses on observations and predictions.\n\n3. **Vocabulary anchor chart:** Create a visual vocabulary anchor chart with pictures and simple definitions posted in the classroom. Allow students to reference it during all phases.\n\n4. **Concrete demonstration:** Before students begin their own investigations, conduct a detailed teacher-led shadow demonstration with a large object, so students understand the procedure and expectations.\n\n**Challenge (For Advanced Learners):**\n\n1. **Calculate angles:** Provide advanced students with protractors during the Explore phase. Have them measure and calculate the angle of incidence (the angle at which light hits the object) for each shadow position. Create a graph showing the relationship between angle of incidence and shadow length.\n\n2. **Shadow length vs. sun angle over a full day:** Challenge students to collect shadow data at multiple times throughout the day (if possible with a classroom stick or object) and graph how shadow length changes from morning to afternoon. Have them predict what shadow length would be at sunrise vs. sunset.\n\n3. **Research extension:** Assign students to research why shadows are different lengths at different latitudes on Earth (due to the sun's angle relative to the horizon). Have them find the latitude of your school and research typical shadow angles for different seasons.\n\n4. **Energy transfer model:** Have advanced students create a detailed model or diagram showing how the sun's energy is transferred to plants through light, then to animals through food, and how that energy is used for growth and movement. Challenge them to label at least three ways energy is transferred.\n\n---\n\n### Extension Activities\n\n1. **Shadow puppet theater:** Students create shadow puppet stories using objects and a light source (flashlight or lamp) to project shadows on a screen or wall. They must explain how the light angle creates different shadow effects and narrate a story involving the character's \"journey\" as shadows change (representing time passing and the sun moving). This reinforces understanding of light direction while adding creativity.\n\n2. **Seasonal shadow investigation:** If this lesson is taught in different seasons, students compare shadow lengths of the same object (e.g., a flagpole or building) at the same time of day across different seasons. They observe and graph how the sun's angle changes with the season, affecting shadow length. This leads to discussions about why some regions have more/less direct sunlight at different times of year.\n\n3. **Sun dial construction:** Students design and build a simple sun dial using a stick, paper circle marked with hours, and a sunny outdoor location. They place the stick in the center and predict how the shadow will move throughout the day as the sun travels across the sky. This real-world application combines shadow tracking with timekeeping and reinforces understanding of solar energy delivery patterns.\n\n4. **Life cycle energy tracking:** Students trace the path of energy from the sun to a specific animal by creating a detailed food chain diagram. Example: Sun → grass (receives light energy, grows) → grasshopper (eats grass, obtains energy) → bird (eats grasshopper, obtains energy) → hawk (eats bird, obtains energy). Each stage should be illustrated and labeled with the energy source.\n\n---\n\n## Appendix: Shadow Investigation Data Sheet\n\n### Shadow Investigation Data Sheet\n\n**Student Names:** _________________ and ________________  \n**Date:** __________________\n\n| Object Name | Shadow Length (Light Above) | Shadow Length (Light at Angle) | Shadow Length (Light Low) | Longest Shadow? |\n|---|---|---|---|---|\n| | | | | |\n| | | | | |\n| | | | | |\n\n**Observations:**\n\n1. Which position made the longest shadow? _____________________\n\n2. Which position made the shortest shadow? _____________________\n\n3. Why do you think the shadow got longer or shorter when you moved the light? \n\n_________________________________________________________________\n\n_________________________________________________________________\n\n4. Did all objects make shadows the same shape? Why or why not?\n\n_________________________________________________________________\n\n_________________________________________________________________\n\n5. What do you wonder about shadows now?\n\n_________________________________________________________________",
  "inputTokens": 285,
  "outputTokens": 4807,
  "cost": 0.0248478,
  "generatedAt": "2026-02-13T07:28:33.528Z"
}