{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "### Core Science Concepts from Image Analysis\n\n- **Light Source and Direction:** The photograph clearly shows a shadow cast by a rock, demonstrating that light travels in a straight line from a source (the sun) and creates a shadow when an object blocks its path.\n- **Object Position Affects Shadow:** The rock's placement and shape determine the size and form of its shadow, showing the relationship between an object's position relative to a light source and the resulting shadow characteristics.\n- **Shadow as Evidence of Light Interaction:** The shadow itself is evidence that light exists and interacts with physical objects, even though light itself cannot be directly seen.\n- **Predictable Patterns in Shadows:** The angle and length of the shadow suggest predictable patterns based on the sun's position, which changes throughout the day and seasons.\n\n---\n\n### Lesson Title\n\n**Shadow Detectives: Tracking How Light and Objects Interact**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** 3-PS2-2 (Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion); 4-PS4-2 (Develop a model to describe that light reflecting from objects and entering the eye allows objects to be seen) — *Note: 3-PS2-2 is the primary standard; shadow observation supports understanding of predictable patterns. While 4-PS4-2 is Grade 4, shadow investigation naturally connects to light concepts appropriate for Grade 3 extension.*\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Make observations and measurements of how shadows change when an object's position relative to a light source changes.\n2. Record data from shadow investigations and identify patterns in how shadows behave.\n3. Use evidence from shadow observations to predict where a shadow will appear under different lighting conditions.\n4. Explain the cause-and-effect relationship between a light source, an object, and the shadow it creates.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by observing the shadow photograph and connecting it to students' own experiences with shadows.\n\n**Materials:**\n- Photograph of the rock and its shadow (displayed on projector or printed large)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board without explanation. Ask students to look carefully for 30 seconds in silence.\n\n2. **Pose these discussion questions to spark curiosity:**\n   - \"What do you notice in this picture? What's different about the area right next to the rock?\"\n   - \"Why do you think there's a darker area on the ground near the rock?\"\n   - \"Where is the sun in this picture? How do you know?\"\n   - \"If we moved the rock to a different spot, what do you think would happen to the dark area (the shadow)?\"\n\n3. **Prediction prompt:** \"I'm thinking about moving this rock to a different location in the same sunny spot. What do you predict will happen to its shadow? Will it get bigger, smaller, stay the same, or disappear?\"\n\n4. **Record student predictions** on chart paper for later reference.\n\n**Transition:** \"Today, we're going to become shadow detectives. We'll investigate how shadows change when we move objects, and we'll try to discover the pattern so we can predict where shadows will appear.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover the relationship between object position, light source, and shadow through hands-on experimentation.\n\n**Materials (per group of 3-4 students):**\n- One flashlight or lamp with a strong beam\n- One small object (rock, block, ball, or cup—use the same object throughout)\n- White paper or poster board\n- Masking tape\n- Ruler (optional, for measurement)\n- Notebook or recording sheet for data\n\n**Activity:**\n\n**Step-by-Step Student Directions:**\n\n1. **Set up your investigation space:** Tape the white paper to a flat surface (table or floor). This is your \"light catching surface.\"\n\n2. **Position the light source:** Place the flashlight or lamp so it shines directly on the paper at a low angle (like the sun in the photograph). Keep the light in the same spot for this entire investigation.\n\n3. **Position 1—Close to the light:** Place your object very close to the light source and observe the shadow cast on the paper. Trace around the shadow with a pencil or marker. Write the date and \"Position 1—Close\" on your tracing.\n\n4. **Position 2—Medium distance:** Move the object to the middle distance from the light source (about 6 inches away if using a flashlight). Observe the new shadow. Trace it on fresh paper or in a different area. Label it \"Position 2—Medium.\"\n\n5. **Position 3—Far from the light:** Move the object as far as possible from the light source while still seeing a clear shadow. Trace this shadow and label it \"Position 3—Far.\"\n\n6. **Observation and comparison:** Look at all three shadow tracings. Talk with your group: \"What changed about the shadows? Did they get bigger or smaller? Why do you think that happened?\"\n\n7. **Record your observations:** Write or draw in your notebook: \"When the object was close to the light, the shadow was _______. When it moved far away, the shadow was _______.\"\n\n**How this connects to the photograph:** Just like the rock in the photo casts a shadow from sunlight, your object casts a shadow from the flashlight. The sun is the light source, and the rock blocks light from reaching the ground.\n\n**What students should record:**\n- Three shadow tracings labeled with positions\n- Observations comparing the three shadows\n- A prediction: \"If I move the object even closer/farther, the shadow will...\"\n\n**Teacher Role:** \n- Circulate to each group; ask guiding questions rather than giving answers: \"What do you notice about the size of the shadows? Which shadow is bigger? Why might that be?\"\n- Ensure the light source stays in the same position throughout.\n- If a group finishes early, ask: \"What happens if you tilt the object? Does the shadow change shape?\"\n\n**Expected Student Outcomes:** \nStudents will discover that shadows change size based on the distance between the object and the light source—closer objects create larger shadows; objects farther away create smaller shadows.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and reinforce concepts after exploration through teacher-led discussion and connection back to the photograph.\n\n**Materials:**\n- Chart paper with student predictions from Engage phase\n- Shadow tracings from Explore phase\n- Photograph of rock and shadow (displayed again)\n\n**Activity:**\n\n1. **Group share-out:** Ask 2-3 groups to briefly show their shadow tracings and describe what they discovered. Ask: \"Did your shadows match your predictions from the beginning? What surprised you?\"\n\n2. **Introduce key vocabulary** using student-friendly language:\n\n   **Light Source:** The object that gives off light (like the sun or a flashlight). Light travels in straight lines from the source.\n\n   **Shadow:** A dark area created when an object blocks light. The shadow appears on the opposite side of the object from where the light comes from.\n\n   **Object:** The thing that blocks the light and creates a shadow (like the rock or your block).\n\n   **Block/Blocks:** When something gets in the way of light, it blocks the light from reaching that spot.\n\n   **Predict:** To say what you think will happen based on what you already know.\n\n3. **Make connections back to the photograph:**\n   - Point to the sun's position (inferred from the shadow direction).\n   - Show how the rock blocks light and creates the shadow on the grass.\n   - Explain: \"The sun is the light source. The rock is the object. The dark area on the grass is the shadow. The grass that's not shaded is where light reaches.\"\n\n4. **Introduce the pattern:** \"We discovered a pattern: When an object is closer to the light source, the shadow is bigger. When an object is farther from the light source, the shadow is smaller. This pattern helps us predict what shadows will look like!\"\n\n5. **Check for understanding:** Ask students to show thumbs up, sideways, or down in response to: \"If I move an object closer to a flashlight, will the shadow get bigger or smaller?\" Call on a few students to explain their thinking.\n\n**Vocabulary:**\n- **Light Source:** Something that makes light, like the sun or a flashlight\n- **Shadow:** The dark area created when an object blocks light\n- **Object:** The thing that blocks the light\n- **Predict:** To say what you think will happen based on patterns you've seen\n- **Pattern:** Something that happens the same way over and over, helping us know what will happen next\n\n**Expected Student Outcomes:** \nStudents understand that shadows are created by light being blocked, and that the distance between a light source and an object affects shadow size. They can use the vocabulary accurately in simple sentences.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding to a new context and deepen their ability to predict shadow behavior.\n\n**Materials:**\n- Index cards with shadow predictions (see below)\n- Additional objects of different shapes (balls, cubes, cylinders, stars)\n- Flashlights and white paper (same setup as Explore)\n- Optional: Classroom clocks or timers\n\n**Activity:**\n\n**Challenge: Shadow Prediction Game**\n\n1. **Explain the challenge:** \"Now you're going to use what you learned to predict shadows before you even see them!\"\n\n2. **Show students three different objects** (ball, cube, star shape). \n\n3. **Give the scenario:** \"Imagine the flashlight is in this spot (point), and I'm going to place the ball HERE (point to a new location). Without tracing it yet, draw what you think the shadow will look like on your paper. Will it be big or small? Will it look like a circle, or something else?\"\n\n4. **Students sketch their predictions individually.**\n\n5. **Then test each prediction:** Place the object where indicated, and trace the actual shadow. Compare predictions to reality. Discuss: \"Did your prediction match? Why or why not? What did you learn?\"\n\n6. **Real-world connection (optional extension):** Ask: \"Think about shadows on a sunny day at recess. Where are shadows longest—in the morning, at noon, or in the afternoon? Why?\" (This previews the idea that shadow length changes as the sun moves, connecting to patterns of motion.)\n\n**Teacher Role:**\n- Validate all predictions as thinking tools, not judgments of \"right or wrong.\"\n- Encourage students to explain their reasoning: \"Tell me why you thought the shadow would be that size.\"\n- Push thinking: \"If we moved the object even closer, what would happen?\"\n\n**Expected Student Outcomes:** \nStudents apply their understanding of the light-object-shadow relationship to make informed predictions. They refine their understanding by comparing predictions to actual observations and explaining discrepancies.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of shadow formation, prediction, and pattern recognition.\n\n**Activity:**\n\n**Formative Assessment (during the lesson):**\n- Observe students during Explore: Can they set up the investigation? Do they notice changes in shadow size? Can they articulate the relationship between distance and shadow size?\n- Listen to explanations during Elaborate: Can students predict shadow behavior and justify their predictions?\n- Monitor vocabulary use: Are students using \"light source,\" \"shadow,\" and \"predict\" appropriately?\n\n**Exit Ticket (summative assessment):**\n\nProvide each student with one of these three prompts (differentiate based on observed readiness):\n\n**Exit Ticket Option 1 (All students):**\nDraw and label a picture showing:\n- A light source\n- An object\n- The shadow created\n- Write or tell: \"The shadow appears because the _______ blocks the light.\"\n\n**Exit Ticket Option 2 (Approaching standard):**\nAnswer with a drawing or sentence: \"If I move this object closer to the flashlight, the shadow will get _______ (bigger/smaller) because _______.\"\n\n**Exit Ticket Option 3 (Meeting/exceeding standard):**\n\"Look at the photograph of the rock. If the sun moves higher in the sky (like at noon), what do you predict will happen to the shadow? Draw or explain your thinking.\"\n\n**Success Criteria:**\n\n✓ Student can identify the three components of shadow formation (light source, object, shadow) and explain that the object blocks light.\n\n✓ Student can describe the pattern: closer object = bigger shadow; farther object = smaller shadow.\n\n✓ Student can make a reasonable prediction about how a shadow will change based on changing the object's position relative to light.\n\n✓ Student uses vocabulary (light source, shadow, object, predict) appropriately in explanations.\n\n**Expected Student Outcomes:**\nMost students will demonstrate understanding that shadows form when objects block light and that the distance between the light source and object affects shadow size. They will use this understanding to make predictions about future shadow behavior.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Pre-teach vocabulary** using real classroom objects and a flashlight during a small group session before the main lesson. Create a vocabulary anchor chart with pictures and simple labels.\n\n2. **Simplify the Explore task** by providing only two positions (close and far) instead of three, and pre-draw the white paper area where they should place the object. Use a consistent, familiar object (like a block).\n\n3. **Provide a sentence frame for recording observations:** \"When the object was close, the shadow was _______. When the object was far, the shadow was _______.\" with word choices (big/small, light/dark).\n\n**Challenge (for advanced learners):**\n\n1. **Investigate shadow shape:** Ask students to explore whether the shape of the object affects the shape of the shadow. Provide objects of different shapes (sphere, cube, star) and ask: \"Do all shapes create the same shadow? Why or why not?\"\n\n2. **Predict and test shadow movement:** Ask: \"If the light source moves (but the object stays still), will the shadow move? Where will it go?\" Have them design an investigation to test this prediction.\n\n3. **Connect to time-based patterns:** Introduce the idea that shadows change throughout the day as the sun moves. Ask students to predict how the rock's shadow in the photograph might look in the morning versus afternoon, or to make predictions about their own classroom shadow if observed at different times.\n\n---\n\n### Extension Activities\n\n1. **Classroom Shadow Exploration:** On a sunny day, have students go outside and observe real shadows cast by trees, buildings, and playground equipment. Measure or sketch shadows at different times of day (morning, noon, afternoon if schedule allows). Create a chart showing how shadows change. This connects to real-world observation and introduces the idea of predictable daily patterns.\n\n2. **Shadow Theater:** Students use a flashlight, white sheet, and their hands or objects to create shadow puppets and stories. This reinforces the cause-and-effect relationship between light position, object position, and shadow appearance in a creative context. Students can predict where to position their hands to create specific shadow shapes.\n\n3. **Shadow Writing Prompt:** \"If you were a shadow, what would your day be like? Write a story about following an object around as the sun moves in the sky. What changes would you notice about your size, shape, and position?\" This integrates literacy with science concept reinforcement and allows students to explain their understanding creatively.",
  "inputTokens": 219,
  "outputTokens": 3590,
  "cost": 0.0186968,
  "generatedAt": "2026-02-13T07:27:01.507Z"
}