{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Shadows and Light\n\n### Core Science Concepts from Image Analysis\n\n- **Light creates shadows:** When light (sunlight in this case) hits an object, it casts a dark shadow on the ground behind it.\n- **Shadows show the shape of objects:** The shadow reflects the general outline and form of the object that blocks the light.\n- **Shadows change with light position:** The shadow's length, direction, and darkness depend on where the light source is and the time of day.\n- **Different materials interact with light differently:** The rock appears opaque (blocking light completely), while the grass and moss around it allow some light to pass through or reflect from their surfaces.\n\n---\n\n### Lesson Title\n\n**Shadows All Around: Light and Dark Discoveries**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 40-minute sessions (or one 75-90 minute block)\n- **NGSS Standards:** \n  - 1-PS4-2: Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated.\n  - 1-PS4-3: Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light.\n\n---\n\n### Learning Objectives\n\nStudents will be able to...\n\n1. Observe and describe how light creates shadows when it shines on objects.\n2. Explain that objects in darkness cannot be seen without light.\n3. Investigate how different materials block light differently (opaque vs. translucent).\n4. Predict where a shadow will appear based on the position of a light source.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about shadows and light using the photograph and direct observation.\n\n**Materials:**\n- Photograph of the rock with shadow (projected or printed)\n- Flashlight or desk lamp\n- Small objects (toy car, ball, block)\n- Darkened corner of classroom (or use a box to create a dark space)\n\n**Activity:**\n\n1. **Display the photograph** on a screen or hold it up for the class to see. Ask students to look carefully at what they notice.\n\n2. **Ask these guiding questions:**\n   - \"What do you see in this picture besides the rock and grass?\"\n   - \"Why is there a dark spot next to the rock? Where do you think that dark spot came from?\"\n   - \"If I covered the sun with my hand, what do you think would happen to that dark spot?\"\n   - \"Have you ever seen your own shadow? Where was it?\"\n\n3. **Wonder prompt:** \"I wonder why we can only see shadows when there is light. Let's find out together!\"\n\n4. **Interactive discovery (optional):** Dim the lights slightly. Ask a volunteer to stand in front of a wall. Turn on a flashlight and shine it on them from the side. Ask, \"What do you see on the wall? Where did that dark shape come from?\" Repeat with the light from different positions.\n\n**Transition:** \"Now you're going to be shadow detectives! Let's explore how light makes shadows with some fun experiments.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how light creates shadows and how different materials interact with light.\n\n**Materials (per small group or station):**\n- Flashlight or small desk lamp\n- Various objects: wooden block, plastic toy, paper, cardboard, clear plastic cup, frosted plastic, aluminum foil\n- White paper or poster board (to act as a \"screen\")\n- Dark space or shadowed area (or use a large cardboard box to create one)\n- Chart paper or observation sheet (with pictures, not just words)\n\n**Activity:**\n\n**Part 1: Shadow Makers**\n\n1. **Arrange students in small groups** (3-4 per group). Give each group a flashlight and one object.\n\n2. **Step-by-step student directions:**\n   - Turn on your flashlight.\n   - Hold your object in front of the light and shine the light on a white paper or wall behind it.\n   - Look at the shadow the object makes.\n   - Move the object closer to the light. What happens to the shadow?\n   - Move the object farther away. What happens now?\n   - Record what you see by drawing the shadow shape on your paper.\n\n3. **What students should record:**\n   - A drawing of the shadow shape\n   - A simple picture showing where they held the object (close vs. far)\n   - Observations: \"The shadow was big/small/dark/light\"\n\n**Part 2: Light Blocking Materials**\n\n1. **Rotate groups** to test different materials (or test as a whole class with teacher modeling).\n\n2. **Step-by-step student directions:**\n   - Shine the flashlight through each material one at a time.\n   - Look at the shadow it makes.\n   - Does all the light get blocked? Or can some light come through?\n   - Draw or write about what you see.\n\n3. **Materials to test:**\n   - Cardboard (blocks all light = dark shadow)\n   - Clear plastic (light passes through = barely a shadow)\n   - Aluminum foil (shiny, reflects light)\n   - Frosted plastic or paper (some light blocks, some gets through)\n\n**Teacher Role:**\n\n- Circulate among groups and listen to student observations without giving answers.\n- Ask prompts: \"What happens when you move it closer? Why do you think that is? Can you see the light coming through?\"\n- Ensure flashlights are handled safely and used to shine on paper or walls, not eyes.\n- Help students record their thinking through drawing or simple labels.\n\n**Expected Student Outcomes:**\n\n- Students observe that shadows are dark shapes made when light is blocked.\n- Students notice that shadows change size based on distance from the light.\n- Students discover that some materials block light completely (opaque), while others allow light to pass through (transparent/translucent).\n- Students create visual records of their observations.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Formalize observations and introduce vocabulary about light and shadows.\n\n**Materials:**\n- Chart paper or whiteboard\n- Photograph of the rock (again)\n- Objects used in Explore phase\n- Flashlight\n\n**Activity:**\n\n1. **Group share-out:** Invite each group to share one discovery they made. Ask, \"What did you learn about shadows?\" Listen for observations about light blocking, shadow size, and materials. Record their ideas on chart paper using simple words and pictures.\n\n2. **Teacher mini-lesson:** Using the photograph again and a flashlight, demonstrate key concepts:\n   - \"In this picture, the sun is like our flashlight. It sends light down on the rock.\"\n   - \"The rock is very hard and solid. Light cannot go through it.\"\n   - \"When light cannot go through something, it makes a shadow on the other side.\"\n   - Shine the flashlight on an object: \"See how the dark shadow appears where the light is blocked?\"\n\n3. **Introduce vocabulary** (with visual demonstrations):\n\n   | Term | Student-Friendly Definition |\n   |------|----------------------------|\n   | **Light** | Energy that helps us see things. It comes from the sun, flashlights, lamps, and fire. |\n   | **Shadow** | A dark shape made when something blocks light. |\n   | **Block** | To stop light from passing through. |\n   | **Opaque** (pronounced oh-PAYK) | A material that light cannot pass through. It makes dark shadows. (Examples: wood, rock, cardboard) |\n   | **Transparent** (pronounced trans-PAIR-ent) | A material that light can pass right through. It doesn't make a shadow. (Examples: clear glass, clear plastic) |\n\n4. **Check for understanding:**\n   - Show different objects one at a time. Ask: \"Will this block light and make a shadow, or will light go through it?\"\n   - Ask: \"Can you see your shadow outside on a sunny day? Why?\" (Because the sun is a light source, and your body blocks the light.)\n   - Point to the photograph: \"What is blocking the light to make this shadow?\"\n\n**Vocabulary:**\n\n- **Light:** Energy that helps us see. It comes from sources like the sun and flashlights.\n- **Shadow:** The dark shape made when something stops light from reaching a surface.\n- **Block/Blocks:** Stops light from passing through.\n- **Opaque:** Cannot let light pass through; makes a dark shadow.\n- **Transparent:** Lets light pass through; doesn't make a shadow (or makes a very faint one).\n\n**Expected Student Outcomes:**\n\n- Students can identify what a shadow is and how it forms.\n- Students understand that light creates shadows.\n- Students can sort materials into categories: blocks light vs. lets light through.\n- Students use new vocabulary with guidance.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply shadow and light concepts to a new context and predict shadow behavior.\n\n**Materials:**\n- Flashlight\n- Various objects (cups, toys, blocks, paper cutouts)\n- Large poster board or light-colored wall\n- Objects for shadow puppets (if available): hand cutouts, animal shapes, sticks\n\n**Activity:**\n\n**Shadow Prediction and Creation**\n\n1. **Set up a \"shadow theater\":** Dim lights and set up a flashlight shining on a wall or poster board.\n\n2. **Prediction challenge:** Show students an object (like a toy car, cup, or block). Ask: \"If I put this here and shine the light from this direction, what will the shadow look like? Will it be big or small? Where will it appear?\"\n\n3. **Test the prediction:** Place the object in the light and ask: \"Were we right? What actually happened?\"\n\n4. **Shadow puppet play (optional, age-appropriate extension):**\n   - If students are engaged, allow them to create simple shadow puppets using their hands or paper cutouts.\n   - Ask: \"Can you make a shadow of a bird? A butterfly? How do you make it bigger or smaller?\"\n\n5. **Real-world connection:** \"Shadow puppets are used in movies, theaters, and in some countries, shadow puppets tell stories! Artists use light and objects to create pictures.\"\n\n**Teacher Role:**\n\n- Facilitate predictions without judgment.\n- Ask: \"Why do you think the shadow will be that size?\"\n- Encourage creativity while ensuring focus on light and shadow concepts.\n- Help students make connections between their predictions and actual results.\n\n**Expected Student Outcomes:**\n\n- Students make and test predictions about shadow size and position.\n- Students recognize patterns (farther object = larger shadow, closer to light = shadow appears in a certain direction).\n- Students apply learning creatively through shadow puppets or shadow art.\n- Students explain their thinking using light and shadow vocabulary.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of light, shadows, and how materials interact with light.\n\n**Activity:**\n\n**Formative Assessment (Throughout the lesson):**\n- Observe during Explore: Are students noticing shadows forming? Can they describe what they see?\n- Listen during Explain: Do students use vocabulary correctly? Can they explain why a shadow forms?\n- Watch during Elaborate: Can they make reasonable predictions and adjust thinking based on results?\n\n**Exit Ticket or Summative Assessment** (Choose one or combine):\n\n**Option 1: Drawings with Labels (Best for 1st Grade)**\n- Give each student a simple picture showing a light source (sun or flashlight) and an object.\n- Ask them to draw where the shadow will be and color it dark.\n- Write or have them dictate: \"The shadow is there because __________.\"\n\n**Option 2: Verbal Assessment**\n- Show a picture or perform a quick demonstration.\n- Ask: \"What do you see? Why is there a shadow? What is blocking the light?\"\n- Listen for understanding of cause and effect.\n\n**Option 3: Sorting Activity**\n- Show pictures or real objects: wood, glass, plastic wrap, cardboard, foil.\n- Ask: \"Which ones will block light and make a shadow? Which ones will let light through?\"\n- Students sort into two piles or point to examples.\n\n**Success Criteria for Student Understanding:**\n\n✓ Student can identify a shadow in a picture or observation.\n\n✓ Student can explain that light creates shadows (or \"the light makes the shadow\").\n\n✓ Student recognizes that blocking light makes a shadow.\n\n✓ Student attempts to use vocabulary: light, shadow, block, opaque, or transparent.\n\n✓ Student can predict where a shadow will appear with some accuracy.\n\n**Expected Student Outcomes:**\n\n- Most first graders will recognize shadows and understand that light is needed.\n- Many will use emerging vocabulary and explain the basic idea that objects block light.\n- Some may develop more sophisticated understanding of distance and shadow size.\n- All students will have concrete experiences to build future understanding of light.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Reduce complexity:** Focus only on one concept at a time (e.g., shadows exist when there is light). Skip the transparent/opaque vocabulary and focus on \"blocks light\" vs. \"doesn't block light.\"\n\n2. **Hands-on scaffolding:** Pair struggling students with a peer or teacher during Explore. Model the activity first: \"Watch me shine the light on the block. See the shadow? Now you try.\" Provide sentence frames: \"The shadow is _____.\" \"The light comes from _____.\"\n\n3. **Visual supports:** Use picture cards showing light sources, objects, and shadows. Reference the photograph repeatedly. Use simple, consistent language: \"Light,\" \"Shadow,\" \"Dark,\" \"Light goes through/light stops.\"\n\n**Challenge (for advanced learners):**\n\n1. **Investigate multiple variables:** Challenge students to test how shadow size changes with distance. Ask: \"If I move the object twice as far from the light, what happens to the shadow?\" Create a chart to show the relationship.\n\n2. **Explore transparency:** Introduce the concept more deeply. \"Light can go through some things but not others. Which materials does light go through? Which ones block it completely?\" Experiment with layering materials.\n\n3. **Design a shadow challenge:** \"Can you use light and objects to create a shadow that looks like a specific shape? Design a shadow picture.\" This connects to design and problem-solving while reinforcing light concepts.\n\n---\n\n### Extension Activities\n\n1. **Shadow Tracking Over Time**\n   - On a sunny day, trace a student's shadow on sidewalk chalk at different times (morning, midday, afternoon if possible).\n   - Observe and discuss: \"Why does the shadow change? Where is the sun at different times?\"\n   - This connects to 1-PS4-2 and introduces early understanding of how light position changes.\n\n2. **Light Source Hunt**\n   - Take students on a classroom or school walk to find different light sources (sun, lamps, windows, reflections).\n   - Identify shadows made by each light source.\n   - Create a chart or poster: \"Light Sources We Found\" with pictures or drawings.\n\n3. **Shadow Story or Puppet Show**\n   - Students create a simple shadow puppet show using paper cutouts and a flashlight.\n   - Tell a short, simple story using shadows (e.g., \"The butterfly and the flower\" or \"The sun and the tree\").\n   - This reinforces learning while building creativity and language skills.\n\n---\n\n**Teacher Notes:**\n\n- First graders learn best through hands-on exploration and repeated exposure. The photograph serves as an anchor point to return to throughout the lesson.\n- Safety reminder: Emphasize that flashlights should never shine directly in eyes. Model proper handling.\n- Keep language simple and concrete. Avoid abstract explanations; use \"show and tell\" methods.\n- This lesson builds foundational understanding for future learning about light, energy, and optics in upper grades.",
  "inputTokens": 223,
  "outputTokens": 3675,
  "cost": 0.0191258,
  "generatedAt": "2026-02-13T07:25:42.914Z"
}