{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Shadows and Sunlight\n\n### Core Science Concepts from Image Analysis\n\n- **Sunlight creates shadows:** When sunlight hits an object, it blocks the light and creates a dark shadow on the ground behind or beside the object.\n- **Shadows change with the sun's position:** The length, direction, and darkness of shadows depend on where the sun is in the sky at different times of day.\n- **Objects block sunlight:** Solid objects (like rocks and structures) prevent sunlight from reaching the ground beneath or behind them, which is why shadows form.\n- **Shadows help us observe the sun's effect:** By watching shadows, we can see evidence of how sunlight travels and affects Earth's surface without looking directly at the sun.\n\n---\n\n### Lesson Title\n\n**Sun, Shadows, and Surprises: Discovering How Sunlight Shapes Our World**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 30-45 minute sessions (or can be split across multiple days)\n- **NGSS Standards:** \n  - K-PS3-1: Make observations to determine the effect of sunlight on Earth's surface.\n  - K-PS3-2: Use tools and materials to design and build a structure that will reduce the warming effect of sunlight on an area.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Make observations about shadows and describe what they see using simple language.\n- Explain that sunlight causes shadows to form on Earth's surface.\n- Predict where a shadow will appear when an object is placed in sunlight.\n- Design and build a simple structure that blocks sunlight and creates shade.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student curiosity about shadows and sunlight using the photograph as a visual hook.\n\n- **Materials:** \n  - Large printed or projected photograph of the rock with shadow\n  - Chart paper and markers\n  - Small objects that cast shadows (toy blocks, rocks, toy animals)\n\n- **Activity:**\n  Display the photograph prominently on the board or projector. Gather students in a circle where they can all see it clearly.\n  \n  **Step 1:** Ask students to look carefully at the picture and point out what they notice. Allow multiple responses without correction.\n  \n  **Step 2:** Ask these specific discussion questions (pause after each for 5-10 seconds of thinking and response time):\n    - \"What do you see in this picture? Can you point to the different colors?\"\n    - \"See that dark area next to the rock? What do you think that is? Have you seen something like that before?\"\n    - \"Where is the sun in this picture? How can you tell the sun is shining?\" (Guide them to notice the light colored areas and the bright ground.)\n    - \"Why do you think the rock is making that dark shape on the ground?\"\n  \n  **Step 3:** Show students a small object (like a toy block) in your hand. Ask: \"If I put this block outside in the sunshine right now, what do you think would happen? Would the ground under it look bright or dark?\"\n  \n  **Step 4:** Record student predictions on chart paper with simple drawings and words. Emphasize that there are no \"wrong\" ideas—we're going to investigate together.\n\n- **Transition:** \"Let's go outside right now and make our own shadows so we can see exactly what happens when sunlight hits objects!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate how sunlight creates shadows through hands-on outdoor observation and play.\n\n- **Materials:**\n  - Small objects: toy blocks, plastic cups, rocks, toy animals, sticks\n  - Chart paper or clipboard with simple recording sheets (drawings or photos)\n  - Tape or chalk (to mark where shadows appear)\n  - Digital camera or tablet (optional, to document shadows)\n\n- **Activity:**\n\n  **Step 1:** Take students outside to a sunny spot on the playground, grass, or hard surface. Ensure the sun is at a moderate angle (not directly overhead if possible, so shadows are visible).\n  \n  **Step 2:** Give each small group (2-3 students) one small object and ask them to:\n    - Hold it up in the sunlight and look at the ground beneath it\n    - Notice the dark shape that appears—this is the shadow\n    - Walk around with the object to see if the shadow moves or changes\n    - Place the object down and trace or point out the shadow's outline\n    - Move the object and watch what happens to the shadow\n  \n  **Step 3:** Rotate groups so each student gets to explore with 2-3 different objects.\n  \n  **Step 4:** Call attention to natural shadows around you: tree shadows, building shadows, your own body shadows. Have students stand in a sunny area and look at their own shadows on the ground. \"Wave your hand! Look at your shadow's hand moving too!\"\n  \n  **Step 5:** Ask exploratory questions (not leading questions):\n    - \"What happens to the shadow when you move the object?\"\n    - \"Is the shadow always the same size?\"\n    - \"Does the shadow feel hot or cold?\"\n    - \"Where does the shadow disappear to if you move the object into the shade?\"\n  \n  **Step 6:** Have students create simple shadow pictures by placing objects in the sun and drawing around the shadows with chalk (can be erased later).\n  \n  **Step 7:** Return to the classroom and have students draw or tell you what they discovered. Document their observations with photos taken outside.\n\n- **Teacher Role:** \n  Circulate among groups asking open-ended questions (\"What do you notice?\" \"What changed?\") rather than explaining. Use phrases like \"Tell me what you see\" and \"Show me what happens when...\" to guide exploration without giving answers. Ensure all students have safe, adequate sun exposure to observe shadows (no staring at the sun).\n\n- **Expected Student Outcomes:** \n  Students should discover that:\n  - Objects make dark shapes (shadows) on the ground when the sun shines on them\n  - Shadows move and change when objects move\n  - Shadows disappear when objects move to a shady place\n  - Their own bodies make shadows in the sun\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce formal vocabulary and explain the cause-and-effect relationship between sunlight and shadows based on observations.\n\n- **Materials:**\n  - Chart paper with key vocabulary and pictures\n  - Photograph from the lesson (the rock with shadow)\n  - Simple diagram showing sun, object, and shadow (teacher-created or from curriculum materials)\n  - Real objects (rock, toy, block) available for reference\n\n- **Activity:**\n\n  **Step 1:** Gather students back together. Display the original photograph again.\n  \n  **Step 2:** Guide a group discussion: \"Remember when we went outside and found shadows? Look at this picture. Can you find the shadow here too? Show me where it is. What object made this shadow?\" (Help them identify the rock and the shadow it casts.)\n  \n  **Step 3:** Introduce key vocabulary using the photograph and real objects as visual references:\n\n  | **Term** | **Student-Friendly Definition** |\n  |----------|--------------------------------|\n  | **Shadow** | A dark shape that appears on the ground when sunlight is blocked by an object. |\n  | **Sunlight** | The bright light that comes from the sun. It travels to Earth and lights things up. |\n  | **Object** | Anything solid that can block sunlight, like a rock, toy, or your body. |\n  | **Block** | To stop something from passing through—sunlight gets blocked by objects, making shadows. |\n  \n  **Step 4:** Explain the relationship simply: \"The sun sends light to Earth. When light hits an object like a rock, the light cannot go through it. So the ground under and behind the object stays dark. That dark spot is called a shadow. The shadow shows us the shape of the object that is blocking the sun!\"\n  \n  **Step 5:** Use hand movements and the real objects to demonstrate:\n    - Hold a toy block in front of a light source (overhead projector, flashlight, or bright window) and show how the shadow appears on the surface behind it\n    - Move the block closer and farther away and explain why the shadow might change\n  \n  **Step 6:** Check for understanding:\n    - Ask: \"What makes a shadow?\" (Sunlight hitting an object and the object blocking the light)\n    - Ask: \"When you stand in the sun, what happens?\" (Your body blocks the sun and makes a shadow)\n    - Ask: \"If we go inside where there's no sunlight, will we still see shadows?\" (No, we need sunlight for shadows)\n\n- **Vocabulary:**\n  - **Shadow:** A dark shape that appears on the ground when an object blocks sunlight.\n  - **Sunlight:** The bright light that comes from the sun.\n  - **Object:** Anything that is solid and can block light.\n  - **Block:** To stop something from passing through.\n\n- **Expected Student Outcomes:** \n  Students should understand that sunlight causes shadows and that objects block sunlight to create shadows on Earth's surface. They should be able to point to a shadow and explain (in simple words) why it is there.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply their understanding by designing a simple structure that reduces the warming effect of sunlight (creates shade).\n\n- **Materials:**\n  - White paper or cardstock\n  - Paper plates or large craft sticks\n  - Tape, stapler, or fasteners\n  - Lightweight fabric scraps or tissue paper (optional)\n  - Thermometer (optional, for measuring temperature in sun vs. shade)\n  - Small toys or objects to place under structures (optional, to represent things being protected)\n  - Markers and crayons for decoration\n\n- **Activity:**\n\n  **Step 1:** Ask students: \"We learned that sunlight creates shadows and dark areas. The ground in shadow feels different than the ground in bright sun. Can you feel the difference?\" Take them outside briefly and have them touch the sunny ground and then the shady ground.\n  \n  **Step 2:** Introduce the challenge: \"Today, we're going to be builders! We need to create a little shelter or shade to keep something cool. This could be a place where a toy might sit in the shade instead of in hot sunlight. Can you design something that will block the sun and make a shadow big enough to protect something?\"\n  \n  **Step 3:** Show examples of structures that create shade: a simple tent made from paper, a roof made from a plate balanced on sticks, a fabric canopy taped to a frame.\n  \n  **Step 4:** Give each student or pair materials and ask them to build their own shade structure. Encourage creativity:\n    - Will they make a tent?\n    - Will they balance something on sticks?\n    - Will they use fabric?\n    - Will they decorate it?\n  \n  **Step 5:** Once structures are built, take them outside and test them:\n    - \"Does your structure make a shadow?\"\n    - \"Is the shadow big enough to cover your toy/object?\"\n    - \"Where would the sun have to be for your shadow to be biggest?\"\n  \n  **Step 6:** Optional: Use a thermometer to measure the temperature in direct sun versus under the structure's shadow. Even a simple observation (\"Does it feel warmer in the sun or under your shade?\") connects to sunlight's warming effect.\n  \n  **Step 7:** Display the structures in the classroom. Have students share: \"What did you use to block the sunlight? How does your shadow help?\"\n\n- **Teacher Role:** \n  Facilitate the building process by asking clarifying questions (\"How will you block the sunlight?\" \"What happens if the sun moves?\"), offering materials as needed, and helping troubleshoot without solving the problem for students. Encourage all attempts, even if structures don't create perfect shade.\n\n- **Expected Student Outcomes:** \n  Students should produce a simple structure that demonstrates understanding that objects can block sunlight and create shade. They should be able to explain (with support) how their structure reduces the effect of sunlight in a specific area.\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of sunlight, shadows, and how objects block sunlight.\n\n- **Activity:**\n\n  **Formative Assessment (During the Lesson):**\n  - Observe students during the Explore phase to see if they notice shadows and can make simple predictions about how shadows will change.\n  - Listen to student explanations during the Explain phase to assess whether they understand the relationship between sunlight and shadows.\n  - Review the structures built in the Elaborate phase to see if students created objects that actually block sunlight and create shade.\n  \n  **Exit Ticket (At the End of the Lesson):**\n  Gather students together and ask these questions (accept drawings, verbal responses, or a combination):\n  \n  1. **\"Show me a shadow.\"** (Point outside or to a picture. Student points to a dark area made by an object blocking sunlight.)\n  \n  2. **\"What makes a shadow?\"** (Expected response: \"The sun/sunlight\" or \"An object blocking the sun\" or \"The sun hits something and makes a dark spot.\")\n  \n  3. **\"If we put a rock in the sun, will it make a shadow? How do you know?\"** (Expected response: \"Yes, because rocks block the sun\" or \"Yes, like in the picture.\")\n  \n  4. **\"Can you show me (or describe) a place where shade would be nice on a hot day?\"** (Expected response: Under a tree, under a building, under their structure, etc.)\n\n- **Success Criteria for Understanding:**\n  - Student can identify a shadow in a photograph, drawing, or real-world setting.\n  - Student can explain (in simple language) that sunlight creates shadows by hitting objects.\n  - Student can predict that an object in sunlight will create a shadow.\n  - Student can recognize that shadows provide shade and reduce the direct effect of sunlight on a surface.\n\n- **Expected Student Outcomes:** \n  Most kindergarteners should be able to identify shadows and understand that sunlight causes them. With scaffolding, they should understand that objects block sunlight. Advanced students may understand that shadows move as the sun moves or that shade feels cooler.\n\n---\n\n### Differentiation\n\n- **Support (for struggling learners):**\n  1. **Use concrete, visible demonstrations:** Always show real objects making shadows in sunlight rather than relying only on pictures. Allow students to touch objects and shadows repeatedly.\n  2. **Simplify language:** Use very simple, repetitive sentences: \"Sun hits rock. Rock blocks sun. Dark spot = shadow.\" Avoid complex explanations.\n  3. **Provide hand-over-hand guidance during building:** Help students physically manipulate materials to create shade structures, then gradually release support.\n  4. **Use visual sentence frames:** Display images or simple diagrams showing the sun, object, and shadow for students to reference during discussions.\n\n- **Challenge (for advanced learners):**\n  1. **Explore shadow direction and movement:** Challenge students to observe shadows at different times of day and notice how they change direction and length. Create a simple \"shadow tracker\" chart showing where a shadow appears at different times.\n  2. **Design multiple shade structures:** Ask students to build two different structures and compare which one creates the biggest shadow or best blocks the sun. Have them explain their design choices.\n  3. **Connect to real-world applications:** Discuss why people wear hats, use umbrellas, or plant trees for shade. Ask: \"How do you think people use shadows to stay cool?\"\n  4. **Experiment with transparency:** Provide translucent materials (clear plastic, tissue paper) and ask: \"Does light pass through this? Does it still make a shadow? Why or why not?\"\n\n---\n\n### Extension Activities\n\n1. **Shadow Art Project:** On a sunny day, have students use chalk to trace shadows of themselves, objects, and natural items (leaves, branches) on pavement. Later, bring the images inside and have them paint or color their shadow tracings to create a shadow art gallery. This reinforces the concept that different shapes create different-shaped shadows.\n\n2. **Shadow Hunt Walk:** Take students on a nature walk around the school or playground specifically looking for shadows. Document shadows on video, photographs, or through drawing. Create a classroom \"Shadow Book\" where each page shows a different shadow found and identifies what object created it.\n\n3. **Sundial Exploration (Introduction to Shadows and Time):** Mark the ground in a sunny area with stones or chalk. Place a stick or your body in the center and trace the shadow every 30 minutes to 1 hour over the course of a morning or afternoon. Show students that shadows move as the sun moves across the sky, preparing them for future learning about Earth's rotation.\n\n---\n\n## Teacher Notes\n\n- **Safety:** Remind students to never look directly at the sun. All sun observations should focus on shadows and lit surfaces, not the sun itself.\n- **Best Time of Day:** Shadows are most visible and distinct when the sun is at a low angle in the early morning or late afternoon. Avoid observation times when the sun is directly overhead (near noon).\n- **Weather Considerations:** This lesson requires sunny weather. Have indoor backup activities available (observe shadows made by overhead projectors or classroom lights) or reschedule outdoor exploration for a sunnier day.\n- **Connection to Real Life:** Encourage families to observe shadows at home and bring in photos or drawings for a classroom display.",
  "inputTokens": 220,
  "outputTokens": 4061,
  "cost": 0.0271225,
  "generatedAt": "2026-02-13T07:25:05.207Z"
}