{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "content": "# Engineering Design Challenge: Shadow & Structure\n\n### Visible Elements in Photo\n- One large, irregularly shaped rock or stone with multiple surface angles and curves\n- Green grass and low vegetation surrounding the rock\n- A distinct shadow cast by the rock on the grass (visible on the left side)\n- Patches of lichen or algae on the rock's surface (darker discoloration)\n- White gravel or crushed stone visible in the upper left corner\n\n### Reasonable Inferences\n- **From the rock's irregular shape and weathered surface**: The rock has been exposed to environmental forces (wind, water, temperature changes) over time, creating natural erosion patterns.\n- **From the shadow's position and length**: The sun is at a low angle, suggesting early morning or late afternoon lighting conditions.\n- **From vegetation surrounding the rock**: This outdoor location receives sunlight and moisture, supporting plant growth—suggesting the rock is in a landscape where water drainage and sunlight exposure matter.\n\n### Engineering Task\n\n**K-2: Build a Shade Spot**\nMake a rock shelter for a bug or small animal using rocks, sticks, and leaves. Your shelter must have a shady spot inside where the sun can't reach. Test it by shining a flashlight on it. Does the light stay out?\n\n**3-5: Design a Shadow-Based Shelter Structure**\nYour challenge: Build a structure using rocks (or rock-shaped materials) that creates a shaded zone on the ground where the temperature stays cooler than the open sun. Your structure must:\n- Use at least 3 different surface angles (like the natural rock)\n- Cast a shadow that covers at least 6 inches × 6 inches of ground\n- Stay stable when tilted gently (test tipping resistance)\n- Protect a thermometer from direct sunlight while allowing air flow\n\n**Success Criteria**: Measure the temperature in your shadow zone vs. open ground after 10 minutes of sun exposure. Your shaded area should be at least 2°C cooler.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a natural system (rock, shadow, weathering) where students can observe an existing problem: How does nature protect small creatures from intense sun? The irregular shape and shadow are real constraints students can mimic. Starting with \"Ask\" allows students to investigate *why* rocks cast shadows and *how* that matters before jumping to building solutions.\n\n### Suggested Materials\n- Rocks or clay/stone-textured craft blocks (varied sizes and shapes)\n- Sticks, twigs, or craft wood pieces\n- Leaves, moss, or fabric scraps (for natural authenticity)\n- Thermometers (2 minimum, for comparison)\n- Measuring tape or ruler\n- Flashlight or phone light (for K-2 testing)\n- Small toy animal or bug figure (optional, for context)\n\n### Estimated Time\n**3-5 minutes**: Observation and discussion of the photo's shadow  \n**15-20 minutes**: Planning and gathering materials  \n**25-35 minutes**: Building and testing the structure  \n**10 minutes**: Data recording and reflection  \n**Total: One 45-minute session, or split into two 30-minute sessions**\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A: Defining and Delimiting Engineering Problems** (K-5) by having students identify how natural structures solve real-world problems (thermal regulation, shelter) and then redesign solutions with measurable constraints, connecting earth science (erosion, temperature) to engineering design.",
  "inputTokens": 2193,
  "outputTokens": 797,
  "cost": 0.0061779999999999995,
  "generatedAt": "2026-02-11T21:28:22.172Z"
}