{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Shadows and Light Energy\n\n### Core Science Concepts from Image Analysis\n\n- **Light travels in straight lines:** The sharp, defined shadow cast by the rock demonstrates that light moves in straight paths and cannot bend around objects, creating distinct shadow patterns.\n- **Objects block light energy:** The rock intercepts light energy from the sun, preventing it from reaching the ground beneath and behind the object, which creates the visible shadow.\n- **Shadows reveal the shape of objects:** The shadow's outline directly corresponds to the rock's shape and size, showing that shadows are evidence of light interacting with objects in the environment.\n- **Light energy can be transferred and reflected:** The sunlit portions of the rock and surrounding grass show where light energy has been transferred to Earth's surface, while shaded areas show where light has been blocked.\n\n---\n\n### Lesson Title\n\n**Shadows Tell the Story: How Light Energy Creates Shadows**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or one 90-minute block)\n- **NGSS Standards:** \n  - 4-PS4-2: Develop a model to describe that light reflecting from objects and entering the eye allows objects to be seen.\n  - 4-PS3-2: Make observations to provide evidence that energy can be transferred from place to place by sound, light, heat, and electric currents.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** how shadows form when light is blocked by an object, using evidence from photographs and direct observation.\n2. **Explain** that shadows are created when light energy travels in straight lines and is blocked by an object, preventing light from reaching the surface behind it.\n3. **Predict and test** how the size and shape of a shadow change based on the position of a light source and the object casting the shadow.\n4. **Model** the path of light using simple tools to demonstrate that light travels in straight lines and creates shadows when blocked.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student interest and activate prior knowledge about shadows using the photograph of the rock and its shadow.\n\n- **Materials:**\n  - Photograph of the rock with shadow (displayed on screen or printed)\n  - Chart paper and markers\n  - Optional: Shadow puppet figures or small objects to cast shadows\n\n- **Activity:**\n\n  1. **Display the photograph** on a large screen or distribute printed copies. Ask students to observe quietly for 30 seconds without talking.\n\n  2. **Facilitate observation with guided questions:**\n     - \"What do you notice about the ground around this rock? What is different between the lighter areas and the darker area?\"\n     - \"Why do you think there is a dark shape on the ground? What could have made that happen?\"\n     - \"If you moved the rock or moved the sun, what do you think would happen to that dark shape?\"\n     - \"Have you ever seen your own shadow? When did you notice it? What was different about that time of day?\"\n\n  3. **Introduce a prediction prompt:** \"I'm thinking that shadows appear when light is blocked. Let's investigate together to find out if that's true. What do you predict will happen to a shadow if we change where the light comes from?\"\n\n  4. **Record student predictions** on chart paper to revisit at the end of the lesson.\n\n- **Transition:** \"Now we're going to become shadow scientists. We'll use flashlights and objects to see if we can make shadows in the classroom and figure out exactly how they form.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate how shadows form by manipulating light sources and objects, discovering that light travels in straight lines and is blocked by objects.\n\n- **Materials:**\n  - Flashlights or desk lamps (one per pair of students)\n  - Small objects to cast shadows (blocks, pencils, toy animals, plastic cups, books)\n  - White paper or white poster board (one per pair)\n  - Tape\n  - Dark corner or room with ability to dim lights\n  - Student observation sheet (provided below)\n\n- **Activity:**\n\n  1. **Arrange the classroom:** Divide students into pairs. Set up a \"shadow investigation station\" in a dimly lit area with white paper taped to a wall or surface.\n\n  2. **Distribute materials** to each pair: one flashlight, 2-3 small objects, white paper.\n\n  3. **Provide student directions:**\n     - \"Place your white paper on the wall or surface.\"\n     - \"Hold your object in front of the flashlight so that light shines past the object onto the white paper.\"\n     - \"Move your flashlight closer to the object. What happens to the shadow? Write or draw what you see.\"\n     - \"Move your flashlight farther away from the object. What happens to the shadow now?\"\n     - \"Shine the light from the side of the object instead of behind it. What happens?\"\n     - \"Change the object. Try a different shape. Does the shadow change shape too?\"\n     - \"Move the light above the object, then below it. What do you notice?\"\n\n  4. **Record observations:** Provide an observation sheet with spaces to:\n     - Draw the object and its shadow in different positions\n     - Record what happens to the shadow when the light moves\n     - Write or draw the path of light from the flashlight to the wall\n\n  5. **Connection to the photograph:** \"The rock in our photograph has a shadow just like the objects you're making shadows with. The sun is acting like our flashlight. The grass and ground are like our white paper.\"\n\n- **Teacher Role:**\n  - Circulate between pairs, asking guiding questions: \"What do you notice about the shadow when the light gets closer?\" \"Can you point to where the light is coming from?\" \"Is the shadow bigger or smaller than your object?\"\n  - Encourage students to test multiple configurations without telling them what will happen.\n  - Do not explain the concept; allow discovery.\n\n- **Expected Student Outcomes:**\n  - Students observe that shadows appear when light is blocked by an object.\n  - Students discover that shadows change size and shape based on light position.\n  - Students begin to understand that light travels from the source toward the object and beyond.\n  - Students record observations with drawings or words showing different shadow configurations.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce formal vocabulary and explain the science of how light energy creates shadows based on student observations.\n\n- **Materials:**\n  - Chart paper and markers\n  - Diagram showing light path (teacher-created or printed)\n  - Photograph of the rock with shadow (from Engage phase)\n  - Student observation sheets from Explore phase\n\n- **Activity:**\n\n  1. **Facilitate a group share-out:** Ask 3-4 student pairs to briefly describe what happened in their shadow investigations. Ask the class what patterns they noticed.\n\n  2. **Introduce key vocabulary** with demonstrations or diagrams:\n\n     - **Light energy:** The form of energy that allows us to see. It travels in straight lines from a source (like the sun or a flashlight).\n     \n     - **Light source:** An object or place that produces light energy (sun, flashlight, lamp, candle).\n     \n     - **Shadow:** A dark shape that forms when an object blocks light energy from reaching a surface.\n     \n     - **Opaque:** An object that blocks light and prevents it from passing through (the rock, pencil, toy—objects that cause shadows).\n     \n     - **Light path:** The straight line that light travels from its source.\n\n  3. **Draw a simple diagram on chart paper:**\n     - Draw a light source (sun or flashlight) on the left.\n     - Draw an arrow showing light traveling in a straight line.\n     - Draw an object in the path of the arrow.\n     - Show the arrow being blocked, with a shadow forming behind the object on the ground/surface.\n     - Label: \"Light Energy,\" \"Object (Opaque),\" \"Shadow.\"\n\n  4. **Connect back to the photograph and exploration:**\n     - \"When we explored with flashlights, the light traveled in a straight line until it hit our object. Then the light couldn't go through—it was blocked. The place where the light didn't reach became the shadow.\"\n     - \"In the photograph of the rock, the sun's light is the light source. The rock is opaque—it blocks the light. The dark area on the ground is the shadow. Light energy travels from the sun in straight lines. When it hits the rock, it can't pass through, so a shadow forms.\"\n\n  5. **Check for understanding:**\n     - \"If I moved the light source to a different position, what would happen to the shadow?\" (Guide students to predict shadow movement.)\n     - \"Why do shadows only appear on sunny days but not inside on a cloudy day?\" (Less direct light energy.)\n     - \"Can you make a shadow with a transparent object like a glass of water?\" (Guide students to reason that transparent objects let light through, so shadows are less visible.)\n\n- **Vocabulary:**\n  - **Light energy:** The form of energy from sources like the sun that allows us to see.\n  - **Light source:** Something that produces light (sun, flashlight, lamp).\n  - **Shadow:** A dark area created when light is blocked by an object.\n  - **Opaque:** An object that light cannot pass through, which blocks light and creates a shadow.\n  - **Straight line:** The path that light travels in—it does not bend around objects.\n\n- **Expected Student Outcomes:**\n  - Students understand that shadows form when opaque objects block light energy.\n  - Students can explain the relationship between light source, object, and shadow.\n  - Students know that light travels in straight lines.\n  - Students can use vocabulary (light source, shadow, opaque, light energy) in simple explanations.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply their understanding of light and shadows to predict and investigate shadow changes in real-world contexts.\n\n- **Materials:**\n  - Outdoor space or sunny window\n  - Meter sticks or measuring tape\n  - Chalk (if outside)\n  - Objects to test (stick, pencil, toy figure, block)\n  - Camera or sketch paper for documenting shadows\n  - Chart for recording shadow length at different times\n\n- **Activity:**\n\n  1. **Real-world shadow investigation:** Take students outside (or to a sunny window) to observe actual shadows cast by objects.\n\n  2. **Prediction task:** \"Choose an object. Predict: If we measure the shadow now, and then measure it again in 15 minutes, will the shadow be bigger, smaller, or the same size? Why do you think that?\"\n\n  3. **Shadow measurement activity:**\n     - Students place an object in sunlight (a stick, pencil, or toy).\n     - Measure and record the length of the shadow using a meter stick.\n     - Predict what will happen to the shadow in 15 minutes as the sun moves across the sky.\n     - Measure again after 15 minutes.\n     - Record and compare measurements.\n     - Discuss: \"Why did the shadow change? What was moving—the sun or the stick?\"\n\n  4. **Shadow drawing or photography:** Students sketch or photograph the shadow, labeling the light source (sun), the object, and the shadow.\n\n  5. **Real-world connections:**\n     - \"Why do you think sundials work? How do you think people use shadows to tell time?\"\n     - \"Why are shadows longer in the early morning and late afternoon than at noon?\"\n     - \"Where do you see shadows in your daily life? When are they useful?\"\n\n- **Teacher Role:**\n  - Facilitate outdoor observations safely, keeping students aware of sun safety.\n  - Guide students to see that the sun's position changes, causing shadow length and direction to change.\n  - Ask open-ended questions: \"How do you explain the change you measured?\"\n  - Help students connect shadow changes to Earth's movement and the sun's apparent movement across the sky (preparing for future ESS learning).\n\n- **Expected Student Outcomes:**\n  - Students observe that shadows change throughout the day as the light source (sun) position changes.\n  - Students measure and record data showing shadow length variations.\n  - Students apply their understanding to real-world shadow phenomena.\n  - Students begin to connect shadow changes to the sun's movement.\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of how light energy creates shadows and the factors that affect shadow formation.\n\n- **Activity:**\n\n  1. **Formative assessment during the lesson:**\n     - Circulate during Explore phase and listen to student explanations of their observations.\n     - Use questioning: \"Why did the shadow get bigger when you moved the light closer?\" to assess understanding.\n     - Review student observation sheets for accuracy and evidence of learning.\n\n  2. **Exit Ticket (Summative Assessment):**\n     \n     Provide students with a simple diagram showing a light source, an object, and asking students to:\n     \n     - **Draw and label:** Show where the shadow would form. Label the light source, the object, and the shadow.\n     - **Explain in 1-2 sentences:** \"Why does a shadow form? What would happen if you moved the light source to the side?\"\n     - **Predict:** \"If you moved the light source farther away, would the shadow be bigger or smaller? Why?\"\n\n  3. **Success Criteria:**\n     - ✓ Student correctly identifies where a shadow will form.\n     - ✓ Student can explain that shadows occur when light is blocked.\n     - ✓ Student predicts shadow changes based on light source position with reasonable reasoning.\n     - ✓ Student uses vocabulary (light source, shadow, light energy, blocked) correctly.\n\n  4. **Alternative assessment option (for students who struggle with writing):**\n     - Students explain their thinking verbally to the teacher or a peer.\n     - Students demonstrate shadow formation with objects and a light source, explaining what they see.\n     - Students draw and label a diagram with teacher/peer support.\n\n- **Expected Student Outcomes:**\n  - Students demonstrate understanding that shadows form when opaque objects block light energy.\n  - Students can predict how shadows change based on light source position.\n  - Students use light-related vocabulary accurately.\n  - Students provide evidence-based explanations for shadow phenomena.\n\n---\n\n### Differentiation\n\n- **Support (for struggling learners):**\n  1. **Simplified vocabulary:** Use \"light,\" \"shadow,\" and \"blocked\" rather than \"light energy\" or \"opaque\" initially. Build to formal vocabulary gradually.\n  2. **Guided exploration:** Provide a step-by-step checklist during Explore with pictures showing each position for the flashlight and object (closer, farther, above, below). Students follow each step and simply observe without writing detailed notes.\n  3. **Partner with a peer:** Pair struggling learners with confident peers during Explore. Assign the struggling learner the role of \"observer\" while the partner manipulates the light and object. The observer draws what happens.\n  4. **Simplified exit ticket:** Offer multiple-choice or fill-in-the-blank options instead of open-ended explanations. Example: \"A shadow forms when light is _____ (blocked / reflected / enlarged) by an object.\"\n\n- **Challenge (for advanced learners):**\n  1. **Investigate transparency:** Provide transparent and translucent objects (clear plastic, wax paper, colored cellophane) alongside opaque objects. Challenge students to predict and test whether these objects create shadows, and explain why shadows are fainter or different.\n  2. **Shadow size and distance:** Challenge students to develop a hypothesis about the relationship between light source distance and shadow size. Have them design a controlled experiment: keep the object and light source distance constant, then predict the shadow size if the light moves closer or farther. Test and graph results.\n  3. **Sundial design:** Introduce the concept of sundials and challenge students to create a simple shadow clock using a stick and marked positions for morning, noon, and afternoon. Require them to explain how the sun's movement affects the shadow position.\n\n---\n\n### Extension Activities\n\n1. **Shadow Puppet Theater:**\n   - Set up a light source behind a white sheet with a dark room in front.\n   - Students create shadow puppets using their hands, objects, or cardboard cutouts.\n   - Have students plan and perform a short shadow puppet show for the class, demonstrating how they can control shadow size and position by moving objects closer/farther from the light.\n   - *Connection:* Reinforces how light position affects shadow size and demonstrates practical application of light energy concepts.\n\n2. **Time-Lapse Shadow Study:**\n   - On a sunny day, have students place an object outdoors and photograph its shadow every 30 minutes over 2-3 hours (or use pre-taken photos).\n   - Students create a sequence showing shadow changes and present findings to the class.\n   - Discussion question: \"Why do you think the shadow moved and changed size? What was moving—the object or the light source?\"\n   - *Connection:* Deepens understanding of light source position and introduces Earth's rotation in an observable way.\n\n3. **Shadow Estimation Challenge:**\n   - Show students a photograph of an object with a shadow.\n   - Ask them to estimate the object's actual height based on the shadow length, using a reference measurement.\n   - This prepares students for proportional reasoning and real-world applications of shadow science (measuring tree heights, building shadows, etc.).\n   - *Connection:* Bridges physical science (light and shadows) with practical problem-solving and measurement skills.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 301,
  "outputTokens": 4067,
  "cost": 0.021163800000000003,
  "generatedAt": "2026-02-13T07:27:43.538Z"
}