{
  "title": "Shadow",
  "category": "physical-science",
  "imageFile": "shadow.jpg",
  "imagePath": "images/physical-science/shadow.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- **Large rock or boulder** with an irregular, roughly rectangular shape resting on soil\n- **Green vegetation and grass** surrounding the rock on all sides\n- **Patches of lichen or moss** (darker spots) covering portions of the rock surface\n- **Soil and loose earth** beneath and around the rock\n- **Shadow cast by the rock** visible on the ground, indicating direct sunlight\n\n### Reasonable Inferences\n\n- **From the rock's position and moss patches**: This boulder has been stationary in this outdoor location for an extended period, long enough for biological growth to colonize its surface.\n- **From the irregular surface and weathering**: The rock shows signs of erosion and weathering, suggesting exposure to outdoor elements (rain, wind, temperature changes).\n- **From its size and weight**: Moving or removing this rock would require significant force or a mechanical advantage system.\n\n---\n\n### Engineering Task\n\n#### **K-2 Version**\n**\"Design a Helper to Move the Big Rock\"**\n\nImagine this big rock is blocking a path where animals need to walk. Your job: **build a tool or machine that could help move it.** You can use ramps, levers, wheels, or rollers. Test your design by moving a smaller rock across your workspace. Does your helper make it easier? How do you know?\n\n#### **3-5 Version**\n**\"Engineer a Rock-Moving System\"**\n\nA landscaper needs to relocate this boulder without digging it out (to preserve the soil). **Design and test a system** that reduces the force needed to move the rock at least 2 feet across level ground using simple machines (lever, ramp, pulley, or wheel/axle). \n\n**Success Criteria:**\n- The system must move the rock at least 2 feet without breaking.\n- The system must require less force than moving it by hand alone (test with a spring scale if available).\n- Explain which simple machine(s) you chose and why.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real-world obstacle (a large, immobile rock in a landscape) without suggesting an obvious solution. Students must first identify the *problem* (how to move something heavy) before imagining solutions. The natural context invites genuine questioning about force, weight, and mechanical advantage.\n\n---\n\n### Suggested Materials\n\n- Wooden blocks, dowels, or sticks (for levers)\n- Cardboard tubes or PVC pipe (for rollers)\n- Books or wooden boards (for ramps)\n- Rope or string (for pulleys or dragging)\n- Small rocks or weighted containers (to simulate the boulder)\n\n---\n\n### Estimated Time\n\n- **K-2**: 30–45 minutes (one session: brief explanation, build, test, reflection)\n- **3-5**: 60–90 minutes (two sessions: design planning and sketching, building, testing with measurements, redesign if needed)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly supports **NGSS 3-5-ETS1-1** (\"Define a simple design problem that can be solved by applying scientific ideas about magnets, forces, or friction\") by grounding the challenge in the visible, real-world problem of moving a heavy object, encouraging students to apply force and simple machine concepts.",
  "inputTokens": 2193,
  "outputTokens": 760,
  "cost": 0.005993,
  "generatedAt": "2026-02-11T23:08:11.495Z"
}