{
  "title": "Solar_panels",
  "category": "physical-science",
  "imageFile": "solar_panels.jpg",
  "imagePath": "images/physical-science/solar_panels.jpg",
  "content": "# Solar Panels Rooftop Engineering Challenge\n\n### Visible Elements in Photo\n- Multiple solar panels mounted on a flat rooftop with metal brackets and railings\n- Dark-colored flat roof surface with protective edge barrier\n- Residential neighborhood below with varied roof types and pitches\n- City skyline visible in the distance\n- Clear sky overhead with good sunlight conditions\n\n### Reasonable Inferences\n- **From solar panel arrangement**: The panels are positioned to capture maximum sunlight throughout the day, suggesting careful angle and spacing planning.\n- **From the flat rooftop setting**: This building was chosen for solar installation because its roof provides open, unshaded space—a practical constraint in urban areas.\n- **From the neighborhood context**: Not all homes below have solar panels, suggesting cost, feasibility, or design decisions affect whether buildings can use this energy technology.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nDesign a sunny spot for pretend solar panels on a toy building. Your job: build a small flat roof using blocks or cardboard and figure out where to place shiny foil \"panels\" so they catch the most light from a flashlight or window. Test where the light shines brightest, then decide the best spots for your panels.\n\n**3-5 Version:**\nYour city needs to add solar panels to a neighborhood rooftop. The building is 40 feet long and 25 feet wide, and you have twelve 5-foot × 3-foot solar panels to arrange. Constraints: (1) panels must face south for maximum sun, (2) no panel can shade another, (3) panels must stay at least 3 feet from the roof edge for safety. Success criteria: maximize the number of panels you can fit while meeting all constraints, and sketch your layout showing measurements and reasoning.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real-world solution already in place, which invites students to reverse-engineer the *problem* it solves: \"Why did this building get solar panels? What problem were they trying to solve?\" Students start by identifying the need (reduce energy costs, use renewable power, fit panels safely on limited roof space) before designing their own arrangement. This anchors the task in authentic context rather than jumping straight to building.\n\n---\n\n### Suggested Materials\n- Cardboard boxes or foam board (for building model roofs)\n- Aluminum foil or reflective paper (to represent solar panels)\n- Ruler and measuring tape\n- Flashlight or access to sunny window\n- Graph paper and pencils (for planning/sketching layouts)\n\n---\n\n### Estimated Time\n**K-2**: 25–40 minutes (one session)  \n**3-5**: 45–60 minutes (single session or two 30-minute sessions if including physical model building)\n\n---\n\n### Why This Works for Teachers\nThis task directly supports **NGSS ETS1.A** (defining and delimiting engineering problems) and **NGSS ETS1.B** (developing possible solutions) by asking students to identify real constraints (roof space, safety edges, sun direction) and optimize placement—core skills in renewable energy design and urban planning.",
  "inputTokens": 2195,
  "outputTokens": 704,
  "cost": 0.005715,
  "generatedAt": "2026-02-10T21:14:34.628Z"
}