{
  "title": "States Of Matter",
  "category": "physical-science",
  "imageFile": "states_of_matter.jpg",
  "imagePath": "images/physical-science/states_of_matter.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Water, Light, and Shadows Around Us\n\n### Core Science Concepts from Image Analysis\n- **Light and shadows:** The photograph shows clear, distinct shadows cast by objects in bright sunlight, demonstrating how light creates shadows on surfaces.\n- **Properties of materials:** Different materials (metal fire hydrant, plastic traffic cone, concrete sidewalk, grass, water) interact with light differently—some reflect light brightly, others absorb it, creating visible contrasts.\n- **Light illumination:** Objects are visible because sunlight illuminates them; the bright daylight makes all objects in the scene clearly visible and distinguishable.\n- **Observation of everyday phenomena:** The image captures a real-world scene where students can observe how light from the sun affects what we see in our environment.\n\n---\n\n### Lesson Title\nShadows and Light: Detectives Exploring How Light Shows Us the World\n\n---\n\n### Lesson Overview\n- **Grade Level:** First Grade\n- **Subject:** Science (Physical Science—Light)\n- **Time Allotment:** Two 40-minute sessions (or four 20-minute sessions spread across two days)\n- **NGSS Standards:** 1-PS4-2 (Make observations to construct an evidence-based account that objects in darkness can be seen only when illuminated); 1-PS4-3 (Plan and conduct investigations to determine the effect of placing objects made with different materials in the path of a beam of light)\n\n---\n\n### Learning Objectives\nStudents will be able to:\n1. **Observe and describe** how light from the sun illuminates objects, making them visible and creating shadows.\n2. **Construct an evidence-based account** that objects can only be seen when light shines on them.\n3. **Plan and conduct a simple investigation** to compare how different materials (shiny, dull, transparent, opaque) interact with light.\n4. **Use vocabulary** such as light, shadow, illuminated, and visible to communicate their observations.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed photograph (or projected image) of the street scene with fire hydrant, traffic cone, shadows, and water\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on a screen or as a printed image where all students can see clearly. Do not explain it yet.\n\n2. **Ask these specific discussion questions** (pause after each to allow thinking time):\n   - \"What do you see in this picture? Name all the things you can find.\" (Students call out: hydrant, cone, sidewalk, grass, water, etc.)\n   - \"Why can we see all these things? What is helping us see them?\" (Guide thinking toward light from the sun.)\n   - \"Do you notice any dark shapes on the ground? What do you think those dark shapes are?\" (Point to the shadow beneath the fire hydrant and the shadows cast by other objects.)\n   - \"If it were nighttime with no sun and no lights, could we still see the fire hydrant and cone? Why or why not?\"\n\n3. **Prediction/Wonder Prompt:** \"I wonder what happens to things when light shines on them, and what happens when no light reaches them. Today, we're going to be light detectives and explore this mystery!\"\n\n4. **Record student ideas** on chart paper as they respond. Display this anchor chart throughout the lesson.\n\n**Transition:** \"Let's do some experiments with light and shadows to discover how light helps us see, just like the sun does in this picture.\"\n\n---\n\n#### 2. EXPLORE (20 minutes)\n\n**Objective:** Students investigate how light illuminates objects and how different materials interact with light.\n\n**Materials (per pair or small group of 3-4 students):**\n- 1 flashlight or lamp with a clear bulb\n- 3-4 objects made of different materials: \n  - 1 shiny object (aluminum foil ball, metal spoon, or shiny tin cup)\n  - 1 dull object (wooden block, fabric cloth, or dull plastic)\n  - 1 transparent object (clear plastic cup or clear bag)\n  - 1 opaque colored object (colored plastic block or book)\n- A darkened corner or closet (or use a cardboard box to create a dark space)\n- White wall or white paper as a backdrop\n- Observation sheet (simple drawing template with boxes for each object)\n\n**Activity:**\n\n**Part 1: Light Makes Things Visible (10 minutes)**\n\n1. **Set up the dark space:** Dim the lights in one corner of the classroom or use a large cardboard box to create a small dark area. Explain: \"This dark corner is like nighttime with no light.\"\n\n2. **Demonstrate first:** Hold up one object (e.g., a wooden block) in the dark area. Ask: \"Can you see this block clearly right now?\" (Students say no.) \"What do we need to make it visible?\" (Light!)\n\n3. **Turn on the flashlight** and shine it on the block. Ask: \"Now can you see it? What changed?\" (The light is shining on it now.)\n\n4. **Student turn:** In pairs or small groups, students take turns:\n   - Placing one object in the dark area\n   - Trying to describe it without light (very dark, hard to see)\n   - Having a partner shine the flashlight on it\n   - Describing what they see when light illuminates it\n   - Recording their observations by drawing or checking boxes on their observation sheet\n\n**Part 2: Different Materials Interact with Light Differently (10 minutes)**\n\n1. **Introduce the second investigation:** \"Now let's see if different materials look the same or different when light shines on them.\"\n\n2. **Place all 4 objects** (shiny, dull, transparent, opaque) side by side on a white paper in front of the dark space.\n\n3. **Shine the flashlight** on each object one at a time. Ask students:\n   - \"Which object looks brightest? Why do you think that?\" (The shiny object reflects light more.)\n   - \"Which object is hard to see through? Why?\" (Opaque objects block light.)\n   - \"Which object lets light pass through it?\" (The transparent object allows light to go through.)\n\n4. **Student investigation:** Each group repeats this with their set of materials, observing and drawing on their observation sheet which materials are shiny, dull, see-through, or solid-colored.\n\n**Teacher Role:** \n- Circulate and ask guiding questions: \"What do you notice?\" \"Is the light bouncing off, passing through, or being absorbed?\"\n- Avoid telling students the \"right answer\"—let them describe what they see\n- Help students use words like \"bright,\" \"dark,\" \"see through,\" and \"cannot see through\"\n- Encourage peer discussion: \"What do you think your partner is noticing?\"\n\n**Expected Student Outcomes:**\n- Students observe that objects are invisible in darkness but visible when light shines on them\n- Students notice that different materials interact with light in different ways (shiny objects are brighter, transparent objects let light through, opaque objects block light)\n- Students record observations through drawings and simple descriptions\n\n---\n\n#### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Anchor chart from Engage phase\n- Chart paper and markers for creating vocabulary posters\n- Printed or projected images of the original photograph\n- Small word cards or labels for vocabulary words\n\n**Activity:**\n\n1. **Group share-out (5 minutes):** \n   - Ask 3-4 groups to share one thing they discovered: \"What happened when you turned on the light?\" and \"What was different about the shiny object compared to the dull one?\"\n   - Record their observations on a new chart labeled \"What We Discovered About Light\"\n\n2. **Introduce key vocabulary (8 minutes):** Teach the following terms using the students' observations and the photograph:\n\n   **Vocabulary:**\n   - **Light:** Energy that allows us to see. It comes from the sun, lamps, and flashlights.\n   - **Illuminated:** When light shines on something and makes it visible. (Use the photograph: \"The sun illuminates the fire hydrant, so we can see it clearly.\")\n   - **Shadow:** A dark area created when an object blocks light. (Point to the shadows in the photograph beneath the fire hydrant and other objects.)\n   - **Visible:** Able to be seen because light is shining on it. (The cone is visible because sunlight illuminates it.)\n   - **Darkness:** When there is no light. Objects cannot be seen in darkness unless light reaches them.\n\n3. **Make connections back to the photograph (3 minutes):**\n   - Display the photograph again\n   - Say: \"Look at our picture. The sun is providing light that illuminates the fire hydrant, the cone, and the grass. That's why we can see all these objects—they are illuminated by sunlight.\"\n   - Point: \"See the dark shapes under the hydrant? Those are shadows. The hydrant blocks the sunlight, so a shadow appears on the ground.\"\n   - Ask: \"If this photo was taken at nighttime with no lights, would we be able to see these objects? Why not?\" (No light = objects not illuminated = cannot be seen)\n\n4. **Check for understanding (2 minutes):**\n   - Ask: \"Show me with your hands: when I say 'illuminated,' make a circle like a light shining. When I say 'shadow,' make a dark shape with your hands.\"\n   - Quick verbal check: \"If I turn off the lights in the classroom right now, would you be able to see your neighbor? Why not?\"\n\n**Expected Student Outcomes:**\n- Students understand that light makes objects visible\n- Students can use the vocabulary words \"light,\" \"illuminated,\" \"shadow,\" \"visible,\" and \"darkness\" in context\n- Students recognize that objects cannot be seen without light\n- Students can identify examples of light, shadows, and illuminated objects in their classroom\n\n---\n\n#### 4. ELABORATE (18 minutes)\n\n**Objective:** Students apply and deepen their understanding by conducting a shadow investigation.\n\n**Materials (per pair or small group):**\n- Flashlight or lamp\n- 2-3 flat objects of different shapes (leaf, hand cutout, toy figure, spoon)\n- White wall, white paper, or white sheet as a backdrop\n- Dark area or dimmed lights\n- Paper and crayons/markers to trace shadows\n\n**Activity:**\n\n1. **Introduce the shadow investigation:** \"Now that we know light creates shadows, let's become shadow detectives! We're going to make shadows and see what we discover.\"\n\n2. **Demonstrate first:**\n   - In the darkened area, hold up an object (e.g., a hand shape) between the light and the white paper\n   - Ask: \"What do you see on the wall? Is that a shadow? What made the shadow?\" (The object blocked the light!)\n   - Explain: \"When light cannot pass through or around an object, it creates a shadow—a dark shape on the other side.\"\n\n3. **Student investigation:**\n   - Each pair/group takes turns shining light on their objects against the white backdrop\n   - Students observe the shadow shape created\n   - Students trace or draw the shadow shape they see\n   - Students compare: \"Does the shadow look like the object? In what ways are they the same or different?\"\n\n4. **Challenge:** \"Move your flashlight closer to the object. What happens to the shadow? Move it farther away. What happens now?\" (Students discover that shadows change size and position based on where the light is.)\n\n5. **Real-world connection:** Return to the photograph. Ask: \"Why do you think there are shadows under the fire hydrant and cone in this picture? What is blocking the sunlight?\" (The objects are blocking the sun's light, creating shadows.)\n\n**Teacher Role:**\n- Position students in front of the light source and backdrop\n- Ask exploratory questions: \"What shape is that shadow?\" \"Why is it that shape?\"\n- Encourage prediction: \"What shadow do you think we'll make with this object?\"\n- Facilitate peer observation: \"What does your partner see that's the same or different from yours?\"\n\n**Expected Student Outcomes:**\n- Students observe that objects block light and create shadows\n- Students can trace or draw shadow shapes\n- Students understand the relationship between an object and its shadow\n- Students observe that light position affects shadow size and direction\n- Students connect shadows in the photograph to their own light investigations\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of light, illumination, shadows, and visibility.\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout lesson):**\n- Observe students during Explore: Can they identify when objects are visible vs. invisible based on light presence?\n- Listen to language use during Explain: Are students using vocabulary (light, illuminated, shadow, visible) appropriately?\n- Watch Elaborate activities: Can students make predictions about shadows and test them?\n\n**Exit Ticket (end of lesson, 5-7 minutes):** \n\nProvide each student with a simple response sheet with 2-3 questions (you read aloud for first graders):\n\n1. **\"I can see things because _____________ shines on them.\" \n   (Answer: light)**\n\n2. **\"Look at this picture of a sunny day [show the photograph again]. Point to or circle something that is illuminated by sunlight. How do you know it's illuminated?\"\n   (Students should identify visible objects and explain that light is shining on them)**\n\n3. **\"Draw or show me: What happens when light is blocked by an object?\"\n   (Students should draw or describe a shadow)**\n\n**Alternative Exit Ticket (for differentiation):**\n- Show three scenarios with pictures:\n  - A. Dark room with no lights / B. Dark room with a flashlight on / C. Sunny day outside\n- Ask: \"In which pictures can you see objects clearly? Why?\"\n\n**Success Criteria for Student Understanding:**\n- ✓ Student can identify that light is necessary to see objects\n- ✓ Student can use the word \"illuminated\" or \"shadow\" in a sentence\n- ✓ Student observes and describes how different materials interact with light\n- ✓ Student recognizes that objects in darkness are not visible without light\n- ✓ Student can point to and describe a shadow in a photograph or real setting\n\n**Expected Student Outcomes:**\n- Most first graders will demonstrate understanding that light makes objects visible\n- Students will use new vocabulary appropriately in context\n- Students will be able to identify shadows and explain that they form when light is blocked\n- Students will recognize the connection between the photograph and their own experiments with light\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified vocabulary and visuals:** Use picture cards with just one word each (light, shadow, dark, bright) instead of full definitions. Create a visual anchor chart with photos of each concept.\n\n2. **Hands-on demonstration before independent exploration:** Sit with small groups and model the flashlight-and-object activity first. Use only 2 objects (shiny and dull) instead of 4 for their investigation. Let students simply describe what they see without recording.\n\n3. **Alternative assessment:** Instead of written/drawn exit ticket, use a verbal check: \"Point to something in our classroom that is illuminated right now. Why can you see it?\" Have students respond in one or two sentences rather than requiring a drawing.\n\n**Challenge (for advanced learners):**\n\n1. **Extended investigation with multiple light sources:** Provide two flashlights and ask: \"What happens to a shadow when two lights shine on the same object?\" Students predict, test, and observe multiple shadows. Encourage them to describe the results.\n\n2. **Shadow exploration with position and distance:** Ask: \"How can you make a shadow bigger? Smaller? Can you make the shadow move without moving the object?\" Students experiment with light position and angle, recording their discoveries.\n\n3. **Real-world application and explanation:** Challenge students to take a photo (or draw) of shadows outside at different times of the day (morning, noon, afternoon). Ask: \"Why do shadows look different at different times? Why is the sun in different places?\" This connects to seasonal and daily light changes.\n\n---\n\n### Extension Activities\n\n1. **Shadow Puppet Theater (15-20 minutes):** Set up a white sheet with a light behind it. Students create shadow puppet stories by placing objects or using their hands to create silhouettes. They can narrate a simple story while peers guess what shadows are being made. This reinforces that object shape determines shadow shape, and requires light from behind for shadows to be visible.\n\n2. **Classroom Light Scavenger Hunt (10-15 minutes):** Students walk around the classroom with a checklist finding examples of:\n   - Something that is bright/shiny (reflects light well)\n   - Something that is dull (does not reflect much light)\n   - Something that is see-through (transparent)\n   - A shadow they can see\n   - A source of light (lamp, window, etc.)\n   Students draw or photograph these items and share with the class, explaining how light interacts with each.\n\n3. **Day and Night Picture Comparison (15-20 minutes):** Provide two pictures of the same scene—one during daytime (bright, illuminated) and one at night (dark, needs artificial light). Ask: \"What's different? Why can we see more in the day picture? Where is the light coming from in the night picture?\" Students sort pictures into \"daytime\" and \"nighttime\" categories and explain their thinking using light vocabulary.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 227,
  "outputTokens": 4057,
  "cost": 0.0210398,
  "generatedAt": "2026-02-13T06:18:11.229Z"
}