{
  "title": "Thermal Energy",
  "category": "physical-science",
  "imageFile": "thermal_energy.jpg",
  "imagePath": "images/physical-science/thermal_energy.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Cooking with Heat Energy\n\n### Core Science Concepts from Image Analysis\n\n- **Heat energy transfer:** The blue flame beneath the pan demonstrates how heat energy moves from the stove to the pan and then to the food cooking on it.\n- **Observable changes caused by heating:** The egg white transforms from a clear, runny liquid to a white, solid state when exposed to heat, showing a physical change in the material.\n- **Energy in everyday situations:** Cooking is a relatable, real-world context where students can see energy being used to change the properties of matter.\n- **Cause and effect relationships:** The presence or absence of heat directly causes changes in how the egg looks and behaves, demonstrating a clear cause-and-effect pattern.\n\n---\n\n### Lesson Title\n\nHow Does Heat Change What We Cook?\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** 3-PS2-1 (investigating effects of forces on objects and motion); *Note: While this lesson focuses on thermal energy effects rather than traditional forces/motion, the investigation structure aligns with the inquiry-based approach of 3-PS2-1, which asks students to \"plan and conduct an investigation to provide evidence.\"* The lesson emphasizes cause-and-effect observation of how heat (an energy source) changes materials, preparing students for later energy standards.\n\n---\n\n### Learning Objectives\n\nStudents will be able to...\n\n1. Make observations and record data about how heat changes the properties of materials (using the egg cooking as a model).\n2. Identify the heat source (flame) and explain how energy moves from the heat source to the material being heated.\n3. Predict what will happen to a material when it is heated based on patterns they observe.\n4. Describe cause-and-effect relationships between applying heat and changes in materials using scientific vocabulary.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about how cooking changes food and activate prior knowledge about heat and changes in materials.\n\n**Materials:**\n- Digital projector or interactive whiteboard to display the photograph\n- Chart paper and markers\n- The thermal_energy.jpg photograph (egg cooking in skillet)\n\n**Activity:**\n\n1. **Display the photograph** on the board without any introduction. Let students observe for 20-30 seconds in silence.\n\n2. **Ask discovery questions** to spark curiosity:\n   - \"What do you see happening in this picture? Describe what you notice about the white part and the yellow part of the egg.\"\n   - \"Where is the heat coming from? What do you see below the pan?\" (Point to the blue flame if students don't notice it.)\n   - \"What do you think the egg looked like before it was cooked? How is it different now?\"\n   - \"Why do you think the egg white changed from clear and runny to white and solid?\"\n\n3. **Elicit prior knowledge:**\n   - \"Has anyone ever watched something cook at home? What happened to it?\"\n   - \"Why do we need heat to cook food?\"\n\n4. **Prediction prompt:** \"If we put a raw egg on a hot stove, what do you think will happen? Why do you think that?\"\n\n5. **Document predictions** on chart paper titled \"What We Think Will Happen to an Egg When Heat Is Applied.\"\n\n**Transition:** \"Today, we're going to do an experiment to test what happens to materials when they get hot, just like this egg in the picture!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover how heat changes materials through a hands-on, safe, sensory-based activity.\n\n**Materials:**\n- Ice cubes (one per student or pair)\n- Warm water in clear cups (teacher-prepared, warm but safe to touch—approximately 110°F)\n- Cold water in clear cups\n- Thermometers (optional, for advanced observation)\n- Paper towels\n- Observation worksheets (printed or projected)\n- Colored paper or construction paper\n- Crayons or colored pencils\n\n**Activity:**\n\n**Step-by-step student directions:**\n\n1. \"Observe the ice cube carefully. Draw or describe how it looks and feels. What is its shape? What is its color? Is it hard or soft?\"\n\n2. \"Predict what you think will happen when you put the ice cube into the warm water. Write or draw your prediction.\"\n\n3. \"Carefully place your ice cube into the warm water cup. Observe what happens over the next 2-3 minutes. Watch for:\n   - Does the ice cube's shape change?\n   - Does it get smaller?\n   - Does the water change color?\n   - Do bubbles appear?\n   - Can you see anything floating in the water?\"\n\n4. \"Now, put a fresh ice cube into the cold water cup. Observe for 1-2 minutes. What happens this time? Is it different from the warm water?\"\n\n5. \"Record your observations by drawing pictures or writing words on your worksheet. Show what happened to the ice in warm water and what happened to the ice in cold water.\"\n\n6. **Connection to photograph:** \"Just like the heat from the stove changed the clear egg white into white solid, the heat from the warm water is changing the ice cube!\"\n\n**Teacher Role:**\n\n- Circulate and ask guiding questions without revealing outcomes: \"What changes are you noticing?\" \"Is that the same as what happened in cold water?\" \"Why do you think that's happening?\"\n- Ensure students are safely handling warm water; assist as needed.\n- Encourage all students to record observations in their own way (drawing, words, or a combination).\n- Use think-pair-share: Have students turn to a partner and describe one change they observed.\n\n**Expected Student Outcomes:**\n\n- Students observe that ice melts (changes shape and becomes liquid) in warm water faster than in cold water.\n- Students record observations through drawings and/or words.\n- Students identify warmth/heat as the cause of the change.\n- Students make a connection between this activity and the cooking egg in the photograph.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and scientific explanations for what students observed.\n\n**Materials:**\n- Chart paper or whiteboard\n- Markers\n- Observation data from Explore phase\n- Photograph of the cooking egg (displayed again)\n- Word cards or labels: \"Heat,\" \"Solid,\" \"Liquid,\" \"Temperature,\" \"Change\"\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 3-4 students to share their observations and drawings from the Explore activity.\n   - Ask the class: \"How were all of these observations the same? How were they different?\"\n   - Record key words on chart paper that students use naturally (e.g., \"melted,\" \"disappeared,\" \"became water,\" \"got smaller\").\n\n2. **Introduce key vocabulary (8 minutes):**\n   - Display each term on a word card and post it on the classroom word wall.\n\n   **Vocabulary:**\n   - **Heat:** Energy that makes things warm. Heat comes from things like fire, the sun, or a hot stove.\n   - **Solid:** A material that has a definite shape and doesn't flow. Ice is a solid. Raw egg white is not quite a solid—it's a liquid.\n   - **Liquid:** A material that flows and takes the shape of its container. Water is a liquid. The clear part of a raw egg is a liquid.\n   - **Temperature:** How hot or cold something is. We measure temperature with a thermometer.\n   - **Change:** Something becoming different. Heat can cause materials to change their properties.\n\n3. **Make connections to the photograph (5 minutes):**\n   - Display the egg photograph again.\n   - \"The heat from the blue flame is energy. That energy travels to the pan and then to the egg. The heat energy changes the clear, runny egg white (a liquid) into white, solid egg white. This is similar to how heat changed your ice cube from a solid to a liquid!\"\n   - Ask: \"What is the heat source in the picture?\" (The blue flame.) \"What was the heat source in our investigation?\" (The warm water.)\n\n4. **Check for understanding (2 minutes):**\n   - Ask students: \"If I put an ice cube on the counter in a warm room, what will happen to it? Why?\"\n   - Have students show thumbs up (I understand), sideways thumb (I'm not sure), or thumbs down (I don't understand) to self-assess.\n\n**Expected Student Outcomes:**\n\n- Students understand that heat causes materials to change.\n- Students can use vocabulary: heat, solid, liquid, and change in context.\n- Students recognize that their ice investigation and the cooking egg photograph show the same scientific principle: heat causes changes in materials.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by predicting and testing how heat affects other materials.\n\n**Materials:**\n- Chocolate chips or a small chocolate bar\n- Butter or margarine\n- Crayon pieces\n- Paper plates\n- Warm water cups or heat source (optional—use warm water only, teacher-supervised)\n- Observation worksheets\n\n**Activity:**\n\n**Real-world application scenario:**\n\"Now that we know heat changes materials, let's test what happens to other materials when they get warm. This is how scientists study how materials behave!\"\n\n**Student directions:**\n\n1. \"Choose one material to test: chocolate chips, butter, or a crayon piece. Draw a picture of it before it gets warm. Describe how it looks and feels.\"\n\n2. \"Make a prediction: 'When this material gets warm, I think it will _____. I think this because _____.' \"\n\n3. \"Place your material on a plate and set it in a warm area (near a sunny window, in warm water, or another location the teacher approves). Observe it every 2-3 minutes.\"\n\n4. \"Record what happens:\n   - Does it change shape?\n   - Does it become softer or harder?\n   - Does it become a different color?\n   - Does it stay the same?\"\n\n5. \"Compare your results with a classmate who tested a different material. Talk about: Were all materials the same? Did some materials change more than others?\"\n\n**Teacher Role:**\n\n- Supervise all heat sources carefully; use warm water only, not direct flame.\n- Ask students: \"Why do you think this material changed differently than the others?\" and \"What would happen if we left it in the warm place longer?\"\n- Facilitate peer comparisons and discussion.\n- Guide students to see that different materials respond differently to heat.\n\n**Expected Student Outcomes:**\n\n- Students test predictions and gather evidence about how heat affects various materials.\n- Students recognize that some materials melt (become liquid), while others soften or change color.\n- Students begin to understand that materials have different properties and respond differently to heat.\n- Students apply their learning to new situations.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of how heat causes changes in materials and their ability to make predictions based on observations.\n\n**Activity:**\n\n**Formative assessment (ongoing throughout lesson):**\n- Observe students' predictions and explanations during Explore and Elaborate phases.\n- Listen to student explanations in group discussions.\n- Review observation worksheets and drawings for evidence that students are connecting heat to material changes.\n- Use the thumbs-up/sideways/down self-assessment during the Explain phase.\n\n**Exit ticket (end of lesson):**\nProvide students with a simple exit ticket (can be verbal for early readers, or written/drawn for more advanced students). Use one or more of these prompts:\n\n1. **Cause and effect:** \"What caused the ice cube to melt? Draw or write your answer.\"\n2. **Prediction:** \"If you left chocolate in the sun on a hot day, what do you think would happen? Why?\"\n3. **Vocabulary check:** \"Show me with your hands what a solid looks like. Now show me what a liquid looks like. Tell me what made the difference.\" (This assesses understanding of the terms and the role of heat.)\n4. **Connection to photograph:** \"Look at the egg picture again. What is causing the egg white to change? How do you know?\"\n\n**Success criteria for student understanding:**\n\n- ✓ Students identify heat as the cause of material changes.\n- ✓ Students can describe at least one change they observed (e.g., \"The ice melted.\" \"The chocolate became soft.\").\n- ✓ Students use vocabulary correctly: heat, solid, liquid, change.\n- ✓ Students can make a reasonable prediction about what will happen when a material is heated.\n- ✓ Students recognize the connection between the cooking egg photograph and their own investigations.\n\n**Expected Student Outcomes:**\n\n- Most third graders will demonstrate understanding that heat causes observable changes in materials.\n- Students will be able to describe changes using both scientific vocabulary and their own words.\n- Students will make logical predictions based on the patterns they observed.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Provide a structured observation template:** Create a simple worksheet with labeled boxes for \"Before,\" \"During,\" and \"After\" with sentence starters: \"The ice cube was _____.\" \"When it got warm, it became _____.\" Students can draw pictures or write one word in each box.\n\n2. **Use gesture and movement:** Have students act out the changes: \"Show me with your body how ice looks\" (stand tall and stiff, like a solid). \"Now show me how water moves\" (flow and sway like a liquid). This multi-sensory approach helps students internalize the concepts.\n\n3. **Pair with a strong peer:** During investigations, partner struggling students with more advanced students who can model careful observation and language use.\n\n4. **Simplify vocabulary:** Focus on just two terms—\"heat\" and \"change\"—before introducing \"solid\" and \"liquid.\" Use lots of examples and repetition.\n\n**Challenge (for advanced learners):**\n\n1. **Introduce reversibility:** Ask advanced students, \"What if we put the melted ice back in the freezer? What do you think would happen? Would it become a solid again?\" Have them test this prediction and explain whether changes caused by heat can be reversed.\n\n2. **Compare rates of change:** Provide two identical ice cubes and have students test which one melts faster: one in warm water and one in even hotter water. Have them measure temperature and time, and graph their results to find patterns.\n\n3. **Explore insulation:** Challenge students to design a \"jacket\" for an ice cube using cotton, foil, plastic wrap, or other materials. Have them predict which material will slow melting the most and test their predictions. This introduces the concept of materials having different properties.\n\n4. **Extended vocabulary:** Introduce \"temperature,\" \"melt,\" and \"freeze\" to advanced students, and have them use these terms in their explanations and predictions.\n\n---\n\n### Extension Activities\n\n1. **Cooking investigation at home:** Send home a note asking families to let students observe one food being cooked (e.g., pasta, toast, an egg). Students sketch or photograph the food before and after cooking, and bring observations back to class. Create a \"Food That Heat Changed\" display board with student observations.\n\n2. **Freezing vs. melting experiment:** Extend the investigation by freezing water in small containers, then observing the ice melt at room temperature over several days. Students predict when the ice will be completely melted and track the melting process daily with drawings and observations. This adds the dimension of time and rate of change.\n\n3. **Material properties sorting activity:** Bring in a variety of solid and liquid materials (sand, clay, water, honey, oil, playdough). Have students sort them into \"solids\" and \"liquids,\" then predict what will happen to each if heated. Test predictions with warm water where safe and appropriate, and discuss why materials behave differently.\n\n---",
  "inputTokens": 221,
  "outputTokens": 3682,
  "cost": 0.0191064,
  "generatedAt": "2026-02-13T04:22:50.072Z"
}