{
  "title": "Thermal Energy",
  "category": "physical-science",
  "imageFile": "thermal_energy.jpg",
  "imagePath": "images/physical-science/thermal_energy.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Heating and Cooling Changes\n\n### Core Science Concepts from Image Analysis\n\n- **Heat energy transfer:** The photograph shows how heat from the flame is transferred to the egg, causing visible changes to occur in the material.\n- **Observable properties and state changes:** The egg white changes from a clear liquid to a white solid when heated, demonstrating a change in material properties.\n- **Reversible and irreversible changes:** The egg provides a concrete example of an irreversible change—once cooked, the egg cannot return to its original state.\n- **Energy and temperature effects:** The blue flame represents thermal energy being applied to an object, causing the material to change in appearance, texture, and structure.\n\n---\n\n### Lesson Title\n\n**From Liquid to Solid: Cooking Up Changes**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 40-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 2-PS1-1: Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n  - 2-PS1-4: Construct an argument with evidence that some changes caused by heating or cooling can be reversed and some cannot.\n\n---\n\n### Learning Objectives\n\nStudents will be able to...\n\n1. Observe and describe how materials change when heat is applied to them.\n2. Identify and record observable property changes (color, texture, appearance) caused by heating.\n3. Classify changes as reversible or irreversible based on evidence from their investigations.\n4. Construct a simple argument using observations to explain whether a heating change can be undone.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12-15 minutes)\n\n**Objective:** Capture student curiosity about how heat changes materials using the egg photograph.\n\n**Materials:**\n- Printed photograph of a cooking egg on a skillet (or digital display via projector/whiteboard)\n- Chart paper and markers\n- A raw egg in a clear bowl (kept sealed for safety)\n- A cooked egg on a plate (prepared beforehand)\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or printed poster where all students can see clearly. Ask students to gather in a circle or on the carpet.\n\n2. **Pose engaging opening questions:**\n   - \"What do you see happening to this egg?\" (Students observe the white part turning from clear to white, the yellow yolk staying visible)\n   - \"Why do you think the egg looks different?\" (Guide them to notice the heat from the blue flame)\n   - \"Do you think this change will last forever, or can we change it back?\" (Record their predictions on chart paper—this is pre-assessment)\n   - \"What would happen if we let this egg cool down? Would it go back to looking like a raw egg?\"\n\n3. **Show a raw egg and a cooked egg side-by-side** without cooking it in front of them yet. Ask: \"Which one was heated? How can you tell?\" Students should notice differences in texture, color, and appearance.\n\n4. **Wonder prompt:** \"I wonder if ALL things change the same way when they get hot. Let's find out!\"\n\n**Transition:** \"Today, we're going to do our own experiments to see what happens when we heat different materials. Then we'll figure out if those changes can be undone.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how heat affects different materials and observe whether changes are reversible or irreversible.\n\n**Materials:**\n- Heat source options (choose ONE per group—safety is paramount):\n  - **Option A (safest for grade 2):** Warm (not boiling) water in a container, using a thermometer to show it's warm but not dangerously hot\n  - **Option B:** Sterno cans (if supervised by trained adults; NOT recommended for independent student use)\n  - **Option C:** Heat lamps (if available and properly positioned away from students)\n- Small containers or saucers\n- Test materials in small quantities:\n  - Raw egg white (in a small cup)\n  - Chocolate (small piece)\n  - Butter (small pat)\n  - Wax (candle stub or crayon shaving)\n  - Sugar (one teaspoon)\n  - Paper (small square)\n  - Cloth (small square)\n- Observation sheets (drawn pictures + words for second graders)\n- Spoons, thermometers, tongs\n- Safety goggles (one per student)\n- Teacher-supervised setup with proper ventilation\n\n**Activity:**\n\n**Teacher Setup (Do this beforehand or with trained aide supervision):**\n- Prepare warm water (approximately 120°F/50°C—warm but not scalding)\n- Arrange materials in stations so students can observe heating effects safely\n- Set up three stations, rotating groups of 2-3 students through each\n\n**Station 1: Heating Egg White**\n1. Students place a small amount of raw egg white in a clear container\n2. Teacher carefully adds warm water around the container (double boiler method) OR places the container in warm water\n3. Students observe and draw what happens: Does the egg white change color? Does it change texture? Does it stay clear?\n4. Record on observation sheet: What did we see? What changed?\n5. After cooling, ask: \"Did the egg white go back to how it was before?\"\n\n**Station 2: Heating Chocolate, Butter, and Wax**\n1. Students place small pieces of each material on separate saucers\n2. Teacher carefully adds warm water nearby or uses a heat lamp at a safe distance\n3. Students observe which materials melt (turn from solid to liquid)\n4. Record on observation sheet: Which materials melted? Which stayed solid?\n5. After cooling, ask: \"Did the melted chocolate/butter/wax turn solid again?\"\n\n**Station 3: Heating Sugar and Paper**\n1. Under close teacher supervision, students observe what happens to a small amount of sugar when gentle heat is applied\n2. Students observe what happens to a small square of paper when placed near (but not in) heat\n3. Record observations: Did the sugar change? Did the paper change?\n4. After cooling, ask: \"Can we fix these changes?\"\n\n**Teacher Role:**\n- Circulate to all stations; NEVER leave heat sources unattended\n- Ask guiding questions rather than giving answers:\n  - \"What do you notice about the color?\"\n  - \"Is the material hard or soft now?\"\n  - \"What do you think will happen if we wait and let it cool?\"\n  - \"Can we undo this change?\"\n- Ensure all students are safe and using protective equipment\n- Take photos or drawings of each stage (before, during, after heating; after cooling)\n\n**Expected Student Outcomes:**\n- Drawn observations showing materials before and after heating\n- Verbal or written descriptions: \"The egg white turned white,\" \"The chocolate got soft and runny,\" \"The paper turned brown\"\n- Early identification of which changes reversed (butter, chocolate solidifying again) and which didn't (cooked egg, burned paper)\n- Recording sheet completed with pictures and simple words/phrases\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and help students make sense of their observations through teacher-led discussion.\n\n**Materials:**\n- Chart paper and markers\n- Student observation sheets from Explore phase\n- Large picture cards showing: solid, liquid, reversible change, irreversible change\n- Photograph of cooking egg (return to original image)\n- Real objects for reference: cooked egg, melted chocolate that has re-solidified, burned paper scrap\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 2-3 student volunteers to describe what their group observed at one station\n   - Ask other students: \"Did anyone see the same thing happen? Did anything different happen?\"\n   - Create a class observation chart on poster paper:\n     - **Material | What We Saw | Did It Change Back?**\n     - Egg white | Turned white and solid | No\n     - Chocolate | Got soft and runny | Yes\n     - Paper | Turned brown/black | No\n\n2. **Introduce vocabulary (5-7 minutes):**\n   Create a visual anchor chart with words, simple definitions, and pictures:\n\n   - **Heat (or Thermal Energy):** Energy that makes things hot. It comes from flames, sunshine, and warm water.\n   - **Heating:** When something gets hotter. Heat energy is being added.\n   - **Cooling:** When something gets colder. Heat energy is being taken away.\n   - **Reversible Change:** A change that CAN be undone. The material goes back to how it was before. *Example: Melted chocolate that becomes solid again when it cools.*\n   - **Irreversible Change:** A change that CANNOT be undone. The material does NOT go back to how it was before. *Example: A cooked egg—it will never be a raw egg again.*\n\n3. **Connect back to observations (4 minutes):**\n   - Point to the cooking egg photograph again: \"When heat from the flame hit this egg, the egg white changed. It got hard and white. This is a **reversible or irreversible change?** Why? Can we turn a cooked egg back into a raw egg?\" (Irreversible—it cannot be undone)\n   - Hold up the re-solidified chocolate: \"This chocolate melted when it got hot, but then it became hard again when it cooled. This is **reversible or irreversible?** Why?\" (Reversible—the change was undone)\n   - Show the burned paper: \"Fire made this paper turn black and break apart. Is this reversible or irreversible? Why?\" (Irreversible—we cannot turn it back into paper)\n\n4. **Check for understanding (2-3 minutes):**\n   - Show each object one at a time; students give a thumbs up (reversible) or thumbs down (irreversible)\n   - Ask one or two students to explain their choice in a sentence: \"I think this is reversible/irreversible because...\"\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Heat (Thermal Energy)** | The energy that makes things hot. It comes from fire, the sun, and warm water. |\n| **Heating** | When something gets hotter because heat is being added to it. |\n| **Cooling** | When something gets colder because heat is moving away from it. |\n| **Reversible Change** | A change that can be undone. The thing goes back to how it was before (like melted chocolate becoming solid again). |\n| **Irreversible Change** | A change that cannot be undone. The thing does NOT go back to how it was before (like a cooked egg or burned paper). |\n\n**Expected Student Outcomes:**\n- Students can identify at least 2 materials they tested and say whether the change was reversible or irreversible\n- Students use the words \"reversible\" and \"irreversible\" correctly in a sentence with prompting\n- Students can point to the egg photograph and explain: \"Heat made the egg white turn white and solid, and this change cannot be undone\"\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding of heating and cooling by testing new materials and making predictions.\n\n**Materials:**\n- Warm water (same temperature as Explore phase) in containers\n- New test materials: ice cube, sugar cube, salt, cheese, apple slice, crayon\n- Small clear containers\n- Observation sheets (new ones)\n- Optional: cooling agent (ice pack) for reversible vs. irreversible challenge\n- Paper and crayons for drawing predictions\n\n**Activity:**\n\n**Option A: Prediction and Testing Game (Recommended)**\n\n1. **Predict (5 minutes):** \n   - Show students three new materials: ice, cheese, and a sugar cube\n   - Say: \"We learned that heat can change materials, and some changes can be undone while others cannot. Let's predict what will happen to these new things when we add heat.\"\n   - Students draw or write on their prediction sheet: \"I think the ice will...\" \"I think the cheese will...\" \"I think the sugar will...\"\n   - Have 2-3 students share predictions aloud\n\n2. **Test (7 minutes):**\n   - At a teacher-supervised station, add warm water and carefully observe\n   - Ice melts (reversible—can freeze again)\n   - Cheese gets soft but doesn't melt completely\n   - Sugar dissolves (this is a reversible change—you can evaporate water to get crystals back, though this is complex; second graders may call this reversible because the sugar \"disappears\")\n   - Students draw what actually happened\n\n3. **Compare and Discuss (3 minutes):**\n   - Ask: \"Was your prediction right or wrong?\"\n   - \"Which of these changes can be undone?\"\n   - \"Which changes cannot be undone?\"\n\n**Option B: Cooling Challenge (Alternative)**\n\n1. Students take previously melted chocolate (now re-solidified) and heat it again\n2. Ask: \"This chocolate already melted once. If we heat it again, what do you think will happen?\"\n3. Students predict, observe, and discover it melts again\n4. Question: \"Can we keep melting and re-solidifying chocolate over and over? Is it still reversible?\" (Yes, until it burns)\n5. Ask: \"If we burned the chocolate instead, could we unburn it?\" (No—irreversible)\n\n**Teacher Role:**\n- Facilitate predictions without correcting them\n- Ask: \"Why do you think that will happen?\"\n- Guide observations: \"What do you see changing?\"\n- Connect new findings to previous learning: \"Is this like the chocolate we melted before? How is it the same or different?\"\n- Encourage students to revise their thinking\n\n**Expected Student Outcomes:**\n- Predictions about new materials (correct or not—the process matters)\n- Drawings and descriptions of what actually happened\n- Statements like: \"The ice melted, and then it froze again, so it's reversible\" OR \"The cheese got soft, and I'm not sure if it goes back\"\n- Recognition that multiple materials can show reversible changes\n- Evidence of applying the concept to unfamiliar materials\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of reversible and irreversible changes caused by heating and cooling.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- Observation of student drawings and labels during Explore and Elaborate phases\n- Listen to students' explanations: Do they use accurate vocabulary? Do they cite evidence from what they observed?\n- Thumb signal checks during Explain phase (\"reversible\" vs. \"irreversible\")\n- Question prompts: \"How do you know? What did you see?\" Listen for evidence-based answers\n\n**Summative Assessment: Exit Ticket (5 minutes)**\n\nProvide each student with a simple exit ticket (can be drawn or written with teacher scribing for students who need support):\n\n**Questions:**\n1. **Draw or point:** \"Which picture shows a reversible change? Which shows an irreversible change?\" (Show three scenarios: ice melting, egg cooking, chocolate melting)\n2. **Explain in your own words:** \"When we heated the egg, it changed. Can we change it back? Why or why not?\"\n3. **Think of a new example:** \"I heated ______, and it changed in a way that CANNOT be undone because _______.\"\n\n**Success Criteria for Student Understanding:**\n- ✓ Student correctly identifies at least 2 examples of reversible changes and 2 examples of irreversible changes\n- ✓ Student explains at least one change using the word \"heat\" or \"heating\"\n- ✓ Student gives a reason why a change is reversible or irreversible (e.g., \"Chocolate melts, then it gets hard again\" OR \"The egg can never go back to raw\")\n- ✓ Student applies the concept to a new material or scenario with minimal scaffolding\n\n**Expected Student Outcomes:**\n- Exit tickets show understanding of reversible vs. irreversible\n- Most students (70%+) correctly identify the egg as an irreversible change\n- Students can name at least one reversible change from their testing\n- Evidence of connecting observations to vocabulary is present in drawings/explanations\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified vocabulary:** Pair \"reversible/irreversible\" with simpler language:\n   - Reversible = \"Can change back\" or \"Goes back to normal\"\n   - Irreversible = \"Cannot change back\" or \"Stays changed\"\n   - Use these terms alongside formal vocabulary consistently\n\n2. **Guided observation sheets:** Provide partially completed sheets with pictures (egg raw → egg cooked) and blanks to fill in with simple words or sentences\n   - \"The egg was _____ (clear/white) before.\"\n   - \"The egg is _____ (hard/soft) now.\"\n   - \"Can we undo this? Yes / No\"\n\n3. **Partner pairing:** Pair each struggling student with a peer who can co-observe and co-record during Explore stations; assign the stronger student to help with recording while the struggling student observes and describes aloud\n\n4. **Pre-teach vocabulary:** Show and discuss the five vocabulary terms with pictures 1-2 days before the lesson; have students point to examples in the classroom (a warm cup of cocoa = heat; a jacket warming you up = heat)\n\n**Challenge (For Advanced Learners):**\n\n1. **Layered questioning:** Push deeper reasoning with questions like:\n   - \"If we melted chocolate three times, would it still be reversible on the fourth time? Why?\"\n   - \"Some materials change in ways that seem reversible, but really they've changed forever. Can you think of an example? (e.g., dissolved sugar—the sugar doesn't truly disappear; it's dissolved but can be recovered by evaporation)\"\n   - \"What would happen if we cooled things instead of heating them? Can ice become water, and water become ice again? Is that reversible?\"\n\n2. **Prediction and hypothesis testing:** Have advanced students write or draw predictions BEFORE each station, then test them and compare results. Challenge them to explain WHY their predictions matched or didn't match\n   - \"I predicted the butter would melt because _______.\"\n   - \"My prediction was wrong. I think it happened because _______.\"\n\n3. **Independent station design:** Let advanced students suggest a NEW material to test and create their own prediction sheet before testing. Ask: \"What do you want to find out? How will you test it? What do you think will happen, and can the change be undone?\"\n\n4. **Extension connections:** Invite them to think about reversible/irreversible changes in their own lives:\n   - \"When you eat food, it gets digested in your body. Is that reversible or irreversible?\" (Irreversible)\n   - \"When you freeze water into ice, is that reversible?\" (Reversible)\n   - Have them draw or explain one example at home with a family member\n\n---\n\n### Extension Activities\n\n1. **\"Materials Around Us\" Hunt (Home or Classroom):**\n   Students find 3 materials in their classroom or home and predict whether heating them would cause a reversible or irreversible change. They draw pictures and labels (\"If we heat ____, it would _____ [reversible/irreversible]\"). Bring findings back to class to share and discuss predictions vs. reality.\n\n2. **Heating & Cooling Timeline:**\n   Create a large classroom timeline on poster board showing the stages of heating and cooling a material:\n   - Solid ice → Melting → Liquid water → Freezing → Solid ice again\n   - Students draw or place pictures at each stage and write or dictate the changes happening. This reinforces the cycle and reversibility concept visually.\n\n3. **\"Can It Change Back?\" Sorting Game:**\n   Prepare picture cards of various heating/cooling scenarios (melting butter, burning toast, melting snow, cooking an egg, melting a popsicle, toasting bread). Students sort them into \"Can Change Back\" and \"Cannot Change Back\" columns on a table or chart. Play as a review game; discuss any cards students disagree on and explain their reasoning.\n\n4. **Cooking Investigation at Home (Family Connection):**\n   Send home a simple observation sheet: \"Watch a family member cook something (pasta, toast, egg, soup, etc.). Draw and write: What changed? Was the change reversible or irreversible? Why?\" Students share findings next lesson; this connects learning to real-world applications and involves families.\n\n5. **Reversible Changes in Nature:**\n   Take a nature walk and photograph or draw examples of reversible changes (ice melting into water, water freezing, snow melting). Back in class, create a bulletin board titled \"Changes We Can Undo\" with student photos and labels. Discuss: \"Why does ice melt in spring? Is this reversible?\"\n\n---\n\n## Summary\n\nThis lesson places students at the center of discovery, allowing them to observe heating and cooling effects firsthand while building understanding of irreversible and reversible changes. The 5E model scaffolds their thinking from curiosity (Engage) through hands-on investigation (Explore) to formal explanation (Explain), application (Elaborate), and assessment (Evaluate). By session's end, second graders will have concrete, observable evidence that some changes caused by heat can be undone—and some cannot—supporting the core NGSS expectations for 2-PS1-1 and 2-PS1-4.",
  "inputTokens": 227,
  "outputTokens": 5020,
  "cost": 0.0258024,
  "generatedAt": "2026-02-13T04:22:10.683Z"
}