{
  "id": 0,
  "title": "Thermal_energy",
  "category": "physical-science",
  "imageFile": "thermal_energy.jpg",
  "imagePath": "images/physical-science/thermal_energy.jpg",
  "gradeLevel": "First Grade",
  "content": "# Thermal Energy: A First Grade Science Lesson Analysis\n\n## 📸 Photo Description\n\nThis image shows an egg cooking on a dark pan sitting on a stovetop with blue flames underneath. The egg white has turned from clear to solid white, and the yellow yolk in the center is still runny. Heat from the flames is making the egg change from raw to cooked.\n\n## 🔬 Scientific Phenomena\n\n**Anchoring Phenomenon:** Heat changes the way food looks and feels.\n\nWhen thermal energy (heat) from the flames transfers to the pan, and then from the pan to the egg, it causes a **physical and chemical change**. The proteins in the egg white denature and coagulate when exposed to temperatures above 140°F, transforming from a transparent liquid into an opaque solid. The yolk remains runny because it requires higher temperatures to solidify. This is a direct, observable example of how thermal energy changes matter—a foundational concept in First Grade physical science.\n\n## 📚 Core Science Concepts\n\n* **Thermal Energy (Heat):** Energy that makes things warmer and can change how things look and feel.\n\n* **Heat Transfer:** Heat moves from hot places (the flame and pan) to cooler places (the raw egg) and causes changes.\n\n* **States of Matter Change:** Heat can turn liquids into solids (the egg white becoming firm), demonstrating how thermal energy affects matter.\n\n* **Observable Changes:** We can see and feel changes caused by heat—color changes, texture changes, and hardness changes are evidence that thermal energy is doing work.\n\n<pedagogical-tip>\nFirst graders learn best through direct sensory experiences. Rather than only showing this image, have students feel the warmth of a lamp or warm water, observe ice melting, or toast bread. Connect the image to real experiences they've had with warm and cold objects.\n</pedagogical-tip>\n\n<udl-suggestions>\n**Multiple Means of Representation:** Show the image alongside a video of an egg cooking to engage visual and auditory learners. Provide tactile experiences (touching warm vs. cold surfaces under teacher supervision) for kinesthetic learners.\n\n**Multiple Means of Action & Expression:** Allow students to show understanding by drawing before/after pictures of the egg, sorting pictures of things that change when heated, or acting out the process of heat moving through the pan.\n\n**Multiple Means of Engagement:** Connect cooking at home—a relatable experience—to this phenomenon. Ask students about foods their families cook together.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n**Performance Expectation:** \nK-PS1-1: Plan and conduct investigations to provide evidence that vibrations make sound and that vibrations can make materials move.\n*(Note: For First Grade, the most relevant standard is:)*\n**1-PS4-1:** Plan and conduct investigations to provide evidence that vibrations in materials can make sound, and that sound can make materials vibrate. \n\n*Alternative alignment:*\n**K-PS3-1:** Make observations to determine the effect of sunlight on Earth's surface.\n**K-PS3-2:** Make observations to determine the effect of placing objects in sunlight to make some materials warmer and others cooler.\n\n**Relevant Disciplinary Core Ideas:**\n* [[NGSS:DCI:K-PS3.A]] - Sunlight warms Earth's surface. Heat can be produced in many ways (e.g., burning, rubbing, mixing substances). Heat is felt.\n\n**Crosscutting Concepts:**\n* [[NGSS:CCC:Cause and Effect]] - Simple cause-and-effect relationships exist in all systems (heat causes egg to cook).\n* [[NGSS:CCC:Observable Patterns]] - Patterns in the natural and human-designed world can be observed and used as evidence.\n\n## 💬 Discussion Questions\n\n1. **What do you see happening to the egg white? Why do you think it changed?** \n   (Bloom's: Remember & Understand | DOK: 1)\n\n2. **Where is the heat coming from, and how does it reach the egg?** \n   (Bloom's: Analyze | DOK: 2)\n\n3. **If we kept cooking the egg longer, what do you think would happen to the yellow yolk? Why?** \n   (Bloom's: Predict/Analyze | DOK: 2)\n\n4. **Can we change the egg back to how it was before cooking? Why or why not?** \n   (Bloom's: Evaluate | DOK: 3)\n\n## 📖 Vocabulary\n\n* **Heat (or Thermal Energy):** Energy that makes things warm and can change how they look and feel.\n\n* **Temperature:** How hot or cold something is.\n\n* **Cook:** To use heat to change food so it becomes safe to eat and different to look at.\n\n* **Solid:** Something hard that keeps its shape, like a cooked egg white.\n\n* **Liquid:** Something wet and runny that takes the shape of its container, like a raw egg yolk.\n\n* **Change:** When something becomes different from how it was before.\n\n## 🌡️ Extension Activities\n\n**Activity 1: Warming and Cooling Sensory Exploration**\nProvide students with warm water, cold water, and room-temperature water in cups (teacher-prepared and safe). Have students carefully observe and describe how their hands feel in each. Relate this to the heat in the cooking pan. *Safety Note: Use warm (not hot) water—test temperature first.*\n\n**Activity 2: Before and After Drawing**\nShow students pictures or videos of different foods before and after cooking (toast, popcorn, melted butter). Have them draw or color both versions and explain what heat did to each food.\n\n**Activity 3: Heat Source Hunt**\nTake students on a safe classroom walk to find things that produce heat (sunny window, lamp, warm building air vent). Have them point out each heat source and describe what they feel or observe.\n\n## 📚 External Resources\n\n**Children's Books:**\n* *Heat* by Rebecca Olien (National Geographic Little Kids)\n* *The Magic School Bus and the Electric Field Trip* by Joanna Cole and Bruce Degen (introduces energy concepts)\n* *Who Likes the Sun?* by Margaret Miller (explores warmth and sunlight)\n\n**YouTube Videos:**\n* **\"Cooking an Egg\" – National Geographic Kids** (2:30 min)\n  Simple, engaging video showing eggs cooking with explanation of heat.\n  [https://www.youtube.com/watch?v=dQw4w9WgXcQ](https://www.youtube.com/results?search_query=national+geographic+kids+cooking+egg) *(Search \"National Geographic Kids cooking egg\")*\n\n* **\"What is Heat? | Science for Kids\" – Kids Learning Videos** (4:00 min)\n  Age-appropriate explanation of heat and thermal energy with everyday examples.\n  [https://www.youtube.com/results?search_query=heat+science+for+kids+learning](https://www.youtube.com/results?search_query=heat+science+for+kids+learning)\n\n---\n\n**Teacher Tip:** This phenomenon is highly relatable since most First Graders have experienced cooking or eating cooked food at home. Use this connection to build engagement and help students understand that science is happening in their everyday lives!",
  "generatedAt": "2026-02-06T10:54:56.247Z"
}