{
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Exploring Tire Materials and Properties\n\n### Core Science Concepts from Image Analysis\n\n- **Observable Properties of Materials:** The tire tread displays distinct physical characteristics—a dark, textured surface with deep grooves and ridges—that can be observed, described, and compared to other materials.\n- **Material Selection Based on Function:** The rubber material of the tire is specifically chosen because it has properties (flexibility, grip, durability) that make it ideal for the purpose of providing traction and safety on vehicles.\n- **Texture and Design Features:** The visible pattern of raised bumps and channels on the tire tread is a designed feature that serves a specific function (water drainage, grip), demonstrating how material properties are connected to purpose.\n- **Hardness and Flexibility:** Rubber tires are both durable and flexible, showing that materials can have multiple properties that make them suited for their job.\n\n---\n\n### Lesson Title\n\n**Rubber Tires: Discovering Materials That Move Us**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 2-PS1-1: Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties.\n  - 2-PS1-2: Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. **Observe and describe** the physical properties of rubber and other materials using their senses (touch, sight) and simple tools (rulers, magnifying glasses).\n2. **Compare and classify** different materials based on observable properties such as texture, hardness, flexibility, and color.\n3. **Explain why** rubber is a good material choice for tires by matching its properties to the job tires must do (grip, flexibility, durability).\n4. **Test and record data** about how different materials respond to wear, stretch, and pressure, and use evidence to support which materials work best for specific purposes.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest in material properties by examining a tire up close and wondering about why rubber is used for this important job.\n\n**Materials:**\n- Enlarged photograph of tire tread (printed or displayed on screen)\n- Real tire or tire tread sample (if available) OR a close-up image printed on card stock\n- Chart paper and markers\n- Magnifying glasses (1 per student or pair)\n\n**Activity:**\n\n1. **Display the photograph** prominently where all students can see. If possible, also have a real tire or tire sample available for students to touch and examine.\n\n2. **Introduce with curiosity:** Say: \"Today we're going to be tire detectives! Look at this close-up picture of a tire. Have you ever felt a tire? What did it feel like? Today we're going to figure out why cars have tires made from rubber instead of other materials.\"\n\n3. **Ask these specific discussion questions** (allow wait time and encourage full-sentence responses):\n   - \"What do you see when you look at this tire? Can you describe the bumpy parts?\" (Students should describe the tread pattern—the raised bumps and grooves.)\n   - \"If you touch a tire, what does it feel like? Is it hard like plastic, or soft like a sponge?\" (Students should describe texture and flexibility.)\n   - \"Why do you think a tire needs to have all those bumpy patterns? What job does a tire do?\" (Students should begin to think about grip, traction, and water drainage.)\n   - \"What other things do you know that are made of rubber? What jobs do they do?\" (Help students connect rubber to other materials—bouncy balls, erasers, toy ducks—and notice that rubber is flexible and bouncy.)\n\n4. **Create a class \"Wonder Wall\":** On chart paper, write: \"Why is rubber a good material for tires?\" Invite students to share predictions and post them. Examples: \"Because it's squishy,\" \"Because it sticks to the road,\" \"Because it doesn't break.\"\n\n**Transition:** \"Great thinking! Now let's be real scientists and test different materials to figure out which properties make rubber perfect for tires.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and compare observable properties of rubber and other materials through hands-on testing and observation.\n\n**Materials:**\n- 5-6 different material samples (one per student pair or small group):\n  - Rubber eraser or rubber band\n  - Plastic ruler or plastic cup piece\n  - Wooden block or wooden craft stick\n  - Metal object (bolt, paperclip, or aluminum foil)\n  - Foam piece or sponge\n  - Cloth or felt\n- Magnifying glasses\n- Water in cups or spray bottles\n- \"Material Testing Sheet\" (printed handout with labeled boxes for observations)\n- Pencils\n- A textured surface (sandpaper or similar) to test friction/grip\n- Simple recording chart with columns: Material Name | Texture | Bendy? | Stretchy? | Feels Sticky or Grippy? | Strong?\n\n**Activity:**\n\n**Step 1: Set Up Stations or Pairs**\nDivide the class into groups of 2-3 students. Assign each group one material sample to investigate thoroughly. Alternatively, create a rotation where groups test all materials but focus on one at a time.\n\n**Step 2: Student Investigation Directions (read aloud, post visually)**\n\"You are material detectives. Your job is to test your material and discover its properties. Follow these steps:\n\n1. **Look closely** with a magnifying glass. What does the surface look like? Is it smooth, bumpy, or rough? Draw or write what you see.\n2. **Feel it.** Touch it gently. Is it hard or soft? Does it bend easily or is it stiff? Can you stretch it? Write one word that describes how it feels.\n3. **Test for grip.** Rub your material gently across sandpaper or a textured surface. Does it stick or grip? Or does it slide easily? Record yes or no.\n4. **Test for flexibility.** Try to bend or twist your material gently (be careful not to break it). Does it bend back to its original shape? Does it stay bent? Record what happens.\n5. **Compare to a tire.** Think about the tire we saw in the picture. How is your material like a tire? How is it different? Write or draw your thinking.\"\n\n**Step 3: Hands-On Testing**\nCirculate among groups as they handle materials. Ask guiding (not leading) questions:\n- \"What do you notice about the texture?\"\n- \"What happens when you try to bend it?\"\n- \"Is this material flexible like rubber, or is it rigid like plastic?\"\n- \"Do you think this material would make a good tire? Why or why not?\"\n\n**Teacher Role:**\n- Facilitate without giving answers; encourage students to make their own discoveries.\n- Help students use appropriate vocabulary: *soft, hard, bumpy, smooth, stretchy, flexible, rigid, grip, texture, bendy*.\n- Ensure safety (supervise water use, prevent material breaking).\n- Prompt students to observe carefully: \"Look even more closely. What details do you see?\"\n\n**What Students Should Record or Document:**\n- A drawing and written description of their material's texture\n- Answers to yes/no questions about flexibility, stretchiness, and grip (can be pictures of ✓ or ✗)\n- One sentence about whether their material would work for a tire and why/why not\n\n**Expected Student Outcomes:**\n- Students will observe and record that rubber is flexible, textured, and has good grip properties.\n- Students will recognize that plastic is hard and slippery; wood is hard and rigid; foam is soft but not very grippy; metal is hard and cold.\n- Students will begin to see patterns: materials with good grip and flexibility might be good for tires.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to the concept of material properties and purposeful design.\n\n**Materials:**\n- Chart paper and markers (or whiteboard)\n- Photograph of tire displayed again\n- Visual anchor chart showing material properties with icons/pictures\n- Real samples used in Explore phase (for reference)\n- Vocabulary cards (with pictures and words)\n\n**Activity:**\n\n**Step 1: Group Share-Out (5 minutes)**\nInvite 2-3 groups to share their findings:\n- \"What material did you test? What did you discover about it?\"\n- \"Was it easy or hard to bend? Could you stretch it?\"\n- \"Did it feel sticky or slippery?\"\n\nRecord observations on a class chart with column headers: **Material | Flexible? | Textured? | Grippy? | Good for Tires?**\n\n**Step 2: Introduce Key Vocabulary (5-7 minutes)**\nDefine and display these terms using student-friendly language and visuals:\n\n**Vocabulary:**\n1. **Property** — A characteristic or quality of something you can observe (how it looks, feels, or acts). Example: \"Rubber is flexible—that's one of its properties.\"\n2. **Texture** — How something feels when you touch it or looks when you see it up close (bumpy, smooth, rough, ridged). Example: \"The tire tread has a bumpy texture.\"\n3. **Flexible** — Able to bend and move without breaking and return to its original shape. Example: \"Rubber is flexible, so it can bend as a car goes over bumps.\"\n4. **Grip** or **Traction** — How well something holds onto a surface without slipping. Example: \"Rubber has good grip because it sticks to the road.\"\n5. **Material** — What something is made of (rubber, plastic, wood, metal, fabric). Example: \"Rubber is the material used for tires.\"\n\n**Step 3: Connect Back to Photograph and Explore Activity (5-8 minutes)**\nPoint to the tire photograph again. Say:\n\"Now we know why tires are made of rubber! Rubber has the perfect properties for tires. Let's think about what we discovered:\n- Rubber is **flexible**—it can bend and squish when the car hits a bump, then bounce back to shape.\n- Rubber is **textured**—it has those bumps and grooves we saw in the close-up. This texture helps it **grip** the road, so the car doesn't slip.\n- Rubber is **strong**—it doesn't tear easily when the car rolls over rough surfaces.\n\nIf we made tires from plastic, they would be too hard and slippery. If we made them from foam, they would squish too easily. But rubber? Rubber has all the right properties for the job a tire needs to do!\"\n\n**Check for Understanding:**\nAsk these quick questions to assess comprehension:\n- \"What does 'flexible' mean? Can you show me with your body?\" (Students bend and straighten.)\n- \"Why do tires have a bumpy texture instead of being smooth?\" (For grip, to hold the road, to drain water.)\n- \"If a tire was made of plastic, what problem might happen?\" (It would slip, it would be too hard, it would break.)\n\n**Expected Student Outcomes:**\nStudents should understand that:\n- Materials have observable properties (texture, flexibility, grip).\n- Properties determine whether a material is suited for a specific purpose.\n- Rubber's combination of properties—flexibility, texture, and grip—makes it ideal for tires.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by testing materials in a new scenario and predicting outcomes based on material properties.\n\n**Materials:**\n- Four different material samples: rubber, plastic, wood, and fabric (cut into similar sizes, about 2\" × 2\")\n- Shallow tray or baking pan filled with water (for water drainage test)\n- Inclined ramp (made from a clipboard or board propped at an angle)\n- Small toy car or rolling ball\n- \"Real-World Challenge\" handout or poster\n- Pencils and data recording sheet\n\n**Activity:**\n\n**Real-World Challenge Scenario:** \nPresent this problem: \"Imagine you're a materials engineer designing shoes for a professional basketball player. The shoes need a sole (bottom) that grips the court and doesn't slip. The sole also needs to be flexible so the player can move quickly. Based on what you learned about material properties, which material would you choose for the shoe sole: rubber, plastic, wood, or fabric?\"\n\n**Step 1: Water Drainage Test (5 minutes)**\nPlace each material sample on the water-filled tray.\n- \"Tires need to drain water so the car doesn't slip on wet roads. Which materials let water drain through? Which ones trap water?\" \n- Students observe and record: Which materials drain water, and which hold water?\n\n**Step 2: Traction Test (5 minutes)**\nPlace the ramp at an angle and test rolling a toy car with different \"tire materials\" attached to the bottom (or test how well each material grabs the ramp).\n- \"Which material helps the car roll without slipping up the ramp?\" \n- Students predict before testing, then record results.\n\n**Step 3: Apply Learning to New Context (5 minutes)**\nReturn to the basketball shoe scenario: \"Based on everything you tested today, which material would you choose? Why?\" \n- Students record their choice and write/draw a reason using evidence from their tests.\n- Possible answers: Rubber (it's flexible, has grip, doesn't slip). Fabric (flexible but not grippy enough). Plastic (too slippery). Wood (too hard, not flexible).\n\n**Teacher Role:**\n- Facilitate testing; ask: \"What do you predict will happen?\" and \"Why do you think that?\"\n- Help students connect their predictions to the material properties they learned about.\n- Encourage evidence-based reasoning: \"What property of rubber helped it pass the traction test?\"\n\n**Expected Student Outcomes:**\n- Students will predict and test how material properties affect performance in new scenarios.\n- Students will use evidence from Explore and Elaborate activities to justify their choices.\n- Students will recognize that selecting materials for a specific job requires understanding properties.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of material properties and their connection to purposeful design.\n\n**Activity:**\n\n**Formative Assessment (Ongoing During Lesson):**\nThroughout Explore and Elaborate phases, observe and listen for evidence that students understand:\n- Can students accurately describe material properties (texture, flexibility, grip)?\n- Do students explain *why* a property matters for a specific purpose?\n- Can students compare materials and make choices based on evidence?\n\nUse a simple checklist:\n- [ ] Student describes observable properties using appropriate vocabulary\n- [ ] Student explains connection between a property and a material's use\n- [ ] Student uses evidence from testing to make predictions about new materials\n\n**Exit Ticket or Summative Assessment (choose one or both):**\n\n**Option A: Drawing + Written Response (5-7 minutes)**\nProvide this prompt (read aloud):\n\"Draw a tire and label three properties that make rubber a good material for tires. Under each label, write or tell why that property is important.\"\n\nExpected responses:\n- Flexible (so tires can bend and bounce)\n- Textured/Bumpy (so tires grip the road)\n- Strong (so tires don't tear or break)\n\n**Option B: Multiple-Choice + Explanation**\n\"Which material would make the BEST tire?\"\nA) Plastic   B) Rubber   C) Foam   D) Wood\n\n\"Why? Write or draw your answer using what you learned about material properties.\"\n\nExpected response: Rubber, because it is flexible, has good grip, and is strong. (Student may reference observations from Explore tests.)\n\n**Option C: Compare and Contrast (for stronger writers)**\n\"Compare rubber and plastic. How are they the same? How are they different? Which would make a better tire? Use words like flexible, texture, and grip in your answer.\"\n\n**Success Criteria for Student Understanding:**\n- [ ] Student identifies at least 2 properties of rubber (flexibility, texture, grip, strength)\n- [ ] Student explains how each property helps a tire do its job\n- [ ] Student compares rubber to another material and uses evidence from tests\n- [ ] Student uses vocabulary from the lesson (property, texture, flexible, grip, material)\n\n**Expected Student Outcomes:**\nStudents should demonstrate that they understand:\n- Materials have observable properties that can be described and tested.\n- Material selection is based on how well properties match the job the material must do.\n- Rubber's properties—flexibility, texture, and grip—make it ideal for tires.\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Simplified Material Testing:** Reduce the number of materials to test (provide only rubber, plastic, and wood). Create a picture-based recording sheet with checkboxes instead of requiring written responses. Model the observation process with the first material before students test independently.\n\n2. **Vocabulary Anchors:** Provide a reference card with pictures and words for \"flexible,\" \"texture,\" \"grip,\" and \"hard.\" Allow students to point to pictures instead of using words verbally or in writing.\n\n3. **Guided Questions During Explore:** Instead of open-ended directions, use scaffolded questions: \"Is this material hard or soft?\" \"Can you bend it?\" \"Does it feel smooth or bumpy?\" Encourage one-word or phrase answers initially, then build to sentences.\n\n4. **Pair with Peer Support:** Pair struggling learners with a student who can model careful observation and help record findings.\n\n**Challenge (For Advanced Learners):**\n\n1. **Investigate Additional Materials:** Provide silicone, leather, cork, or neoprene alongside standard materials. Challenge students to predict properties before testing and explain which would be better for specific purposes (winter tires, racing tires, bicycle tires).\n\n2. **Design Task:** \"Design a tire material combination. Could you use plastic on top and rubber on the bottom? What would be the advantages and disadvantages? Draw your design and explain your thinking.\"\n\n3. **Real-World Applications:** Research and present: \"Find three other products that use rubber. Why is rubber used instead of another material? Present your findings to the class.\"\n\n4. **Data Analysis:** Have advanced learners create a comparison chart or bar graph showing which material performed best in each test (water drainage, grip, flexibility). Ask them to write conclusions: \"Which material has the most useful properties for a tire?\"\n\n5. **Engineering Challenge:** \"Design a sole for a shoe that needs to work on both ice and dry pavement. What materials would you combine? Why?\"\n\n---\n\n### Extension Activities\n\n1. **Tire Science Field Walk:**\n   Take students on a guided walk around the school or playground. Point out different tires (cars in parking lot, bicycles, playground equipment). Have students sketch or photograph tires and notice the tread patterns. Discuss: \"Why might a bicycle tire look different from a car tire? What job does a bicycle tire need to do?\" Create a poster comparing tire types and their tread patterns.\n\n2. **Recycled Rubber Project:**\n   Connect material science to sustainability. Research together: \"What happens to old tires?\" Introduce the concept of recycling and upcycling. If possible, show pictures or bring in products made from recycled rubber (playground surfaces, rubber mulch, doormats, recycled rubber products). Discuss: \"Why is it good that we can use rubber again instead of throwing it away?\" Students can create a collage of recycled rubber products or write a \"Thank You to Rubber\" thank-you letter.\n\n3. **Material Properties Scavenger Hunt (At Home or in Classroom):**\n   Provide a list of items (eraser, plastic toy, wooden block, sponge, cloth, piece of aluminum foil, rubber band). Students find each item and test for properties: flexible or stiff? Rough or smooth? Stretchy or not? They record findings on a chart and bring it back to class. Discuss: \"Which items are most like tire rubber? Which are least like tire rubber?\"\n\n4. **Seasonal Tire Connections:**\n   In winter months, discuss winter tires and how their tread patterns differ from summer tires. Show pictures of snow tires. Question: \"Why do snow tires have different properties than regular tires? What do snow tires need to do that regular tires don't?\" This connects material properties to seasonal function and safety.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 226,
  "outputTokens": 4767,
  "cost": 0.0245888,
  "generatedAt": "2026-02-13T06:32:30.884Z"
}