{
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Tire Tread Patterns and Motion\n\n### Core Science Concepts from Image Analysis\n\n- **Tread patterns serve a purpose:** The deep grooves and ridges on tire treads are designed to grip surfaces and help wheels move efficiently without slipping, demonstrating how surface features affect motion.\n- **Different materials have different properties:** Tires are made of rubber, a flexible material that can push and pull against the ground to move objects, showing how material properties relate to force and motion.\n- **Pushes and pulls create motion:** Wheels with tread patterns transfer the pushing and pulling forces from vehicles to the ground, causing movement and directional changes.\n- **Texture and friction affect how objects move:** The raised pattern on tires increases friction with the ground, which is essential for controlled motion and stopping.\n\n---\n\n### Lesson Title\n\nRolling, Gripping, and Moving: Investigating How Tire Patterns Help Wheels Roll\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 30-40 minute sessions\n- **NGSS Standards:** K-PS2-1, K-PS2-2\n\n---\n\n### Learning Objectives\n\n- Students will be able to **observe and describe how different tire tread patterns look and feel**.\n- Students will be able to **compare how wheels with different surface patterns move across a flat surface**.\n- Students will be able to **predict and test whether a textured wheel surface helps or hinders rolling motion**.\n- Students will be able to **explain in simple words how tire treads help vehicles move and grip the ground**.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by exploring the photograph and introducing the concept of tire tread.\n\n**Materials:**\n- Printed photograph (large, displayed on board or projected)\n- Real toy car or picture of a car\n- Optional: actual small tire or toy wheel to handle\n\n**Activity:**\n\n1. **Display and Hook:** Show the close-up photograph of tire treads. Ask students to gather around or sit where they can see clearly. Say: \"Look very closely at this picture. What do you see? What do these patterns remind you of?\"\n\n2. **Discussion Questions:**\n   - \"Where have you seen patterns like this before?\" (on car tires, bicycle tires, shoes)\n   - \"Why do you think there are bumps and lines on tires instead of a smooth, flat surface?\"\n   - \"Have you ever felt a tire? Was it bumpy or smooth?\"\n   - \"What do you think happens when a tire with all these bumpy patterns rolls on the ground?\"\n\n3. **Prediction Prompt:** \"I wonder if a wheel with bumps and lines on it rolls differently than a perfectly smooth wheel. Let's find out together!\"\n\n4. **Transition:** \"Today, we're going to become tire scientists and test how different patterns on wheels help them roll and grip the ground.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate through hands-on activity how different textured surfaces on wheels affect rolling motion.\n\n**Materials:**\n- Toy cars or wheel toys (4-5 available)\n- Smooth plastic cups or paper cups with wheels attached\n- Textured wheel options: cup wheels wrapped in bubble wrap, foil, or sandpaper; naturally textured toy wheels\n- Smooth wheel options: unwrapped cups, toy cars with smooth plastic wheels\n- Large, clear table or floor space (4-6 feet long)\n- Ramps or flat surfaces (poster board or cardboard strips)\n- Small ball (optional, for comparison)\n- Chart paper for recording observations\n\n**Activity:**\n\n1. **Setup:** Create two testing stations or demo areas:\n   - **Station A:** Smooth wheel/car (unwrapped or smooth toy)\n   - **Station B:** Textured wheel/car (wrapped in bubble wrap, sandpaper, or textured toy)\n   - Set up a 4-6 foot flat \"testing track\" on the floor or table\n\n2. **Student Directions:**\n   - \"First, look at both wheels. What do you notice about how they feel and look? Are they the same or different?\"\n   - \"Now, watch as we give the smooth wheel a gentle push. Watch where it goes and how far it rolls. Can you stop it easily?\"\n   - \"Next, watch as we give the textured wheel the same gentle push. Watch where it rolls and how far it goes. Can we stop it easily?\"\n   - \"Let's try pushing both wheels with a bigger push. What happens?\"\n   - \"Can we make the wheels roll backward? Which one is easier to control?\"\n\n3. **What to Record/Document:**\n   - Have students draw or mark on chart paper:\n     - A picture of the smooth wheel\n     - A picture of the textured wheel\n     - Simple marks showing \"far\" or \"not far\" for distance rolled\n     - A smiley or frown face for \"easy to control\" or \"hard to control\"\n   - Take photographs of each test run\n   - Encourage students to feel both wheels and describe the difference in their own words\n\n4. **Connection to Photograph:** \"Remember the bumpy pattern we saw in the photograph? The textured wheel we tested today looks similar—it has bumps and raised parts, just like real tire treads!\"\n\n**Teacher Role:**\n- Facilitate without leading. Use open-ended prompts: \"What do you notice?\" \"What happens next?\" \"Is it the same or different?\"\n- Ask clarifying questions: \"Why do you think it rolled farther/shorter?\" \"What's different about the two wheels?\"\n- Allow students to take turns pushing wheels and making observations\n- Celebrate curiosity and careful observation; do not correct predictions yet\n\n**Expected Student Outcomes:**\n- Students observe that textured wheels roll more slowly or with more control than smooth wheels\n- Students notice the difference in how easily each wheel can be stopped or directed\n- Students begin to form a connection between the bumpy texture and how wheels move\n- Students describe observations using simple language: \"bumpy,\" \"smooth,\" \"rolls fast,\" \"rolls slow,\" \"easy to stop,\" \"hard to stop\"\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts, connecting discoveries back to the photograph and real tires.\n\n**Materials:**\n- Chart paper with vocabulary words (large print, with simple illustrations)\n- The close-up photograph of tire treads\n- Photos from the Explore phase\n- Toy car or real small tire for demonstration\n- Whiteboard or chart for writing student observations\n\n**Activity:**\n\n1. **Group Share-Out:**\n   - Gather students in a circle. Ask: \"What did we discover about the smooth wheel and the textured wheel? Which one was easier to stop? Which one gripped better?\"\n   - Invite 3-4 students to share one thing they noticed\n   - Display the recorded observations and photos on chart paper\n\n2. **Key Vocabulary Introduction:**\n   - **Tread** (tuh-RED): \"The bumpy pattern on a tire that helps the wheel grip the ground. It's like tiny mountains on the tire.\"\n   - **Texture** (TEX-chur): \"How something feels when you touch it—bumpy, smooth, rough, or soft.\"\n   - **Grip** (GRIP): \"When something holds on tightly without slipping. Bumpy treads help tires grip the road.\"\n   - **Push and Pull:** \"Pushes and pulls are forces that make things move. We push the wheel forward; the tire tread pulls against the ground to grip it.\"\n   - **Friction** (FRIK-shun): \"The invisible force that happens when two things rub together. It helps tires slow down and stop safely.\"\n\n3. **Connecting Back to the Photograph:**\n   - Show the photograph again. \"Look at this close-up of a real tire. See all the bumps and grooves? Those are the tread. Just like our textured wheel, these treads help the tire grip the road so the car can move safely and stop when needed.\"\n   - Point to specific treads: \"These grooves are like little channels that help water flow away and help the tire stick to the ground.\"\n\n4. **Connection to Real Life:**\n   - \"Real cars have tires with treads just like this. When you ride in a car, the treads help it go fast, slow down, and turn without sliding. Without treads, tires would be slippery like ice!\"\n   - \"You have treads too! Feel the bottom of your shoe. It has bumpy patterns—that's so you don't slip when you run and play.\"\n\n5. **Check for Understanding:**\n   - Ask: \"Why do you think tires have bumpy treads instead of being smooth?\" (Allow 2-3 student responses)\n   - Ask: \"If a tire was completely smooth like a marble, what might happen when a car tries to stop?\" (Listen for ideas about slipping or sliding)\n   - Show the textured and smooth wheels again. \"Which one is more like a real tire?\" (Textured)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Tread** | The bumpy ridges and grooves on a tire that help it grip the road |\n| **Texture** | How something feels when you touch it (bumpy, smooth, rough, soft) |\n| **Grip** | To hold on tight without slipping; treads help tires grip |\n| **Push and Pull** | Forces that make things move (push = move away, pull = move toward) |\n| **Friction** | An invisible force created when two things rub together that slows things down |\n\n**Expected Student Outcomes:**\n- Students understand that tire treads have a purpose: to grip the ground and help vehicles move safely\n- Students can identify texture differences and connect them to function (bumpy = better grip)\n- Students begin to use vocabulary words (tread, grip, texture) in their descriptions\n- Students recognize that the photograph shows a real tire with the same bumpy pattern as our test wheels\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by designing and testing solutions that use tire tread principles.\n\n**Materials:**\n- Pre-made wheel sets (smooth and textured options, as before)\n- Small obstacles (blocks, tape lines, ramps at slight angles)\n- Poster board or cardboard track\n- Materials for creating textures: bubble wrap, sandpaper, rubber bands, tape, foil\n- Empty paper cups with wheels (can be assembled by teacher beforehand)\n- Markers and chart paper for predictions and results\n\n**Activity:**\n\n1. **Design Challenge (Teacher-Led):**\n   - \"Now that we know textured treads help tires grip and control movement, let's use that idea to solve a problem. Here's the challenge: We need to design a wheel that can roll around a curve without slipping off the track.\"\n\n2. **Student Activity Steps:**\n   - **Station 1 (Prediction):** Show students a curved track or obstacle course. Ask: \"Which wheel do you think will go around this curve better—the smooth one or the textured one? Why?\" Have students draw or point to their prediction on chart paper.\n   - **Station 2 (Testing):** Provide each small group with a smooth wheel and a textured wheel. Let them test both wheels on the curved track. Which one stayed on better? Which one was easier to control?\n   - **Station 3 (Building):** If time allows, students can select materials (bubble wrap, sandpaper, rubber bands) to add texture to a plain cup wheel. \"What texture do you think will grip best?\" Let them test their creation on the curved track.\n\n3. **Real-World Application:**\n   - \"Tire makers have to think carefully about tread patterns. They test many different designs, just like you did today. Some tires are for regular roads, some are for rainy weather, some are for fast cars, and some are for trucks that carry heavy things. Each one has different tread patterns for different jobs!\"\n\n**Teacher Role:**\n- Circulate among testing stations; ask: \"What's working? What's not? Why?\"\n- Encourage students to try multiple textures and compare results\n- Guide students to make observations rather than directing outcomes\n- Celebrate creative texture choices and thoughtful predictions\n\n**Expected Student Outcomes:**\n- Students apply their understanding that textured surfaces improve grip and control\n- Students recognize that tread design solves real problems (staying on track, turning safely)\n- Students make predictions based on their earlier exploration\n- Students test their ideas and observe results\n- Students understand that engineers and designers use science to improve tire design\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of how tire tread patterns affect motion and grip.\n\n**Activity:**\n\n**Formative Assessment (Throughout the Lesson):**\n- **Observation Checklist:** Note which students can:\n  - Identify textured vs. smooth surfaces\n  - Describe how wheels with different treads roll differently\n  - Use words like \"grip,\" \"texture,\" or \"tread\" appropriately\n  - Make predictions and test them\n  - Connect the photograph to real tires and their own shoes\n\n**Exit Ticket / Summative Assessment (End of Lesson):**\n\nAdminister this simple assessment. You can use drawings, verbal responses, or a combination:\n\n1. **Show the tire photograph again.** Ask: \"What do you see in this picture? Describe the bumpy parts.\"\n   - *Success Criteria:* Student points to or describes the ridges/grooves and uses words like \"bumpy,\" \"bumps,\" \"lines,\" or \"tread\"\n\n2. **Show two wheels (one smooth, one textured).** Ask: \"Which one is more like the tire in the photograph? How do you know?\"\n   - *Success Criteria:* Student selects the textured wheel and explains it has bumps or feels different\n\n3. **Ask:** \"Why do you think car tires have bumpy treads instead of being smooth? What does the bumpy part do?\"\n   - *Success Criteria:* Student responds with an idea related to grip, stopping, control, or holding on (e.g., \"So the car doesn't slip,\" \"To help it stop,\" \"So it grips the road\")\n\n4. **Optional (Visual Response):** Provide a simple worksheet with two wheels drawn (smooth and textured). Ask students to circle the one they think is better for a rainy day and explain why.\n   - *Success Criteria:* Student circles the textured wheel and provides a reason related to grip or safety\n\n**Expected Student Outcomes:**\n- Students can identify and describe tire treads in the photograph\n- Students understand that textured treads help wheels grip and control motion\n- Students make the connection between the photograph, test wheels, and real tires\n- Students recognize that tread design solves motion and safety problems\n- Students can explain, in simple language, one function of tire treads\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Hands-On Reference Objects:** Provide tactile samples students can touch throughout the lesson (actual rubber tire tread, smooth plastic wheel, sandpaper, bubble wrap). Allow students to feel and manipulate these repeatedly before and during testing. This builds understanding through touch and reduces reliance on verbal explanation.\n\n2. **Simplified Vocabulary:** Use only 2-3 key words (tread, bump, grip) rather than introducing all five terms at once. Repeat these words frequently in context. Create large, illustrated vocabulary cards students can see and touch during discussions.\n\n3. **Peer Observation:** Pair struggling learners with more confident peers during the Explore phase. Have them work as a team to push wheels and record observations together. The peer can model predictions and verbal descriptions.\n\n4. **Visual Supports:** Use photographs or drawings alongside all vocabulary. Create a simple reference chart showing \"smooth wheel = slips,\" \"bumpy wheel = grips\" with actual images for students to reference during activities.\n\n**Challenge (for advanced learners):**\n\n1. **Pattern Analysis:** Ask advanced students to examine the tire tread photograph more closely and count or sketch the number of grooves or ridges they can see. Ask them to predict: \"Do you think all tires have the same number of bumps, or do different tires have different patterns?\" Introduce the idea that different tire patterns are designed for different purposes (rain, snow, racing, trucks).\n\n2. **Engineering Design Extension:** Challenge advanced students to design their own wheel tread pattern using available materials. Provide them with the design problem: \"Create a tread pattern that works best for a rainy day. Test it on a wet or slightly tilted surface. Why do you think your design works?\" Have them test and refine their design.\n\n3. **Real-World Application Research:** Provide pictures or real examples of different tire types (rain tires, snow tires, racing tires, truck tires if available). Ask students to compare the tread patterns and discuss: \"Why do you think these tires look different? When might you use each one?\" This builds understanding of how form follows function.\n\n4. **Force and Motion Terminology:** Introduce the concept of \"resistance\" or \"drag\" in age-appropriate language. Ask: \"Do you think the bumpy tire creates more or less friction with the ground? How do you know?\" Let them test by comparing how hard it is to push each wheel.\n\n---\n\n### Extension Activities\n\n1. **Shoe Tread Investigation:** Take students on a \"tread hunt\" around the classroom or outdoors. Have them observe and touch treads on their own shoes, sneakers, boots, and other footwear. Ask: \"Why do your shoes have bumpy bottoms? How are they like tire treads?\" Create a classroom chart showing different shoe treads (drawing or tracing them on paper). Discuss: \"Do all shoes have the same tread, or are there different patterns?\"\n\n2. **Texture Sorting Activity:** Set up a \"texture table\" with various materials (bubble wrap, sandpaper, rubber, foil, smooth plastic, felt, corduroy fabric). Have students sort materials into \"bumpy/textured\" and \"smooth\" categories. Discuss which textures might work well for tire treads and why. Challenge students to rank the textures from \"least grip\" to \"most grip.\"\n\n3. **Rainy Day Tire Test (Home Connection):** Send a note home asking families to look at car tires together during a rainy or wet day. Ask: \"Can you see the water flowing in the grooves of the tire tread? What do you think those grooves are for?\" Encourage families to take photos and bring observations back to share with the class. Create a book or poster of \"What We Found About Tires\" with student contributions.\n\n---\n\n---\n\n**Teacher Notes:**\n\nThis lesson emphasizes direct observation and hands-on exploration appropriate for kindergarten learners. The photograph serves as an engaging anchor that makes the abstract concept of tire function concrete and relatable. By testing wheels with different textures, students develop an intuitive understanding of how surface properties affect motion—a foundational concept for K-PS2-1 and K-PS2-2. The lesson deliberately connects the close-up photograph to student experiences (shoes, toy cars, vehicles in their lives) to deepen relevance and understanding.\n\nThe Elaborate phase includes design thinking (predicting, testing, refining), which builds critical thinking while still remaining playful and exploratory. The Exit Ticket is designed to be flexible, allowing students to demonstrate understanding through drawings, gestures, or simple verbal responses—all valid assessments at the kindergarten level.",
  "inputTokens": 221,
  "outputTokens": 4494,
  "cost": 0.029288500000000002,
  "generatedAt": "2026-02-13T06:31:02.258Z"
}