{
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Exploring Material Properties Through Tire Tread\n\n### Core Science Concepts from Image Analysis\n\n- **Material Properties:** Tires are made of rubber, a material engineered with specific properties (flexibility, durability, grip) that make it suitable for its purpose of creating friction with the road surface.\n- **Observable Properties of Matter:** The tread pattern on tires has measurable characteristics (depth, shape, spacing) that can be observed and compared to understand how design affects function.\n- **Wear and Physical Changes:** The weathered appearance of the tire in the photograph shows evidence of physical wear over time, demonstrating how materials change through use without changing their fundamental composition.\n- **Friction and Force:** The tread design exists because rubber interacts with road surfaces through friction, a force concept that explains why tire design matters for vehicle motion and safety.\n\n---\n\n### Lesson Title\n\n**What Makes a Tire Stick? Exploring Material Properties and Friction**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 50-minute sessions (or 90-100 minutes total)\n- **NGSS Standards:** \n  - 5-PS1-3: Make observations and measurements to identify materials based on their properties\n  - 5-PS2-1: Support an argument that the gravitational force exerted by Earth on objects is directed down\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Identify and describe observable properties of rubber and other materials through systematic observation and measurement\n- Explain how the tread pattern on a tire relates to friction and the material's ability to grip surfaces\n- Conduct comparative tests to determine which material properties are best suited for creating friction\n- Support an argument using evidence about why tire tread design matters for vehicle safety\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12 minutes)\n\n**Objective:** Activate student curiosity about tire design and material properties by examining the photograph.\n\n**Materials:**\n- Projected image of tire photograph (or printed copies for small groups)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or distribute printed images to small groups. Ask students to observe silently for 30 seconds, noticing details.\n\n2. **Ask these discussion questions** to spark curiosity:\n   - \"What do you notice about the surface of this tire? What patterns do you see?\"\n   - \"Why do you think tires have those deep grooves and bumps instead of being smooth, like a baseball?\"\n   - \"What happens to a tire when a car drives on a wet road? Why would the grooves matter?\"\n   - \"If we rubbed this tire on different surfaces—wet concrete, dry sidewalk, ice—would it feel the same on all of them? Why or why not?\"\n\n3. **Prediction Prompt:** \"I'm going to show you two rubber samples—one smooth and one with a pattern cut into it, just like tire tread. Before we test them, predict which one will slide more easily on a tilted board and which one will grip better. Write or draw your prediction.\"\n\n4. **Document predictions** on a class chart titled \"Our Predictions About Friction and Material Design.\"\n\n**Transition:** \"Today we're going to become materials scientists and test rubber and other materials to figure out how properties like texture, grip, and surface design affect how things interact with each other.\"\n\n---\n\n#### 2. EXPLORE (25 minutes)\n\n**Objective:** Students investigate how material properties affect friction through hands-on testing.\n\n**Materials:**\n- Rubber samples (smooth rubber eraser, textured rubber grip tape or shelf liner, tire tread sample if available, or cut rubber from old tire)\n- Other material samples: sandpaper, plastic, leather, felt, aluminum foil\n- Tilted board or ramp (wooden board propped at 15-20° angle)\n- Small weights or objects that fit in palm (same mass for all tests)\n- Metric ruler for measuring angles\n- Data recording sheets (printed table)\n- Tape to secure materials to ramps\n\n**Activity:**\n\n1. **Set up testing stations** with one ramp at each station (or students rotate). Ensure ramps are at the same angle.\n\n2. **Demonstrate the protocol** once:\n   - Tape a material sample to a small weight or wooden block\n   - Place it on the ramp at the bottom\n   - Slowly tilt the board until the object slides\n   - Measure how high (or what angle) the ramp reached before the object slid\n   - Record the angle\n\n3. **Student directions:**\n   - Work in pairs or small groups\n   - Test each material sample using the same procedure\n   - Predict before testing: \"Will this material grip or slide easily?\"\n   - Record the angle at which each material started to slide\n   - Observe and record descriptions of each material's surface (rough, smooth, sticky, flexible, etc.)\n   - Complete the table: Material Name | Surface Description | Prediction | Angle Before Sliding | Observations\n\n4. **Connection to photograph:** As students test, prompt them: \"Which of your test materials feels most like tire rubber? Which property makes it grip better—roughness, flexibility, or something else?\"\n\n5. **Teacher Role:** Circulate and ask guiding questions without providing answers:\n   - \"What do you notice about the materials that held on longer?\"\n   - \"How does the texture feel different between samples?\"\n   - \"If you wanted a material to grip even better, what would you change?\"\n\n**Expected Student Outcomes:**\n- Students discover that rougher, textured materials grip better and require a steeper angle before sliding\n- Students observe that smoother materials slide more easily at shallow angles\n- Students make connections between surface texture and friction\n\n---\n\n#### 3. EXPLAIN (18 minutes)\n\n**Objective:** Formalize vocabulary and concepts about material properties and friction using student discoveries.\n\n**Materials:**\n- Data table results from Explore phase (teacher compiled)\n- Chart paper with vocabulary terms\n- Photograph of tire displayed again\n- Samples from Explore phase for reference\n\n**Activity:**\n\n1. **Group Share-Out (7 minutes):** Have 3-4 groups share their most interesting discovery:\n   - \"Which material surprised you?\"\n   - \"Which material gripped the best? Why do you think that happened?\"\n   - Record findings on a class chart with all materials ranked by grip strength (angle measurements).\n\n2. **Introduce Vocabulary (6 minutes):** Display each term on chart paper with student-friendly definitions:\n\n   **Vocabulary:**\n   - **Friction:** A force that happens when two surfaces rub together; it slows down or stops motion. Rougher surfaces create more friction.\n   - **Material Property:** A characteristic or feature of a material that describes how it looks, feels, or acts (like being rough, smooth, flexible, or hard).\n   - **Texture:** How a surface feels to touch—rough, smooth, bumpy, sticky, etc.\n   - **Grip:** The ability of a surface to hold onto another surface without slipping; materials with good grip have high friction.\n   - **Tread:** The grooves or bumpy patterns on a tire's surface designed to increase friction and help the tire grip the road.\n\n3. **Connect Back to Photograph (3 minutes):**\n   - \"The tire in our photograph has deep grooves called tread. Based on what we discovered, why would a tire have tread instead of being completely smooth?\"\n   - Expected answer: \"The tread creates a rough, bumpy texture that increases friction, so the tire grips the road better and doesn't slip.\"\n   - \"When a tire gets old and worn down (like in our picture), the tread gets shallower. What might happen to a car's grip on a wet or icy road if the tread wears away?\"\n\n4. **Check for Understanding:**\n   - Show a smooth rubber eraser and a piece of sandpaper: \"Which one has better grip? Which one would you want on a tire? Why?\"\n   - Exit slip: \"Finish this sentence: A tire needs tread because _______________.\"\n\n**Expected Student Outcomes:**\n- Students can define friction and material properties accurately\n- Students explain the relationship between texture and grip\n- Students apply concepts to explain tire tread design\n\n---\n\n#### 4. ELABORATE (20 minutes)\n\n**Objective:** Students apply their understanding of material properties to design and test solutions for specific problems.\n\n**Materials:**\n- Smooth rubber samples or plastic blocks\n- Sandpaper (various grits), textured tape, craft foam, rubber cement, materials from Explore phase\n- Tilted ramps (same as Explore)\n- Weights/objects to hold materials\n- Design challenge worksheet\n- Tape, glue, scissors\n\n**Activity:**\n\n1. **Present the Challenge:**\n   - \"A car manufacturer notices that drivers are skidding on icy roads. The smooth rubber on winter tires isn't gripping well. Your job is to design a material surface that will grip better in icy conditions. You can use any materials we've tested today to modify a smooth rubber surface.\"\n\n2. **Design Process (12 minutes):**\n   - **Step 1:** Draw or describe your design. What texture or pattern will you add? Why?\n   - **Step 2:** Build your design by gluing or taping texture material onto the smooth rubber sample\n   - **Step 3:** Test your design on the ramp using the same procedure from Explore\n   - **Step 4:** Measure the angle at which it grips\n   - **Step 5:** Compare your design to the original smooth surface\n\n3. **Document Findings:**\n   - Record the angle achieved with your modified surface\n   - Write: \"My design was successful/unsuccessful because _______\"\n   - \"If I could improve my design, I would _______ because _______\"\n\n4. **Teacher Role:** \n   - Ask students to explain their design choice before testing\n   - Encourage students to predict improvement before testing\n   - Facilitate quick testing turnarounds so students can iterate\n\n5. **Share & Reflect (5 minutes):**\n   - Have 2-3 groups briefly present their most successful design\n   - Ask: \"Which design principles worked best?\"\n   - Connect to real tires: \"Car makers test thousands of tread patterns to find the best grip. Your testing today is similar to what engineers do.\"\n\n**Expected Student Outcomes:**\n- Students apply understanding to create new material surfaces with improved grip\n- Students collect measurement evidence and analyze success\n- Students articulate connections between texture design and real-world applications\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of material properties, friction, and design applications.\n\n**Activity:**\n\n**Formative Assessment Throughout Lesson:**\n- Observation during Explore phase: Were students systematic in testing? Did they control variables (angle, object mass, procedure)?\n- Exit slip from Explain phase responses\n- Quality of predictions and reasoning during Elaborate design phase\n\n**Summative Assessment — Exit Ticket (end of lesson):**\n\nDistribute an exit ticket with these questions:\n\n1. **Observation & Measurement (PS1-3):**\n   - \"Look at the photograph of the worn tire again. Describe three observable properties of the rubber material.\" (Sample answer: rough texture, dark color, grooved/patterned surface, flexible)\n\n2. **Material Properties & Function (PS1-3):**\n   - \"Why is rubber with a rough texture better for a tire than rubber that is smooth? Use evidence from today's tests in your explanation.\" (Sample answer: In our tests, the rough sandpaper gripped longer than the smooth eraser because friction is stronger on rough surfaces. Tires need good grip, so they have rough, grooved tread.)\n\n3. **Real-World Application (PS2-1 & Design Connection):**\n   - \"A tire's tread wears down over time and becomes smoother. Explain what happens to a car's grip when this occurs and why a driver should replace worn tires.\" (Sample answer: When tread wears down, the surface becomes smoother. Smoother surfaces have less friction, so the tire doesn't grip the road as well. The car could slip, especially on wet or icy roads, which is unsafe.)\n\n4. **Reasoning & Argument (PS1-3):**\n   - \"Some race car tires have a smooth surface (called slicks), while off-road vehicle tires have deep, chunky tread. Why might manufacturers design different tires for different purposes?\" (Sample answer: Slicks have less friction but better for dry track surfaces. Off-road tires need deep tread to grip dirt, mud, and rough terrain.)\n\n**Success Criteria:**\n- Student can identify at least 2 material properties accurately\n- Student uses evidence from testing to explain relationships between texture and grip\n- Student applies concepts to explain or predict real-world scenarios\n- Student's reasoning demonstrates understanding that rougher surfaces = greater friction = better grip\n\n**Expected Student Outcomes:**\n- Exit tickets show clear understanding of friction and material properties\n- Students can articulate why tread design matters for safety\n- Students connect lab evidence to real-world applications\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified Data Table:** Provide a pre-made table with material names already filled in; students only record angle measurements and one-word texture descriptions (rough/smooth). Use a number line showing angles to help them estimate.\n\n2. **Partner with Strong Peer:** Pair students with classmates who can help manage the tilting procedure and read measurements. Assign the struggling student the role of data recorder (simpler task of writing numbers).\n\n3. **Sentence Stems for Exit Ticket:** Provide partially completed sentences:\n   - \"The tire in the photo has tread because _________________.\"\n   - \"A rough surface grips better than a smooth surface because _______________.\"\n   - Allow drawing or labeling instead of full paragraphs; accept shorter responses.\n\n**Challenge (for advanced learners):**\n\n1. **Variable Testing:** Have students design an experiment to test whether *angle of the ramp* or *type of surface texture* has a bigger effect on friction. Challenge them to control one variable while changing the other systematically and create a graph showing results.\n\n2. **Real-World Research:** Provide images of different tire treads (racing slicks, all-season, winter, off-road, motorcycle). Have students research and present why engineers design different tread patterns for different conditions, creating a visual poster with evidence.\n\n3. **Extension Design Challenge:** \"Car tires need to last 25,000+ miles. Design a tread pattern that provides excellent grip AND will wear slowly over time. What trade-offs exist? Sketch your design with labels explaining how it solves both problems.\"\n\n---\n\n### Extension Activities\n\n1. **Tire Wear Investigation:** If possible, obtain photos of new vs. worn tires (or visit a tire shop/car service center). Have students measure tread depth in millimeters and predict remaining tire lifespan. Create a graph showing how tread depth changes with miles driven. Connect to concepts of material wear and friction reduction.\n\n2. **Weather & Tread Simulation:** Set up a \"track\" with water, sand, and ice (or frozen water). Test tire samples on each surface. Have students predict which tire type would work best in each weather condition and explain their reasoning based on friction and grip concepts.\n\n3. **Engineer's Challenge — Presentation:** Have students work in teams to design a new tire for a specific vehicle type (dirt bike, truck, race car, wheelchair). They must sketch the tread pattern, describe material choices, and present their reasoning to \"manufacturers\" (other students or teachers). Audience votes on best design and explains why using friction/grip concepts.\n\n---",
  "inputTokens": 286,
  "outputTokens": 3585,
  "cost": 0.0187388,
  "generatedAt": "2026-02-13T06:34:38.982Z"
}