{
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# Fourth Grade Physical Science 5E Lesson Plan: Tire Friction and Motion\n\n## Core Science Concepts from Image Analysis\n\n- **Friction and Surface Texture:** The deep tread patterns visible on the tire are designed to increase friction between the tire and the road surface, demonstrating how texture affects the force opposing motion.\n- **Energy Transfer Through Motion:** Tires convert the chemical energy from fuel into kinetic energy that propels vehicles, showing how energy changes form to enable movement.\n- **Forces and Motion Relationship:** The tire's interaction with the ground involves forces (friction, grip, traction) that determine how quickly or slowly an object can accelerate, decelerate, or maintain speed.\n- **Material Properties and Function:** The rubber material and its specific tread design are engineered to provide grip at different speeds, illustrating how material choice affects performance and safety.\n\n---\n\n## Lesson Title\n\n**Grip It! How Tread Helps Things Move**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 50-minute sessions (or three 35-minute periods)\n- **NGSS Standards:** \n  - 4-PS3-1: Use evidence to construct an explanation relating the speed of an object to the energy of that object.\n  - 4-PS3-2: Make observations to provide evidence that energy can be transferred from place to place by sound, light, heat, and electric currents.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** how different surface textures affect the speed and grip of a moving object.\n2. **Explain** the relationship between friction, tire tread, and the movement of vehicles using evidence from investigations.\n3. **Design and test** wheels or surfaces with different tread patterns to solve a motion problem.\n4. **Construct an argument** that friction is a force that affects how quickly objects can move or stop.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Spark curiosity about tires and how they help vehicles move by analyzing the photograph.\n\n**Materials:**\n- Projected or printed image of tire tread (the photograph provided)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** of the tire tread clearly so all students can see the detailed pattern. Ask students to observe silently for 15 seconds without speaking.\n\n2. **Launch with a hook question:** \"Have you ever noticed the bumpy patterns on car tires? Why do you think tires look like this instead of being smooth?\"\n\n3. **Facilitate a brief discussion** using these specific questions:\n   - \"What do you see in this picture? Describe the texture and patterns.\"\n   - \"Where have you seen tires? What do tires do?\"\n   - \"If a tire was completely smooth like a hockey puck, what might happen when a car tries to stop quickly on a rainy day?\"\n   - \"Why might these bumpy patterns be important for keeping vehicles safe?\"\n\n4. **Record student ideas** on chart paper. Validate all responses without confirming correctness yet.\n\n5. **Prediction prompt:** \"I'm going to show you that the bumpy pattern on tires is called 'tread.' Today, we're going to investigate whether tread really helps objects move and stop. What do you predict will happen if we test a smooth surface versus a bumpy one?\"\n\n**Transition:** \"Let's investigate whether tread actually makes a difference in how things move. You'll become tire engineers!\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate friction and surface texture through hands-on testing of different surfaces.\n\n**Materials (per group of 3-4 students):**\n- Smooth surface: one ceramic tile, piece of laminate flooring, or sheet of plastic\n- Textured surface: one piece of sandpaper (medium grit), rubber mat, or bath mat\n- Rolling objects (same for all tests): toy car, marble, or weighted ball (rubber ball works well)\n- Meter stick or measuring tape\n- Painter's tape or masking tape\n- Data recording sheet (provided below)\n- Ramp or inclined surface (textbook propped at angle, or wooden ramp)\n\n**Student Directions (Display on board or provide as handout):**\n\n1. **Set up your test track:** Place your smooth surface on a flat area. Use tape to mark a starting line.\n\n2. **Test 1 – Smooth Surface:**\n   - Position your rolling object at the starting line on the smooth surface.\n   - Give it a gentle push or release it from the ramp.\n   - Measure how far it travels before stopping.\n   - Record the distance in your data table.\n   - Repeat two more times and find the average distance.\n\n3. **Test 2 – Textured Surface:**\n   - Replace the smooth surface with your textured surface.\n   - Repeat steps 2 and 3, measuring the distance the object travels.\n\n4. **Observations:** As you test, record:\n   - How smoothly did the object roll on each surface?\n   - Did it make any sounds?\n   - Did it slow down faster or slower on each surface?\n\n5. **Compare your results:** Which surface allowed the object to travel farther? Why do you think this happened?\n\n**Sample Data Recording Sheet:**\n\n| Surface Type | Trial 1 Distance | Trial 2 Distance | Trial 3 Distance | Average Distance |\n|---|---|---|---|---|\n| Smooth Surface | _____ cm | _____ cm | _____ cm | _____ cm |\n| Textured Surface | _____ cm | _____ cm | _____ cm | _____ cm |\n\n**Teacher Role:**\n\n- Circulate among groups, observing without revealing answers.\n- Ask guiding questions: \"What do you notice? Why do you think the object traveled different distances? What is causing it to slow down?\"\n- Ensure consistent push force or release height across all trials.\n- Help students measure accurately but let them discover the pattern.\n- If a group finishes early, ask: \"What would happen if we made the surface even bumpier? What if we made it smoother?\"\n\n**Expected Student Outcomes:**\n\n- Students should observe that the object travels **farther on the smooth surface** and **stops sooner on the textured surface**.\n- They should recognize that something is preventing the object from sliding as far on textured surfaces.\n- They should generate initial explanations involving \"roughness\" or \"stickiness.\"\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and scientific concepts to explain observed phenomena.\n\n**Materials:**\n- Chart paper from Engage phase\n- Whiteboard or document camera\n- Visual aids: diagrams of friction (can be hand-drawn or printed)\n- The tire photograph (displayed again)\n- Friction demonstration materials (optional): two blocks, one smooth and one with sandpaper, with string attached\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Invite 2-3 groups to share their results: \"Which surface made your object stop faster?\"\n   - Ask: \"What did we learn? Did the bumpy surface or smooth surface make the object go farther?\"\n   - Record findings on chart paper.\n\n2. **Introduce Key Vocabulary (8 minutes):**\n\n   Present each term with a simple definition, using the tire photograph as visual support:\n\n   - **Friction:** A force that happens when two surfaces touch and rub against each other. It slows down moving objects. *Point to the tire tread in the photo: \"The bumpy parts create more friction with the road.\"*\n\n   - **Tread:** The bumpy or grooved pattern on a tire that increases friction and helps the tire grip the road safely. *Show the tread patterns in the photograph.*\n\n   - **Force:** A push or pull that can change how an object moves. Friction is one type of force. *Demonstrate: Push a book across the smooth table, then the textured surface.*\n\n   - **Grip or Traction:** How well a tire holds onto the road without slipping. More tread = better grip. *Ask: \"Why is this important for a car stopping at a red light?\"*\n\n   - **Energy:** The ability to move or cause change. Moving objects have energy. Friction takes away energy and makes them slow down.\n\n3. **Connection to Observations (3 minutes):**\n   - \"Remember our test? The textured surface created MORE friction. The friction was a force that slowed down our object faster. On the smooth surface, there was LESS friction, so our object traveled farther.\"\n   - Point back to the tire: \"Tires have tread to CREATE friction with the road. This friction helps cars grip the road and stop safely. Without tread, cars would slide like on ice!\"\n\n4. **Check for Understanding:**\n   - Ask: \"If a tire loses its tread and becomes smooth, will the car stop faster or slower?\" (Slower — less friction.)\n   - Ask: \"Is friction always bad?\" (No — we want friction between tires and roads for safety.)\n\n**Vocabulary Summary:**\n\n| Term | Student-Friendly Definition |\n|---|---|\n| **Friction** | A force that happens when two surfaces rub together and makes moving things slow down. |\n| **Tread** | The bumpy or grooved patterns on a tire that help it grip the road. |\n| **Force** | A push or pull that can change how something moves. |\n| **Grip/Traction** | How well a tire holds onto the road without slipping. |\n| **Energy** | The ability to move or make things happen. Moving objects have energy, and friction makes them lose it. |\n\n**Expected Student Outcomes:**\n\n- Students should understand that friction is a force caused by surface contact.\n- They should recognize that textured surfaces create more friction than smooth ones.\n- They should connect this to why tires have tread: to create friction for safety and control.\n- They should be able to use the term \"friction\" in context.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Students apply friction concepts to design and test improved tire treads.\n\n**Materials (per group):**\n- Cardboard or foam circles (3–4 inches diameter) to represent wheels\n- Textured materials to add \"tread\": markers, clay, sandpaper pieces, foam stickers, rubber bands, or adhesive-backed craft foam\n- Rolling test surface (from Explore phase)\n- Meter stick or measuring tape\n- Tape\n- Optional: toy car with removable wheels to substitute custom wheels\n\n**Activity: Design Better Tread**\n\n1. **Present the Challenge (3 minutes):**\n   - \"We know friction helps tires grip the road. But what PATTERN of tread works BEST? You're going to be tire engineers and design a new tread pattern.\"\n   - Show examples: deep grooves, small bumps, cross-hatched patterns, etc.\n   - Explain: \"You'll add tread to a wheel, test it on our track, and see if your design improves grip even more than the smooth textured surface.\"\n\n2. **Design Phase (5 minutes):**\n   - Groups sketch their tread pattern on paper first.\n   - They add tread material to their cardboard wheel to match their design.\n   - Encourage variety: different heights, patterns, and materials.\n\n3. **Test Phase (7 minutes):**\n   - Groups roll their custom wheel down the test surface (or use it on the toy car).\n   - Measure how far the wheel travels or how quickly the car stops.\n   - Record results and compare to the original smooth and textured surfaces.\n\n4. **Reflection (3 minutes):**\n   - \"Which tread design worked best? Why do you think so?\"\n   - \"Did deeper grooves help more? Did the pattern matter?\"\n   - \"Real tire engineers test hundreds of designs. Why is this important?\"\n\n**Teacher Role:**\n\n- Facilitate the design brainstorm without favoring one pattern.\n- Ensure groups understand they're testing the effect of their tread design.\n- Ask: \"How will you know if your design is better? What will you measure?\"\n- Encourage comparison: \"Is your result better than the smooth surface? Better than the textured surface from before?\"\n\n**Expected Student Outcomes:**\n\n- Students produce a custom wheel with an original tread design.\n- They collect data showing how their tread affects motion.\n- They articulate why certain tread patterns might work better (e.g., \"Deeper grooves grip better\" or \"The pattern spreads the grip across the wheel\").\n- They recognize that material scientists and engineers use testing to improve designs.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of friction, tread, and the relationship between surface texture and motion.\n\n**Formative Assessment (throughout lesson):**\n\n- **Observe during Explore:** Can students accurately measure and compare distances? Do they notice the pattern that textured surfaces slow objects down?\n- **Listen during Explain:** Do students use the term \"friction\" correctly? Can they explain why tread matters?\n- **Check during Elaborate:** Do students design a tread intentionally and test it fairly?\n\n**Exit Ticket (Summative Assessment) – Administer at end of Session 2**\n\nProvide each student with a card or paper with these questions. Students can answer with drawings, words, or both:\n\n1. **Draw or write:** Why do tires have bumpy tread instead of being smooth?\n\n2. **Multiple choice:** When a tire has less tread (becomes smoother), does the car:\n   - A) Stop faster\n   - B) Stop slower\n   - C) Stay the same\n   \n   Explain your answer in one or two sentences.\n\n3. **Real-world connection:** A race car uses smooth tires on a dry, clean track. A truck driving in the snow has deep tread. Why might each vehicle use different tires?\n\n**Success Criteria:**\n\n✓ **Proficient:** Student explains that tread creates friction, which helps vehicles grip the road and stop safely. They connect observations from the investigation to real-world tire design.\n\n✓ **Developing:** Student identifies that tread is bumpy and that bumpy surfaces slow objects down, but may not use the word \"friction\" or may have incomplete reasoning.\n\n✓ **Emerging:** Student recognizes that tires are different from other surfaces, but cannot explain why tread matters.\n\n**Expected Student Outcomes:**\n\n- 80% of students should correctly explain that bumpy tread creates friction.\n- 70% should predict that less tread = less grip and longer stopping distance.\n- 60% should connect this concept to real-world vehicle safety.\n\n---\n\n## Differentiation\n\n### Support (for struggling learners)\n\n1. **Simplified Data Sheet:** Provide a data table with fewer trials (only 1 or 2 per surface) and pre-labeled columns. Allow students to draw distance lines instead of measuring with a ruler.\n\n2. **Vocabulary Anchor Chart:** Create a visual anchor chart with pictures and simple definitions of \"friction,\" \"tread,\" and \"grip\" posted near the workspace. Encourage students to point to the chart when explaining their findings.\n\n3. **Paired Investigation:** Pair struggling students with stronger partners for the Explore phase. Assign them specific roles (measurer, recorder, observer) so all students participate actively.\n\n4. **Simplified Exit Ticket:** Allow drawings only, or provide sentence stems: \"Tires have tread because _____.\" \"When tread wears away, the car _____.\"\n\n### Challenge (for advanced learners)\n\n1. **Friction Coefficients:** After the basic investigation, introduce the concept that friction can be measured and compared using numbers. Have advanced students calculate the ratio of distance traveled on smooth vs. textured surfaces and explain what that ratio tells us about friction strength.\n\n2. **Environmental Variables:** Ask students to design an experiment testing how different conditions affect friction: wet surfaces, sloped surfaces, different materials (plastic, wood, carpet), or varying object masses. Guide them to predict outcomes and test one variable.\n\n3. **Tire Analysis:** Provide students with pictures of different tire types (racing slicks, snow tires, all-terrain tires, road tires) and ask them to research and present on why each tire design is suited to its purpose. Create a poster or slideshow explaining the relationship between tread design and environment/speed.\n\n4. **Design Challenge Extension:** Challenge students to design a wheel tread that works well on BOTH smooth and rough surfaces. Test and refine their design across multiple surface types, mimicking real-world engineering constraints.\n\n---\n\n## Extension Activities\n\n1. **Tire Wear Investigation:** Bring in old and new tires (or pictures of them) and compare tread depth. Discuss why tread wears down over time and what happens to safety as tires age. Students can measure tread depth with a penny (Lincoln's head test) and predict stopping distance based on tread wear.\n\n2. **Friction in Your Classroom:** Send students on a \"friction hunt\" around the school. They find examples of surfaces designed for grip (stair treads, playground surfaces, shoe soles) and surfaces designed for sliding (dance floors, ice rinks). Create a poster or presentation categorizing things by their friction purpose.\n\n3. **Speed and Stopping Distance Simulation:** Use a toy car on a ramp and vary the height to change speed. Test how far the car travels on smooth vs. textured surfaces at different speeds. Graph the results and discuss the relationship between speed, friction, and stopping distance. Connect to real-world vehicle safety (why speed limits are lower in wet or snowy conditions).\n\n4. **Material Testing:** Expand the investigation by testing many materials: rubber, sandpaper, foam, bubble wrap, velcro, grass, carpet, etc. Create a friction ranking chart and discuss why certain materials are chosen for specific purposes (e.g., rubber for tires, sandpaper for grip).\n\n5. **Inventor Profile:** Research and present on a scientist or engineer who works with tires, materials, or friction (e.g., Goodyear, Michelin, a modern tire designer). Share how they test tires and what new technologies are being developed for better grip and safety.\n\n---\n\n## Notes for Teacher Preparation\n\n- **Safety:** Ensure rolling objects stay on the floor and don't roll into students' faces or spaces.\n- **Materials sourcing:** Textured materials (sandpaper, rubber mats) are inexpensive and available at hardware or craft stores. Cardboard circles can be cut from paper towel tubes or purchased as craft wheels.\n- **Video support (optional):** Consider showing a brief 2–3 minute video of a car testing tires with different tread depths on a wet surface. This reinforces the real-world connection.\n- **Formative checks:** Observe student language during group work. Are they using \"friction,\" \"tread,\" and \"grip\" naturally? This indicates concept ownership.\n- **Time flexibility:** If students are deeply engaged in the Elaborate phase, allow extra time for testing and design refinement rather than rushing to Evaluate.",
  "inputTokens": 302,
  "outputTokens": 4393,
  "cost": 0.022794799999999997,
  "generatedAt": "2026-02-13T06:33:57.762Z"
}