{
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Forces and Friction in Motion\n\n### Core Science Concepts from Image Analysis\n\n- **Friction:** The textured tread pattern on tires creates friction when in contact with the ground, which affects how objects move and stop.\n- **Forces and Motion:** The design of tire treads demonstrates how forces (like grip and resistance) influence an object's ability to accelerate, decelerate, and change direction.\n- **Material Properties and Function:** The rubber material and tread pattern are specifically designed to reduce slipping and increase traction—showing how the properties of materials affect their ability to perform a function.\n- **Unbalanced Forces:** Tires experiencing different amounts of friction from surfaces (wet, dry, smooth, rough) demonstrate how unbalanced forces change an object's motion.\n\n---\n\n### Lesson Title\n\nRolling, Gripping, and Stopping: Investigating Friction with Tires and Wheels\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Physical Science)\n- **Time Allotment:** Two 45-minute sessions\n- **NGSS Standards:** \n  - 3-PS2-1: Plan and conduct an investigation to provide evidence of the effects of balanced and unbalanced forces on the motion of an object.\n  - 3-PS2-2: Make observations and/or measurements of an object's motion to provide evidence that a pattern can be used to predict future motion.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- **Plan and conduct an investigation** to test how different surfaces affect how far a rolling object travels before stopping.\n- **Make observations and measurements** of how friction (a force) changes an object's motion.\n- **Explain the relationship** between the texture of a surface and the amount of friction it creates.\n- **Predict** which surfaces will stop a rolling object more quickly based on observations of friction.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about friction and motion using the tire photograph.\n\n**Materials:**\n- Printed photograph of the tire tread (or displayed on screen)\n- Toy car or ball for demonstration\n- Smooth and rough surface samples (e.g., paper, sandpaper, carpet piece)\n\n**Activity:**\n\n1. **Display the photograph** of the tire tread on the board or screen. Ask students to look closely at the patterns without explaining what they are yet.\n\n2. **Ask these discussion questions:**\n   - \"What do you notice about the pattern on this rubber tire? Why do you think it has all these lines and bumps?\"\n   - \"Have you ever felt a tire on a car or bike? What does it feel like compared to a smooth surface?\"\n   - \"Why do you think a tire might be bumpy instead of smooth and slippery like ice?\"\n   - \"If a car tire was completely smooth like plastic, what might happen when it rained or when the car tried to stop?\"\n\n3. **Predict and Wonder Prompt:** \"I'm going to roll this toy car down two different surfaces—one smooth and one rough. Before I do, predict: Which surface will make the car stop faster? Why do you think that?\"\n\n4. **Demonstrate** rolling the car down a smooth surface (e.g., tile or plastic) and a rough surface (e.g., carpet or sandpaper). Record student observations on chart paper.\n\n**Transition:** \"Today, we're going to become friction scientists! We're going to test different surfaces just like the tire in this picture, and measure how far objects roll before they stop.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover how friction affects motion through hands-on experimentation.\n\n**Materials (per group of 3-4 students):**\n- 1 toy car or rolling ball\n- 1 meter stick or measuring tape\n- 4-5 different surface samples: smooth cardboard, sandpaper (rough), paper towel, fabric/cloth, aluminum foil\n- Tape (to secure surfaces to a ramp or table)\n- Paper for recording data\n- Pencil\n\n**Activity:**\n\n1. **Explain the Setup (Teacher models first):** \"We're going to create a simple ramp using these materials. Each group will test the same toy car rolling down the same ramp, but we'll change the surface it lands on. We'll measure how far the car travels before it stops.\"\n\n2. **Student Steps:**\n   - **Step 1:** Set up a small ramp or smooth rolling path. Groups should have the same starting height so the car always has the same amount of starting force.\n   - **Step 2:** Place the first surface (e.g., smooth cardboard) at the bottom of the ramp using tape.\n   - **Step 3:** Release the car from the same starting point and watch where it stops.\n   - **Step 4:** Use the meter stick to measure the distance from where the car left the ramp to where it stopped. Record the measurement.\n   - **Step 5:** Repeat with the same surface two more times to check if you get similar results.\n   - **Step 6:** Switch to a new surface and repeat steps 3-5.\n\n3. **What to Record:**\n   - Create a simple table with: Surface Type | Distance 1 | Distance 2 | Distance 3 | Average Distance\n   - Have students draw pictures of each surface and describe what it feels like (smooth, bumpy, rough, scratchy).\n\n4. **Connection to the Photo:** \"Just like the tire tread in the picture, some surfaces have bumps and texture. Others are smooth. Your job is to discover which kind of surface stops the rolling object faster.\"\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What do you notice about how far the car travels on this surface? Does it go the same distance each time? Which surface stopped it the quickest?\"\n- Help students measure accurately without giving the answer about which surface \"wins.\"\n- Encourage students to observe what the car does—does it slide, roll smoothly, slow down gradually, or stop suddenly?\n\n**Expected Student Outcomes:**\n- Students discover that rougher, textured surfaces stop the rolling object sooner (shorter distance).\n- Students notice that smoother surfaces allow the object to travel farther.\n- Students recognize that repeated trials produce similar (but not always identical) results.\n- Students create a data table showing their measurements.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts, connecting exploration to the tire photograph.\n\n**Materials:**\n- Chart paper or whiteboard\n- Printed photograph of tire tread\n- Simple tactile samples (sandpaper, silk fabric, aluminum foil) for class to touch\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask each group: \"Which surface stopped the car the fastest? Which surface let it travel the farthest?\"\n   - Create a class graph or chart showing all groups' average distances by surface type.\n   - Ask: \"What pattern do you see? Do the rough surfaces always make the car stop sooner?\"\n\n2. **Introduce Key Vocabulary (Teacher-Led, 8 minutes):**\n   \n   **Vocabulary:**\n   - **Friction:** A force that happens when two surfaces rub against each other. Friction slows things down or stops them from moving.\n   - **Rough Surface:** A surface that is bumpy and uneven, which creates a lot of friction.\n   - **Smooth Surface:** A surface that is flat and even, which creates less friction.\n   - **Force:** A push or pull that makes something move, stop, or change direction.\n   - **Texture:** How a surface feels when you touch it—bumpy, smooth, sticky, etc.\n\n3. **Connect Back to the Photograph (5 minutes):**\n   - Show the tire photo again. \"This tire has a bumpy texture, right? That's the tread. Why would a car tire need to have tread instead of being smooth like a ping-pong ball?\"\n   - Explain: \"The bumpy tread creates friction between the tire and the road. This friction helps the car grip the road, speed up, slow down, and turn without sliding. Without friction from the tread, the car would slip and slide, especially on wet roads.\"\n   - Ask: \"Have you ever noticed tire tracks in dirt or snow? The bumpy tread makes those patterns!\"\n\n4. **Check for Understanding:**\n   - Ask individual students: \"If a tire was perfectly smooth with no tread, would it stop faster or slower than a tire with tread? Why?\"\n   - Have students touch different samples and say whether they create \"high friction\" or \"low friction.\"\n\n**Expected Student Outcomes:**\n- Students understand that friction is a force created by surfaces rubbing together.\n- Students recognize that rougher surfaces create more friction than smooth surfaces.\n- Students can explain why tire tread is important for safety and control.\n- Students can predict which surfaces will have more or less friction based on how they look and feel.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply concepts to a new context and deepen understanding of friction and forces.\n\n**Materials:**\n- Toy cars or rolling balls\n- 3-4 different \"road\" designs students create (see below)\n- Ramps or rolling paths\n- Craft materials: salt, flour, sand, water, paint (in shallow trays or on paper)\n- Measuring tapes\n- Chart paper for predictions\n\n**Activity:**\n\n**Real-World Challenge: Designing Roads for Safety**\n\n1. **Scenario:** \"Road engineers need to decide what to put on different types of roads to keep cars safe. In a parking lot, they need cars to be able to stop quickly. On a highway, they want cars to be able to go fast without too much friction. What surfaces or materials would they use?\"\n\n2. **Design Task for Groups:**\n   - Each group chooses or creates a different \"road surface\" using available materials:\n     - Salt or sand sprinkled on a smooth surface\n     - Flour on paper\n     - Wet vs. dry surfaces\n     - Textured craft paper\n   - Group predicts: \"Will this surface create high friction or low friction? Will our car stop quickly or travel far?\"\n   - Test the car on their designed surface and measure the distance.\n   - Compare results to their predictions.\n\n3. **Gallery Walk (optional):**\n   - Groups display their surfaces and data.\n   - Other students observe and discuss: \"Why did this surface create more or less friction than we expected?\"\n\n4. **Discussion:**\n   - Ask: \"In real life, where do we need high friction (like playgrounds, driveways)? Where might we want less friction (like parking lots where cars need to move freely)?\"\n   - \"What happens to friction on a rainy day? (The water creates less friction—it's slippery!)\"\n   - Connect to the tire: \"That's why tread is even more important in wet weather!\"\n\n**Teacher Role:**\n- Facilitate group decision-making about materials without telling them what to use.\n- Ask probing questions: \"Why did you choose that material? What do you think will happen?\"\n- Help students connect their predictions to their results.\n\n**Expected Student Outcomes:**\n- Students apply their understanding of friction to a new context (road design).\n- Students recognize that friction depends on both the surfaces involved and conditions (wet/dry).\n- Students can explain why different real-world places need different amounts of friction.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of forces, friction, and motion.\n\n**Activity:**\n\n**Formative Assessment (During the lesson):**\n- Observe students during Explore phase: Are they making careful measurements? Do they notice patterns in their data?\n- Listen to explanations during group share-out: Can students describe which surfaces create more friction?\n- Ask guiding questions during Elaborate phase: Can students predict outcomes and connect to real-world examples?\n\n**Exit Ticket (Summative Assessment):**\n\nProvide each student with a simple sheet or have them respond verbally/in writing to these questions:\n\n1. **Drawing Prompt:** \"Draw a surface that would create HIGH friction and a surface that would create LOW friction. Label them.\"\n\n2. **Multiple Choice:** \"Which of these surfaces would STOP a rolling toy car the fastest?\n   - A) Smooth plastic\n   - B) Rough sandpaper\n   - C) Aluminum foil\n   (Correct answer: B)\n\n3. **Explain:** \"Why does a car tire need to have bumpy tread on it? Use the word 'friction' in your answer.\"\n\n4. **Predict:** \"If you pour water on a road, will a car stop faster or slower? Why?\"\n\n**Success Criteria for Student Understanding:**\n- ✓ Student can identify which surfaces create more or less friction.\n- ✓ Student can explain that friction is a force that slows down or stops motion.\n- ✓ Student can predict how changing a surface will change how far a rolling object travels.\n- ✓ Student can connect friction to real-world examples (tires, roads, playgrounds).\n- ✓ Student's measurements and data table are reasonably accurate and show consistent results.\n\n**Expected Student Outcomes:**\n- Most students will demonstrate understanding that rough surfaces create more friction than smooth surfaces.\n- Students will recognize friction as a force that affects motion.\n- Students will apply this concept to explain why tire tread is important.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplified Data Table:** Provide a pre-made data table with surface names already filled in. Students only need to measure and record numbers. Use pictures of surfaces instead of words.\n\n2. **Peer Partnerships:** Pair struggling students with stronger measurement skills alongside a peer for the Explore phase. Assign specific roles (one measures, one records, both predict).\n\n3. **Concrete Comparisons:** During Explain phase, let these students physically touch and compare surfaces (sandpaper vs. foil) before discussing abstract concepts. Use very simple language: \"Bumpy = more friction = stops faster. Smooth = less friction = goes farther.\"\n\n4. **Modified Exit Ticket:** Allow students to point to pictures or use very simple 1-2 word answers instead of full sentences.\n\n**Challenge (for advanced learners):**\n\n1. **Quantitative Analysis:** Ask advanced students to graph their group's data and compare it to other groups' graphs. Ask: \"Why did different groups get slightly different results with the same surface? What variables might have affected this?\"\n\n2. **Variables Investigation:** Have students design an experiment testing how the angle of the ramp affects friction, or whether the weight of the rolling object matters. Predict and test outcomes.\n\n3. **Real-World Application:** Challenge students to research and present on tire tread depth standards, anti-lock braking systems (ABS), or how different tires are designed for different weather conditions. Create an informational poster or short presentation.\n\n4. **Extended Comparison:** Ask students to compare friction in other systems: \"How is friction between tire and road similar to friction between shoe and floor? How is it different?\" or \"How would friction work on the moon, where there's no air or water?\"\n\n---\n\n### Extension Activities\n\n1. **Friction Scavenger Hunt (10-15 minutes):** Students walk around the classroom and school to identify high-friction and low-friction surfaces. Create a list or poster: \"Surfaces with HIGH friction: sandpaper, carpet, the classroom floor\" and \"Surfaces with LOW friction: glass, tile, plastic slides.\" Discuss why each space has the friction it does.\n\n2. **Design a Playground Challenge:** Students design a safe playground surface, considering friction. They sketch their design and explain why they chose that material. (Playground surfaces need high friction to prevent kids from sliding!) Display designs in the classroom or hallway.\n\n3. **Water and Ice Friction Experiment:** In cooler months or with access to ice, have students test how water and ice affect friction. Roll a toy car on a wet vs. dry surface, or compare ice to regular carpet. Discuss why cars slip on ice and roads are treated with salt. This connects to weather and seasonal changes and deepens understanding of how friction changes with conditions.\n\n---",
  "inputTokens": 220,
  "outputTokens": 3735,
  "cost": 0.0194228,
  "generatedAt": "2026-02-13T06:33:10.280Z"
}