{
  "id": 0,
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "gradeLevel": "Fifth Grade",
  "content": "# Fifth Grade Science Lesson: Tire Wear and Material Properties\n\n## 📸 Photo Description\n\nThis image shows several vehicle tires with deep tread patterns—the grooves and ridges molded into the rubber surface. The treads are visibly worn down and dirty, showing how tires change over time from repeated use on roads. In the background, you can see a car wheel and metal rim, which helps you understand how tires are part of a vehicle's system.\n\n## 🔬 Scientific Phenomena\n\n**Anchoring Phenomenon:** *Why do tire treads wear down over time?*\n\nTire tread wears away due to **friction**—the force created when the rubber tire surface rubs against the road. Every time a car drives, the tire makes contact with the pavement, and tiny bits of rubber are scraped away. This happens repeatedly over thousands of miles of driving. The friction also creates heat, which can speed up the wearing process. Additionally, the weight of the vehicle pressing down on the tire adds pressure that increases wear. Eventually, when treads become too shallow, the tire no longer grips the road safely, and it must be replaced.\n\n## 📚 Core Science Concepts\n\n* **Friction:** A force that occurs when two surfaces rub against each other, causing resistance and wear. Friction between the tire and road is what slows down a car and allows it to grip the road.\n\n* **Material Properties and Wear:** Rubber is a material that can be worn away by repeated rubbing and friction. Different materials (like rubber, plastic, or metal) wear at different rates depending on their properties.\n\n* **Force and Motion:** The weight of the vehicle (a downward force) combined with the motion of driving creates continuous stress on tires, which causes them to gradually break down.\n\n* **Energy Transfer:** Friction converts some of the energy from a moving car into heat and wear, which is why tires get warm during driving and eventually deteriorate.\n\n<pedagogical-tip>\nConsider bringing a worn tire tread gauge or an actual worn tire to class so students can observe the depth difference between new and old treads. This concrete visual makes the abstract concept of friction's effects much more tangible for fifth graders who are still developing abstract reasoning skills.\n</pedagogical-tip>\n\n<udl-suggestions>\n**Representation:** Provide high-contrast close-up photos of tire treads alongside diagrams showing the friction process. For kinesthetic learners, use a worn piece of sandpaper and a smooth piece to physically demonstrate how surfaces change with friction. **Action & Expression:** Allow students to choose between drawing a labeled diagram, creating a digital slide, or building a model to explain tire wear.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n**Performance Expectation:**\n5-PS2-1: Support an argument that the gravitational force exerted by Earth on objects is downward.\n\n**Disciplinary Core Ideas:**\n* [[NGSS:DCI:5-PS2.A]] (Forces and Motion)\n* [[NGSS:DCI:5-PS2.B]] (Types of Interactions)\n\n**Crosscutting Concepts:**\n* [[NGSS:CCC:Cause and Effect]]\n* [[NGSS:CCC:Energy and Matter]]\n\n---\n\n## 💬 Discussion Questions\n\n1. **What do you think would happen to a tire if someone drove a car in circles in the same spot over and over?** (Bloom's: Predict/Analyze | DOK: 2)\n\n2. **Why might a race car driver need to change tires more often than someone who drives slowly on quiet streets?** (Bloom's: Analyze | DOK: 3)\n\n3. **How could tire companies design a tire that lasts longer without wearing out as quickly?** (Bloom's: Create/Evaluate | DOK: 3)\n\n4. **Explain the connection between friction, heat, and tire wear. Why do all three happen together?** (Bloom's: Understand/Analyze | DOK: 2)\n\n---\n\n## 📖 Vocabulary\n\n* **Tread:** The grooved pattern on the surface of a tire that helps it grip the road and channels water away.\n\n* **Friction:** A force that resists motion when two surfaces rub together; it slows things down and can create heat and wear.\n\n* **Wear:** The gradual damage or loss of material that happens when something is used repeatedly over time.\n\n* **Grip:** The ability of a tire to hold firmly to the road surface without slipping.\n\n* **Material Properties:** The characteristics of a substance that describe how it looks, feels, and behaves (like hardness, flexibility, or resistance to wear).\n\n---\n\n## 🌡️ Extension Activities\n\n1. **Tire Tread Measurement Lab:** Provide students with pennies, a ruler, and pictures of different tires (or actual tire cross-sections if available). Have them measure tread depth using a penny (inserting Lincoln's head to see how deep the groove is). Students can compare new tires to worn ones and graph their findings. This makes the invisible wear visible and quantifiable.\n\n2. **Friction Exploration Station:** Set up three surfaces (smooth tile, carpeted floor, sandpaper) and have students roll a toy car down ramps of equal height onto each surface. Students measure and record how far the car travels on each surface, then write a conclusion about which surface causes more friction and why this relates to tire wear.\n\n3. **Design a Better Tire Challenge:** In small groups, have students sketch or build a prototype tire (using clay, rubber bands, or other safe materials) that they think would last longer. Students must explain the scientific reasoning behind their design choices (e.g., thicker rubber, different tread patterns, harder material). They can test prototypes by dragging them across sandpaper and comparing wear.\n\n---\n\n## 📚 External Resources\n\n**Children's Books:**\n* *Tires* by Mari Schuh (Simple Machines series) – Explains how tires work and why they're important.\n* *How Do Wheels Work?* by Thomas K. and Heather Adamson – Covers tires, friction, and vehicle systems in accessible language.\n* *What Do Wheels Do?* by Robin Page – Picture book exploring wheels, tires, and motion.\n\n**YouTube Videos:**\n* **\"How Tires Are Made\" by National Geographic Kids** (3 min) – Shows the manufacturing process and explains tire materials; [https://www.youtube.com/watch?v=_mzLmx2-FN0](https://www.youtube.com/watch?v=_mzLmx2-FN0)\n\n* **\"Friction for Kids\" by ScienceStruck** (5 min) – Animated explanation of friction with relatable tire examples; [https://www.youtube.com/watch?v=kj4e6KDVy1k](https://www.youtube.com/watch?v=kj4e6KDVy1k)\n\n---",
  "generatedAt": "2026-02-06T23:20:08.834Z"
}