{
  "title": "Tires",
  "category": "physical-science",
  "imageFile": "tires.jpg",
  "imagePath": "images/physical-science/tires.jpg",
  "content": "# Engineering Design Challenge: Tire Tread & Grip\n\n### Visible Elements in Photo\n- Vehicle tire with deep, angular tread patterns carved into rubber surface\n- Metal alloy wheel rim with ventilation holes (visible in background)\n- Multiple tires stacked or arranged side-by-side\n- Weathered, dirt-covered rubber showing wear and texture variation\n- Shadow details revealing the 3D depth of tread blocks\n\n### Reasonable Inferences\n- **From tread pattern**: The angular grooves and blocks are designed to channel water and improve grip on wet or loose surfaces (function visible in form).\n- **From wear/dirt accumulation**: Tires experience repeated friction, temperature changes, and environmental exposure over time, requiring durable material.\n- **From stacking**: Multiple tires suggest replacement cycles and the need for tire durability testing or evaluation.\n\n---\n\n### Engineering Task\n\n**K-2: Make a Wheel That Grips**\nDesign and build a spinning wheel (using a paper plate, plastic lid, or foam circle) that can grab and pull a toy car or block across a smooth table. Add bumps, ridges, or textured stickers to the bottom to make it \"grippy\" like a tire. Test: Does it pull better than a smooth wheel? What sticks best?\n\n**3-5: Design a Tread Pattern for Traction**\nYour challenge: Design a tire tread pattern that maximizes grip on a wet, slippery surface (smooth linoleum or plastic sheet sprayed lightly with water) while minimizing rolling resistance. Using foam circles, clay, or carved rubber erasers, carve or glue different groove patterns. **Success criteria**: (1) Pattern must cover at least 60% of the wheel surface, (2) Test rolling distance on wet surface—pattern must allow the wheel to stop within 2 feet when rolled from a 3-foot ramp, (3) Document why your pattern works (explain groove angle, depth, and spacing).\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nTires exist to solve a real-world problem: grip and safety. The photo shows the *solution* (tread design) but doesn't show the *problem* in action (slipping, hydroplaning, or loss of control). Starting with **Ask / Define Problem** lets students first understand *why* tread matters before they redesign it. This grounds the challenge in authentic need rather than jumping to prototype-building.\n\n---\n\n### Suggested Materials\n- Foam circles, cardboard discs, or paper plates (wheel blanks)\n- Clay, playdough, or craft foam (for carving tread)\n- Textured tape, sandpaper, or sticky-back foam (for adding grip)\n- Water spray bottle or shallow water tray (for wet-surface testing)\n- Ramp (wooden board, cardboard tube, or ruler propped at 20–30°)\n\n---\n\n### Estimated Time\n**K-2**: 40–50 minutes (5 min brief, 20 min build, 15 min test & compare, 10 min share results)  \n**3-5**: Two 40-minute sessions (Session 1: Ask/design, 15 min build; Session 2: Test, analyze, refine, 30 min)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (*Define the design problem*) by having students identify that grip, durability, and control are engineering requirements, then test whether their design choices actually meet those needs in a measurable way.",
  "inputTokens": 2327,
  "outputTokens": 808,
  "cost": 0.006367,
  "generatedAt": "2026-02-09T13:44:57.433Z"
}