{
  "title": "Seedling",
  "category": "life-science",
  "imageFile": "100_1681.jpeg",
  "imagePath": "images/life-science/100_1681.jpeg",
  "content": "# Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- A dark glass bottle (appears to be a plastic or glass beverage container) lying horizontally on a tan/beige surface\n- A green plant seedling with three leaves and a thin stem growing from inside or near the bottle's opening\n- A window with white and tan trim in the background\n- Dense, overgrown vegetation (shrubs and weeds) visible through the glass window\n- Red metal cap or band visible on the bottle's opening\n\n### Reasonable Inferences\n\n- **From the seedling in the bottle**: The bottle is being repurposed as a growing container, suggesting a need to create a closed or protected environment for plant growth using recycled materials.\n- **From the overgrown vegetation outside**: Plants grow readily in this outdoor setting when given space and sunlight, implying that controlled indoor growing conditions (like this bottle setup) might serve a purpose—perhaps for space-limited environments, water conservation, or seed starting.\n- **From the bottle's placement indoors on a surface near a window**: This is a deliberate growing setup designed to provide light and stability while containing soil, water, and roots in a confined space.\n\n### Engineering Task\n\n**K–2 Version:**\nDesign a water home for a plant using a bottle. Your bottle home must:\n- Hold soil and a baby plant safely\n- Let water reach the plant's roots\n- Sit steady on a shelf or table without tipping\n- Get sunshine through a window\n\nShow your teacher how your plant home works and keep a picture to see if your plant grows after one week.\n\n**3–5 Version:**\nDesign a self-contained plant-growing system using a recycled plastic bottle that maximizes plant growth while minimizing water waste over two weeks. Your system must:\n- Use only one 500 mL or larger plastic bottle as the main container\n- Support a seedling or seed using soil (max. 2 liters of soil per system)\n- Retain water efficiently (measure soil moisture daily with a simple moisture test—e.g., finger depth or paper towel check)\n- Remain stable on a flat surface and not leak onto surfaces\n- Receive consistent indirect or direct light\n\nSuccess is measured by: seedling height (in cm) after 14 days, soil moisture consistency (recorded daily), and zero spillage or structural failure.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real-world solution already in place (a bottle used as a planter), which makes it perfect for the *Ask* phase. Students can observe the setup and define the underlying need: \"How can we grow plants in small spaces using recycled materials?\" This mirrors the problem-solving thinking visible in the photo itself—someone identified a constraint (limited space or resources) and reused a bottle to solve it. Students must first understand *why* this design choice was made before improving or iterating on it.\n\n### Suggested Materials\n\n1. Clear plastic bottles (500 mL–2 L, clean and dry)\n2. Potting soil or garden soil\n3. Small seedlings, seeds, or cuttings (bean seeds, herb seedlings, or fast-growing plants like lettuce or radish)\n4. Water (for daily watering)\n5. Measuring tape or ruler, small cups or syringes (for consistent water measurement)\n\n*Optional*: Pebbles or gravel for drainage, markers for labeling, paper towels for moisture testing.\n\n### Estimated Time\n\n**Single session**: 45–60 minutes (setup, planting, initial observations).  \n**Full challenge** (if observing growth over 2 weeks): 45 minutes initial setup + 5 minutes daily maintenance checks + 20 minutes final documentation and reflection.\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem reflecting a need or a want*) and **K-2-ETS1-1** (*Ask questions, make observations, and gather information about a situation people want to change to define a simple problem that can be solved through engineering*) by having students identify the real-world constraint (limited growing space) and engineer a scalable, measurable solution using waste reduction.",
  "inputTokens": 2334,
  "outputTokens": 943,
  "cost": 0.007049,
  "generatedAt": "2026-02-09T13:10:47.455Z"
}