{
  "title": "100_1681",
  "category": "life-science",
  "imageFile": "100_1681.jpeg",
  "imagePath": "images/life-science/100_1681.jpeg",
  "content": "# Engineering Design Challenge: Plant Propagation in Repurposed Containers\n\n### Visible Elements in Photo\n- Dark plastic bottle (appears to be a repurposed beverage container) with soil and sprouting plant inside\n- Living plant seedling with green heart-shaped leaves and a thin green stem\n- Red metal lid/cap on the bottle (appears to be securing or sealing the top)\n- Yellow/tan surface (windowsill or table)\n- Window with white frame and overgrown green vegetation visible outside\n- Bright natural sunlight illuminating the scene\n\n### Reasonable Inferences\n- **From bottle + plant + soil**: This is a DIY hydroponic or soil-based propagation system—someone has repurposed a bottle as a mini greenhouse or planter to grow a cutting or seedling.\n- **From plant health + sunny location**: The setup is positioned in a high-light area to support photosynthesis and growth.\n- **From sealed lid + moist appearance**: The lid may trap humidity to create a humid microclimate that encourages root development and reduces water loss.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Plant Home in a Bottle**\n\nDesign and build a bottle home to help a plant cutting grow strong roots. You have a plastic bottle, soil, water, and a cutting from a plant. Your bottle home must:\n- Hold the soil without spilling\n- Keep the plant standing up straight\n- Let light reach the plant\n- Keep the soil wet but not underwater\n\nCan you make your plant cutting grow roots in one week?\n\n---\n\n**3-5: Design an Optimized Propagation Chamber**\n\nEngineer a repurposed bottle system that maximizes root development for plant cuttings in 2–3 weeks. Your design must meet these criteria:\n\n**Constraints:**\n- Use only one plastic bottle (any size) and recycled materials\n- System must fit on a windowsill\n- Cannot cost more than $2 in new materials\n\n**Success Criteria (measurable):**\n- Cutting develops visible roots ≥1 cm long within 2 weeks\n- Soil moisture stays consistent (no wilting, no waterlogging)\n- Seedling height increases by at least 2 cm\n- Lid/cover design maintains humidity while allowing light penetration\n\n**Test variables:** Compare two designs—one sealed and one open-topped—to determine which produces faster root growth.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\n*Why this phase fits:* The photo shows a real-world solution (bottle propagation system) already in place, but students don't yet understand *why* it works or *how well* it works compared to alternatives. The task asks students to identify the problem (how do we help cuttings grow roots?) and investigate whether the visible design truly solves it optimally. This opens exploration before jumping to \"build exactly this.\"\n\n---\n\n### Suggested Materials\n- Plastic bottles (2-liter soda or water bottles, cleaned)\n- Potting soil or coconut coir\n- Plant cuttings (coleus, philodendron, or herbs like basil—fast-rooting species)\n- Rubber bands or tape (to secure lids or covers)\n- Plastic wrap or clear plastic bags (optional, for sealed-chamber variation)\n- Ruler (to measure root and stem growth)\n- Water (distilled or tap)\n\n---\n\n### Estimated Time\n**Two 40-minute sessions** (or one 60–75-minute block)\n- Session 1: Ask/Define the problem, observe the photo, plan designs, and set up bottles (25–30 min)\n- Session 2 (after 1–2 weeks): Test, measure growth, compare results, and iterate (30–40 min)\n\n*Note: Root development requires 7–14 days; plan follow-up observations on day 3, 7, and 14.*\n\n---\n\n### Why This Works for Teachers\nThis task directly aligns with **NGSS ETS1.A: Defining Engineering Problems** (K–5) by asking students to identify what plants need to grow roots and to test whether a real-world design solves that problem—bridging life science observation with engineering systems thinking.",
  "inputTokens": 2201,
  "outputTokens": 954,
  "cost": 0.0069710000000000015,
  "generatedAt": "2026-02-12T02:34:30.140Z"
}