{
  "title": "American Robin",
  "category": "life-science",
  "imageFile": "american_robin.jpg",
  "imagePath": "images/life-science/american_robin.jpg",
  "content": "# NGSS Engineering Design Challenge\n\n### Visible Elements in Photo\n\n- Small bird (American robin) perched on a large, rough stone/rock\n- Rocky, sandy ground scattered with pebbles and small stones\n- Low green shrubs and vegetation in the background\n- Natural outdoor habitat with mixed terrain (rock, soil, plants)\n- Bird's small size relative to the rock it is standing on\n\n### Reasonable Inferences\n\n- **From the bird's posture on the rock**: The bird uses elevated perches to scout for food and watch for danger, suggesting that height and stability matter for survival.\n- **From the rocky ground**: Small animals in this habitat need shelter from predators and weather; rocks provide natural protection and lookout points.\n- **From mixed terrain**: The bird must navigate and survive in an environment with both open space and dense vegetation, requiring adaptability.\n\n### Engineering Task\n\n**K-2: Build a Safe Lookout Post for the Robin**\n\nImagine this robin needs a safe place to stand and watch for danger. Using rocks, sticks, and clay, build a small lookout post (about the size of your hand) where the bird can rest and see everything around it. Your post should be sturdy enough that it won't tip over, and the bird should be able to stand on top without sliding off.\n\n---\n\n**3-5: Design a Predator-Alert Perch**\n\nDesign and build a perch structure that allows a small bird to stand safely while maximizing visibility of its surroundings. Your perch must:\n- Be at least 15 cm tall so the \"bird\" can see above ground obstacles\n- Support a 50-gram weight (simulating the bird) without tipping\n- Use only natural materials (rocks, branches, clay, soil) found outdoors or in a classroom collection\n- Have a stable base with a diameter no larger than 10 cm\n\nTest your design by placing the weight on top and observing how long it remains stable when gently bumped from different directions.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This phase fits best because the photo shows a real-world habitat and a specific animal behavior (perching for safety and surveillance). Students begin by asking, \"Why does the robin need to be up high? What problems does it face on the ground?\" This grounds the engineering task in observable nature before jumping to building solutions.\n\n### Suggested Materials\n\n- Small rocks or pebbles (various sizes)\n- Sticks or twigs\n- Air-dry clay or natural soil\n- Gravel or sand\n- A toy bird figurine or weighted object (50g mass for 3-5)\n\n### Estimated Time\n\n- **K-2**: 20–30 minutes (design and build)\n- **3-5**: 45–60 minutes (design, build, test, and revise)\n\n### Why This Works for Teachers\n\nThis task directly supports **NGSS ETS1.A** (defining engineering problems based on criteria and constraints) by anchoring the design challenge in an observable animal need, making the \"why we build\" as clear as the \"what we build.\"",
  "inputTokens": 2328,
  "outputTokens": 692,
  "cost": 0.005788,
  "generatedAt": "2026-02-09T13:39:32.314Z"
}