{
  "title": "Amphibian",
  "category": "life-science",
  "imageFile": "amphibian.jpg",
  "imagePath": "images/life-science/amphibian.jpg",
  "content": "# Engineering Design Challenge: Climbing Creature Habitat\n\n### Visible Elements in Photo\n- Three tree frogs with bumpy, textured skin (gray-brown coloration)\n- Adhesive toe pads visible on all frogs' feet\n- A smooth, whitewashed wooden surface (the frogs are resting on it)\n- Varied body sizes among the three individuals\n- Yellow/gold coloring visible on at least one frog's underside or leg\n\n### Reasonable Inferences\n- **From adhesive toe pads**: These frogs climb vertical surfaces in their natural habitat and need structures with varying grip levels to move safely.\n- **From smooth wooden surface**: The frogs are currently on a surface that doesn't mimic their natural environment (trees, rough bark); they require textured climbing surfaces.\n- **From body size variation**: Different-sized frogs need climbing structures with features (grip, handholds, spacing) that accommodate multiple sizes.\n\n### Engineering Task\n\n**K-2: Build a Climbing Home for Frogs**\nDesign and build a climbing wall or tree for frogs using natural and craft materials. Your wall needs rough spots where frogs can grip with their sticky feet, smooth spots where they can rest, and at least two levels. Test it by gently placing a toy frog on it—does it stay in place or slide down?\n\n**3-5: Design a Multi-Level Climbing Structure for Tree Frogs**\nDesign a vertical climbing structure that accommodates frogs of three different sizes (small, medium, large). Your structure must:\n- Include at least 3 distinct climbing surfaces with different textures (bumpy, ridged, sticky)\n- Support a climbing frog at heights of 10 cm, 20 cm, and 30 cm\n- Have at least 2 resting platforms where a frog can pause without climbing\n- Use only natural materials (bark, twigs, leaves) or recyclables (felt, sandpaper, fabric scraps)\n- Be stable enough to hold a 200-gram weight without tipping\n\nSuccess = All three \"frog sizes\" can climb from bottom to top and rest safely at each platform.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real creature in an engineered (human-made) environment rather than its natural one. The mismatch identifies the core problem: *\"Tree frogs need climbing surfaces with specific grip and texture properties—how do we design an environment that meets their biological needs?\"* Students observe the frog's adaptations (toe pads, body shape) and use them to define what a proper habitat must provide. This makes **Ask** the natural entry point.\n\n### Suggested Materials\n- Bark pieces, twigs, and branches (collected or purchased)\n- Sandpaper (various grits) and fine steel wool\n- Fabric scraps, felt, or rubber shelf liner (for grip simulation)\n- Hot glue gun or wood glue\n- Foam board or dowel rods (as structural framework)\n- Recyclable items: egg cartons, cork coasters, or burlap\n\n### Estimated Time\n**Two 40-50 minute sessions**  \nSession 1: Observe frogs, identify needs, sketch and plan structure (25-30 min).  \nSession 2: Build, test, and revise based on performance (50-60 min, or extend to a third session if iteration is deep).\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS K-ESS3-1 / 1-LS1-1** (life science) *and* **ETS1-1: Ask questions to define design problems** by linking animal adaptations to engineering criteria—students must translate a biological observation (sticky toe pads) into measurable design constraints (surface texture, grip strength, stability).",
  "inputTokens": 2328,
  "outputTokens": 856,
  "cost": 0.006607999999999999,
  "generatedAt": "2026-02-09T13:40:33.858Z"
}