{
  "title": "Animal Behavior",
  "category": "life-science",
  "imageFile": "animal_behavior.jpg",
  "imagePath": "images/life-science/animal_behavior.jpg",
  "content": "# Engineering Design Challenge: Green Lizard Habitat & Camouflage\n\n### Visible Elements in Photo\n\n- A bright green lizard with detailed scale patterns (yellow-green, white, and darker markings)\n- Rough, gray-brown bark or rock surface serving as the lizard's perch\n- The lizard's eye, nostril, and jaw structure clearly visible in profile\n- Textured skin with individual scales visible at high magnification\n- Natural outdoor setting with lichen or moss growth on the substrate\n\n---\n\n### Reasonable Inferences\n\n1. **From green coloration + gray-brown background**: The lizard's color helps it blend into leafy or mossy environments, suggesting camouflage is essential for survival in this habitat.\n\n2. **From textured scales + rough substrate**: The lizard's body texture matches tree bark, implying that surface grip and blending with natural materials are design features that aid climbing and hiding.\n\n3. **From visible eye and alert posture**: The lizard actively monitors its surroundings, suggesting that any shelter or habitat design must allow for sightlines and quick escape routes.\n\n---\n\n### Engineering Task\n\n#### **K–2 Version:**\n**\"Design a Hide-Out for a Lizard Friend\"**\n\nMake a cozy spot where a pretend lizard can hide and feel safe. Use leaves, twigs, bark, and grass to build a little home. Your lizard needs to be able to peek out and see what's happening around it. Can you make it blend in so it's hard to spot?\n\n---\n\n#### **3–5 Version:**\n**\"Design a Camouflaged Lizard Shelter\"**\n\nDesign and build a shelter for a green lizard that:\n- Uses natural materials (bark, leaves, moss, small rocks) to match the lizard's environment\n- Provides at least two hiding spots within 15 cm of the structure\n- Allows the lizard to observe its surroundings (has at least one sightline that is 180° or greater)\n- Stays structurally sound when tilted 30° (simulate climbing on a slope)\n- Blends visually with its surroundings (test: can a partner identify it from 1 meter away without guidance?)\n\n**Success criteria**: Shelter is camouflaged AND functional for observation AND structurally stable.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo is an excellent launching point for the problem-identification phase because it shows *why* camouflage and shelter design matter in the natural world. Students observe the lizard's real-world survival needs (hiding, observing, climbing) and can ask: *\"What does this animal need to stay safe in its home?\"* Rather than starting with a solution, the photo prompts students to define problems the lizard faces—predators, temperature, visibility—which they then solve through design.\n\n---\n\n### Suggested Materials\n\n1. **Natural materials** (collected or provided): bark pieces, leaves, twigs, moss, small pebbles, grass\n2. **Fasteners**: non-toxic hot glue or craft glue, paper tape\n3. **Base structure**: small cardboard box, piece of cork board, or flat wood scrap (to anchor the shelter)\n4. **Measurement tools**: ruler or meter stick, protractor (for 3–5 tilt test)\n5. **Optional**: craft paint in greens/browns to touch up materials if natural camouflage is limited\n\n---\n\n### Estimated Time\n\n- **K–2**: 30–40 minutes (one session: 10 min. observation, 20 min. building, 10 min. testing and sharing)\n- **3–5**: 60–90 minutes across two sessions\n  - *Session 1* (40 min.): Observation, problem definition, and material planning\n  - *Session 2* (50 min.): Building, testing against criteria, and iteration\n\n---\n\n### Why This Works for Teachers\n\nThis challenge directly addresses **NGSS K.ETS1.A** (asking what plants and animals need to survive) and **3-5.ETS1.A** (defining and delimiting engineering problems based on specific criteria), while making camouflage and biomimicry tangible and hands-on.",
  "inputTokens": 2328,
  "outputTokens": 969,
  "cost": 0.007172999999999999,
  "generatedAt": "2026-02-09T13:40:21.597Z"
}