{
  "title": "Arachnid",
  "category": "life-science",
  "imageFile": "arachnid.jpg",
  "imagePath": "images/life-science/arachnid.jpg",
  "content": "### Visible Elements in Photo\n\n- One spider with dark body and eight long, thin legs positioned on dry, sandy soil\n- Cracked and compacted tan/brown soil with visible pebbles and rocks\n- Scattered dried plant material (twigs, straw) embedded in soil surface\n- Uneven, hard-packed ground terrain with minimal vegetation\n\n### Reasonable Inferences\n\n- **From spider on exposed soil**: The spider needs shelter or camouflage to survive in this open, dry environment where it is easily visible to predators.\n- **From hard-packed, cracked soil**: Water is scarce in this habitat; any structure built here must account for drainage or moisture retention challenges.\n- **From sparse vegetation and rocky surface**: Natural building materials (small stones, sand, dead plant matter) are readily available in this environment.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nA spider needs a safe home on dry, rocky ground. Build a cozy shelter for the spider using rocks, sand, sticks, and soil. Your shelter should have a small opening for the spider to go in and out, and it should hide the spider from bigger animals that want to eat it. Test your shelter by gently sprinkling water on it—does it stay dry inside?\n\n**3-5 Version:**\nDesign and build a protective burrow shelter for a ground-dwelling spider that must meet these criteria:\n- Entrance hole no larger than 1 cm diameter\n- Shelter retains at least 80% of internal moisture when exposed to simulated drought conditions (dry heat lamp for 5 minutes)\n- Structure remains intact when supporting a 500g weight placed on top\n- Uses only natural materials found in arid environments (sand, pebbles, twigs, dried leaves, clay)\n\nDocument your design with a labeled sketch before building, test each criterion, and redesign any part that fails.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase is the best fit because the photo shows a real organism in its natural habitat with no obvious human-made solution visible. Students must first *identify* the spider's actual needs (shelter, moisture retention, predator avoidance) before imagining how to solve them. The task begins with observation and questioning (\"What does this spider need to survive here?\"), which is core to the Ask phase.\n\n---\n\n### Suggested Materials\n\n- Dry sand or potting soil\n- Small pebbles and gravel\n- Twigs, dried grass, and straw\n- Modeling clay or air-dry clay\n- Spray bottle or water dropper\n- Small cardboard tube or PVC pipe (optional, for K-2 reference model)\n- Heat lamp or sunny windowsill (for 3-5 moisture testing)\n\n---\n\n### Estimated Time\n\n- **K-2**: 30–40 minutes (10 min observation/discussion, 15–20 min building, 5–10 min testing and sharing)\n- **3-5**: Two 40-minute sessions (Session 1: observe, sketch design, gather materials, build; Session 2: test all criteria, document results, redesign and retest)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.B: Developing Possible Solutions**, asking students to research a real organism's needs and generate designs that meet multiple, measurable criteria while using locally available materials—skills that transfer beyond the science classroom.",
  "inputTokens": 2329,
  "outputTokens": 767,
  "cost": 0.006164,
  "generatedAt": "2026-02-09T13:34:34.222Z"
}