{
  "title": "Backyard Landscape",
  "category": "life-science",
  "imageFile": "backyard2.jpg",
  "imagePath": "images/life-science/backyard2.jpg",
  "content": "# Engineering Design Challenge: Backyard Water Garden System\n\n### Visible Elements in Photo\n\n- A small pond or water feature with a log/wood border containing water and visible stones\n- Flowering plants (purple, white, yellow flowers) arranged around the water feature\n- Darker soil/mulch surrounding the planted areas\n- A wooden fence (weathered gray) bordering the garden space\n- A red garden tool visible in the planting bed\n- A lawn area separated from the garden by a stone or concrete edging\n\n---\n\n### Reasonable Inferences\n\n- **From the water feature with log border**: Water needs containment and management; the log structure may experience decay or instability over time, creating a need for durability or redesign.\n- **From dense flower plantings around the water**: Plants near water require consistent moisture; the garden design suggests someone is managing water flow or retention to keep plants healthy.\n- **From the red tool and overall layout**: This is an actively maintained garden where someone regularly tends plants, implying tools and access pathways are needed for care.\n\n---\n\n### Engineering Task\n\n**K-2: Design a Better Watering System**\n\nYour teacher has a garden with a small pond and lots of flowers. The flowers drink water, but sometimes they get too dry or too wet. Can you design a way to help water move from the pond to the flowers? You can use pipes (straws), containers (cups), or tubing to make your system work. Test it by pouring water in and seeing if it reaches all the flowers!\n\n---\n\n**3-5: Design a Sustainable Water Management System for a Garden**\n\nYour task: Design a system that captures and distributes water from a central water source (like the pond shown) to a flower garden bed, maintaining consistent moisture in the soil while preventing flooding or water waste. \n\n**Constraints:**\n- Your system must deliver water to at least 3 different plant areas\n- Water loss to evaporation or runoff cannot exceed 20% (test by measuring water in vs. water reaching plants)\n- The system must fit within a 2 ft × 3 ft garden bed\n- Use only recyclable or natural materials (plastic bottles, cloth strips, clay, gravel, sand)\n\n**Success Criteria:**\n- All three plant zones show moist soil after 10 minutes of operation\n- No pooling or overflow occurs at any point\n- System can be refilled without dismantling it\n- Sketch your design before building and revise it after testing\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real, working garden system with an observable challenge: maintaining water distribution across multiple plants while preventing waste or damage. Students must first identify *why* water management matters in this specific garden (plants need consistent moisture, water is limited, the current setup has limitations) before imagining solutions. This roots the task in authentic observation and real-world need.\n\n---\n\n### Suggested Materials\n\n- Clear plastic bottles (2-liter or smaller) cut into sections\n- Drinking straws or thin plastic tubing\n- Cloth strips or burlap for wicking water\n- Pea gravel or sand for filtration layers\n- Soil and potted plants (or plastic cups with soil to simulate plants)\n- Tape or string to secure connections\n- Measuring cups for testing water amounts\n\n---\n\n### Estimated Time\n\n- **K-2**: 45–60 minutes (initial design sketch, 1 building session, 1 test session)\n- **3-5**: Two 40-minute sessions (Session 1: Problem definition, sketching, materials exploration; Session 2: Building, testing, and revision)\n\n---\n\n### Why This Works for Teachers\n\nThis challenge directly addresses **NGSS 3-5-ETS1-2** (*Generate and compare multiple possible solutions based on how well they meet the criteria and constraints*) by having students prototype different water-delivery methods and evaluate which keeps plants healthier with less waste, grounding engineering in a visible, tangible system.",
  "inputTokens": 2304,
  "outputTokens": 890,
  "cost": 0.006754,
  "generatedAt": "2026-02-09T13:17:39.347Z"
}