{
  "title": "Backyard Landscape",
  "category": "life-science",
  "imageFile": "backyard2.jpg",
  "imagePath": "images/life-science/backyard2.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# First Grade Life Science 5E Lesson Plan: Garden Friends and Flowers\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Plants need sun, water, and soil to grow and survive** — visible in the healthy garden with diverse plant growth in the flower bed, lawn, and surrounding areas\n- **Different plants have different body structures (flowers, stems, leaves, roots) that help them live** — observable in the variety of flower types, grasses, tall plants, and ground covers visible in the garden\n- **Animals and plants live together in habitats** — inferred from the garden ecosystem showing multiple organisms (flowers, grass, shrubs, insects) in one shared space\n- **Plants produce flowers and come in many colors and shapes** — clearly visible with the purple, yellow, white, and orange flowers displayed throughout the photograph\n\n---\n\n## Lesson Title\n\n**Growing and Growing: Exploring Plants in Our Garden Homes**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 1-LS1-1 (Use materials to design a solution by mimicking how plants use external parts to survive)\n  - 1-LS3-1 (Make observations to construct an account that young plants are like, but not exactly like, their parents)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify at least three external parts of a plant (roots, stems, leaves, flowers) and explain what each part does to help the plant survive.\n2. Observe and describe how different plants in a garden look the same but are also different from their parent plants.\n3. Explain that plants need soil, water, and sunlight to grow and live in a garden habitat.\n4. Design a simple solution to help a plant grow using what they learned about plant parts and needs.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by exploring what plants need to live.\n\n**Materials:**\n- Large printed copy or projected image of the backyard garden photograph\n- Chart paper and markers\n- Students' personal observations\n\n**Activity:**\n\n1. **Display the photograph** on the board or projector. Give students 30-45 seconds to look silently and notice what they see.\n\n2. **Ask these guided questions** (one at a time, pausing for responses):\n   - \"What do you notice in this picture? What living things do you see?\" *(Expected: flowers, grass, plants, dirt, water in the pond)*\n   - \"Why do you think these flowers and plants look so pretty and healthy?\" *(Guide toward: they have food, water, sun, or good soil)*\n   - \"Where do you think the flowers get water?\" *(Expected: rain, sprinklers, people watering)*\n   - \"What do you think would happen if we never watered the flowers or gave them sunlight?\" *(Expected: they would die, turn brown, stop growing)*\n\n3. **Wonder prompt:** \"I wonder what parts of plants help them drink water and stay alive. What do you think?\" Have students turn to a partner and share one idea. Capture 2-3 responses on chart paper under the heading \"What Plants Need to Grow.\"\n\n4. **Transition:** \"Great thinking! Today, we're going to explore the different parts of plants and figure out how each part helps plants survive—just like in this beautiful garden.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate plant structures through hands-on observation and a plant dissection activity.\n\n**Materials:**\n- Fresh flowers with stems and leaves (carnations or tulips work well; one per student or pair)\n- Small cups of water (one per student/pair)\n- Magnifying glasses (optional but recommended)\n- White paper towels\n- Chart labeled \"Plant Parts We Found\" with columns for: Roots/Stems, Leaves, Flowers, Other\n- Clipboards and pencils for each student\n\n**Activity:**\n\n**Step-by-step student directions:**\n\n1. \"Take your flower and hold it gently. First, look at the **bottom of the stem**. Do you see any little stringy parts or roots? Show your partner. Draw what you see on your paper.\"\n\n2. \"Now, feel the **stem**. Is it hard or soft? Bendy or straight? Smell the stem. Tell your partner what the stem feels and smells like.\"\n\n3. \"Look at the **leaves** on the stem. What shape are they? What color? Are they smooth or bumpy? Touch one. Draw a leaf on your paper.\"\n\n4. \"Look at the **flower** at the top. Count the petals. What color is it? Smell the flower. Be gentle! Draw the flower.\"\n\n5. \"Now, put your flower in the cup of water and set it on the table. We're going to watch what happens to it over the next few days.\"\n\n6. \"Tell the class one plant part you found and what it looks like. We'll write it on our chart together.\"\n\n**Connection to photograph:** \"The flowers and plants in the photograph have all of these parts too—roots in the dirt, stems, leaves, and beautiful flowers like yours.\"\n\n**What students should record:**\n- Drawings of plant parts (roots/stems, leaves, flowers)\n- Written or verbal descriptions of what they felt, saw, or smelled\n- Observations written on the class chart\n\n**Teacher Role:**\n- Circulate and ask guiding questions: *\"What does the stem feel like? Can you describe the color of the flower? Why do you think the roots need to be in water?\"*\n- Prompt students to make comparisons: *\"Is your flower's stem the same as the flower in the photograph?\"*\n- Encourage peer teaching: *\"Tell your neighbor what you discovered.\"*\n- Do **not** tell students what each part does; let them discover through exploration.\n\n**Expected Student Outcomes:**\n- Students will have observed and recorded at least three plant parts.\n- Students will have made connections between their flower and the flowers in the photograph.\n- Students will show curiosity about how the flower changes in water over time.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect plant structures to their functions using student observations.\n\n**Materials:**\n- Chart from Explore phase with student drawings and observations\n- Plant diagram (simple, First Grade-level; showing roots, stem, leaves, flower, with labels)\n- Poster board with vocabulary words and pictures\n- Real flower or plant (can be the same one from Explore)\n\n**Activity:**\n\n1. **Group share-out:** Ask 4-5 students to share what they discovered about their flower. Record their descriptions on a new chart titled \"What Plant Parts Do.\"\n\n2. **Introduce vocabulary with demonstrations:**\n\n   - **Roots:** \"Remember the stringy parts at the bottom of your stem? Those are **roots**. Roots drink water from the soil and hold the plant in the ground. Let's pretend our hands are roots—can you wiggle your fingers like roots drinking water?\" (Act this out.)\n   \n   - **Stem:** \"The stem is like the plant's *bones* or *straw*. It holds the flower up tall so it can get sunlight. It also helps move water from the roots up to the leaves and flower. Show me with your arm: can you stand tall like a stem?\"\n   \n   - **Leaves:** \"Leaves are like the plant's *mouth* for eating! They catch sunlight and use it to make food for the plant. If we didn't have leaves, the plant couldn't grow.\"\n   \n   - **Flower:** \"The flower is pretty and colorful. But flowers do an important job—they make seeds so baby plants can grow. Maybe bees visit flowers to help make seeds.\"\n   \n   - **Habitat:** \"All these plants live together in the garden. The garden is their home—their **habitat**—where they have soil, water, and sunshine.\"\n\n3. **Connect back to photograph:** Point to specific flowers and plants in the original image. \"This purple flower in the photograph has roots under the ground drinking water, a green stem holding it up, leaves catching sunshine, and a beautiful flower. Just like yours!\"\n\n4. **Check for understanding:**\n   - Hold up a picture of a plant and point to the roots. Ask: \"What job do the roots do?\"\n   - Point to leaves: \"Why do plants need leaves?\"\n   - Point to a flower: \"What's special about flowers?\"\n   - Accept answers like \"drink water,\" \"make food,\" \"make baby plants\" — informal language is fine.\n\n**Vocabulary:**\n\n| **Term** | **Student-Friendly Definition** |\n|----------|--------------------------------|\n| **Roots** | The stringy parts under the ground that drink water and hold the plant in place. |\n| **Stem** | The part that holds the plant up tall and helps water move from the roots to the rest of the plant. |\n| **Leaves** | The flat green parts that catch sunlight and make food for the plant. |\n| **Flower** | The colorful part that makes seeds so new baby plants can grow. |\n| **Habitat** | A home where plants and animals live together and have what they need to survive. |\n\n**Expected Student Outcomes:**\n- Students can identify the four main plant parts and name one job each part does.\n- Students understand that plants need soil, water, and sunlight to survive.\n- Students make a connection between the vocabulary words and the real flower they observed.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply knowledge of plant parts to solve a real-world problem.\n\n**Materials:**\n- Small potted plants (one per student or pair) — can be small flowers, herbs, or fast-growing plants like beans\n- Index cards with simple \"Plant Care Scenarios\" (see below)\n- Chart paper labeled \"How to Help Our Plant Grow\"\n- Watering cans, soil, markers, construction paper\n- Optional: Seeds to plant\n\n**Activity:**\n\n**Scenario-based problem-solving:**\n\nPresent this simple scenario: *\"A friend wants to grow a pretty flower at home, but they don't know how to keep it healthy. How can we help them? What does the plant need?\"*\n\n**Student task:**\n1. Show students a small potted plant. Ask: \"What does this plant need to be healthy and grow big like the flowers in the photograph?\"\n\n2. Have students work in pairs to think of **three things the plant needs** and draw or write them on a \"Plant Care Card.\"\n\n3. **Guide their thinking** with questions:\n   - \"Does the plant need water? Where does it get water?\" (Roots drink it from soil)\n   - \"Does the plant need sunshine? Why?\" (Leaves make food with sunlight)\n   - \"Does the plant need good soil?\" (Roots live there and get nutrients)\n\n4. **Create a class \"Plant Care Guide\"** on chart paper:\n   - Draw or write: \"Give it water (roots drink it),\" \"Put it in sunshine (leaves need it),\" \"Use good soil (roots need it to grow).\"\n   - Let students illustrate each care instruction.\n\n5. **Optional extension:** If time permits, students can plant a seed in a small cup and decorate it with drawings of what the plant will look like when it grows. Take them home to observe change over time.\n\n**Teacher Role:**\n- Facilitate small group discussions: *\"Why do you think roots need soil? What would happen if we forgot to water it?\"*\n- Validate all responses that show reasoning about plant needs.\n- Help students make the connection: *\"Look at the garden photo—the gardener probably does these three things to keep the flowers healthy.\"*\n- Allow student-to-student teaching.\n\n**Expected Student Outcomes:**\n- Students can identify and explain the three main needs of plants (water, sunlight, soil).\n- Students create a visual or written guide showing how to care for a plant.\n- Students connect their plant care knowledge to the healthy garden in the photograph.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of plant structures, functions, and needs using formative and summative strategies.\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout lesson):**\n- **During Explore:** Observe student drawings and listen to descriptions of plant parts. Note whether students identify at least 3 parts.\n- **During Explain:** Ask students to point to plant parts and name them. Accept informal language (e.g., \"the part that drinks water\" = roots).\n- **During Elaborate:** Listen to pair discussions. Do students mention water, sunlight, or soil as plant needs?\n\n**Exit Ticket / Summative Assessment** (use one or both):\n\n**Option 1: Visual Assessment (for emerging readers)**\n- Show a simple plant drawing with four labeled parts: roots, stem, leaves, flower.\n- Read each statement aloud. Students hold up a thumbs up if it's true, sideways if they're not sure:\n  1. \"Roots drink water from the soil.\" ✓\n  2. \"Leaves catch sunlight to make food.\" ✓\n  3. \"Flowers help make baby plants.\" ✓\n  4. \"Plants don't need water to grow.\" ✗\n\n**Option 2: Open-ended question (for advanced writers/speakers)**\n- Display the garden photograph again. Ask: *\"What does the gardener do to keep these flowers healthy and beautiful? Tell me three things.\"*\n- Accept written, drawn, or verbal responses.\n- **Success criteria:**\n  - Student mentions at least two of: watering/water, sunlight/sun, soil, care\n  - Student can explain why one of these things helps the plant\n\n**Option 3: One-Minute Partner Share**\n- Partner A: \"Show me a plant part on this flower and tell me what it does.\"\n- Partner B: \"Show me a plant part and tell me what it does.\"\n- Teacher listens in on 4-5 pairs.\n\n**Expected Student Outcomes to Indicate Mastery:**\n\n✓ Students can identify at least two plant parts (roots, stems, leaves, or flowers) and explain one job each part does.\n\n✓ Students understand that plants need water, soil, and sunlight to survive.\n\n✓ Students can look at the garden photograph and explain why the plants look healthy (they have water, sunshine, and good soil).\n\n✓ Students demonstrate curiosity about plant growth and ask questions (e.g., \"When will my plant grow bigger?\").\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Simplified vocabulary:** Use only 2-3 key terms (roots, stems, leaves) instead of five. Use repetition and real objects to reinforce meaning. Pair student with a strong partner during Explore and Elaborate phases.\n\n2. **Tactile/kinesthetic anchors:** During Explain, have students act out plant parts (roots wiggling, stems standing tall, leaves waving in wind, flowers opening). This helps students remember and understand concepts through body movement.\n\n3. **Scaffolded exit ticket:** Provide a drawing of a plant with parts labeled. Ask the student to point to one part and tell you one thing it does. Accept single-word answers: \"water,\" \"sun,\" \"grow.\"\n\n### Challenge (for advanced learners):\n\n1. **Deeper observation:** Ask students to compare their flower to the flowers in the photograph and write/draw how they're the same AND different. Introduce the idea that even though baby plants come from parent plants, they're not exactly the same. (Connection to 1-LS3-1.)\n\n2. **Extended investigation:** Have students predict what will happen to their flower in water over one week. Create a \"Plant Diary\" where they draw observations every 2-3 days. Discuss changes: Did the flower last longer? Did the stem absorb water? Did any roots grow?\n\n3. **Design a solution:** Present this challenge: *\"Your classroom plant gets no sunlight because we're in a corner with no windows. How could you use mirrors, white paper, or other materials to help the plant get light?\"* Have students sketch a design and explain their thinking (connection to 1-LS1-1).\n\n---\n\n## Extension Activities\n\n1. **Seed planting and observation:** Give each student a fast-growing seed (bean, sunflower, or marigold). Plant it in a clear cup with soil so roots are visible. Students water it and observe for 2-3 weeks, recording how it changes. Create a class growth chart. Discuss: \"Is the baby plant the same as the parent plant? How is it different?\" *(Addresses 1-LS3-1)*\n\n2. **Garden walk and sketch:** If your school has access to a garden, outdoor area, or even a decorated hallway with plants, take students on a \"plant observation walk.\" Have them sketch three different plants and label the parts they see (roots, stems, leaves, flowers). Compare drawings: \"Did we all find the same parts?\"\n\n3. **Plant part sorting game:** Create picture cards of different plants (flowers, vegetables, trees, grass). Have students sort by \"Has bright flowers,\" \"Has big leaves,\" \"Grows in a garden,\" etc. Discuss why plants might look different but have the same parts.\n\n---\n\n### Additional Notes for the Teacher\n\n- **Real objects matter:** Using an actual flower makes learning concrete and memorable for First Graders. If possible, obtain flowers 1-2 days before the lesson so students can observe them in water during Elaborate and evaluate phases.\n\n- **Garden photo as reference:** Return to the photograph at every phase. It anchors abstract concepts and shows students a real-world habitat with multiple living things.\n\n- **Document growth:** If students take plants home after Elaborate, send a simple \"Plant Care Sheet\" with pictures and minimal words so families can participate in the learning.\n\n- **Connection to habits:** Emphasize that gardeners and plant parents use science knowledge to help living things survive—this builds science identity in First Graders.",
  "inputTokens": 2859,
  "outputTokens": 4143,
  "cost": 0.023574,
  "generatedAt": "2026-02-12T19:46:41.518Z"
}