{
  "title": "Bee",
  "category": "life-science",
  "imageFile": "bee.jpeg",
  "imagePath": "images/life-science/bee.jpeg",
  "content": "# Engineering Design Challenge: Bee Access to Flowers\n\n### Visible Elements in Photo\n- A bee (with fuzzy body, long proboscis, six legs, and wings) visiting a green flower bud or seedpod\n- Green plant stem and leaves with visible veins\n- The bee's body positioned on a narrow, pointed structure\n- Brown spots or damage marks on the plant leaves\n- A curved, hook-like appendage at the tip of the flower/seedpod\n\n### Reasonable Inferences\n- **From the bee's proboscis and flower structure**: The bee needs to reach nectar or pollen inside flowers with varying shapes and depths—different flower designs require different access strategies.\n- **From the narrow, pointed plant structure**: Plants with enclosed or hard-to-reach flowers may limit which pollinators can visit them effectively, affecting reproduction.\n- **From the bee's grip on the stem**: Insects need stable landing surfaces to access flowers; slippery or unstable stems make pollination difficult or impossible.\n\n---\n\n### Engineering Task\n\n#### **K-2 Version**\n**Make a Flower That a Bee Can Visit**\n\nDesign and build a pretend flower using paper, straws, or cups that a \"bee\" (your finger or a toy) can land on and reach inside to find a treat (sticker, pom-pom, or marker dot). Your flower must have:\n- A safe landing spot (a flat or bumpy place for the bee to stand)\n- An opening that the bee can reach into\n- A prize hidden inside that the bee can collect\n\nTest it: Can your bee land, stay on, and get the prize?\n\n---\n\n#### **3-5 Version**\n**Design a Flower Structure That Accommodates Pollinators**\n\nPollinators like bees need flowers that are accessible—with stable landing platforms and openings sized for their bodies. Your challenge:\n\n**Build a model flower** (using paper cups, paper, straws, beads, and tape) that meets these criteria:\n- **Landing platform**: Must support a toy bee (or marble) for at least 3 seconds without sliding\n- **Access opening**: Must allow a straw (representing a proboscis) to reach a hidden \"nectar\" point 5 cm inside the flower\n- **Stability**: Must remain upright when gently tilted 15 degrees in any direction\n\n**Test & iterate**: Try at least two design changes. Record whether each version meets all three criteria. Which design works best?\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real pollinator facing a real structural challenge: reaching food from a specific plant design. Students should begin by observing *why* the bee's shape, size, and tools matter for flower access—defining the actual problem bees face in nature—before jumping to solutions. This grounds the challenge in authentic need.\n\n---\n\n### Suggested Materials\n- Paper cups or toilet paper tubes (flower body)\n- Construction paper or tissue paper (petals)\n- Straws or thin dowels (proboscis simulators)\n- Tape and scissors\n- Small beads, pom-poms, or stickers (nectar / pollen rewards)\n- Toy bee, marble, or finger (pollinator)\n\n---\n\n### Estimated Time\n**45–60 minutes** (single session for K-2; can extend to two 30-minute sessions for 3-5 with iteration and redesign)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (define simple design problems that can be solved by applying scientific ideas about plants and animals) by having students connect a real organism's structure and needs to a functional design solution.",
  "inputTokens": 2330,
  "outputTokens": 839,
  "cost": 0.0065249999999999996,
  "generatedAt": "2026-02-09T13:17:51.432Z"
}