{
  "title": "Biological_decomposition",
  "category": "life-science",
  "imageFile": "biological_decomposition.jpg",
  "imagePath": "images/life-science/biological_decomposition.jpg",
  "content": "# Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- A large tree trunk with thick, deeply textured bark (appears to be oak or similar hardwood)\n- A vertical cavity or hollow opening running through the center of the trunk\n- Dark interior space suggesting significant decay or decomposition\n- Bare branches extending from the tree (dormant season)\n- Clear blue sky and surrounding bare trees indicating winter or early spring\n\n## Reasonable Inferences\n1. **From the cavity shape and dark interior** – The tree has experienced internal decay over time, likely from rot, fungal colonization, or animal activity, creating a structural weakness.\n2. **From the size and bark texture** – This is a mature tree that has survived years despite structural compromise, suggesting it has adapted or the remaining wood is supporting it.\n3. **From the bare branches and season** – The tree may be declining in health, or it is dormant; either way, the hollow affects its ability to transport water and nutrients.\n\n---\n\n## Engineering Task\n\n### **K–2 Version**\n**\"Design a Helper for Our Hollow Tree\"**\n\nA big tree has a large hole in its middle. The tree is still alive, but it needs help! Can you design and build a way to help keep this tree safe and strong? You can use sticks, clay, cloth, or other materials to create a *protector* or *fixer* that could help the tree. What shape would work best? Would your design keep bugs out? Would it let the tree breathe?\n\n### **3–5 Version**\n**\"Engineer a Cavity Treatment System\"**\n\nThis ancient tree has a large internal cavity that weakens its structure and invites decay. Your task: **Design a protective insert or treatment system** that will:\n- **Support:** Help distribute the tree's weight safely across the hollow section\n- **Prevent:** Stop water, insects, and fungi from worsening the cavity\n- **Allow:** Permit the tree to continue growing and transporting nutrients\n- **Measure success:** Your design must support at least 2 kg of weight without cracking, remain water-resistant when exposed to moisture, and allow airflow through or around it\n\nYou have sketching time, material testing time, and prototype building time. Test your design against each criterion and improve it.\n\n---\n\n## EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase is the best fit because the photo shows a real environmental challenge (a hollow tree facing structural and biological stress) without an obvious solution visible. Students must first understand *what is happening*, *why it matters*, and *what the tree needs* before imagining or building. The hollow cavity and signs of decomposition invite curiosity and problem-finding—the heart of the \"Ask\" phase.\n\n---\n\n## Suggested Materials\n1. **Foam blocks or carved wood** – to test support and weight-bearing\n2. **Waterproof tape, plastic sheeting, or wax-coated paper** – to prototype barrier designs\n3. **Small sticks, dowels, or craft foam rods** – to simulate supportive structures\n4. **Clay or moldable compounds** – to create custom shapes that fit irregular cavities\n5. **Mesh or fabric scraps** – to experiment with breathable, pest-resistant layers\n\n---\n\n## Estimated Time\n**Two 40-minute sessions:**\n- Session 1 (40 min): Ask phase – observe photos, discuss the problem, research tree health, and sketch initial ideas\n- Session 2 (40 min): Imagine and create phases – design, build, and test one prototype with feedback\n\n---\n\n## Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A (Defining and Delimiting Engineering Problems)** by asking students to identify constraints (tree health, structural integrity, material durability) and criteria (support, protection, breathability) from a real biological system, connecting life science observation to engineering design thinking.",
  "inputTokens": 2172,
  "outputTokens": 871,
  "cost": 0.006527000000000001,
  "generatedAt": "2026-02-13T02:53:27.160Z"
}