{
  "title": "Bird_characteristics",
  "category": "life-science",
  "imageFile": "bird_characteristics.jpg",
  "imagePath": "images/life-science/bird_characteristics.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- A pigeon (rock dove) with blue-gray head, iridescent neck feathers, white wing patch, and black wing markings\n- Red/pink legs and feet gripping a perch\n- Small, pointed black beak\n- Brown earth and scattered green vegetation in background\n- Blurred rocky/concrete ground surface\n\n### Reasonable Inferences\n- **From leg and foot structure**: The pigeon's strong, gripping feet are adapted for perching on surfaces like ledges, poles, or buildings—this suggests birds need specialized body parts for their environment.\n- **From beak shape and size**: The small, pointed beak suggests this bird is designed to peck and pick up small seeds or food items from the ground.\n- **From feather patterns**: The distinct white wing patch and iridescent coloring may serve purposes like species recognition or predator avoidance in natural settings.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\n*Design a landing platform where a bird can rest safely.* Your pigeon friend needs a safe place to land and stand. Build a perch using straws, sticks, or dowels that a bird can grip with its feet. The perch must be sturdy enough to hold the bird's weight (test with a small toy or water bottle). Make sure it doesn't roll or tip over. Can you add a food dish below it so the bird can eat?\n\n**3-5 Version:**\n*Design a bird perch and feeding station system.* Create a two-part structure: (1) a stable perch that mimics a natural roosting surface (must support at least 2 pounds of weight without tipping), and (2) an attached or nearby feeding tray that prevents food from scattering. Your design must account for the bird's gripping foot structure and small beak size. Test your perch with a 2-pound weight and measure how much food stays in the tray after 10 gentle \"pecks\" with a stick. Criteria: perch must be stable at 90° angles, tray must contain at least 80% of seeds.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real organism in its environment—a perfect opportunity to start with observation and question-asking. Students should first notice the bird's physical features (feet, beak, body) and ask: \"What does this bird need to survive safely?\" From there, they naturally identify a solvable engineering problem: creating a structure that supports the bird's behavior (perching, feeding). This grounds the entire EDP in authentic biological observation.\n\n---\n\n### Suggested Materials\n1. Wooden dowels, tree branches, or sturdy straws (for perch structure)\n2. Small plastic containers or trays (for feeding platform)\n3. Tape, zip ties, or hot glue (for assembly)\n4. Sandpaper (to smooth dowel surfaces for grip testing)\n5. Small weights (2-lb dumbbells, water bottles, or sand bags) for load testing\n\n---\n\n### Estimated Time\n**45–60 minutes** (single session for K-2; two 30-minute sessions for 3-5)\n- Design/planning: 10–15 minutes\n- Building: 20–30 minutes\n- Testing and refinement: 10–15 minutes\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS-ETS1-1** (defining engineering problems by identifying wants/needs from observations) and **ETS1-2** (designing solutions that use proper materials and constraints), because students observe real bird anatomy and solve a genuine biological support challenge.",
  "inputTokens": 2195,
  "outputTokens": 827,
  "cost": 0.00633,
  "generatedAt": "2026-02-12T01:13:46.873Z"
}