{
  "title": "Blackbird",
  "category": "life-science",
  "imageFile": "blackbird.jpg",
  "imagePath": "images/life-science/blackbird.jpg",
  "content": "# Engineering Design Challenge: Bird Shelter\n\n### Visible Elements in Photo\n- A black bird with a long tail, standing on grass\n- Short green grass and soil (mixed with small white particles, possibly sand or gravel)\n- Natural outdoor ground habitat\n- Bird's thin, pointed beak (adapted for foraging)\n- Bird's upright posture and alert stance\n\n### Reasonable Inferences\n- **From grass and soil:** The bird forages on open ground and needs shelter from predators and weather (inferred from exposed habitat).\n- **From beak shape:** The bird hunts for small food items in soil or grass, suggesting it spends time low to the ground and is vulnerable in open spaces.\n- **From alert posture:** The bird must detect threats quickly, implying it needs a shelter design that allows visibility while providing protection.\n\n### Engineering Task\n\n**K-2: Make a Safe Hide-Out for a Bird**\nYour job: Design a cozy hiding spot for a bird like this one. Use natural things (sticks, leaves, grass) to make a shelter on the ground where the bird can stay safe and still see if something bad is coming. Your shelter should be as big as your hand and keep the bird tucked in.\n\n**3-5: Design a Ground-Level Shelter for Ground-Foraging Birds**\nDesign a bird shelter that meets these requirements:\n- **Size:** At least 6 inches wide and 4 inches tall\n- **Location:** Sits on soil or grass\n- **Protection:** Shields a bird from overhead predators (hawks, crows) and side exposure\n- **Visibility:** Allows the bird to see threats while inside\n- **Materials:** Use only natural or recycled materials (twigs, leaves, cardboard, straw, scrap wood)\n- **Test it:** Simulate wind (blow gently on it) and rain (spray water). Does it hold up? Can you still see through one side?\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real animal in a vulnerable open habitat with no visible shelter. Students naturally ask: \"Where does this bird hide? Why does it need shelter?\" This creates authentic curiosity about a genuine survival need—perfect for the **Ask** phase. Students identify the problem (exposed bird, no protection) before designing solutions.\n\n### Suggested Materials\n- Dry grass, leaves, and small twigs (collected outdoors)\n- Cardboard scraps or paper towel tubes\n- Straw or hay\n- Bark pieces\n- Soil or sand (to anchor structure)\n- Tape or natural twine (optional)\n\n### Estimated Time\n**45–60 minutes** (or two 30-minute sessions)\n- Session 1: Observe photo, discuss bird needs, sketch design (15 min)\n- Session 2: Build shelter, test, and refine (30–45 min)\n\n### Why This Works for Teachers\nThis task directly supports **NGSS K-LS1-1 / 1-LS1-1** (animals have basic needs and structures that help them survive) and **3-5-ETS1-1** (define engineering problems based on real-world constraints), grounding design thinking in observable wildlife behavior rather than abstract concepts.",
  "inputTokens": 2327,
  "outputTokens": 729,
  "cost": 0.005972,
  "generatedAt": "2026-02-09T13:18:03.854Z"
}