{
  "title": "Camouflage",
  "category": "life-science",
  "imageFile": "camouflage.jpg",
  "imagePath": "images/life-science/camouflage.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- A dead or weathered log with flaking, layered bark in shades of gray and dark brown\n- A tan/beige-colored lizard or small reptile on the log, blending in with the bark texture\n- Forest floor debris: scattered leaves, twigs, and wood chips in browns and tans\n- Dappled light and shadow across the scene\n- Multiple layers of decomposing wood and organic material in the background\n\n## Reasonable Inferences\n- **From lizard placement on log**: The reptile relies on color and texture similarity to avoid detection by predators—this is camouflage adaptation for survival.\n- **From variety of wood textures and colors**: Natural environments contain many different surfaces; animals must match their surroundings to hide effectively.\n- **From forest floor debris**: Small creatures need shelter and protection in natural settings where predators hunt by sight.\n\n## Engineering Task\n\n**K-2 Version:**\nYour job is to design a hiding spot for a small animal (like a lizard or bug). Using natural materials from outside, build a shelter that blends in with its surroundings so a pretend predator can't spot it easily. What colors and textures should you use? Can you make it so the animal is hard to see?\n\n**3-5 Version:**\nDesign a protective shelter for a small creature (lizard, salamander, or insect) that must meet these criteria:\n- Use only natural materials (leaves, bark, twigs, soil) collected from a nearby area\n- The shelter must be at least 10 cm long and allow the animal to hide inside\n- At least 80% of the shelter's visible surface must match or blend with the surrounding environment (test by placing it on the forest floor and seeing if it \"disappears\" at arm's length)\n- The structure must withstand light rain without collapsing (test with a spray bottle)\n\nSketch your design first. Build and test it. Redesign if it fails any test.\n\n## EDP Phase Targeted\n**Ask / Define Problem** — This photo shows a real-world survival need (an animal hiding from predators in nature). Students must first observe *why* the lizard chose this spot and *what problem* camouflage solves before they design a shelter. The challenge naturally starts with asking: \"Why is this lizard so hard to see? What does it need to survive?\"\n\n## Suggested Materials\n- Fallen leaves (various sizes and colors)\n- Bark pieces and wood chips\n- Small twigs and sticks\n- Soil or sand\n- Spray bottle (for water/rain simulation)\n- A small toy animal or figurine (for testing visibility)\n\n## Estimated Time\n**K-2**: 30-40 minutes (10 min observation + collection, 15-20 min building, 5-10 min testing/sharing)\n\n**3-5**: Two 35-40 minute sessions (Session 1: observation, sketching, material collection, building; Session 2: testing, refinement, documentation)\n\n## Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) by grounding the challenge in observable biological need, and **ETS1.B** (developing possible solutions) by requiring students to prototype a design that meets specific performance criteria tied to real animal behavior.",
  "inputTokens": 1805,
  "outputTokens": 761,
  "cost": 0.00561,
  "generatedAt": "2026-02-09T13:35:21.675Z"
}