{
  "title": "Centipede",
  "category": "life-science",
  "imageFile": "centipede.jpg",
  "imagePath": "images/life-science/centipede.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- A centipede with a segmented body (approximately 15+ segments visible)\n- Reddish-brown exoskeleton with a glossy appearance\n- Multiple pairs of legs extending from each body segment\n- Rough, textured wooden surface (the centipede's habitat)\n- Small debris and lichen patches on the wood\n\n## Reasonable Inferences\n- **From segmented body structure**: The centipede's flexible, jointed design allows it to move through tight spaces and uneven terrain on the forest floor.\n- **From multiple leg pairs**: Each segment contributes legs for coordinated, wave-like movement across surfaces—an adaptation for crawling efficiently through soil and wood crevices.\n- **From habitat (wood surface)**: Centipedes hunt in decomposing wood and soil, suggesting their body shape is optimized for navigating narrow, confined spaces.\n\n## Engineering Task\n\n### K–2 Version:\n**\"Design a Wiggly Crawler\"**\n\nBuild a creature that can move like a centipede by wiggling and bending. Use paper segments connected together so it can squeeze through a narrow tunnel made from a paper towel tube. Your crawler should have at least 6 body parts that can bend and move. Can your creature make it all the way through the tunnel without getting stuck?\n\n### 3–5 Version:\n**\"Engineer a Segmented Robot Crawler\"**\n\nDesign and build a segmented crawler inspired by centipede movement. Your design must:\n- Have at least 8 body segments, each one independently movable\n- Use legs or appendages on at least 4 segments\n- Successfully navigate through a course with three obstacles: a narrow gap (2 inches wide), a ramp angled 30°, and uneven \"terrain\" (crumpled paper)\n- Complete the course in under 45 seconds without falling apart\n\nMeasure and record the time it takes to complete the course. Identify which segment design works best for turning corners.\n\n---\n\n## EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows an animal in nature solving a real movement problem—navigating confined, uneven spaces. Students begin by observing *how* the centipede's segmented structure solves the challenge of flexibility and efficiency, then translate that observation into their own design brief.\n\n---\n\n## Suggested Materials\n- Paper cups, straws, or foam tubes (for body segments)\n- Pipe cleaners or craft sticks (for legs)\n- Tape, glue, or brass fasteners (for flexible joints)\n- Markers and colored paper (for decoration and labeling)\n- Stopwatch or timer (for 3–5 testing phase)\n\n---\n\n## Estimated Time\n- **K–2**: 45–60 minutes (single session: design, build, test)\n- **3–5**: Two 40-minute sessions (Session 1: design and build; Session 2: test, measure, refine, document results)\n\n---\n\n## Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A (Defining and Delimiting Problems)** and **ETS1.B (Developing Possible Solutions)** by having students observe a natural structure, identify the engineering problem it solves, and prototype their own solution based on observable design features.",
  "inputTokens": 2195,
  "outputTokens": 763,
  "cost": 0.00601,
  "generatedAt": "2026-02-10T00:43:31.000Z"
}