{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada06282020_hdr.jpg",
  "imagePath": "images/life-science/cicada06282020_hdr.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Cicadas and Insects in Nature\n\n## Core Science Concepts from Image Analysis\n\n• **Adaptation and Survival** – The cicada's body structure (wings, legs, coloring) and behavior (feeding on plant fluids) show how insects are adapted to live in specific environments and interact with plants.\n\n• **Food Relationships and Energy Movement** – The cicada feeds on plant materials (visible from its positioning on flowering plant), demonstrating how energy and matter move from plants to animals in a food web.\n\n• **Life Cycles and Growth** – Cicadas undergo significant physical changes (metamorphosis) as they grow, visible in their distinctive body structure and the shed exoskeleton often seen in nature.\n\n• **Ecosystem Interactions** – The image shows a specific habitat where insects and plants live together, depending on one another for survival.\n\n---\n\n## Lesson Title\n\n**How Do Cicadas Fit Into Their World? Investigating Insect Adaptations and Plant-Animal Relationships**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 50-minute sessions (or four 25-minute block sessions)\n- **NGSS Standards:** \n  - 5-LS2-1: Develop a model to describe the movement of matter among plants, animals, decomposers, and the environment.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Identify and describe the body structures of a cicada that help it survive in its environment.\n2. Explain how cicadas depend on plants for food and how this relationship moves energy and matter through an ecosystem.\n3. Develop a simple model showing how matter (food and energy) moves from plants to insects to other animals.\n4. Apply knowledge of insect adaptations to predict how other insects survive in their habitats.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student curiosity about the relationship between insects and plants using the photograph.\n\n**Materials:**\n- Printed color copy of the cicada photograph (one per table or displayed via projector)\n- Chart paper or whiteboard for recording questions\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it. Ask students to look silently for 30 seconds and notice everything they can.\n\n2. **Pose these guiding questions** to spark discussion:\n   - \"What do you see in this picture? Describe the animal and the plant.\"\n   - \"Why do you think the cicada is on this plant with the red flowers? What might it be doing there?\"\n   - \"What do you notice about the cicada's body? What parts do you see?\" (Point out legs, wings, body shape.)\n   - \"If you could ask this cicada one question, what would it be?\"\n\n3. **Record student observations and questions** on chart paper. Highlight any comments about the cicada feeding, the plant's role, or the cicada's body parts.\n\n4. **Wonder prompt:** \"I wonder how this tiny cicada gets the food it needs to live and grow. Let's find out!\"\n\n**Transition:** \"In today's investigation, you'll be cicada detectives. You'll explore how insects like this cicada are built for survival and how they connect to the plants around them.\"\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate insect adaptations and plant-insect relationships through observation and hands-on modeling.\n\n**Materials:**\n- Photo copies of the cicada image (one per student or pair)\n- Magnifying glasses (one per pair)\n- Pre-made \"Insect Body Parts\" labels and diagram template (printed or displayed)\n- String or yarn (to create food chain models)\n- Index cards with pictures/names: Plant, Cicada, Bird, Decomposer\n- Optional: Real cicada images, close-up photos of cicada mouth parts\n- Student observation sheet (template provided below)\n\n**Activity:**\n\n**Part 1: Close Observation (10 minutes)**\n\n1. **Distribute magnifying glasses and printed cicada photos to pairs.** Ask: \"Look closely at the cicada's body using the magnifying glass. Find and point to: head, legs, wings, body.\"\n\n2. **Guide observation with prompts:**\n   - \"How many legs do you count?\"\n   - \"What do the wings look like? Feel? (Have students touch different textures.)\"\n   - \"Can you see the mouth? Where is it?\" (Cicadas have a straw-like mouth they use to drink from plants.)\n\n3. **Students draw and label the cicada** on their observation sheet, marking key body parts.\n\n**Part 2: Food Chain Investigation (12 minutes)**\n\n1. **Ask:** \"What do you think the cicada eats? Why is it on a plant?\" Allow 1-2 minutes for pair discussion.\n\n2. **Explain the cicada's feeding behavior** (teacher-guided, not student discovery): \"Cicadas use a special straw-like mouth to poke into plants and drink the liquid inside. This liquid is called plant juice or sap, and it has water and nutrients the cicada needs to grow.\"\n\n3. **Build a simple food chain model:**\n   - Give each pair the index cards: Plant, Cicada, Bird, Decomposer.\n   - Ask: \"If the cicada eats from the plant, what eats the cicada?\"\n   - Have students arrange the cards in a line (Plant → Cicada → Bird → Decomposer).\n   - Use string to connect the cards, showing how energy and matter move from one to the next.\n\n4. **Students draw this food chain** on their observation sheet and label each organism.\n\n**Teacher Role:**\n- Circulate and ask questions: \"Why did you put the plant first?\" \"What happens to the bird when it eats the cicada?\" \"Where does the decomposer fit in?\"\n- Avoid telling answers; guide thinking with questions.\n- Correct misconceptions gently: \"Let's look at that again. Does the bird eat the plant, or the cicada?\"\n\n**Expected Student Outcomes:**\n- Labeled drawings of cicada body parts\n- A food chain diagram showing Plant → Cicada → Bird\n- Recorded observations about cicada body structures and what it eats\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Introduce formal vocabulary and reinforce understanding of adaptations and food relationships.\n\n**Materials:**\n- Chart paper with vocabulary terms written large\n- Photograph displayed (visible throughout)\n- Student vocabulary sheets or interactive notebook pages\n- Visual aids: cicada adaptation posters (wings, legs, mouth) or drawings\n\n**Activity:**\n\n1. **Share-Out (5 minutes):** Ask pairs to share one thing they discovered about the cicada's body or its relationship with the plant. Record key ideas on chart paper.\n\n2. **Introduce Vocabulary (8 minutes):** Teach each term using the photograph as reference:\n\n   - **Adaptation:** A body part or behavior that helps an animal survive in its environment. (Point to cicada's wings, legs, and straw-like mouth as examples.)\n   - **Predator:** An animal that hunts and eats other animals. (Ask: \"What is the cicada's predator?\" *Bird*)\n   - **Prey:** An animal that is hunted and eaten by other animals. (The cicada is prey for birds.)\n   - **Ecosystem:** All the living things (plants, animals, insects) and non-living things (water, soil, air) in an area that interact with each other.\n   - **Matter/Energy:** Plants capture energy from the sun. When the cicada eats the plant, it gets that energy. When a bird eats the cicada, the energy moves again.\n\n3. **Deepen Understanding (5 minutes):**\n   - Display the photograph again and point: \"The cicada's wings are an adaptation that helps it fly to find plants to eat. Its straw mouth is an adaptation that lets it poke into plants. These adaptations help it survive.\"\n   - \"When the cicada eats the plant's sap, it's taking in matter and energy from the plant. If a bird eats the cicada, the matter and energy move to the bird. This is how matter moves through an ecosystem.\"\n\n4. **Check for Understanding:**\n   - Ask: \"If there were no plants, could cicadas survive? Why not?\"\n   - Ask: \"What happens to the energy the plant got from the sun when a bird eats the cicada?\"\n   - Have students thumbs-up/sideways/down to show confidence with key concepts.\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|----------------------------|\n| **Adaptation** | A body part or behavior that helps an animal live and survive in its home. |\n| **Predator** | An animal that hunts and eats other animals to live. |\n| **Prey** | An animal that is hunted and eaten by other animals. |\n| **Ecosystem** | All the living and non-living things in one area that work together, like plants, insects, and soil. |\n| **Matter** | Anything that takes up space—like water, food, and air. It moves through ecosystems when animals eat plants and other animals. |\n\n**Expected Student Outcomes:**\n- Students can name at least two cicada adaptations and explain how they help the cicada survive.\n- Students can explain that the cicada gets energy and matter from plants, and that energy moves through food chains.\n- Students can use vocabulary terms (adaptation, predator, prey, ecosystem) in sentences.\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Students apply their understanding of adaptations and food relationships to new scenarios and real-world contexts.\n\n**Materials:**\n- Picture cards of 4-5 different insects (ant, grasshopper, dragonfly, beetle, ladybug) with their adaptations labeled\n- \"Insect Adaptation Challenge\" worksheet with scenarios\n- Chart paper or whiteboard for class discussion\n- Optional: Images of insect habitats (garden, pond, forest)\n\n**Activity:**\n\n**Option A: Adaptation Detective (for most students)**\n\n1. **Display a new insect image** (e.g., a grasshopper on a leaf).\n\n2. **Ask:** \"This grasshopper is related to the cicada, but it's built a little differently. Look at its strong back legs. Why do you think grasshoppers have such powerful legs while cicadas have delicate wings?\"\n\n3. **Guide discussion:** \"Different insects have different adaptations because they live in different ways and eat different foods. The grasshopper jumps to escape danger; the cicada flies.\"\n\n4. **Students complete an adaptation comparison worksheet:**\n   - Draw or paste a picture of a new insect.\n   - Label its adaptations.\n   - Write: \"This insect has _____ because _____.\"\n   - Example: \"This insect has strong legs because it needs to jump away from predators.\"\n\n5. **Class share:** 2-3 students present their insect and explain one adaptation.\n\n**Option B: Food Chain Puzzle (for all students)**\n\n1. **Give each group a different \"ecosystem scenario\":**\n   - Scenario A: A garden with plants, cicadas, birds, and snakes.\n   - Scenario B: A forest with trees, grasshoppers, owls, and worms.\n\n2. **Task:** Create a food chain showing how matter moves from plants to the final predator. Use string or draw arrows.\n\n3. **Ask:** \"If all the plants died, what would happen to the cicadas? To the birds?\"\n\n4. **Class debrief:** Discuss how ecosystems depend on plants as the energy source.\n\n**Teacher Role:**\n- Ask probing questions: \"How do you know that's an adaptation?\" \"What would happen if the cicada didn't have wings?\"\n- Listen to student reasoning and gently challenge incomplete thinking.\n- Affirm connections students make to the original photograph.\n\n**Expected Student Outcomes:**\n- Students identify and explain adaptations in new insects.\n- Students accurately build food chains showing matter movement.\n- Students recognize that plants are essential to all ecosystems because they capture energy.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of insect adaptations, food relationships, and ecosystem matter movement.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **During Explore:** Observe student-created food chain diagrams and labeled drawings. Ask: \"Why did you put the plant first?\" Listen for understanding of matter movement.\n- **During Explain:** Use thumbs-up/sideways/down for vocabulary checks. Ask individual students to define adaptation or explain a food chain aloud.\n- **During Elaborate:** Review adaptation comparison worksheets. Look for accurate cause-and-effect explanations (adaptation → survival benefit).\n\n**Summative Assessment: Exit Ticket (5 minutes)**\n\nDistribute an index card with these three questions. Students answer individually:\n\n1. **Look at the cicada photo one more time. Name two body parts of the cicada and tell how each one helps it survive.** \n   - Success Criteria: Identifies at least 2 body parts (wings, legs, mouth) and explains a survival benefit for each.\n\n2. **Draw a simple food chain that shows how matter moves from the plant to a bird (include: plant → cicada → bird).** \n   - Success Criteria: Correct sequence with arrows showing direction of matter/energy flow.\n\n3. **Why do plants come first in this food chain?** \n   - Success Criteria: Student explains that plants get energy from the sun and other animals need that energy to survive, OR \"plants make food\" or \"animals eat plants.\"\n\n**Scoring Guide:**\n\n| Performance | Evidence |\n|-------------|----------|\n| **Proficient** | Student correctly answers all 3 questions with accurate explanations and a properly drawn food chain. |\n| **Developing** | Student answers 2 questions correctly but may have incomplete explanations or a food chain with a minor sequencing error. |\n| **Beginning** | Student attempts all questions but shows gaps in understanding adaptations or food chain concepts. |\n\n**Expected Student Outcomes:**\n- At least 80% of students can name cicada adaptations and explain their survival function.\n- 80% of students can draw a correct 3-organism food chain.\n- 75% of students can explain why plants are essential to an ecosystem (energy/food source).\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Provide a labeled diagram of the cicada** during Explore so students don't struggle with identification. They focus on observing rather than guessing.\n\n2. **Pre-teach vocabulary** using picture cards before the Explain phase. Pair terms with simple drawings (wings = flying, mouth = eating, legs = holding on).\n\n3. **Use a sentence frame for food chain explanations:**\n   - \"The _____ eats the _____. The _____ eats the _____.\"\n   - \"This is an adaptation because it helps the cicada _____.\"\n\n4. **Provide a partially completed food chain** (Plant → Cicada → ___) and ask students to fill in the missing organism and explain.\n\n### Challenge (For Advanced Learners)\n\n1. **Explore decomposers in depth:** Ask advanced students to research and explain what happens to a dead cicada. How do decomposers break down matter so it returns to the soil? Create a full 4-5 organism food web (not just a chain).\n\n2. **Compare multiple insects:** Provide images of 5-6 different insects in different habitats (aquatic, forest, garden, grassland). Challenge students to:\n   - Identify adaptations specific to each habitat\n   - Explain why the same adaptation might work differently in different environments\n   - Build multiple food chains showing ecosystem diversity\n\n3. **Investigate seasonal changes:** Ask: \"Cicadas emerge at certain times of year. How might the availability of plants change the cicada's ecosystem? What happens in winter?\" Students research and create a seasonal food chain comparison.\n\n4. **Design a new insect:** Challenge students to draw an imaginary insect with adaptations suited to a specific ecosystem (desert, arctic, underwater) and explain how each adaptation helps it survive.\n\n---\n\n## Extension Activities\n\n1. **Backyard Ecosystem Walk:** Take students outside to observe real insects on plants. Have them sketch any insects they find and identify possible adaptations. Ask: \"What plants do you see? Could a cicada live here? Why or why not?\" (Connects to real-world applications; 20-30 minutes)\n\n2. **Life Cycle Investigation:** Cicadas have a complex life cycle—spending years underground before emerging. Provide an informational text or video about cicada life cycles. Students create a labeled diagram showing egg → nymph → adult stages and explain how each stage is adapted to its environment. (Extends to life cycles; 2-3 lessons)\n\n3. **Create an Ecosystem Diorama:** Students build a shoebox or poster-board diorama showing a cicada's habitat with plants, other insects, and predators. They label food relationships with string or arrows showing how matter moves through the ecosystem. Display in classroom or hallway. (Real-world application of ecosystem concepts; homework or project-based learning)\n\n4. **Cicada Sound Investigation:** Play recordings of cicada calls. Discuss: \"Why do cicadas make sounds? Is this an adaptation?\" Research how male cicadas use sound to attract mates. Connect to adaptation for reproduction and survival. (Cross-curricular with sensory learning; 15-20 minutes)\n\n5. **Comparison Study—Cicadas vs. Other Plant-Eating Insects:** Provide articles or images comparing cicadas to aphids, grasshoppers, and beetles. Create a comparison chart showing: What they eat, Body adaptations, Predators, Habitats. Discuss how similar adaptations help different insects survive. (Advanced: introduces concept of convergent evolution at simple level)\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety:** Remind students that live insects should be observed gently. If observing real cicadas, handle minimally and release unharmed.\n- **Timing:** This lesson works well in late spring or early summer when cicadas are active. Adjust timing of outdoor exploration accordingly.\n- **Real Cicada Photos:** If possible, show a brief video (30 seconds) of a cicada feeding on a plant stem. This concrete visual reinforces the feeding behavior discussed in Explain.\n- **Vocabulary Reinforcement:** Display vocabulary posters throughout the unit. Use terms consistently in all discussions.\n- **Formative Feedback:** After Explore phase, quickly scan student food chain diagrams and provide verbal feedback: \"I see you put the plant first—great! Now, what do you think eats the cicada?\" This guides thinking without giving answers.\n\n---\n\nThis lesson directly addresses NGSS 5-LS2-1 by having students develop a model (food chain) showing how matter moves among plants, animals, and the environment, grounded in the concrete, observable relationship visible in the photograph.",
  "inputTokens": 2817,
  "outputTokens": 4386,
  "cost": 0.024746999999999998,
  "generatedAt": "2026-02-12T20:03:46.106Z"
}