{
  "id": 78,
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada.jpg",
  "content": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada clinging to a thin branch. The cicada's transparent wings are visible, revealing intricate vein patterns and slight color variations ranging from pale green to brownish hues. Dew droplets are scattered across the wings and branches, adding a glossy texture to the scene. The background is blurred, emphasizing the sharp focus on the cicada and its immediate surroundings.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the life cycle of a cicada, specifically highlighting its metamorphosis from nymph to adult. Cicadas spend most of their lives underground as nymphs, feeding on sap from plant roots. When they emerge, they undergo a remarkable transformation, shedding their exoskeleton (a process called molting) to reveal their wings and adult form. The dew droplets in the image also illustrate surface tension, a property of water that allows it to form droplets rather than spreading out flat.\n\n## 📚 Core Science Concepts\n\n1. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, involving significant changes in structure and function.  \n2. **Exoskeleton**: A hard outer covering that provides support and protection for insects like cicadas.  \n3. **Surface Tension**: The elastic tendency of a liquid surface, which allows it to resist an external force.\n\n<pedagogical-tip>  \nEngage students with a hands-on activity: Observe live or recorded images of cicada molting. Ask them to compare the nymph and adult stages, focusing on differences in structure (e.g., wings, legs). Use a magnifying glass to examine the exoskeleton's texture and discuss its role in protection.  \n</pedagogical-tip>\n\n<udl-suggestions>  \n- Provide tactile models or 3D prints of cicada nymphs and adults for students to compare.  \n- Offer visual aids like time-lapse videos of molting to support understanding.  \n- Use analogies (e.g., comparing molting to shedding skin) to make abstract concepts more relatable.  \n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS1.A]]: Developmental Biology  \n- [[NGSS:CCC:Cause and Effect]]: The role of molting in cicada development.  \n- [[NGSS:CCC:Structure and Function]]: How the exoskeleton supports survival.\n\n**Performance Expectations:**  \n- 3-LS1-1: Develop models to describe that organisms have unique and diverse life cycles but share common patterns of growth and development.  \n- 5-ESS2-1: Develop a model to explain the Earth's internal and surface processes.\n\n## 💬 Discussion Questions\n\n1. What changes do you observe between a cicada nymph and an adult? (Bloom's: Compare) (DOK: 2)  \n2. How does the exoskeleton help a cicada survive in its environment? (Bloom's: Analyze) (DOK: 3)  \n3. Why might dew droplets form on the wings of a cicada? (Bloom's: Evaluate) (DOK: 1)  \n4. What role does molting play in the life cycle of a cicada? (Bloom's: Explain) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Metamorphosis:** The process of transformation from an immature form to an adult.  \n- **Exoskeleton:** A hard outer covering that supports and protects an insect's body.  \n- **Surface Tension:** The property of water that allows it to form droplets.  \n- **Nymph:** The immature stage of an insect, such as a cicada, before it becomes an adult.  \n- **Molting:** The process of shedding an exoskeleton to grow or develop.\n\n## 🌡️ Extension Activities\n\n- **For Support:** Provide a diagram comparing the life stages of a cicada with labels. Use simple language to describe each stage.  \n- **For Extension:** Research how other insects undergo metamorphosis and compare their life cycles to that of a cicada.  \n- **Cross-Curricular Link:** Explore how cicadas are represented in myths or stories from different cultures.\n\n## 🌍 External Resources\n\n**Children's Books:**  \n- *The Very Quiet Cricket* by Eric Carle  \n- *Cicadas: Insects of the Summer* by Bobbie Kalman\n\n**YouTube Videos:**  \n- *The Life Cycle of a Cicada*, National Geographic Kids (https://www.youtube.com/watch?v=example)  \n- *Cicada Molting Time-Lapse*, Science Channel (https://www.youtube.com/watch?v=example)  \n",
  "generatedAt": "2026-02-02T22:15:00.000Z",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada clinging to a thin branch. The cicada's transparent wings are visible, revealing intricate vein patterns and slight color variations ranging from pale green to brownish hues. The cicada's bulging eyes and segmented body can be clearly seen. The background is blurred, allowing the focus to remain on the cicada.\n\n## 🔬 Scientific Phenomena\n\nThis image depicts a cicada in its adult stage, after undergoing a remarkable transformation from its immature nymph form. Cicadas spend most of their lives underground, feeding on plant roots. When they emerge, they shed their exoskeleton (a hard outer covering) to reveal their wings and mature body. This process of change from an immature to an adult form is called metamorphosis.\n\n## 📚 Core Science Concepts\n\n1. **Life Cycle**: Cicadas have a unique life cycle that includes an underground nymph stage and an aboveground adult stage.\n2. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, involving significant changes in structure and function.\n3. **Exoskeleton**: A hard outer covering that provides support and protection for insects like cicadas.\n\n<pedagogical-tip>\nEngage students in a hands-on exploration of the cicada's life cycle. Provide images or videos of the nymph and adult stages, and encourage them to compare the differences in structure and behavior. Use a magnifying glass to examine the texture and function of the exoskeleton. Encourage students to ask questions and make observations about the remarkable transformation they observe.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Offer visual aids, such as diagrams or models, to help students understand the different stages of the cicada's life cycle.\n- Provide opportunities for tactile exploration, such as handling a molted exoskeleton, to support kinesthetic learners.\n- Use analogies and storytelling to make the concept of metamorphosis more relatable and engaging for young learners.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:CCC:Patterns]]: Patterns of growth and development in living things\n- [[NGSS:SEP:2]]: Developing and Using Models\n\n## 💬 Discussion Questions\n\n1. What changes can you see between the cicada's nymph and adult stages? (Bloom's: Analyze) (DOK: 2)\n2. How does the exoskeleton help the cicada survive? (Bloom's: Evaluate) (DOK: 3)\n3. Why do you think the cicada's wings have a transparent, delicate appearance? (Bloom's: Analyze) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Cicada**: A type of insect known for its loud, buzzing calls.\n- **Nymph**: The immature stage of an insect, such as a cicada, before it becomes an adult.\n- **Metamorphosis**: The process of transformation from an immature form to an adult.\n- **Exoskeleton**: A hard, outer covering that supports and protects an insect's body.\n- **Transformation**: A marked change in appearance or character, especially a dramatic one.\n- **Molt**: To shed an exoskeleton or outer layer to allow for growth or development.\n\n## 🌡️ Extension Activities\n\n- **For Support**: Create a simple life cycle diagram for the cicada, with labels and descriptions for the nymph and adult stages.\n- **For Extension**: Investigate how other insects, such as butterflies or dragonflies, undergo metamorphosis and compare their life cycles to that of the cicada.\n- **Cross-Curricular Link**: Explore how cicadas are represented in art, literature, or music from different cultures.",
    "grade1": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada clinging to a thin branch. The cicada's large, transparent wings are clearly visible, revealing intricate patterns of veins and a slight greenish-brown color. The cicada's bulbous eyes and segmented body are also prominent in the photograph.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the adult stage of a cicada's life cycle. Cicadas are insects that spend most of their lives underground as nymphs, feeding on the sap from plant roots. When they emerge from the soil, they undergo a remarkable transformation, shedding their hard exoskeleton (a process called molting) to reveal their wings and adult form. The transparent wings of the cicada are a key feature of their mature stage, allowing them to fly and mate.\n\n## 📚 Core Science Concepts\n\n1. **Life Cycle**: The stages of growth and development that an organism goes through, from birth to adulthood and reproduction.\n2. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, involving significant changes in structure and function.\n3. **Exoskeleton**: A hard outer covering that provides support and protection for insects like cicadas.\n\n<pedagogical-tip>\nEngage students with a hands-on activity: Observe live or recorded images of cicada molting. Ask students to compare the nymph and adult stages, focusing on differences in structure (e.g., wings, legs). Use a magnifying glass to examine the exoskeleton's texture and discuss its role in protection.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Provide tactile models or 3D prints of cicada nymphs and adults for students to compare.\n- Offer visual aids like time-lapse videos of molting to support understanding.\n- Use analogies (e.g., comparing molting to shedding skin) to make abstract concepts more relatable.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-LS1.A]]: Structure and Function\n- [[NGSS:DCI:1-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:CCC:Patterns]]: Recognizing the patterns in the life cycle of cicadas\n\n## 💬 Discussion Questions\n\n1. How does the adult cicada's appearance differ from the nymph's? (Bloom's: Compare) (DOK: 2)\n2. What purpose do the cicada's transparent wings serve? (Bloom's: Analyze) (DOK: 3)\n3. Why do you think the cicada sheds its exoskeleton as it grows? (Bloom's: Evaluate) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Life Cycle**: The series of changes an organism goes through during its lifetime, from birth to adulthood and reproduction.\n- **Metamorphosis**: The process of transformation from an immature form to an adult, involving significant changes in structure and function.\n- **Exoskeleton**: A hard, external skeleton that provides support and protection for insects.\n- **Nymph**: The immature stage of an insect, such as a cicada, before it becomes an adult.\n- **Molt**: The process of shedding an exoskeleton to allow for growth or development.\n\n## 🌡️ Extension Activities\n\n- **For Support**: Create a simple diagram or timeline to illustrate the life cycle of a cicada, focusing on the key stages of growth and development.\n- **For Extension**: Research how other insects, such as butterflies or dragonflies, undergo metamorphosis and compare their life cycles to that of a cicada.\n- **Cross-Curricular Link**: Explore how cicadas are represented in myths, stories, or cultural traditions from different parts of the world.\n\n## 🌍 External Resources\n\n**Children's Books:**\n- *The Very Quiet Cricket* by Eric Carle\n- *Cicadas: Insects of the Summer* by Bobbie Kalman\n\n**YouTube Videos:**\n- *The Life Cycle of a Cicada*, National Geographic Kids (https://www.youtube.com/watch?v=example)\n- *Cicada Molting Time-Lapse*, Science Channel (https://www.youtube.com/watch?v=example)",
    "grade2": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada clinging to a thin branch. The cicada's transparent wings are visible, revealing intricate vein patterns and slight color variations ranging from pale green to brownish hues. Dew droplets are scattered across the wings and branches, adding a glossy texture to the scene.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the remarkable life cycle of a cicada. Cicadas spend most of their lives underground as nymphs, feeding on the sap from plant roots. When they emerge, they undergo a dramatic transformation, shedding their exoskeleton (a process called molting) to reveal their beautiful adult wings. The dew droplets in the image also demonstrate the property of surface tension, which allows water to form droplets instead of spreading out flat.\n\n## 📚 Core Science Concepts\n\n1. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, with significant changes in structure and function.\n2. **Exoskeleton**: A hard, outer covering that provides support and protection for insects like cicadas.\n3. **Surface Tension**: The elastic tendency of a liquid surface that allows it to resist an external force, causing the water to form droplets.\n\n<pedagogical-tip>\nEngage students with a hands-on activity: Observe live or recorded images of cicada molting. Encourage them to compare the nymph and adult stages, focusing on the differences in structure (e.g., wings, legs). Use a magnifying glass to examine the exoskeleton's texture and discuss its role in protection.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Provide tactile models or 3D prints of cicada nymphs and adults for students to compare and explore.\n- Offer visual aids like time-lapse videos of molting to support understanding.\n- Use analogies (e.g., comparing molting to shedding skin) to make abstract concepts more relatable.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:CCC:Cause and Effect]]: The role of molting in cicada development\n- [[NGSS:CCC:Structure and Function]]: How the exoskeleton supports the cicada's survival\n\n## 💬 Discussion Questions\n\n1. What changes do you notice between the cicada nymph and the adult cicada? (Bloom's: Analyze) (DOK: 2)\n2. How does the exoskeleton help the cicada survive in its environment? (Bloom's: Evaluate) (DOK: 3)\n3. Why do you think the dew droplets form on the cicada's wings? (Bloom's: Explain) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from an immature form to an adult.\n- **Exoskeleton**: A hard, outer covering that supports and protects an insect's body.\n- **Surface Tension**: The property of water that allows it to form droplets.\n- **Nymph**: The immature stage of an insect, like a cicada, before it becomes an adult.\n- **Molting**: The process of shedding an exoskeleton to grow or develop.\n\n## 🌡️ Extension Activities\n\n- **For Support**: Create a diagram or model comparing the life stages of a cicada, with simple labels and descriptions.\n- **For Extension**: Research how other insects, like butterflies or dragonflies, undergo metamorphosis and compare their life cycles to that of a cicada.\n- **Cross-Curricular Link**: Explore how cicadas are represented in myths, stories, or art from different cultures.",
    "grade3": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada clinging to a thin branch. The cicada's transparent wings are visible, revealing intricate vein patterns and subtle shades of green and brown. Tiny dew droplets cling to the wings and branches, adding a sparkling, natural beauty to the scene. The blurred background helps to focus attention on the cicada and its immediate surroundings.\n\n## 🔬 Scientific Phenomena\n\nThis image captures a fascinating moment in the life cycle of a cicada - the emergence of the adult from its nymphal stage. Cicadas spend most of their lives underground as nymphs, feeding on the sap of plant roots. When they finally emerge, they undergo a remarkable transformation, shedding their hard exoskeleton (or outer shell) to reveal their delicate, adult wings. The dew droplets on the wings and branches illustrate the property of surface tension, which allows water to form droplets instead of spreading out flat.\n\n## 📚 Core Science Concepts\n\n1. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, involving significant changes in the cicada's structure and function.\n2. **Exoskeleton**: A hard, external skeleton that provides support and protection for insects like cicadas.\n3. **Surface Tension**: The elastic tendency of a liquid surface, which allows water to form droplets and resist external forces.\n\n<pedagogical-tip>\nEngage students in a hands-on exploration of cicada molting by providing live specimens or video recordings. Encourage them to observe the differences between the nymph and adult stages, focusing on changes in the exoskeleton, wings, and overall body structure. Use a magnifying glass to examine the intricate details of the exoskeleton and wings. This hands-on activity will help students better understand the remarkable process of metamorphosis.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Offer visual aids, such as diagrams or 3D models, to help students visualize the life cycle and structural changes of a cicada.\n- Provide opportunities for students to compare and contrast the nymph and adult stages through interactive activities or multimedia resources.\n- Incorporate analogies or real-world examples to make the concept of surface tension more accessible and relatable for students.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS1.A]]: Developmental Biology\n- [[NGSS:CCC:Cause and Effect]]: The role of molting in the cicada's transformation and development\n- [[NGSS:CCC:Structure and Function]]: How the exoskeleton supports the cicada's survival and adaptation\n\n**Performance Expectations:**\n- 3-LS1-1: Develop models to describe that organisms have unique and diverse life cycles but share common patterns of growth and development.\n- 5-ESS2-1: Develop a model to describe the cycling of water through Earth's systems driven by energy from the sun and the force of gravity.\n\n## 💬 Discussion Questions\n\n1. What are the key differences you observe between the cicada nymph and the adult? (Bloom's: Analyze) (DOK: 2)\n2. How does the cicada's exoskeleton help it survive in its environment? (Bloom's: Evaluate) (DOK: 3)\n3. Why do you think the dew droplets form on the cicada's wings and the surrounding branches? (Bloom's: Explain) (DOK: 2)\n4. What role does the process of molting play in the cicada's life cycle? (Bloom's: Analyze) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from an immature form to an adult, involving significant changes in structure and function.\n- **Exoskeleton**: A hard, external skeleton that provides support and protection for insects like cicadas.\n- **Surface Tension**: The elastic tendency of a liquid surface that allows it to form droplets and resist external forces.\n- **Nymph**: The immature stage of an insect, such as a cicada, before it becomes an adult.\n- **Molting**: The process of shedding an exoskeleton to allow for growth and development.\n\n## 🌡️ Extension Activities\n\n- **For Support**: Create a sequencing activity or simple diagram to help students understand the life cycle of a cicada, focusing on the transformation from nymph to adult.\n- **For Extension**: Investigate how other insects, such as butterflies or dragonflies, undergo metamorphosis and compare their life cycles to that of the cicada.\n- **Cross-Curricular Link**: Explore how cicadas are represented in myths, stories, or cultural traditions from around the world.\n\n## 🌍 External Resources\n\n**Children's Books:**\n- *The Life and Times of the Cicada* by Maggie Moss\n- *Cicada Chant* by Susan Avingaq\n\n**YouTube Videos:**\n- *Life Cycle of a Cicada*, National Geographic Kids (https://www.youtube.com/watch?v=example)\n- *Cicada Molting Time-Lapse*, Science Channel (https://www.youtube.com/watch?v=example)",
    "grade4": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada, a type of large, winged insect. The cicada is clinging to a thin branch, its transparent wings spread out. The wings have intricate vein patterns and a slightly greenish-brown color. Tiny dew droplets can be seen scattered across the wings and branches, giving the scene a glistening appearance.\n\n## 🔬 Scientific Phenomena\n\nThis photo captures the remarkable transformation of a cicada as it transitions from its nymph stage to the adult form. Cicadas spend most of their lives underground, feeding on the sap of plant roots. When they emerge, they undergo a process called molting, where they shed their hard, outer exoskeleton to reveal their fully developed wings and adult body. The dew droplets in the image demonstrate the property of surface tension, which allows water to form small, bead-like shapes on surfaces.\n\n## 📚 Core Science Concepts\n\n1. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, winged insect.\n2. **Exoskeleton**: The hard, outer covering that provides protection and support for insects like cicadas.\n3. **Surface Tension**: The elastic-like property of water that allows it to form droplets on surfaces.\n\n<pedagogical-tip>\nEngage students by having them observe live or video recordings of cicadas molting. Encourage them to compare the appearance and structure of the nymph and adult stages, focusing on the changes in the exoskeleton and the development of wings. You can also demonstrate surface tension by having students observe water droplets on different surfaces, such as leaves or glass.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Provide tactile models or 3D printed replicas of cicada nymphs and adults for students to compare and explore.\n- Use visual aids, such as diagrams or time-lapse videos, to help students understand the process of metamorphosis.\n- Encourage hands-on activities, like observing water droplets or creating models of the cicada life cycle, to appeal to different learning styles.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-LS1.A]]: Structure and Function\n- [[NGSS:CCC:Patterns]]: Patterns in the life cycle of cicadas\n- [[NGSS:SEP:Constructing Explanations]]: Explaining the process of metamorphosis\n\n## 💬 Discussion Questions\n\n1. What are the main differences you observe between the nymph and adult stages of a cicada? (Bloom's: Analyze, DOK: 2)\n2. How does the exoskeleton of a cicada help it survive in its environment? (Bloom's: Evaluate, DOK: 3)\n3. Why do you think the dew droplets form on the cicada's wings and the branches? (Bloom's: Explain, DOK: 2)\n4. What role does molting play in the life cycle of a cicada? (Bloom's: Understand, DOK: 2)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from an immature form to an adult.\n- **Exoskeleton**: The hard, outer covering that supports and protects an insect's body.\n- **Surface Tension**: The property of water that allows it to form droplets on surfaces.\n- **Nymph**: The immature stage of an insect, such as a cicada, before it becomes an adult.\n- **Molting**: The process of shedding an exoskeleton to allow for growth and development.\n- **Sap**: The fluid that circulates through the vascular system of plants, providing nutrients.\n\n## 🌡️ Extension Activities\n\n- **For Support**: Create a simple life cycle diagram of the cicada, with clear labels and descriptions of each stage.\n- **For Extension**: Research how other insects, such as butterflies or dragonflies, undergo metamorphosis and compare their life cycles to that of the cicada.\n- **Cross-Curricular Link**: Explore how cicadas have been represented in myths, stories, or cultural traditions from around the world.\n\n## 🌍 External Resources\n\n**Children's Books**:\n- *Cicada* by Shaun Tan\n- *The Life Cycle of a Cicada* by Bobbie Kalman\n\n**Videos**:\n- \"Cicada Molting Time-Lapse\" by the Science Channel (https://www.youtube.com/watch?v=example)\n- \"The Life Cycle of a Cicada\" by National Geographic Kids (https://www.youtube.com/watch?v=example)",
    "grade5": "## 📸 Photo Description\n\nThe image shows a close-up view of a cicada, a large insect with distinctive transparent wings. The cicada is clinging to a thin branch, its body and wings covered in tiny droplets of dew. The intricate veins and patterns on the wings are clearly visible, and the background is blurred, focusing attention on the cicada itself.\n\n## 🔬 Scientific Phenomena\n\nThis image captures a key stage in the life cycle of a cicada - the transformation from a nymph (immature form) to an adult. Cicadas spend most of their lives underground as nymphs, feeding on plant sap. When they emerge, they undergo a remarkable metamorphosis, shedding their exoskeleton (a hard outer covering) to reveal their adult wings and body. The dew droplets on the cicada's wings illustrate the property of surface tension, which allows water to form these small, round shapes rather than spreading out flat.\n\n## 📚 Core Science Concepts\n\n1. **Metamorphosis**: The process of transformation from an immature form (nymph) to an adult, involving significant changes in structure and function.\n2. **Exoskeleton**: A hard outer covering that provides support and protection for insects like cicadas.\n3. **Surface Tension**: The elastic tendency of a liquid surface, which allows it to resist an external force and form droplets.\n\n<pedagogical-tip>\nEngage students by allowing them to observe live or recorded images of cicada molting. Have them compare the nymph and adult stages, focusing on the differences in structure (e.g., wings, legs). Use a magnifying glass to examine the exoskeleton's texture and discuss its role in protection. Encourage students to share their observations and ask questions to deepen their understanding.\n</pedagogical-tip>\n\n<udl-suggestions>\n- Provide tactile models or 3D prints of cicada nymphs and adults for students to compare and manipulate.\n- Offer visual aids like time-lapse videos of molting to support visual and kinesthetic learners.\n- Use analogies (e.g., comparing molting to shedding skin) to make abstract concepts more relatable for students.\n- Encourage students to draw or sketch the different stages of the cicada's life cycle to reinforce their understanding.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:CCC:Patterns]]: The life cycle and metamorphosis of cicadas\n- [[NGSS:CCC:Structure and Function]]: How the exoskeleton supports the cicada's survival\n\n**Performance Expectations:**\n- 5-LS1-1: Support an argument that plants get the materials they need for growth chiefly from air and water.\n- 5-LS2-1: Develop a model to describe the movement of matter among plants, animals, decomposers, and the environment.\n\n## 💬 Discussion Questions\n\n1. Describe the differences you observe between the cicada nymph and the adult cicada. (Bloom's: Analyze) (DOK: 2)\n2. How does the cicada's exoskeleton help it survive in its environment? (Bloom's: Evaluate) (DOK: 3)\n3. Why do you think the dew droplets form on the cicada's wings? (Bloom's: Explain) (DOK: 2)\n4. What role does molting play in the life cycle of a cicada? (Bloom's: Understand) (DOK: 2)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from an immature form to an adult.\n- **Exoskeleton**: A hard outer covering that supports and protects an insect's body.\n- **Surface Tension**: The property of water that allows it to form droplets.\n- **Nymph**: The immature stage of an insect, such as a cicada, before it becomes an adult.\n- **Molting**: The process of shedding an exoskeleton to grow or develop.\n- **Transformation**: A marked change in appearance or character, especially a dramatic one.\n\n## 🌡️ Extension Activities\n\n- **For Support**: Create a diagram comparing the different life stages of a cicada, with simple labels and descriptions.\n- **For Extension**: Research how other insects, such as butterflies or dragonflies, undergo metamorphosis and compare their life cycles to that of a cicada.\n- **Cross-Curricular Link**: Explore how cicadas are represented in myths, stories, or cultural traditions from around the world.\n\n## 🌍 External Resources\n\n**Children's Books:**\n- *The Hum of the Cicadas* by Sherri Maret\n- *Cicadas: Summer's Symphony* by Gail Greiner\n\n**YouTube Videos:**\n- *Life Cycle of a Cicada*, National Geographic Kids (https://www.youtube.com/watch?v=example)\n- *Cicada Molting Time-Lapse*, Science Channel (https://www.youtube.com/watch?v=example)"
  }
}