{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada.jpg",
  "imagePath": "images/life-science/cicada.jpg",
  "content": "# Engineering Design Challenge: Cicada on Branches\n\n### Visible Elements in Photo\n- A cicada (tan and orange body with segmented legs) perched on a gray-brown branch\n- Red and dark burgundy leaves or plant material on adjacent branches\n- Transparent, delicate wings with visible vein patterns\n- Thin branches of varying thickness the insect can grip\n- Natural outdoor environment with soft, blurred background\n\n### Reasonable Inferences\n- **From the insect's body shape and leg structure**: The cicada's clawed feet and angled legs are adapted to cling to rough, cylindrical surfaces; students could infer that branch texture and diameter affect how well creatures can hold on.\n- **From the transparent wings**: Wings require protection from damage during daily movement through branches; the insect needs a design that allows wings to fold away or remain undamaged while navigating tight spaces.\n- **From branch proximity**: The cicada moves between branches of different diameters; any structure it uses (or that mimics its habitat) must accommodate multiple grip points.\n\n---\n\n### Engineering Task\n\n**K-2: Design a Climbing Perch for Bugs**\n\nBuild a \"stick home\" that a bug (like a cicada) can climb on and rest. Use branches or straws tied together so they make good handholds. Your bug should be able to grip the perches with its feet and feel safe. Test it by rolling a small toy bug down your branches—it should stop and not fall off.\n\n---\n\n**3-5: Design a Structural Grip System for Tree-Dwelling Insects**\n\nDesign a branch-like structure (using dowels, straws, or craft sticks) that allows a weighted toy insect to grip and climb without sliding. Your structure must:\n- Be at least 20 cm tall\n- Include at least 3 branches of different diameters (vary thickness by 5mm)\n- Allow a 50-gram weight to be suspended from the \"grip points\" for 10 seconds without falling\n- Use only natural materials or craft materials (twine, tape, rubber bands allowed for binding)\n\nTest your grip by attaching a weight with a string; measure how long it stays attached. Redesign one joint or surface texture if it fails the first test.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo works best for the *Ask* phase because students can observe a real creature solving a real problem—how to grip and move safely through uneven, natural structures. Rather than telling students \"design a grip,\" we let them notice the cicada *needs* to grip, then ask them to build a solution. This grounds the challenge in nature observation rather than abstract design.\n\n---\n\n### Suggested Materials\n\n1. **Dowels or craft sticks** (various diameters: 6mm, 10mm, 15mm)\n2. **Twine, jute, or yarn** (for binding joints and creating texture)\n3. **Rubber bands or masking tape** (for securing branches together)\n4. **Toy bug or weighted object** (50-100g: small action figure, washer stack, or clay ball)\n5. **Sandpaper** (optional, to vary grip texture on smooth dowels)\n\n---\n\n### Estimated Time\n\n**30–45 minutes** (single session for K-2; one 30-min session for 3-5 with optional redesign in a second session)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A: Defining Engineering Design** by having students identify that natural structures (branches) solve a problem (gripping) and then prototype a human-made version, bridging biomimicry and functional design thinking.",
  "inputTokens": 2327,
  "outputTokens": 837,
  "cost": 0.006512,
  "generatedAt": "2026-02-09T13:31:06.000Z"
}