{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada.jpg",
  "imagePath": "images/life-science/cicada.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Cicadas and What Animals Need\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Animals need food to survive** — The cicada is positioned on a plant with flowers/buds, demonstrating that insects feed on plant parts to get the energy and nutrients they need.\n- **Animals have body structures for survival** — The cicada's legs, wings, and mouth parts are specialized adaptations that help it hold on to plants, move, and eat.\n- **Animals live in habitats with plants** — The photograph shows the cicada in its natural environment on flowering branches, illustrating that animals depend on plants in their habitats.\n- **Different animals have different appearances** — The cicada's distinctive coloring, wings, and body shape are different from other animals students know, promoting observation of diversity.\n\n---\n\n## Lesson Title\n\n**Cicadas Need Plants: What Do Animals Eat?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total)\n- **NGSS Standards:** \n  - K-LS1-1: Use observations to describe patterns of what plants and animals (including humans) need to survive.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. **Observe and describe** what the cicada in the photograph is doing on the plant.\n2. **Identify** that animals need food (plants or other living things) to survive.\n3. **Explain** that animals live in places where they can find the food and shelter they need.\n4. **Recognize** that different animals have different body parts to help them eat and move.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about the cicada and activate prior knowledge about what animals need.\n\n**Materials:**\n- Large printed photograph of the cicada on the plant (or display via projector)\n- Chart paper and markers\n- Picture cards of other animals (optional: bird, squirrel, fish — for comparison)\n\n**Activity:**\n\n1. **Display the photograph** on the board or wall where all students can see it clearly. Allow 30 seconds of silent observation.\n\n2. **Ask these discovery questions** (one at a time, allowing think-pair-share time):\n   - *\"What do you see on this plant? What is this creature doing?\"*\n   - *\"Why do you think this insect is on the flowers? What might it be looking for?\"*\n   - *\"What does this bug need to stay alive and healthy?\"*\n   - *\"Have you ever seen an insect on a flower or plant? Tell a friend what you remember.\"*\n\n3. **Record student responses** on chart paper with simple drawings and words. Accept all ideas without judgment; this reveals prior knowledge.\n\n4. **Wonder prompt:** *\"I wonder... why insects like cicadas spend so much time on plants. What do you wonder about?\"*\n\n**Transition:** *\"Today, we're going to explore what cicadas and other animals need to live, just like we need food and water.\"*\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate what animals need by observing plant-based feeding and matching animals to their food.\n\n**Materials:**\n- Real plants or plant pieces in small cups (spinach, lettuce, grass, flower petals, small leaves)\n- Pictures of animals (cicada, caterpillar, rabbit, butterfly, bee, bird) — 1 set per pair\n- Pictures of food items (seeds, berries, insects, leaves, flowers, grass) — 1 set per pair\n- Observation clipboard or sheet (simple picture-based recording)\n- Magnifying glasses (optional, if available)\n\n**Activity:**\n\n**Part A: Hands-On Food Exploration (10-12 minutes)**\n\n1. **Organize students in pairs.** Give each pair a small cup with a plant piece (e.g., a spinach leaf or grass blade).\n\n2. **Provide simple directions:**\n   - *\"Look closely at the plant with your magnifying glass. Does it look like something an animal might want to eat?\"*\n   - *\"Touch it gently. How does it feel? Is it soft? Hard?\"*\n   - *\"Would a tiny insect like a cicada eat this? Why or why not?\"*\n\n3. **Students observe and discuss** with their partner for 3-4 minutes. Teacher circulates, asking questions without revealing answers:\n   - *\"What do you notice?\"*\n   - *\"Why might insects like this plant?\"*\n\n4. **Rotate plants** (if time allows) so students see variety: leaves, flower petals, grass, seeds.\n\n**Part B: Matching Animals to Food (8-10 minutes)**\n\n1. **Display animal and food picture cards** on the board or table.\n\n2. **Demonstrate one example:** Hold up the picture of a bee and a flower. *\"The bee needs flowers. Bees drink sweet juice from flowers and eat pollen. Let's match them together.\"*\n\n3. **Students work in pairs** to match 3-4 animals to their food sources:\n   - Cicada → Leaves (or plant sap)\n   - Caterpillar → Leaves\n   - Bird → Seeds/berries\n   - Rabbit → Grass/lettuce\n\n4. **Record by drawing** (simple picture-based): Students draw or point to their matches on a recording sheet.\n\n**Teacher Role:** Circulate and listen. Ask guiding questions:\n- *\"What does this animal eat in nature?\"*\n- *\"Where would it find this food?\"*\n- *\"How does the animal's body help it eat this food?\"* (e.g., *\"Does it have a mouth for chewing?\"*)\n\nDo NOT provide direct answers; instead, lead them to think.\n\n**Expected Student Outcomes:**\n- Students observe that plants are food for many animals.\n- Students match at least 2-3 animals correctly to their food source.\n- Students record their thinking through drawing or pointing.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to life science concepts.\n\n**Materials:**\n- The original cicada photograph (large display)\n- Chart paper with student observations from Engage phase\n- Picture of a cicada's mouth (if available) or detailed diagram\n- Sentence frames on chart paper: *\"The cicada needs _______ to survive.\"*\n- Word cards: **food, plant, survive, body parts**\n\n**Activity:**\n\n1. **Gather students** in a circle or meeting area where they can all see the photograph clearly.\n\n2. **Group share-out (5 minutes):**\n   - *\"Let's talk about what we discovered. Who found that plants are food for animals?\"*\n   - *\"Show us on the photograph: where is the cicada? What is it doing?\"*\n   - *\"Why is the cicada on the plant?\"* (Guide to: *\"To get food!\"*)\n\n3. **Introduce and define vocabulary (8-10 minutes)** — Use the photograph to point and show:\n\n   - **Cicada:** A type of insect that lives on plants and trees.\n   - **Food/Eat:** Something a living thing takes in to give it energy and help it grow.\n   - **Survive:** To stay alive and healthy.\n   - **Body parts:** The different pieces of an animal's body (legs, mouth, wings) that help it do things.\n   - **Plant:** A living thing that grows from the ground and makes food using sunlight.\n\n4. **Make connections back to the photograph (5 minutes):**\n   - Point to the cicada's mouth (visible in close-up): *\"See the cicada's special mouth? It's like a straw. It pokes into the plant and drinks the juice inside. That's its food!\"*\n   - Point to its legs: *\"These strong legs help it hold on to the plant so it doesn't fall.\"*\n   - Point to its wings: *\"These wings help it fly from plant to plant to find more food.\"*\n\n5. **Check for understanding:**\n   - *\"Does the cicada need food to survive? Thumbs up or thumbs sideways?\"*\n   - *\"Can the cicada find food without plants? Why not?\"*\n   - *\"What body parts help the cicada eat?\"*\n\n**Vocabulary Display:**\nCreate a visual anchor chart and keep it displayed throughout the lesson:\n\n| **Word** | **What It Means** |\n|----------|------------------|\n| **Cicada** | An insect that lives on plants |\n| **Food** | Something animals eat for energy |\n| **Survive** | To stay alive and healthy |\n| **Plant** | A living thing that gives food to animals |\n| **Body parts** | Legs, wings, mouth — pieces that help animals do things |\n\n**Expected Student Outcomes:**\n- Students use the word \"food\" when talking about what animals need.\n- Students can point to body parts on the cicada in the photograph.\n- Students explain (in simple words) that the cicada eats from plants.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding to a new scenario and deepen thinking about habitats and survival.\n\n**Materials:**\n- Index cards or paper with pictures of different habitats: garden, forest, desert, pond\n- Animal picture cards (cicada, squirrel, fish, butterfly, ant)\n- \"Where Do I Live?\" sorting activity mat or poster\n- Crayons, markers, colored pencils\n- Blank paper for drawing\n\n**Activity:**\n\n**Choice 1: Habitat Sorting (10 minutes)**\n\n1. **Show students four habitat cards:** garden, forest, desert, and pond.\n\n2. **Ask:** *\"Where does the cicada live? What food would it find there?\"*\n\n3. **Model one example:** Hold up the **garden** card. *\"In a garden, there are flowers and plants. A cicada can find food here! That's where cicadas live.\"*\n\n4. **Provide animal and habitat cards** to small groups or pairs.\n\n5. **Students sort animals to their habitats** by matching pictures:\n   - Cicada → Garden or Forest\n   - Fish → Pond\n   - Squirrel → Forest\n   - Butterfly → Garden or Forest\n\n6. **Discuss:** *\"Why does the cicada belong in the garden? What food is there?\"*\n\n**Choice 2: Draw Your Own Animal-Plant Match (10 minutes)**\n\n1. **Students draw or paint** an animal and the plant/food it needs.\n\n2. **Provide sentence frame:**\n   *\"This _________ needs _________ to survive.\"*\n\n3. **Students write or dictate** the answer, which you scribe.\n\n**Teacher Role:**\n- Facilitate sorting conversations without giving all answers.\n- Ask: *\"What food does this animal need? Where would it find that?\"*\n- Accept all reasonable responses; the goal is application of the concept.\n- Celebrate thinking: *\"You figured out that birds need seeds, and they find seeds in forests!\"*\n\n**Expected Student Outcomes:**\n- Students correctly sort at least 2-3 animals to habitats.\n- Students articulate why an animal belongs in a habitat (e.g., *\"The cicada goes to the garden because it eats the plants there.\"*)\n- Students produce a drawing showing an animal and its food source.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of what animals need to survive, using the cicada as the primary example.\n\n**Formative Assessment (During the Lesson):**\n\n- **Listen to student discussions** during Explore and Elaborate phases. Look for:\n  - Do students mention food/eating when describing what animals need?\n  - Can students connect the cicada to the plant on which it sits?\n  - Do students recognize that animals need plants for food?\n\n- **Observe matching and sorting activities:** Can students correctly pair animals with their habitats and food sources?\n\n- **Ask checking questions:**\n  - *\"What does the cicada eat?\"* (Expected: *\"Plants\"* or *\"Leaves\"*)\n  - *\"Why does the cicada need food?\"* (Expected: *\"To live\"* or *\"To have energy\"*)\n  - *\"Can the cicada survive without plants?\"* (Expected: *\"No\"*)\n\n**Exit Ticket/Summative Assessment (5 minutes):**\n\nUse **one of the following** based on your class:\n\n**Option A: Picture-Based (Non-readers)**\nDisplay three pictures:\n1. A cicada on a plant\n2. A cicada in an empty box (no plant)\n3. A cicada eating food (if available)\n\n**Ask:** *\"Which picture shows what the cicada needs? Point to it.\"*\n\n**Success Criteria:** Student points to the picture of the cicada on the plant or with food.\n\n---\n\n**Option B: Verbal Exit Ticket (for whole group)**\nAsk each student one question (while doing a quick individual check):\n\n*\"Tell me one thing the cicada needs to stay alive.\"*\n\n**Success Criteria:** Student responds with \"food,\" \"plants,\" \"leaves,\" or \"the plant's juice.\"\n\n---\n\n**Option C: Drawing Assessment**\n**Provide:** Blank paper with a drawn cicada.\n\n**Prompt:** *\"Draw or show me something the cicada needs to survive.\"*\n\n**Success Criteria:**\n- Student draws a plant, leaf, flower, or food source.\n- Student can tell you why the cicada needs it.\n\n**Expected Student Outcomes:**\n\nBy the end of the lesson, students should be able to:\n- ✓ Identify that animals (like the cicada) need food to survive.\n- ✓ Recognize that plants are a food source for many animals.\n- ✓ Describe body parts the cicada uses to eat and move (legs, mouth, wings).\n- ✓ Match animals to the habitats where they find food.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplify vocabulary:**\n   - Use only \"food,\" \"plant,\" and \"animal\" — avoid \"survive\" and \"habitat\" initially.\n   - Use repetitive language: *\"The cicada eats the plant. The plant is food.\"*\n\n2. **Provide pre-sorted examples during matching activities:**\n   - Instead of asking students to sort independently, show **one correct match** first, then have them choose between two pre-selected options.\n   - Example: *\"Does the cicada eat leaves or rocks? Point to leaves.\"*\n\n3. **Use real or tactile materials:**\n   - Let students hold a real leaf or plant. Ask: *\"Is this soft? Could a tiny bug eat this?\"*\n   - This concrete experience supports understanding better than pictures alone.\n\n4. **Reduce recording demands:**\n   - Instead of drawing, allow students to simply **point to or select** pictures that match.\n   - Accept verbal responses only — no written or drawn answers required.\n\n---\n\n### Challenge (For Advanced Learners)\n\n1. **Extend to food chains:**\n   - Ask: *\"What eats the cicada? Does anything hunt the cicada?\"*\n   - Introduce the concept that animals eat other animals too: *\"A bird might eat the cicada!\"*\n   - Create a simple food chain illustration: Plant → Cicada → Bird.\n\n2. **Compare and contrast:**\n   - Provide pictures of two different insects (cicada and butterfly). Ask: *\"Both are bugs. Both need food. But do they eat the SAME food? Look closely.\"*\n   - Guide them to observe differences in mouth parts or body structures.\n\n3. **Introduce life cycles (preview):**\n   - *\"Did you know cicadas lay eggs on plants? The babies grow on the plant. Then they eat the plant. The whole family needs the plant!\"*\n   - Show a simple diagram of cicada life stages (if available).\n\n4. **Ask deeper \"why\" questions:**\n   - *\"If a cicada's plant dies, what happens to the cicada? What should the cicada do?\"* (Move to another plant)\n   - *\"Why don't cicadas live in places with no plants?\"*\n\n---\n\n## Extension Activities\n\n1. **Cicada Hunt Take-Home Project (1-2 weeks later)**\n   - Send home a **\"Nature Detective\" sheet** with the cicada photograph.\n   - Ask families to find evidence of cicadas or other insects on plants in their yard or neighborhood (with adult supervision).\n   - Students report back: *\"What animal did you find? What plant was it on? Why was it there?\"*\n\n2. **Build a Mini Habitat Diorama**\n   - In small groups, students create a **shoebox habitat** with real or paper plants, leaves, and drawn cicadas.\n   - Display in the classroom. Students explain: *\"This is where cicadas live. Here is their food. Here is how they stay safe.\"*\n   - Reinforce: *\"A good habitat has food, water, and shelter.\"*\n\n3. **Guest Speaker or Virtual Field Experience**\n   - Invite a local naturalist, entomologist, or farmer to show live insects and plants.\n   - Alternatively, use a virtual field trip video (YouTube: \"Insects in Nature\" or \"Bug Safari\") where students observe animals on plants in their natural habitat.\n   - Follow up with: *\"What animals did you see? What were they eating?\"*\n\n4. **Seasonal Observation Journal** (Ongoing)\n   - Create a **class observation sheet** hung near a window or outdoor area.\n   - Encourage students to sketch insects and plants they see (even if not cicadas).\n   - Weekly share: *\"Who found an insect eating a plant this week?\"*\n\n---\n\n## Teacher Notes & Tips\n\n- **Safety:** Remind students that we observe insects gently and don't pick them up without adult permission. This is especially important if collecting real plants.\n- **Inclusivity:** Use multiple representations (photos, real plants, drawings) to support visual, kinesthetic, and auditory learners.\n- **Prior Knowledge:** This lesson assumes students have seen insects or plants before. If not, begin with a simple nature walk or picture book (e.g., *\"Insects\" by Briggs* or *\"In the Garden\"* series) to build foundational knowledge.\n- **Local Connection:** If possible, mention cicadas or insects common in your area. Use local examples (gardeners, parks) to make the lesson relevant.\n\n---\n\nThis lesson uses the cicada photograph as the anchor example to teach K-LS1-1 in a concrete, observable way. Students move from observation and curiosity (Engage) through exploration (Explore) to formal understanding (Explain) and application (Elaborate), with assessment woven throughout. The focus on \"what animals need to survive\" is directly visible in the photograph and age-appropriate for Kindergarten learners.",
  "inputTokens": 2806,
  "outputTokens": 4400,
  "cost": 0.024805999999999998,
  "generatedAt": "2026-02-13T01:03:18.664Z"
}