{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada06282020_hdr.jpg",
  "imagePath": "images/life-science/cicada06282020_hdr.jpg",
  "content": "# Engineering Design Challenge: Cicada on Flowering Branch\n\n### Visible Elements in Photo\n\n- A cicada (tan/orange body with detailed wing pattern) clinging to a gray branch\n- Red and dark flowering plant with multiple petals on the same branch structure\n- Delicate, net-like wings on the insect showing intricate vein patterns\n- Rough, cylindrical branch serving as the insect's perch\n- Blurred background suggesting the insect's natural outdoor habitat\n\n### Reasonable Inferences\n\n- **From cicada's grip on branch**: The insect must hold tight to vertical or angled surfaces; its feet and body shape are designed for clinging to rough, narrow structures without slipping.\n- **From proximity to flowers**: Cicadas seek food (nectar or sap) and navigate through plant material; plants provide both nutrition and shelter in their ecosystem.\n- **From delicate wing structure**: The wings must balance being lightweight for flight while strong enough to generate sound (cicadas are known for loud buzzing) and withstand repeated use.\n\n### Engineering Task\n\n#### **K-2 Version:**\n**\"Design a Perch for a Cicada\"**\n\nMake a branch or stick that a cicada (or a toy model) can grip and hold onto without falling off. Your perch should be thick enough to grab but not too heavy. You can wrap it with string, cloth strips, or rough materials. Test it: Can your cicada stay on when you tilt or shake the branch gently?\n\n#### **3-5 Version:**\n**\"Design a Landing Platform for Insects\"**\n\nDesign and build a branch-like structure, 8–12 inches long, that allows an insect (represented by a small toy or model) to grip securely at angles up to 45° from horizontal without slipping. Your structure must:\n- Include a rough or textured surface (cicadas grip with clawed feet, not smooth ones)\n- Support the insect's weight when tilted\n- Allow attachment of at least one small flowering bloom model nearby\n\nSuccess criteria: The insect model stays attached for 10 seconds when the branch is held at 45°, and at least one flower fits on or near the branch without blocking the insect's grip points.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real organism in its natural environment solving a grip problem. Students must first observe *why* the cicada needs to cling (safety, feeding access, sound production) before designing a solution. The need emerges from observing nature, not from a given constraint.\n\n### Suggested Materials\n\n1. Twigs, branches, or wooden dowels (various diameters: ¼\" to ½\")\n2. Rough materials for texture: bark strips, sandpaper, burlap, or rope wrapped around smooth sticks\n3. Small toy insects, clothespins, or foam models to represent cicadas\n4. Artificial or paper flowers to create a realistic \"plant\" scenario\n5. Tape, glue, or string to assemble and modify the structure\n\n### Estimated Time\n\n**60–90 minutes** (two 30–45 minute sessions)\n- Session 1: Observation, sketching, material gathering, and initial build\n- Session 2: Testing, refining grip texture, and iteration\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K-2-ETS1-2** (K–2 Design Solutions) and **3-5-ETS1-1** (3–5 Define Engineering Problems) by asking students to observe an organism's real-world need and design a structure that solves it, grounding engineering in authentic biological observation.",
  "inputTokens": 2309,
  "outputTokens": 828,
  "cost": 0.006449,
  "generatedAt": "2026-02-09T13:18:15.533Z"
}