{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada06282020_hdr.jpg",
  "imagePath": "images/life-science/cicada06282020_hdr.jpg",
  "gradeLevel": "Second Grade",
  "gradeLevelKey": "second-grade",
  "content": "# 5E Lesson Plan: Cicadas and Their Plant Homes\n\n## Core Science Concepts from Image Analysis\n\n- **Animal adaptations:** The cicada's body structure (strong legs for gripping, wings for movement, mouthparts) help it survive and interact with plants in its habitat.\n- **Habitat and food sources:** Cicadas live on plants (like the flowering plant shown) where they find food and shelter; plants provide what animals need to live.\n- **Diversity of living things:** Different organisms (insects and plants) live together in the same space and have different body parts that help them survive.\n- **Interactions between plants and animals:** The cicada uses the plant for food and shelter, showing how animals depend on plants in nature.\n\n---\n\n## Lesson Title\n\nCicadas and Their Plant Homes: Investigating How Animals and Plants Live Together\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Second Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 90 minutes total (two 45-minute sessions, or three 30-minute sessions)\n- **NGSS Standards:** \n  - 2-LS4-1: Make observations of plants and animals to compare the diversity of life in different habitats.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Identify and describe the body parts of an insect (cicada) and explain how those parts help it live on plants.\n2. Observe and record details about how animals and plants live together in a habitat.\n3. Explain why plants are important to insects like cicadas by identifying what cicadas get from plants (food and shelter).\n4. Compare the body parts of different insects and plants to understand how different living things are suited to their homes.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Large printed or projected image of the cicada on the red flowering plant\n- Chart paper or whiteboard for recording observations\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a projector or as a large printout. Show only the image without any title or explanation for 30 seconds in silence so students can look carefully.\n\n2. **Ask students to turn to a partner** and whisper what they see. Listen for their initial observations.\n\n3. **Ask these discovery questions** (one at a time, allowing 20-30 seconds of think-time for each):\n   - \"What do you notice about the creature on the branch? What does it look like?\"\n   - \"Why do you think this creature is sitting on this plant? What might it be doing there?\"\n   - \"Look closely at the creature's legs and wings. What do you see? Why might the creature need these body parts?\"\n   - \"Have you ever seen a creature like this? Where was it?\"\n\n4. **Create a class \"wonder wall\"** by asking: \"What do you want to know about this creature and the plant? What questions do you have?\" Record 3-4 student questions on chart paper. Highlight questions like: \"Does this bug eat the plant?\" or \"Why does it stay on plants?\" or \"What are those clear wings?\"\n\n5. **Show a brief 30-second video clip** (optional) of a cicada making its sound if available, or simply describe: \"This is a cicada. Some cicadas are so loud in summer that you can hear them outside!\"\n\n**Transition:** \"Today, we're going to be bug detectives and plant scientists to figure out why cicadas love living on plants.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Copies of a simple cicada diagram (body parts unlabeled) for each student\n- Actual images or close-up photos of cicadas (printed or on tablets/computers if available)\n- Real plant branches with leaves (if possible) or detailed photos of plant stems and leaves\n- Magnifying glasses (1-2 per pair)\n- Observation sheets (see below)\n- Colored pencils or crayons\n- Chart showing 3 simple insect body parts: **legs**, **wings**, **mouth**\n\n**Activity:**\n\n**Part A: Detailed Observation of the Cicada (10 minutes)**\n\n1. **Organize students into pairs.** Give each pair a printed close-up image of the cicada (or use the original photograph).\n\n2. **Provide this student direction:** \"You are bug detectives. Your job is to look VERY carefully at this cicada and draw or point out where these three things are: its legs, its wings, and its mouth. Use the magnifying glass if you have one.\"\n\n3. **Students record on their observation sheet:**\n   - Draw the cicada and circle or label: legs, wings, mouth\n   - Write or copy one thing they notice about each part (e.g., \"The legs are strong and grabby,\" \"The wings are see-through\")\n\n4. **Circulate and ask guiding questions:**\n   - \"How many legs do you see?\"\n   - \"What color are the wings?\"\n   - \"Why do you think the cicada needs strong legs?\"\n\n**Part B: Exploring Why Cicadas Need Plants (10-15 minutes)**\n\n5. **Show students the plant branch image/real branch** and ask: \"Look at what the cicada is standing on. What do you see? Is it hard or soft? Does it have leaves?\"\n\n6. **Ask this key question:** \"What might the cicada use from this plant? What does the cicada need to live?\" Allow students to hypothesize:\n   - \"It can eat the plant leaves\" or \"It can drink juice from the plant\"\n   - \"It can hide under the leaves so other animals don't eat it\"\n   - \"It can rest on the branch\"\n\n7. **Student investigation task:** Provide students with a real plant branch (or detailed photo). Tell them: \"Pretend you are a tiny cicada. Show me on this plant where you would sit to stay safe and find food. Why did you pick that spot?\"\n\n   Students point to or mark spots on the branch and explain their thinking to their partner.\n\n8. **What to record:** Students complete a simple sentence:\n   - \"A cicada needs a plant because _____________________.\"\n   - Or: \"A cicada uses the plant to _____________________.\"\n\n**Teacher Role:**\n- Listen to student conversations without correcting; encourage descriptive language (\"Tell me more about that...\")\n- Use your magnifying glasses alongside students to model careful observation\n- Gently redirect students to visual evidence: \"Look at the picture again. What do you see the cicada doing?\"\n- Resist naming body parts for them—let them discover and describe\n\n**Expected Student Outcomes:**\n- Students identify at least 2 body parts of the cicada (legs, wings)\n- Students propose at least one reason why cicadas live on plants (food, shelter, or resting place)\n- Observation sheets show drawings and simple written/copied descriptions\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- The original photograph, displayed\n- Chart paper with vocabulary words and pictures\n- Picture cards of different insects (ant, butterfly, ladybug, cicada) showing their different body parts\n- Simple 1-page reference sheet with cicada and plant illustration\n\n**Activity:**\n\n1. **Gather students in a meeting area** with the photograph visible.\n\n2. **Share-out from Explore:**\n   - Ask 3-4 pairs to show their observation sheets and tell the class one thing they learned about the cicada's body\n   - Record observations on chart paper: \"What we learned about cicadas\"\n   - Affirm accurate observations: \"Yes! You noticed the wings are clear and see-through—that helps the cicada fly!\"\n\n3. **Introduce vocabulary with visual support:**\n\n**Vocabulary:**\n\n- **Insect:** A small animal with six legs, wings, and a body made of three parts (head, middle, back). *Show pictures of cicada, ant, butterfly.* \"All of these are insects.\"\n\n- **Adaptation:** A body part or behavior that helps an animal live in its home. *Use the photo.* \"The cicada's strong legs are an adaptation—they help it grip the plant branch!\"\n\n- **Habitat:** A place where an animal or plant lives and finds food and shelter. *Point to the plant in photo.* \"This plant is part of the cicada's habitat.\"\n\n- **Food source:** Something an animal eats to stay alive. *Explain:* \"The cicada gets food from the plant. The plant is a food source.\"\n\n4. **Make connections back to the photograph:**\n   - Point to the cicada's legs: \"See these strong legs? That's an adaptation. The adaptation helps the cicada hold on tight to the branch so it doesn't fall off.\"\n   - Point to the plant: \"This plant is the cicada's habitat. It's the cicada's home. Here, the cicada finds food and stays safe.\"\n   - Ask: \"Why does the cicada live on THIS plant instead of on the ground? Turn to your neighbor and say one reason.\"\n\n5. **Check for Understanding:**\n   - Ask students to show a \"body part signal\" (hold up fingers for \"legs\" or \"wings\" or make a pinching motion for \"adaptation\"):\n     - \"If I say a word the cicada uses to hold on branches, show me your pinching hands!\"\n     - \"If I describe the cicada's home, put your hands on your lap!\"\n   - Ask 1-2 students: \"Tell me one thing the cicada gets from the plant.\"\n\n6. **Create a classroom anchor chart** titled \"How Cicadas and Plants Live Together\" with 2-3 student-generated sentences and simple drawings.\n\n**Expected Student Outcomes:**\n- Students can identify and name at least 2 insect body parts (legs, wings)\n- Students understand that a habitat is where an animal lives\n- Students can state one reason cicadas live on plants (food or shelter)\n- Students use the word \"adaptation\" in context with teacher support\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Large paper or poster board (1 per pair)\n- Pictures of different insects (cicada, ant, butterfly, grasshopper, beetle) and different plants (flower, tree, bush)\n- Glue sticks and scissors\n- Markers\n- Index cards with simple fact sentences\n\n**Activity: \"Match the Animal to Its Habitat\"**\n\n1. **Explain the task:** \"Different insects have different body parts and live in different habitats. We're going to be scientists and match insects to the plants they live on.\"\n\n2. **Organize students into small groups (3-4 students).**\n\n3. **Give each group:**\n   - A large sheet divided into 4 sections\n   - Pictures of 2-3 different insects (cicada, butterfly, grasshopper)\n   - Pictures of 2-3 different plants (flowering plant, grass, tree bark)\n\n4. **Student task:**\n   - Glue an insect on one side and a plant on the other\n   - Draw or write: \"Why does this insect live on this plant?\"\n   - Use sentence stems:\n     - \"The _____ has _____ [body part] so it can _____.\"\n     - \"The _____ lives on the plant because _____.\"\n   - Example: \"The cicada has strong legs so it can hold on to the branch.\"\n\n5. **Gallery walk:** Post all group posters and have students walk around to see how other groups matched insects and plants. Ask: \"Did other groups match the same insects? Why or why not?\"\n\n6. **Introduce a challenge question:** \"What would happen if the cicada lost its wings? Could it still live on the plant? Why or why not?\" Have students discuss in small groups.\n\n**Teacher Role:**\n- Circulate and ask: \"Tell me about the body parts this insect has. How do those help it live on this plant?\"\n- Use prompts: \"What does this insect EAT? Where would it find that food on the plant?\"\n- Guide students to notice adaptations: \"Look at the grasshopper's legs—they're long and springy. Our cicada's legs are different. Why?\"\n\n**Expected Student Outcomes:**\n- Students correctly match at least one insect to a plant habitat with a reasonable explanation\n- Students use vocabulary like \"legs,\" \"wings,\" \"habitat,\" \"food,\" and \"adaptation\" with increasing confidence\n- Students recognize that different insects have different body parts suited to different plants\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity: Two-Part Assessment**\n\n**Formative Assessment (ongoing throughout lesson):**\n- Observe student responses during Engage discussions\n- Review observation sheets from Explore for evidence of careful observation\n- Listen to student explanations during Elaborate for correct use of vocabulary and concepts\n- Use the \"signal\" check in Explain phase to gauge understanding in real-time\n\n**Summative Assessment - Exit Ticket (5 minutes at end of lesson):**\n\nProvide each student with a simple exit ticket (can be verbal or written, depending on your students' writing levels). Choose 2-3 questions:\n\n**Option A (for students who can write):**\n1. \"Draw or write: What body parts does a cicada have? Pick one and tell why it helps the cicada.\"\n2. \"Why do cicadas live on plants? Give one reason.\"\n3. \"What is a habitat? Use the cicada and plant as an example.\"\n\n**Option B (for all learners—verbal):**\nAsk individual students as they leave:\n- \"Show me on this picture where the cicada's legs are. Why does the cicada need strong legs?\"\n- \"Why do you think the cicada sits on this plant and not on the ground?\"\n- \"What does the cicada get from the plant?\"\n\n**Success Criteria:**\n- **Developing:** Student identifies 1 body part; gives vague reason for why cicada lives on plant (\"It likes plants\")\n- **Proficient:** Student identifies 2+ body parts and explains one clear reason (food, shelter, or resting place); uses habitat vocabulary with support\n- **Advanced:** Student identifies multiple body parts with functions; explains multiple reasons cicadas need plants; uses vocabulary accurately and independently\n\n**Expected Student Outcomes:**\n- 80% of students can identify cicada legs and wings\n- 75% of students can give at least one reason cicadas live on plants\n- 70% of students understand \"habitat\" means a place where an animal lives\n\n---\n\n## Differentiation\n\n**Support (for struggling learners):**\n\n1. **Simplify vocabulary:** Use only 2 key terms instead of 4. Focus on \"legs\" and \"wings\" as body parts, and \"habitat\" as home. Skip \"adaptation\" initially.\n\n2. **Provide sentence frames with pictures:** \n   - \"The cicada has _____. It uses it to _____.\" (with picture labels: legs/wings/mouth and gripping/flying/eating)\n   - \"The cicada lives on the plant because _____.\" (with picture options: food, shelter, resting place)\n\n3. **Pair with a stronger reader:** Have students partner with a peer who can help read observation sheets and vocabulary words aloud.\n\n4. **Reduce written output:** Allow students to draw or point instead of writing; accept one-word or two-word answers and affirmations like \"yes\" or \"because it eats.\"\n\n5. **Use real objects when possible:** If you have access to live insects, photos of real plants, or branches, these are more concrete than drawings for students who struggle with representational thinking.\n\n**Challenge (for advanced learners):**\n\n1. **Comparative analysis:** Show images of 3-4 different insects (cicada, ant, dragonfly, beetle). Ask: \"How are their legs different? Why? What does each insect do with its legs?\" Have students create a comparison chart.\n\n2. **Food web connections:** After understanding cicadas eat plant sap, ask: \"What animals might eat cicadas? What would eat those animals? Can you draw a food chain?\" Introduce the concept that cicadas are part of a larger ecosystem.\n\n3. **Seasonal thinking:** Research and discuss: \"Cicadas come out at a certain time of year. Why do you think that is? What season do plants grow the most? When would cicadas have the most food?\" (Sets stage for life cycle learning in Grade 3.)\n\n4. **Adaptation design challenge:** \"If a cicada had to live on a cactus instead of this flower, what would its body need to change? Draw or describe a 'cactus cicada.' What new adaptations would it need?\"\n\n---\n\n## Extension Activities\n\n1. **Insect Hunt (Outdoor or Classroom Observation):**\n   - Take students outside or to a garden area to find real insects on plants\n   - Provide clipboards and observation sheets with questions: \"What insect did you find? What plant was it on? How many legs do you see? What do you think it's doing?\"\n   - Sketch or photograph findings; share in class the next day\n   - Connection: Real-world application of habitat observation (2-LS4-1)\n\n2. **Plant-Animal Sorting Game (Small Group or Stations):**\n   - Create picture cards of various animals (cicada, butterfly, bee, ladybug, earthworm) and plants (flower, grass, tree, shrub)\n   - Students sort animals into two groups: \"Live on plants\" and \"Live in soil/ground\"\n   - For each \"plant-living\" animal, match it to a plant it might live on\n   - Variation: Add reasoning cards (\"This insect eats pollen,\" \"This insect has sticky feet to climb\") and match them to insects\n   - Connection: Deepens understanding of habitat diversity (2-LS4-1)\n\n3. **Cicada Life Cycle Mini-Book (Individual or Pairs):**\n   - Provide a simple 4-page booklet template with pages: \"Baby Cicada,\" \"Growing Cicada,\" \"Adult Cicada in Spring,\" \"Adult Cicada in Summer\"\n   - Students draw or paste pictures showing the cicada at different stages and write 1-2 sentences about each (with support)\n   - Intro statement: \"Cicadas are born under the ground near plant roots. They grow bigger and climb up plants. As adults, they live on plants.\"\n   - Connection: Introduces life cycles and plant-animal interdependence; sets foundation for Grade 3 life cycle standards\n\n---\n\n## Notes for Teacher\n\n- This lesson emphasizes **observable characteristics** (body parts, colors, locations) rather than complex anatomy, keeping it age-appropriate for Grade 2.\n- The focus on **habitat and adaptation** directly supports 2-LS4-1, which asks students to compare organisms in different settings.\n- Concrete, hands-on exploration in phases 1-2 is crucial for second graders; the explanation phase builds vocabulary *after* they've already wondered and observed.\n- If you have access to real plants, branches, or even a specimen cicada (empty shell), these will dramatically increase engagement and learning.\n- The lesson can be split across two days: Day 1 = Engage + Explore Part A; Day 2 = Explore Part B + Explain + Elaborate.\n- Consider visiting a school garden, local park, or sending home an observation assignment to extend this into students' outdoor lives.",
  "inputTokens": 2841,
  "outputTokens": 4511,
  "cost": 0.025396,
  "generatedAt": "2026-02-12T20:01:23.453Z"
}