{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada06282020_hdr.jpg",
  "imagePath": "images/life-science/cicada06282020_hdr.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Cicada on Flowers\n\n## Core Science Concepts from Image Analysis\n\n- **External body parts have specific functions:** The cicada's legs, wings, and proboscis (long mouth) help it survive by climbing, flying, and feeding on plant liquids.\n- **Living things use their body parts to meet their needs:** The cicada is using the flower plant to get food; the plant provides shelter and nutrients.\n- **Habitats contain different living things that interact:** The cicada and the flowering plant share the same space; both are living organisms in a natural environment.\n- **Animals have special features that help them survive:** The cicada's strong legs grip branches, its wings help it move, and its proboscis lets it drink from flowers.\n\n---\n\n## Lesson Title\n\n**Cicadas and Their Amazing Bodies: How Insects Use Their Parts to Live**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 1-LS1-1 (Use materials to design a solution by mimicking how animals use external parts to survive)\n  - 1-LS3-1 (Make observations that young animals are like, but not exactly like, their parents)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify and name three external body parts of an insect (legs, wings, body) and explain what each part helps the insect do.\n2. Observe and describe how an animal's body parts help it survive in its habitat (finding food, moving, staying safe).\n3. Explain that animals use their body parts to meet their needs, just like the cicada uses its legs to climb and its mouth to drink.\n4. Design a simple model or drawing showing how an animal's body part helps it do a job (inspired by the cicada's body).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or projected photograph of the cicada on red flowers (enlarged for whole group viewing)\n- Chart paper and marker\n- Small toy insects or plastic bugs (optional, to handle)\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or poster board where all students can see clearly. Give them 30 seconds to just look silently.\n\n2. **Introduce with wonder:** Say, \"Today we're looking at a very special insect called a *cicada*. Look carefully. This cicada is on a red flower. I want you to notice what you see. What do you wonder about this insect?\"\n\n3. **Ask these discussion questions** (pause for genuine student responses):\n   - \"What parts of the cicada's body can you see in this picture?\" (Help students notice: legs, wings, body, head.)\n   - \"Why do you think the cicada is on this flower? What might it be doing?\" (Elicit: eating, drinking, resting, looking for food.)\n   - \"What do you think those long legs are for? Why does a cicada need legs?\"\n   - \"Do you see those clear wings? What might wings help the cicada do?\"\n\n4. **Record student ideas** on chart paper titled \"What We Wonder About Cicadas.\" Praise curiosity and avoid correcting misconceptions now.\n\n5. **Prediction prompt:** \"Today we're going to learn all about how this cicada's body parts help it survive. Let's find out together!\"\n\n**Transition:** \"Now let's explore and discover what each part of the cicada's body can do.\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Printed copies of cicada diagram (simple line drawing showing body, head, legs, wings, proboscis—can be found in free online resources or teacher-created)\n- Color pencils or crayons (one set per student or pair)\n- Pipe cleaners (to represent legs)\n- Coffee filters or wax paper (to represent wings)\n- Pencils or straws (to represent the proboscis/mouth)\n- Magnifying glasses (2-3 for small groups to share)\n- Photographs of other insects (ant, butterfly, bee) to compare—printed in color if possible\n- Chart paper\n\n**Activity:**\n\n**Part 1: Body Parts Investigation (12 minutes)**\n\n1. **Distribute the cicada diagram** to each student or student pair. Say: \"This is a drawing of the cicada from our photograph. I want you to look very carefully at each part.\"\n\n2. **Guided observations:** Point to each body part on the large photograph as you guide students:\n   - \"Can you find the HEAD? That's where the eyes are.\"\n   - \"Can you find the LEGS? Let's count them. How many do you see?\" (Cicadas have 6 legs.)\n   - \"Can you find the WINGS? They look like see-through blankets on its back.\"\n   - \"Can you find its MOUTH or PROBOSCIS? It's like a tiny straw.\"\n\n3. **Students color and label** their diagram with teacher support. Provide word cards (HEAD, LEGS, WINGS, BODY, MOUTH) for students to tape or copy onto their diagram.\n\n4. **Partner talk:** Have students turn to a partner and point to each part, naming it. Circulate and listen for understanding.\n\n**Part 2: What Do These Parts Do? (8-10 minutes)**\n\n1. **Build a model:** Explain: \"Let's use things we have in our classroom to build a cicada body and see what each part is good for.\"\n\n2. **Demonstrate slowly** as students follow along with their own materials:\n   - Use a pencil to be the **body**\n   - Attach 6 pipe cleaners (folded in half) as **legs**\n   - Attach coffee filters as **wings** with tape\n   - Attach a straw as the **proboscis**\n\n3. **Test each part:**\n   - **Legs:** Can students move the pipe cleaners to make the pencil body climb up the table edge? Can they grip a stick or pencil?\n   - **Wings:** Can the coffee filters move? Can they flutter?\n   - **Mouth (straw):** Can they use the straw to \"drink\" water from a cup (demonstrate only, students just talk about it)?\n\n4. **Document observations:** Students draw or write (with teacher scribe support) what each body part can do on a simple chart:\n   | Body Part | What It Does |\n   |-----------|-------------|\n   | Legs | _____________ |\n   | Wings | _____________ |\n   | Mouth | _____________ |\n\n**Teacher Role:** \n- Circulate and ask guiding questions: \"What happened when you moved the legs? Did the body move?\" \n- Avoid telling answers; prompt discovery: \"What do you think will happen if we bend the legs?\"\n- Support students who struggle with fine motor tasks by helping them attach pieces or holding the model.\n- Use this time to assess which students can identify and describe body parts and functions.\n\n**Expected Student Outcomes:**\n- Students identify at least 3 body parts of the cicada.\n- Students discover that legs help the insect climb/grip, wings help it move/fly, and the mouth helps it eat/drink.\n- Students create a labeled model or diagram showing these parts and their functions.\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- The chart paper from Engage phase (\"What We Wonder About Cicadas\")\n- Printed cicada diagram (same as Explore)\n- Real or high-quality images of cicadas in habitats\n- Vocabulary cards with pictures and words\n- Large poster paper to create a class anchor chart\n\n**Activity:**\n\n1. **Share findings from Explore:** Ask volunteers to share what they discovered about cicada body parts and what they do. Point to their models or diagrams as they share.\n\n2. **Correct misconceptions gently:** If a student says something inaccurate, acknowledge their thinking and reframe: \"I see what you're thinking! Actually, those strong legs help the cicada grip onto branches so it doesn't fall. Let's see how they work...\"\n\n3. **Introduce vocabulary with student-friendly definitions:**\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition | Example from the Photo |\n|------|---------------------------|----------------------|\n| **External Parts** | The outside parts of an animal's body that you can see—like arms, legs, and wings | The cicada's legs, wings, and mouth are external parts. |\n| **Proboscis** | A long, thin mouth shaped like a straw that the cicada uses to drink juice from plants | You can see it near the cicada's head in the photo. |\n| **Habitat** | The place where an animal lives and finds food, water, and shelter | The cicada lives on plants and flowers like the red ones in our photo. |\n| **Insect** | A small animal with six legs, a body with three parts (head, thorax, abdomen), and usually wings | The cicada is an insect. |\n| **Survive** | To stay alive and healthy by meeting your needs (food, water, shelter) | The cicada survives by using its body parts to find food on plants. |\n\n4. **Create an anchor chart** titled \"How Cicadas Use Their Bodies to Survive\":\n   - Draw or paste the cicada photo in the center\n   - Around it, write and illustrate: \"LEGS help climb → WINGS help fly → MOUTH helps eat\"\n   - Post this in the classroom for reference\n\n5. **Connect back to the photograph:** Show the original photo again. Point and say: \"Look! The cicada is holding onto this branch with its strong legs. This keeps it safe. It can reach the flower with its mouth—like a straw—to drink the juice inside. Its wings help it fly to different plants if it needs to find more food. Every part of its body helps it live.\"\n\n6. **Check for understanding** with these prompts (students answer aloud, with thumbs up/down, or with hand signals):\n   - \"Show me with your hand how a cicada's legs help it climb.\" (Students mime climbing.)\n   - \"What does a cicada use its mouth—its proboscis—for?\" (Pause for response: to drink plant juice.)\n   - \"Why do you think the cicada needs wings?\" (To fly/move/escape danger.)\n   - \"Is the cicada a living thing? How do you know?\" (Students should recognize that it moves, eats, and lives in a habitat.)\n\n**Expected Student Outcomes:**\n- Students can name at least 3 external body parts of a cicada.\n- Students can explain that each body part helps the cicada survive (find food, move, stay safe).\n- Students understand that the cicada is a living insect in a natural habitat.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Picture cards of different animals (bird, squirrel, fish, butterfly, dog—at least 5 different animals)\n- Chart paper labeled \"How Do Animals Use Their Bodies?\"\n- Colored pencils, crayons\n- Blank paper or student journals\n- Optional: video clip (2-3 minutes max) of cicadas in nature or insects climbing/flying\n\n**Activity:**\n\n**Option A: \"Other Animals Use Their Bodies Too\" (Recommended for most first graders)**\n\n1. **Introduce:** \"The cicada uses its legs, wings, and mouth to survive. But other animals have special body parts too! Let's see how.\"\n\n2. **Show picture cards** of 3-4 animals (bird, squirrel, butterfly, fish). For each:\n   - Ask: \"What body parts do you see? What do you think this body part helps it do?\"\n   - Example for bird: \"Birds have wings like cicadas! But birds use their wings to... fly! Birds also have a BEAK instead of a proboscis. What do they use their beak for?\"\n\n3. **Co-create a comparison chart** on chart paper:\n\n   | Animal | Body Part | What It Does |\n   |--------|-----------|-------------|\n   | Cicada | Legs | Climb and grip |\n   | Cicada | Wings | Fly |\n   | Bird | Wings | Fly |\n   | Bird | Beak | Pick up and eat food |\n   | Squirrel | Claws | Climb and dig |\n\n4. **Discuss:** \"What do you notice? Do different animals sometimes have the same body parts that do the same job?\" (Help students see that wings help many animals fly, but they use them in different ways.)\n\n**Option B: \"Design an Insect Body\" (For advanced learners)**\n\n1. Provide each student with a blank body outline (simple circle for head, oval for body).\n\n2. Say: \"Imagine you're an insect designer! Your insect needs to catch flying bugs for food. What body parts would your insect need? Draw or build them!\"\n\n3. Students add: antennae (to sense), wings (to fly), legs (to climb), and a mouth shape (to catch food).\n\n4. Students explain their design to a partner: \"My insect has [part] because it helps [what it does].\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"Why did you choose that body part?\" \"How would that help your insect survive?\"\n- Validate all thoughtful answers, even if anatomically imperfect.\n- Prompt students to make connections: \"That's like the cicada's legs! Why did you want your insect to have strong legs?\"\n\n**Expected Student Outcomes:**\n- Students compare how different animals use similar body parts (wings, legs) to survive.\n- Students apply the concept of \"body parts = survival\" to new animals.\n- Students can explain their reasoning about body parts and their functions.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (Throughout the Lesson):**\n- Observations during Explore: Can students identify body parts and describe what they do?\n- Listen to student language during group discussions: Do they use terms like \"legs,\" \"wings,\" \"proboscis,\" \"survive,\" or \"habitat\"?\n- Review student diagrams and models: Do body parts match the photograph? Can students label them?\n\n**Exit Ticket or Summative Assessment (Choose One):**\n\n**Option 1: Verbal Assessment (Best for First Grade)**\nShow the original cicada photograph again. Ask each student individually or in small groups:\n1. \"Point to three different body parts of the cicada.\"\n2. \"Tell me what this body part does.\" (Point to legs, then wings, then proboscis.)\n3. \"Why do you think the cicada is on the flower?\"\n4. \"How do the cicada's body parts help it survive?\"\n\n**Success Criteria:** Student can identify 2-3 body parts AND explain what at least one does.\n\n**Option 2: Drawing and Writing (If students are ready)**\nProvide a blank paper. Say: \"Draw a cicada. Label at least two body parts. Write or tell me one thing that body part helps the cicada do.\"\n\n**Success Criteria:** \n- Cicada drawing is recognizable (has body, legs, wings).\n- At least 2 body parts are labeled.\n- Student can verbally or in writing describe one function.\n\n**Option 3: Quick Show-and-Tell with Models**\nStudents hold up their pipe-cleaner model from Explore and explain: \"This part [point] helps the cicada [explain function].\"\n\n**Success Criteria:** Student can identify the part and give a reasonable explanation (may not be perfectly worded, but the idea is present).\n\n**Expected Student Outcomes:**\n- Students demonstrate they can identify 2-3 external body parts of a cicada.\n- Students explain that body parts help animals survive (find food, move, stay safe).\n- Students make the connection between what they see in the photograph and what they learned about animal adaptations.\n\n---\n\n## Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Reduce vocabulary load:** Use only 2-3 body part names at first (legs, wings, mouth). Don't require \"proboscis\" pronunciation; \"straw-mouth\" or \"drinking tube\" is fine.\n\n2. **Provide a word bank with pictures:** When students are labeling or talking about body parts, give them a card with pictures and words to point to and repeat, rather than generating words from memory.\n\n3. **Hand-over-hand model building:** If a student struggles with assembling the pipe-cleaner model, sit beside them and gently guide their hands through the motions while narrating: \"Now we're folding the pipe cleaner to make a leg. See how we bend it?\"\n\n4. **One-to-one questioning:** Instead of whole-group discussion, ask individual students one simple question: \"Do you see the legs?\" \"Can you point to the wings?\" Affirm all attempts.\n\n5. **Simplify the exit ticket:** Instead of asking \"How do body parts help the cicada survive?\" ask \"What do the legs do?\" or \"Does the cicada need wings? Why or why not?\"\n\n---\n\n**Challenge (For Advanced Learners):**\n\n1. **Deeper inquiry:** Show pictures of cicada nymphs (the young form) and adult cicadas. Ask: \"How are they the same? How are they different? Do you think a baby cicada's legs work the same way as an adult's?\" This connects to 1-LS3-1 (young and adult animals are alike but not exactly the same).\n\n2. **Compare multiple insects:** Provide field guides or photos of an ant, cicada, grasshopper, and butterfly. Ask: \"Which insect has the longest legs? Which has the strongest legs for jumping? Why do you think?\" Have students rank them or create a chart.\n\n3. **Engineer a solution:** \"Think about a big problem: an insect needs to drink juice from a flower, but the flower is far away from the ground. What body parts would help it get there?\" Have them design an insect on paper with labels.\n\n4. **Predict and test:** \"If a cicada didn't have wings, what would happen? Could it still survive?\" Encourage reasoning and discussion.\n\n5. **Research extension:** Have advanced readers/listeners look at a simple book about cicadas (e.g., *Cicadas* by Rachel Griffith, or similar) and share one new fact with the class.\n\n---\n\n## Extension Activities\n\n**For Early Finishers or Follow-Up Lessons:**\n\n1. **Cicada Life Cycle Book:** Create a 4-page mini-book showing the cicada life cycle stages (egg → nymph → adult → laying eggs). Use the photograph as the \"adult\" page. Draw or cut/paste simple images for each stage. Discuss: \"A baby cicada doesn't have wings yet. How does it survive without wings?\" (It hides underground, eats roots, stays safe.) This deepens understanding of adaptation and survival across life stages (supports 1-LS1-2).\n\n2. **Habitat Diorama:** Students create a small shoebox habitat showing where a cicada lives. Include: a plant stem or branch, flowers, leaves, and their pipe-cleaner or drawn cicada. Ask them to label or point out: \"Where does the cicada find food? Where does it rest? Where is it safe?\" This reinforces habitat concepts and real-world application.\n\n3. **Insect Body Part Hunt on the Playground:** Take students outside with clipboards. Ask: \"Can you find an insect? What body parts do you see? Does it have legs? Wings? How many legs?\" Students draw and label what they observe. Back in the classroom, compare to the cicada. (\"This ant has six legs like the cicada! This butterfly has wings like the cicada!\") This is authentic observation and comparison.\n\n4. **\"If I Were an Insect\" Role-Play:** Students choose an insect and mime its movements. \"If I were a cicada, I would climb with my strong legs and fly with my wings!\" Others guess the insect. Discuss which body parts made the movements possible. This is kinesthetic and reinforces understanding of how body parts enable action.\n\n5. **Cicada Sound Investigation:** Cicadas are famous for their loud buzzing sound. Play a short audio clip of cicada sounds (available on YouTube or nature websites). Discuss: \"Where does this sound come from? Some cicadas vibrate their wings to make noise! Why would they do this?\" (To find a mate, to communicate.) This connects anatomy to behavior and survival.\n\n---\n\n## Teacher Notes & Tips\n\n- **Timing:** This lesson is designed as two sessions (Day 1: Engage, Explore, and half of Explain; Day 2: Rest of Explain, Elaborate, Evaluate). Adjust based on your students' pace and attention spans.\n\n- **Photograph advantage:** The cicada photo is exceptionally clear and detailed, allowing students to see all major body parts. Use a magnifying glass with projected images if available to emphasize fine details.\n\n- **Model realism:** The pipe-cleaner model is intentionally simple. It doesn't need to look perfect—the goal is for students to understand that body parts have functions, not to create realistic representations.\n\n- **Safety:** Ensure no students have insect phobias that would prevent engagement. If so, frame the lesson as \"learning about amazing insect bodies\" rather than \"bugs we find outside.\"\n\n- **Vocabulary pacing:** First graders benefit from repetition. Repeat key terms (legs, wings, proboscis, survive, habitat) frequently across all phases, and use them in context rather than in isolated vocabulary lessons.\n\n- **Cultural connections:** In some cultures, cicadas are symbolic or eaten as food. If relevant to your community, share this respectfully: \"Different people around the world think cicadas are important and interesting in different ways.\"\n\n---\n\nThis lesson keeps first graders engaged through hands-on exploration while building foundational understanding of how animal body structures relate to survival and habitat needs.",
  "inputTokens": 2864,
  "outputTokens": 5156,
  "cost": 0.028644,
  "generatedAt": "2026-02-12T20:00:35.764Z"
}