{
  "title": "Cicada Shell",
  "category": "life-science",
  "imageFile": "cicada_shell.jpg",
  "imagePath": "images/life-science/cicada_shell.jpg",
  "gradeLevel": "Third Grade",
  "gradeLevelKey": "third-grade",
  "content": "# 5E Lesson Plan: Cicada Life Cycles and Shedding Shells\n\n### Core Science Concepts from Image Analysis\n\n- **Life cycles of insects:** Organisms go through distinct stages of growth and development, including shedding their outer covering (exoskeleton) as they grow larger—a process called molting or ecdysis.\n- **Adaptation and survival:** The hardened exoskeleton protects the organism during its development and allows it to survive in its environment; shedding it is a necessary stage in the organism's life cycle.\n- **Evidence of organism activity:** Found objects like shed exoskeletons provide observable evidence of organisms living in an environment and progressing through their life cycle.\n- **Growth and change:** Animals change shape, size, and appearance as they develop, and these changes follow patterns over time.\n\n---\n\n### Lesson Title\n\nFrom Shell to Song: Discovering How Cicadas Grow and Change\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Third Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (or three 30-minute sessions)\n- **NGSS Standards:** \n  - 3-LS1-1 (Develop models to describe that organisms have unique and diverse life cycles but all have in common birth, growth, reproduction, and death)\n  - 3-LS3-2 (Use evidence to support the explanation that traits can be influenced by the environment)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Identify and describe the stages of the cicada life cycle using observable evidence such as shed exoskeletons.\n- Explain why cicadas shed their outer shells and how this relates to their growth.\n- Construct a simple model showing the major stages of a cicada's life cycle (egg, nymph, adult).\n- Use evidence from the photograph to describe how environmental factors (like tree bark) support cicada survival.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about how animals grow and change.\n\n**Materials:**\n- Projected image of the cicada exoskeleton and tree bark (the photograph provided)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on the screen or printed large. Ask students to look carefully for 30 seconds without talking, then turn to a partner and whisper what they see.\n\n2. **Ask these guiding questions to spark curiosity:**\n   - \"What do you see in this picture? What is the brown thing on the tree?\"\n   - \"Does it look alive to you right now? Why or why not?\"\n   - \"Have you ever seen something like this on a tree or building? Where?\"\n   - \"What do you think happened to the animal that lived inside this shell?\"\n\n3. **Record student predictions on chart paper** under the heading \"What Is This Shell?\" and \"How Did It Get There?\"\n\n4. **Wonder prompt:** \"I wonder if this shell is a dead animal or if the animal that lived inside it is still alive somewhere... Let's find out!\"\n\n**Transition:** \"Today, we're going to be detectives and learn the story of this shell and the amazing animal that left it behind.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate the features of an exoskeleton and discover through observation how it protects and changes as animals grow.\n\n**Materials (per group of 3-4 students):**\n- Real cicada exoskeleton or high-quality detailed photograph printed on cardstock\n- Hand lenses or magnifying glasses\n- Ruler (to measure shell length)\n- Drawing paper\n- Colored pencils or markers\n- Observation recording sheet (see below)\n- Chart labeled \"What We Notice About the Shell\"\n\n**Student Directions:**\n\n1. **Receive the shell or detailed image.** Handle gently. You are scientists studying evidence of a real animal!\n\n2. **Use your hand lens to observe the shell closely.** Look at:\n   - The texture (is it bumpy, smooth, hard, or papery?)\n   - The shape (what parts do you see? legs? head? wings?)\n   - The color and any patterns\n   - Any cracks or openings\n\n3. **Measure and draw:** Use the ruler to measure the shell's length. Sketch the shell in detail on your paper, labeling the parts you can identify (head, legs, wings, belly).\n\n4. **Fill out your observation sheet** by checking boxes or drawing for these questions:\n   - Is the shell hard or soft?\n   - Does it have legs attached? How many?\n   - Can you see where wings might have been?\n   - Is there an opening or split anywhere on the shell?\n\n5. **Compare with a partner.** Did you both notice the same things? What was different?\n\n6. **Add your observations** to the class chart: \"What We Notice About the Shell.\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What does that bumpy part remind you of?\" \"Why do you think there's a split here?\" \"Does this feel like it could protect something?\"\n- Do NOT explain what the shell is yet; let students describe what they observe.\n- Encourage students to touch and examine carefully.\n- Record interesting student observations on the chart without confirming or denying their ideas.\n\n**Expected Student Outcomes:**\n- Students will accurately describe physical features of the exoskeleton (hard, segmented, has leg parts, etc.).\n- Students will notice cracks or splits and wonder about them.\n- Students will recognize it has animal-like parts (head, legs, wings).\n- Students will create detailed drawings and written/pictorial records.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce vocabulary and the concept of insect life cycles, connecting student observations to the cicada's growth process.\n\n**Materials:**\n- Large life cycle diagram or poster (visual, not text-heavy)\n- Chart paper\n- Images of cicada stages (egg, nymph, adult) if available\n- Vocabulary cards with pictures\n\n**Activity:**\n\n1. **Gather the class.** Review observations from the Explore phase by asking:\n   - \"What parts did you find on this shell?\"\n   - \"Why do you think there's a crack or split?\"\n\n2. **Introduce the animal:** \"This shell came from a cicada (show picture of adult cicada). A cicada is an insect that lives on trees. But here's the amazing part—the shell we studied is NOT a dead cicada. It's like an old house that the cicada moved out of!\"\n\n3. **Explain the life cycle** using a simple, visual diagram with these stages:\n   - **Egg:** Tiny, laid in a tree branch (students may not see this stage outside).\n   - **Nymph:** A baby cicada that looks different from the adult. It lives underground eating from plant roots for several YEARS (use dramatic pause—\"Some cicadas stay underground for 13 or even 17 YEARS!\"). As it grows bigger inside its hard shell (exoskeleton), it gets too big for that shell.\n   - **Molting:** When the nymph gets too big, it sheds its old shell and grows a new, bigger one underneath. It does this many times! That's the shell we found!\n   - **Adult:** Finally, the cicada emerges from its shell, grows wings, and comes above ground to find a mate, make that buzzing sound, and lay eggs.\n\n4. **Connect back to the photograph:**\n   - \"The shell you observed is called an exoskeleton. It's like armor that protects the soft body inside.\"\n   - \"When the cicada got too big, it split right here (point to the crack/split students noticed) and climbed out.\"\n   - \"That's why the shell is empty—the cicada outgrew it and moved on!\"\n\n5. **Check for understanding:** Ask students:\n   - \"Why do you think the cicada had to leave its shell?\"\n   - \"What do you think it needed the shell for?\" (Protection, support as it grew)\n   - \"Is the shell part of the cicada's life cycle?\" (Yes! It's part of growing up.)\n\n**Vocabulary:**\n\n- **Life cycle:** All the stages an animal goes through from birth to death (egg, growing, adult, making babies).\n- **Exoskeleton:** A hard outer shell that protects an insect's soft body; like a suit of armor.\n- **Molt (or shed):** When an animal outgrows its shell and leaves it behind to grow a bigger one.\n- **Nymph:** A baby insect that hasn't grown into its adult form yet.\n- **Cicada:** An insect that lives on trees, spends years growing underground, and makes a loud buzzing sound.\n\n**Expected Student Outcomes:**\n- Students can name the stages of a cicada's life cycle.\n- Students understand that molting is a necessary part of growth.\n- Students recognize the shed exoskeleton as evidence of a living organism in their environment.\n- Students can explain why the shell is empty.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding of life cycles by creating a physical model and connecting it to real-world observations.\n\n**Materials:**\n- Paper or craft materials (construction paper, paper tubes, tissue paper, string, tape, glue sticks)\n- Markers and colored pencils\n- Large poster paper or sentence strips\n- Pictures of cicadas at different life stages (eggs, nymphs, adults)\n- Optional: Actual or high-quality images of tree bark with exoskeletons attached\n\n**Activity: Build a Life Cycle Model**\n\n1. **Divide the class into four groups,** each assigned one stage: Egg, Nymph, Molting, Adult.\n\n2. **Each group creates a 3D model or large drawing** of their stage using provided materials:\n   - **Egg group:** Create tiny eggs in a tree branch (use a paper tube for the branch, tissue paper for eggs).\n   - **Nymph group:** Make a nymph in its exoskeleton (use paper and markers to show the shell, draw or attach legs).\n   - **Molting group:** Show the moment the cicada sheds its shell (create two figures—one inside/one emerging).\n   - **Adult group:** Draw or build an adult cicada with wings, ready to fly and sing.\n\n3. **Arrange the models in order** on a large display in the classroom to show the full life cycle.\n\n4. **Each group presents** their stage in order and explains:\n   - What happens during this stage?\n   - How does the cicada change?\n   - Why is this stage important?\n\n5. **Reflect:** \"Where do you think cicadas live in OUR neighborhood? Why do you think they choose those places?\" (Students notice that cicadas need trees, soil, plant roots—environmental factors that support their survival.)\n\n**Teacher Role:**\n- Facilitate group discussions: \"What do you need to show in your picture so someone else understands this stage?\"\n- Ask students to use evidence: \"What do you know about nymphs that will help you design this model?\"\n- Display the full cycle prominently in the room for reference.\n\n**Expected Student Outcomes:**\n- Students create or describe the four major stages of the cicada life cycle.\n- Students can explain why each stage matters for the cicada's survival and growth.\n- Students recognize environmental features (trees, soil) as supports for cicada life cycles.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of insect life cycles and the purpose of exoskeletons through formative and summative strategies.\n\n**Formative Assessment (During Lesson):**\n- **Observation during Explore:** Did students notice the crack/opening and ask questions about it?\n- **Listen during Explain:** Can students retell why cicadas shed their shells?\n- **Examine during Elaborate:** Do models accurately represent the stages and show understanding of growth and change?\n\n**Summative Assessment: Exit Ticket (Distribute at end of Day 2)**\n\nProvide a simple picture or sentence frame. Students complete and illustrate:\n\n**Option 1 (Drawing + Words):**\n- \"Draw the exoskeleton from the photo. Then draw arrows and labels showing what happens next in the cicada's life cycle.\"\n\n**Option 2 (Sentence Frames):**\n- \"The shell we found belonged to a ___________________.\"\n- \"The cicada left this shell because _______________________________.\"\n- \"This shell helped the cicada by ________________________________.\"\n- \"The next stage of the cicada's life cycle is ________________________.\"\n\n**Option 3 (Questions to Answer Verbally or with Pictures):**\n- \"If you found this shell on a tree, what would that tell you about what lives near your school?\"\n- \"Why is molting an important part of the cicada's life?\"\n- \"How does the exoskeleton help the cicada survive?\"\n\n**Success Criteria (Students Met Learning Objectives When They Can):**\n✓ Identify the shell as part of a cicada's life cycle.\n✓ Explain that molting happens because the insect grows and needs a bigger shell.\n✓ Name at least two stages of the cicada life cycle (egg, nymph, adult).\n✓ Recognize the exoskeleton as protection during growth.\n✓ Provide evidence from the photo (the crack, the empty space, the shape of legs/wings).\n\n**Expected Student Outcomes:**\n- Most students will correctly identify the shell's purpose and explain basic molting.\n- Students will be able to sequence at least 2-3 life cycle stages.\n- Students will understand that organisms change as they grow.\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n1. **Provide a labeled diagram** of the cicada life cycle during the Explain phase. Students can refer to it during all activities and use it to guide their model-building.\n2. **Pair with a stronger reader/observer.** During Explore, allow the partnership to discuss observations together before recording. The support student can help record observations in words or pictures.\n3. **Simplify the exit ticket** to a two-choice format: \"The cicada left this shell because: A) it grew too big for it, or B) it didn't need it anymore.\" With a sentence starter: \"I think the answer is _____ because _____.\"\n4. **Use a physical demonstration:** Show a cicada shell photo side-by-side with a picture of an adult cicada to make the connection very concrete.\n\n**Challenge (For Advanced Learners):**\n1. **Research extension:** \"Some cicadas stay underground as nymphs for 13 or 17 YEARS. Find out why their life cycle is so long. How is this different from other insects?\" (Students can use provided resources or teacher-guided research to report findings.)\n2. **Comparative life cycles:** Provide images of other insects (butterfly, grasshopper, dragonfly) and their exoskeletons/shells. Students compare: \"How are cicada and butterfly life cycles the same? Different?\" Create a Venn diagram.\n3. **Predict and test:** \"If we look for cicada shells on different types of trees, will we find more on some trees than others? Why?\" Students design an outdoor observation plan to investigate this question.\n\n---\n\n### Extension Activities\n\n1. **Cicada Hunt (Outdoor Observation):**\n   - Take students on a nature walk near school grounds or in a park (especially in late spring/early summer).\n   - Search tree trunks, branches, and shrubs for cicada exoskeletons.\n   - Collect (gently) or photograph shells found and label the location, tree type, and height where found.\n   - Create a \"Cicada Shell Map\" of the school yard or park showing where shells were discovered.\n   - Discuss: \"Why do you think we found more shells near certain trees?\"\n\n2. **Listening for Cicadas (Sensory Learning):**\n   - Play an audio recording of cicada sounds (widely available online—search \"cicada sound recording\").\n   - Explain: \"The adult cicada makes this loud buzzing or clicking sound by vibrating special body parts. This is how males attract females to mate.\"\n   - Take students outside on a warm day (cicadas are most active in late summer) and listen for real cicada calls.\n   - Create a \"Sound Map\" showing where cicada sounds were heard around the school.\n\n3. **Life Cycle Comic Strip or Animation:**\n   - Students create a 4-6 panel comic strip showing the cicada life cycle from egg to adult.\n   - Include labels, dialogue bubbles where the cicada \"explains\" each stage, and environmental details (tree, soil, etc.).\n   - Alternative: Use a digital tool or flip-book format to create a simple animation showing the cicada molting and growing.\n   - Display in the classroom or hallway to teach other students about cicada life cycles.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 384,
  "outputTokens": 3942,
  "cost": 0.020621800000000003,
  "generatedAt": "2026-02-13T03:52:16.592Z"
}