{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada06282020_hdr.jpg",
  "imagePath": "images/life-science/cicada06282020_hdr.jpg",
  "gradeLevel": "Fourth Grade",
  "gradeLevelKey": "fourth-grade",
  "content": "# 5E Lesson Plan: Cicadas and Their Special Body Parts\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **External body structures and their functions:** Cicadas have specialized body parts (legs for gripping, wings for movement, piercing mouth) that help them survive and interact with their environment.\n- **Sensory systems and responses:** Cicadas use compound eyes and other sensory organs to detect light, movement, and plants, then respond by moving or feeding.\n- **Habitat and adaptation:** Cicadas are adapted to living on plants and trees; their coloring and body shape help them blend in and survive in their environment.\n- **Life cycles and metamorphosis:** Many cicada species undergo dramatic changes from nymphs living underground to winged adults that emerge on plants.\n\n---\n\n## Lesson Title\n\n**Cicadas: Amazing Insects with Super-Powered Body Parts**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fourth Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 4-LS1-1: Construct an argument that plants and animals have internal and external structures that function to support survival, growth, behavior, and reproduction.\n  - 4-LS1-2: Use a model to describe that animals receive different types of information through their senses, process the information in their brain, and respond to the information in different ways.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Identify at least three external body structures of a cicada and explain how each one helps the cicada survive.\n2. Describe how cicadas use their senses to find food and stay safe from predators.\n3. Compare the body structures of a cicada to the body structures of other insects they know.\n4. Create a labeled diagram of a cicada showing its key body parts and their functions.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about insects and how their body parts help them survive.\n\n**Materials:**\n- Printed photograph of cicada (large color print or projected on screen)\n- Wonder chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or print it at poster size. Do NOT explain what the insect is yet.\n\n2. **Ask these discussion questions** (pause for think-pair-share before calling on students):\n   - *\"Look closely at this insect. What do you notice about its body parts? What looks different or interesting?\"*\n   - *\"Why do you think this insect has such big, detailed wings? What do you think it uses those wings for?\"*\n   - *\"Look at the insect's legs and mouth. What clues do these give us about what this insect does to survive?\"*\n   - *\"This insect is sitting on a plant with red flowers. Why might it be there? What might it be doing?\"*\n\n3. **Record student observations** on the wonder chart without correcting them. Use phrases like \"Some of you think...\" to honor all responses.\n\n4. **Prediction prompt:** *\"I'm going to tell you this is a cicada. Based on what you see, what do you predict cicadas need their special body parts for? Turn to a neighbor and make one prediction together.\"*\n\n**Transition:** \"Today we're going to become cicada scientists and discover how each of this insect's body parts helps it survive and do important things. Let's explore!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate cicada body structures and functions through hands-on examination and model-building.\n\n**Materials:**\n- Printed photograph of cicada (one per pair or small group)\n- Labeled diagram worksheet (simple, with blank labels for students to fill in) — see template suggestion below\n- Magnifying glasses (1 per pair)\n- Colored pencils or markers\n- Large index cards or construction paper\n- String, pipe cleaners, craft materials for making a 3D cicada model (optional for second session)\n- Student observation sheet (see below)\n\n**Activity:**\n\n**Part A: Close Observation (10 minutes)**\n\n1. **Distribute materials** to each pair: magnifying glass, printed photo, and observation sheet.\n\n2. **Give these step-by-step directions:**\n   - *\"Use your magnifying glass to look very closely at the photograph. Start at the cicada's head and slowly move your eyes down to its body and legs.\"*\n   - *\"On your observation sheet, draw circles around three body parts you notice. Label what you see: head, eyes, legs, wings, mouth, body, or anything else you spot.\"*\n   - *\"Next to each circle, write or draw what you think that body part does. Does it help the cicada move? See? Eat? Hold on? Escape?\"*\n   - *\"You don't need the 'right' answer—use what you see in the photo to make your best guess.\"*\n\n3. **Circulate and ask prompts** without giving answers:\n   - *\"What do you notice about the wings? Why are they so detailed?\"*\n   - *\"Look at those legs—are they long or short? Thick or thin? Why would the cicada need legs like that?\"*\n   - *\"Where do you think the cicada eats from? What body part might help it eat?\"*\n\n**Part B: Body Part Function Sorting (10 minutes)**\n\n4. **Project or display the photograph again.** Point to one body part at a time (e.g., wings).\n\n5. **Ask:** *\"Show me with your thumbs: Does this help the cicada MOVE, SENSE (see, hear, feel), or EAT? Thumbs up for move, sideways for sense, down for eat.\"*\n\n6. **Have students explain their thinking.** Accept all responses and record them. Examples:\n   - Wings → MOVE (flying)\n   - Large eyes → SENSE (seeing predators or plants)\n   - Legs → MOVE and SENSE (feeling textures, holding on)\n   - Mouth → EAT (drinking plant juice)\n\n**Teacher Role:**\n- Facilitate without revealing answers. Your job is to ask questions that guide observation.\n- If students struggle, zoom in on specific body parts: *\"What is this part shaped like? What else in nature has a shape like this?\"*\n- Validate effort and curiosity over accuracy.\n\n**Expected Student Outcomes:**\n- Students identify 3–5 external body structures.\n- Students make reasonable predictions about what each part does based on observation.\n- Students record these observations on their sheet (drawings, labels, or words).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect student discoveries to life science concepts about how body structures support survival.\n\n**Materials:**\n- Large chart paper or whiteboard\n- Colored markers\n- Printed labeled diagram of a cicada (teacher reference, or students can color/label their own)\n- Student vocabulary cards (optional; see below)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):** \n   - Ask 3–4 student pairs to share one body part they studied and what they think it does.\n   - Write their observations on the chart under headings: MOVE | SENSE | EAT | PROTECT\n   - Say: *\"Listen to your classmates' ideas. Do you agree or have a different idea?\"*\n\n2. **Introduce vocabulary with student-friendly definitions (5 minutes):**\n\n   **Vocabulary:**\n   - **External structures:** Body parts on the outside of an animal that help it do things (like wings, legs, eyes, and mouth).\n   - **Adaptation:** A special body part or behavior that helps an animal survive in its environment.\n   - **Compound eyes:** Eyes made of many tiny parts that help insects see movement and light very well.\n   - **Sensory organs:** Body parts that help animals collect information from their surroundings (eyes see, ears hear, antennae feel).\n   - **Function:** The job or purpose of a body part.\n\n3. **Connect back to the photograph and Explore activity (5 minutes):**\n   - Display the cicada photo again.\n   - Point to the wings: *\"A cicada's wings are an external structure. Their function is to help the cicada fly to new plants. This is an adaptation because flying helps it survive—it can find food and escape from predators.\"*\n   - Point to the eyes: *\"See how big and round the cicada's eyes are? These are compound eyes—an adaptation for sensing danger and light. When the cicada's brain receives this information through its eyes, it can respond by flying away or moving closer to food.\"*\n   - Point to the legs: *\"Notice the spiky legs? They grip the plant so the cicada doesn't fall. The legs also have sensory organs that feel the plant. When the cicada's brain gets this information, it knows it's in the right place to eat.\"*\n\n4. **Check for understanding (5 minutes):**\n   - Ask: *\"Turn to a neighbor: Tell me one external structure of a cicada and its function.\"*\n   - Listen to 2–3 pairs and give specific praise: *\"You explained how the wings help the cicada move—that's exactly right!\"*\n\n**Expected Student Outcomes:**\n- Students understand that cicadas have body structures (wings, legs, eyes, mouth) that each have a specific job.\n- Students can explain that these structures help cicadas survive by moving, sensing, and eating.\n- Students connect their own observations to vocabulary terms.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding by comparing cicadas to other insects and by creating a detailed labeled diagram.\n\n**Materials:**\n- Large blank outline of a cicada (printed template for each student)\n- Colored pencils, crayons, or markers\n- Labels: Wings, Legs, Eyes, Mouth/Proboscis, Body, Antennae (on small sticky notes or strips)\n- Picture cards or photos of other insects (ant, butterfly, dragonfly, beetle) — 1 set per pair\n- Comparison chart handout (optional)\n\n**Activity: Cicada Diagram & Comparison**\n\n1. **Create a detailed, labeled diagram (10 minutes):**\n   - Distribute blank cicada outline to each student.\n   - Provide colored pencils and label cards.\n   - Direct students: *\"Color your cicada to match the photograph as closely as you can. Then, place the label cards on each body part. Next to each label, write one sentence about what that part does. For example: 'Wings—help the cicada fly to new plants.'\"*\n   - Students should produce a colorful, labeled diagram with function sentences.\n\n2. **Compare body structures across insects (5 minutes):**\n   - Show picture cards of 3–4 other insects (ant, butterfly, dragonfly, beetle).\n   - Ask: *\"Do all insects have wings like the cicada? Do all insects have the same kind of legs? Let's compare.\"*\n   - Guide discussion: *\"The butterfly has wings to fly, just like the cicada. But the ant has smaller wings or no wings—it walks instead. Both insects have legs, but for different jobs.\"*\n   - Conclude: *\"Insects have the same general body structures, but their structures are different shapes and sizes depending on how they live.\"*\n\n3. **Apply to a new scenario (optional, if time allows):**\n   - Present a scenario: *\"Imagine a cicada needs to escape from a bird. Show me with your hand movements and tell me: Which body parts does it use? First, its compound eyes sense the bird. Then, its legs push off the plant. Finally, its wings help it fly away. Walk me through it.\"*\n\n**Teacher Role:**\n- Circulate and ask clarifying questions: *\"Why is that body part important for the cicada?\"* \n- Provide sentence starters if needed: *\"The _____ helps the cicada because _____.\"*\n- Encourage students to reference the photo and the chart from the Explain phase.\n\n**Expected Student Outcomes:**\n- Students produce a labeled diagram with color, labels, and function descriptions.\n- Students articulate that different insects have similar structures (wings, legs, eyes) adapted for their specific survival needs.\n- Students demonstrate understanding that external structures have purposes related to survival, movement, sensing, and feeding.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of cicada body structures and their functions, and how sensory information leads to responses.\n\n**Formative Assessment (Throughout Lesson):**\n- Observe student diagrams during Elaborate phase. Do labels match functions? Are descriptions accurate?\n- Listen to pair discussions. Do students use vocabulary (external structure, adaptation, function, sensory)?\n- Review observation sheets from Explore phase. Did students identify realistic functions for each body part?\n\n**Exit Ticket / Summative Assessment (5-7 minutes):**\n\nDistribute an exit ticket with the following prompts (students can respond with words, drawings, or both):\n\n1. **\"Draw or label one body part of the cicada. Write what job that body part does.\"**\n   - *Success Criteria:* Student identifies a real body part (wings, legs, eyes, mouth) and describes a reasonable function (moving, sensing, eating, gripping).\n\n2. **\"A cicada sees a red flower on a plant. Explain what happens next. Use these words: eyes, brain, legs, wings.\"**\n   - *Success Criteria:* Student describes a logical sequence: eyes see → brain processes → cicada responds (moves legs or flies with wings). Student uses at least 2–3 of the provided words.\n\n3. **\"How are a cicada's wings an adaptation? How do they help it survive?\"**\n   - *Success Criteria:* Student explains that wings help the cicada move to new plants, escape danger, or find food.\n\n**Rubric Example (Simple 3-point):**\n- **3 = Meets Expectation:** Student accurately identifies body parts, describes realistic functions, and explains how structures help the cicada survive.\n- **2 = Approaching:** Student identifies body parts and functions with minor inaccuracies or incomplete explanations.\n- **1 = Developing:** Student identifies body parts but struggles to connect them to function or survival.\n\n**Expected Student Outcomes:**\n- Students demonstrate understanding that cicadas have specialized external structures.\n- Students explain that these structures help cicadas sense their environment, move, and find food.\n- Students can describe how sensory information (what the cicada sees or feels) leads to a response (flying, moving, eating).\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified observation sheet:** Provide a sheet with pictures of cicada body parts already circled. Students only need to draw lines and match each part to one of three functions: Move | Sense | Eat. Reduce writing demands by allowing drawings or one-word labels.\n\n2. **Vocabulary anchor chart:** Create a large, visual chart with the five vocabulary terms and simple images for each. Keep this posted during all phases so students can reference it without memorizing.\n\n3. **Pair struggling students with a peer mentor** during Explore. The peer can help ask guiding questions and scribe observations if the student struggles with writing.\n\n4. **Provide a completed example diagram** (cicada with labels and function sentences already written) that students can use as a reference when creating their own during Elaborate.\n\n### Challenge (For Advanced Learners)\n\n1. **Investigate the cicada life cycle:** Provide research materials (books, websites) about how cicadas change from nymphs underground to winged adults. Ask: *\"How do you think a cicada's body structures change as it grows? Why would a nymph need different body parts than an adult?\"* Students create a labeled diagram comparing nymph and adult structures.\n\n2. **Design a \"survival challenge\" scenario:** Present complex situations such as *\"A cicada is on a plant when it rains heavily. It is very cold. What body structures does it use to survive this? Design a body part that might help.\"* Students sketch and describe an adaptation for a new challenge.\n\n3. **Research and present on cicada communication:** Advanced learners investigate how male cicadas make loud sounds using special body structures called tymbals. They can create a poster or short presentation explaining the structure, its function, and why it helps cicadas survive.\n\n---\n\n## Extension Activities\n\n1. **Cicada life cycle timeline:** Students create a 4-stage timeline showing a cicada's metamorphosis from egg to adult. For each stage, they draw and label the body structures visible at that point and explain how the structures change. This reinforces that external structures evolve as organisms grow.\n\n2. **Insect body structure scavenger hunt:** Provide photos of 6–8 different insects (ladybug, dragonfly, grasshopper, bee, stink bug, praying mantis). Students match body structures (wings, legs, eyes, antennae) to each insect and explain how each structure helps that particular insect survive. Create a class chart comparing all insects.\n\n3. **Build a 3D cicada model:** Using craft materials (pipe cleaners for legs, tissue paper for wings, googly eyes, etc.), students construct a 3D model of a cicada. They label each part and write its function on an index card. Display models as a class \"Cicada Museum\" with function cards for visitors to read.\n\n---\n\n## Teacher Tips\n\n- **Timing note:** If your school has 30-minute blocks, you can split this into three sessions: Session 1 = Engage + Explore Part A, Session 2 = Explore Part B + Explain, Session 3 = Elaborate + Evaluate.\n- **Real cicada specimens:** If available in your area during cicada season, a carefully preserved specimen (humanely collected or found naturally) can replace or supplement the photograph. Always handle with respect and discuss ethical science practices.\n- **Connection to prior learning:** This lesson assumes students have basic knowledge of insects and plant structures. If not, briefly review that insects have six legs and three body parts (head, thorax, abdomen).\n- **Cultural note:** In some cultures, cicadas are significant. Invite students to share any knowledge about cicadas from their families or cultures (food, symbolism, folklore). This enriches the lesson with diverse perspectives.\n\n---\n\n**This lesson is designed to meet Fourth Grade expectations for understanding how external structures support animal survival and how sensory information leads to behavioral responses. Students leave with a concrete, observable understanding of adaptation and function.**",
  "inputTokens": 2833,
  "outputTokens": 4301,
  "cost": 0.024338,
  "generatedAt": "2026-02-12T20:03:00.203Z"
}