{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada06282020_hdr.jpg",
  "imagePath": "images/life-science/cicada06282020_hdr.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Insects and What They Need to Survive\n\n## Core Science Concepts from Image Analysis\n\n- **Living organisms have specific body parts that help them survive** — The cicada has wings, legs, and eyes adapted for life on plants and in the environment.\n- **Animals need plants for food and shelter** — The cicada is on a flowering plant stem, showing the relationship between insects and plants.\n- **Different animals look different and have different structures** — The cicada's body is distinctly different from the plant it clings to.\n- **Insects are living things that need food, water, and safe places to live** — The image shows an insect in its natural habitat using the plant for both food and attachment.\n\n---\n\n## Lesson Title\n\n**What Do Cicadas Need to Live?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 90 minutes (delivered across two 45-minute sessions or flexible instruction)\n- **NGSS Standards:** K-LS1-1 (Use observations to describe patterns of what plants and animals need to survive)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Identify at least two body parts that help the cicada survive.\n2. Describe what the cicada needs to stay alive (food, water, and a safe place).\n3. Explain why the cicada is on the plant (to find food and a place to hold on).\n4. Observe and share one way animals and plants are connected.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture curiosity about insects and their survival needs using the photograph.\n\n**Materials:**\n- Printed or projected image of the cicada on the flowering plant (large enough for all students to see)\n- Chart paper and markers\n- Optional: small toy insects or plastic cicada figure to hold up\n\n**Activity:**\n\n1. **Display the photograph.** Project it on the screen or hold up a large printed copy. Ask students to look carefully but not call out yet.\n\n2. **Ask these guiding questions** (one at a time, pausing for responses):\n   - \"What do you see in this picture? Is it an animal or a plant, or both?\"\n   - \"Can you point to the bug? What is the bug doing on the plant?\"\n   - \"Do you think this bug is happy here? Why or why not?\"\n   - \"What do you think this bug needs to stay alive?\"\n\n3. **Activate prior knowledge:** Ask, \"Has anyone ever seen a bug on a plant in your yard or garden? What was it doing there?\"\n\n4. **Wonder prompt:** Say, \"This is a cicada—a special insect. Today, we're going to discover what cicadas need to survive and why plants are important to them.\"\n\n**Transition:** \"Let's explore and find out together what this cicada needs to live!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate the connection between insects and plants through hands-on observation and play-based exploration.\n\n**Materials:**\n- Real plants in pots (small potted flowering plants, grass, or herb plants) or branches with leaves/flowers in water\n- Toy insects, plastic bugs, or student-made bug cutouts (pre-cut simple insect shapes)\n- Magnifying glasses (optional, if available)\n- Paper and crayons\n- Large floor space or tables for exploration stations\n\n**Activity:**\n\n1. **Set up exploration stations** (or conduct as a whole group with a central demonstration plant):\n   - Station 1: Living plant(s) in a pot or vase\n   - Station 2: Paper/crayons for drawing\n   - Station 3: Toy insects to place on/around plants\n\n2. **Student Directions:**\n   - \"Find a partner or small group. Go to the plant station.\"\n   - \"Look closely at the plant. Use your eyes (and magnifying glass if you have one). What do you see?\"\n   - \"Now, place your toy bug on the plant. Where does it like to sit? Why do you think it chose that spot?\"\n   - \"Does the bug want to be on a leaf? On the stem? By the flower? Why?\"\n   - \"After exploring, draw or paint a picture of your bug on the plant.\"\n\n3. **What students should record/document:**\n   - A drawing showing the bug on the plant\n   - Observations written or dictated (e.g., \"The bug sat on the flower because that's where the food is\")\n\n4. **Teacher Role:** \n   - Circulate and ask open-ended questions: \"Why did you put your bug there?\" \"What do you think the bug finds on the plant?\"\n   - Do NOT tell students the answers; guide them with curiosity.\n   - Listen for ideas about food, shelter, and safety.\n   - Encourage repeated exploration and repositioning of insects.\n\n5. **Expected Student Outcomes:**\n   - Students discover that bugs seek out plants, particularly flowers and leaves.\n   - Students make predictions about why bugs go to certain plant parts.\n   - Students create visual representations showing insects on plants.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and solidify the concept that animals need plants to survive.\n\n**Materials:**\n- Chart paper and markers\n- Photograph of cicada (displayed again)\n- Picture cards of body parts (eyes, legs, wings, mouth) and survival needs (food, water, shelter)\n- Simple storybook about insects (optional, e.g., \"The Very Hungry Caterpillar\" or similar)\n\n**Activity:**\n\n1. **Group share-out:**\n   - Invite 3–4 students to share their drawings or observations.\n   - Ask, \"Why did you put your bug on that part of the plant?\"\n   - Affirm responses and highlight any mentions of food, hiding, or safety.\n\n2. **Return to the cicada photograph:**\n   - \"Look at the cicada again. Where is it? What is it near?\" (Flowers, plant stem)\n   - \"Why do you think the cicada loves this plant?\"\n\n3. **Introduce key vocabulary** (using the photograph and students' discoveries):\n\n   | Term | Student-Friendly Definition |\n   |------|---------------------------|\n   | **Cicada** | A special bug (insect) that lives on plants and makes loud buzzing sounds. |\n   | **Insect** | A small animal with six legs, wings (sometimes), and a body with three parts. All bugs are insects. |\n   | **Needs** | Things that a living thing must have to stay alive and healthy (like food, water, and a safe place). |\n   | **Plant** | A living thing that grows from the ground and gives food to insects and animals. |\n   | **Survive** | To stay alive and healthy. |\n\n4. **Make connections:**\n   - \"The cicada survives because it found a plant. The plant gives the cicada what it needs.\"\n   - Point to the flower: \"Cicadas eat plants. They drink water from the plant too.\"\n   - Point to the stem/leaves: \"The plant also helps hide the cicada and keeps it safe.\"\n\n5. **Check for understanding:**\n   - Hold up a picture of a plant and ask, \"Is this living or not living?\"\n   - Ask, \"What do insects need to survive?\" (Pause for answers: food, water, safe place)\n   - Ask, \"Can a cicada live without a plant? Why not?\"\n\n6. **Expected Student Outcomes:**\n   - Students understand that cicadas (and insects) need food, water, and shelter.\n   - Students recognize that plants provide these things to insects.\n   - Students use new vocabulary (cicada, insect, survive, needs) in simple sentences.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students deepen understanding by exploring how different insects and plants interact, and apply learning to new scenarios.\n\n**Materials:**\n- Picture cards of various insects (butterfly, ant, grasshopper, ladybug, etc.)\n- Picture cards of various plants (flower, tree, grass, garden, bush)\n- Pre-made matching cards or a simple chart (2 columns: \"Insects\" and \"What They Need\")\n- Student worksheets or activity mats with a picture of a plant and blank spaces to draw/add insects\n- Crayons, stickers, or cut-out pictures of insects\n\n**Activity Option 1: Insect-Plant Matching**\n\n1. **Show picture cards of different insects and plants.**\n2. **Ask students:** \"Where do you think this bug lives? What plant does it need?\"\n3. **Guide matching activity:** Have students place insect cards near plant cards they think \"go together.\"\n4. **Discuss:** \"Why do you think the ant needs the grass?\" \"What does the butterfly eat from the flower?\"\n5. **Reinforce:** \"All insects need plants to survive, just like the cicada!\"\n\n**Activity Option 2: Bug Habitat Creation**\n\n1. **Give each student a worksheet with a large drawing of a plant/tree/garden scene.**\n2. **Task:** \"Draw or paste insects into this picture. Show where they would live and why.\"\n3. **Prompt:** \"Where do insects go to find food? Where do they hide? Where can they drink water?\"\n4. **Share:** Students show their habitat and explain their choices.\n\n**Teacher Role:**\n- Ask deepening questions: \"What else might this insect need from the plant?\"\n- Encourage students to think about multiple insects using the same plant.\n- Celebrate connections students make between different insects and plants.\n\n**Expected Student Outcomes:**\n- Students apply the concept that insects need plants to multiple scenarios.\n- Students recognize that many different insects depend on plants.\n- Students demonstrate understanding through visual representation and explanation.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of what insects need to survive and why plants are important.\n\n**Formative Assessment (Ongoing Throughout Lesson):**\n- Observe student engagement during Explore phase — do they place insects on/near plant parts?\n- Listen to explanations during Explain phase — can students articulate why the cicada is on the plant?\n- Examine drawings from Explore and Elaborate phases — do they show insects interacting with plants?\n\n**Summative Assessment — Exit Ticket/Check for Understanding:**\n\nConduct a brief one-on-one or small-group interview using these questions:\n\n1. **\"Look at this picture of a cicada on a plant. What does the cicada need to stay alive?\"** \n   - *Success Criteria:* Student identifies at least one of the following: food, water, safe place.\n\n2. **\"Why do you think the cicada is on the flower?\"** \n   - *Success Criteria:* Student explains that the cicada finds food or water there, or that it's a safe place.\n\n3. **\"Can you show me one body part of the cicada that helps it stay on the plant?\"** \n   - *Success Criteria:* Student points to or names legs, claws, or another attachment feature.\n\n4. **\"What would happen to the cicada if there were no plants?\"** \n   - *Success Criteria:* Student indicates the cicada would have no food, nowhere to live, or would die.\n\n**Alternative Summative Assessment (For groups or whole class):**\n- **Picture Sort:** Show pictures of living things (plants, insects, humans, rocks). Ask students to point to things that are alive and explain why. Listen for connections to \"needs.\"\n- **Drawing Prompt:** \"Draw a cicada and the plant it needs to survive.\" Assess whether students show the relationship between insect and plant.\n\n**Expected Student Outcomes — How to Determine Success:**\n- ✓ Students can name at least two things insects need to survive (food, water, shelter).\n- ✓ Students can explain why an insect is on a plant (using words like \"food,\" \"water,\" \"safe,\" \"home\").\n- ✓ Students recognize that plants are living things and that insects depend on them.\n- ✓ Students use the word \"survive\" or \"need\" appropriately in conversation.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified vocabulary:** Use only \"bug,\" \"plant,\" \"food,\" \"home,\" and \"alive\" instead of full science terms. Introduce \"insect\" and \"cicada\" later or only in context.\n\n2. **Guided exploration:** Partner struggling students with a peer or paraprofessional during the Explore phase. Model how to observe the plant and place the insect, then allow student to copy the action.\n\n3. **Visual supports:** Use picture cards instead of asking for verbal explanations. Ask, \"Does the bug need food, water, or a home?\" and have the student point to a picture rather than answer in words.\n\n4. **Shorter attention span:** Break the lesson into three shorter sessions instead of two, or allow students to work at a station for just 10 minutes before rotating.\n\n### Challenge (For Advanced Learners)\n\n1. **Deeper questioning:** Ask, \"If we moved the cicada to a different plant, would it survive? Why or why not?\" or \"What other bugs might live on this same plant?\"\n\n2. **Comparative exploration:** Have students investigate multiple types of plants and observe which insects they attract. Create a simple chart: \"Plant A had ___ bugs. Plant B had ___ bugs.\"\n\n3. **Creative application:** Challenge students to design a \"bug garden\" on paper—drawing a plant and all the insects that need it to survive. Ask them to explain why each insect chose that plant.\n\n4. **Extended vocabulary:** Introduce additional terms such as **shelter**, **habitat**, or **predator** (simple definition: \"an animal that eats other animals\").\n\n---\n\n## Extension Activities\n\n1. **Cicada Life Cycle Exploration (5–10 minutes)**\n   - Show pictures of cicada life stages: egg, nymph, adult.\n   - Explain in simple terms: \"Cicadas start as tiny eggs on plants. They grow and grow on the plant, eating it. When they're big enough, they become flying insects.\"\n   - Activity: Students draw or sequence pictures of a cicada growing up on a plant.\n\n2. **Build an Insect Hotel (Craft Activity, 20–30 minutes)**\n   - Provide materials: small boxes, paper tubes, dry grass, twigs, leaves, tape, markers.\n   - Guide students to create a \"home\" for insects using natural materials.\n   - Discuss: \"What does an insect need in its home?\" (Safe spaces, places to hide, close to food/plants)\n   - If possible, place it near a plant or garden and observe which insects visit.\n\n3. **\"What Do Animals Need?\" Sort Activity (10–15 minutes)**\n   - Provide picture cards of various animals (dog, bird, fish, butterfly, ant, etc.) and their needs (food, water, shelter, air).\n   - Students sort or match animals to what they need.\n   - Highlight: \"Just like the cicada, all animals need food, water, and a safe place to live!\"\n\n---\n\n## Notes for Teachers\n\n- **Safety:** If using live plants in the classroom, ensure they are non-toxic if students touch them. Avoid pesticide-treated plants.\n- **Engagement Tip:** If possible, play a recording of cicada sounds during the lesson—students find this engaging and memorable!\n- **Real-World Connection:** If your school has a garden, outdoor space, or window area with plants, consider moving the exploration activity outside to observe real insects.\n- **Inclusive Language:** Use \"we observe\" and \"we wonder\" to emphasize that science is collaborative and that all ideas are valued.\n\nThis lesson directly aligns with **K-LS1-1** by having students use observations of the cicada and their hands-on exploration to describe what insects (animals) need to survive, with emphasis on the plant-animal relationship visible in the photograph.",
  "inputTokens": 2788,
  "outputTokens": 3704,
  "cost": 0.021307999999999997,
  "generatedAt": "2026-02-12T19:59:41.484Z"
}