{
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada.jpg",
  "imagePath": "images/life-science/cicada.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# 5E Lesson Plan: Cicadas and Their Life Cycles\n\n## Core Science Concepts from Image Analysis\n\n- **Life cycles and metamorphosis:** Cicadas undergo incomplete metamorphosis, changing form as they grow from nymphs to adults with visible wings and body structures adapted for their life stage.\n- **Adaptations for survival:** Cicadas possess specialized body structures (wings, legs, mouthparts) that help them move through their environment, find food, and interact with plants.\n- **Relationships between organisms and their environment:** Cicadas depend on plants and branches for food, shelter, and resting places; they are part of food chains and ecosystems.\n- **Movement of matter and energy:** Cicadas consume plant materials (sap), converting matter and energy from plants as they grow and develop.\n\n---\n\n## Lesson Title\n\n**The Cicada's Journey: From Underground Nymph to Winged Wonder**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 5-LS1-1: Support an argument that plants get the materials they need for growth chiefly from air and water.\n  - 5-LS2-1: Develop a model to describe the movement of matter among plants, animals, decomposers, and the environment.\n\n---\n\n## Learning Objectives\n\nStudents will be able to...\n\n1. Identify and describe the body structures of an adult cicada and explain how each structure helps the cicada survive and move through its environment.\n2. Explain the life cycle of a cicada, including the major stages from egg to adult, and describe how the cicada changes during its development.\n3. Develop a model showing how matter (plant sap) moves from plants to cicadas and describe the relationship between cicadas and the plants they depend on.\n4. Argue that cicadas need plants as a source of food and energy for growth, using observations and evidence from the lesson.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge by examining the photograph of a cicada on plant branches with red flowers.\n\n**Materials:**\n- Projected image of the cicada photograph (large, clear display)\n- Chart paper and markers\n- Student science notebooks or paper\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or printed poster where all students can see it clearly. Say: \"Look at this creature carefully. What do you notice? What questions come to mind?\"\n\n2. **Facilitate a brief observation session** (2–3 minutes):\n   - Ask students to turn to a partner and describe what they see in the image.\n   - Invite 3–4 volunteers to share one observation aloud.\n\n3. **Ask these specific discussion questions** to spark curiosity:\n   - \"What do you think this insect is eating, and how can you tell from the photograph?\"\n   - \"Where do you think this insect came from before it looked like this? Did it always have wings?\"\n   - \"Why do you think this insect is holding on to the plant branch? What might it need from the plant?\"\n   - \"If this insect disappeared from our gardens, what do you think might happen to other animals or the plants around it?\"\n\n4. **Pose a wonder prompt:** \"I'm wondering: How does this insect get the energy and materials it needs to grow, and where does it come from?\" Write this question on chart paper and leave it visible throughout the lesson.\n\n**Transition:** \"Today, we're going to become cicada detectives. We'll investigate how these insects grow, what they eat, and how they are connected to the plants around them.\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate cicada life cycles and body structures through hands-on modeling and observation.\n\n**Materials (per group of 3–4 students):**\n- Large paper or poster board (11\" × 17\")\n- Colored markers or colored pencils\n- Pre-prepared \"cicada life stage cards\" showing pictures of egg, nymph (underground), nymph (above ground), and adult cicada (printed or drawn)\n- Glue stick\n- Sentence strips with scrambled life cycle events (printed)\n- Ruler\n- Student observation worksheet (see below)\n\n**Activity:**\n\n1. **Divide students into groups of 3–4.** Distribute one large sheet of poster paper and the lifecycle cards to each group.\n\n2. **Give these step-by-step directions:**\n   - \"Your group has four pictures showing different stages of a cicada's life. Arrange these pictures in order on your poster paper from left to right, showing how the cicada changes from the very beginning (an egg) to an adult.\"\n   - \"Use your markers to draw arrows connecting each stage to the next stage. Along each arrow, write or draw what you think needs to happen for the cicada to change to the next stage (hint: think about food, time, and growing bigger).\"\n   - \"Beneath each life stage, use the sentence strips to write or paste what the cicada looks like and what it eats at that stage.\"\n\n3. **Distribute the observation worksheet** with these guiding prompts:\n   - \"Where does the cicada nymph live? Why do you think it lives there?\"\n   - \"What does a cicada eat? Where does it get its food?\"\n   - \"How long do you think a cicada stays in each stage of its life? (You'll find out the real answer later!)\"\n   - \"Draw and label the body parts you see on the adult cicada in the photograph. What do you think each part does?\"\n\n4. **Teacher Role:** \n   - Circulate among groups and ask probing questions: \"Why did you put that stage first? What makes you think so?\" and \"What do you think the cicada needs to survive at each stage?\"\n   - Do **not** provide correct answers; instead, redirect students to observe and reason from the photograph.\n   - Listen for misconceptions and note them for the Explain phase.\n\n5. **Expected Student Outcomes:**\n   - Groups produce a life cycle diagram with stages in some logical order (correct sequence is not the primary goal yet).\n   - Students record observations about where cicadas live, what they look like, and what they eat.\n   - Evidence of student thinking about connections between cicadas and plants.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and solidify understanding of the cicada life cycle and plant-insect relationships.\n\n**Materials:**\n- Chart paper with the wonder question\n- Prepared poster showing the **correct cicada life cycle** (egg → underground nymph → above-ground nymph → adult)\n- Picture cards or slides of each stage\n- Vocabulary cards (printed, one per term)\n- Student science notebooks\n\n**Activity:**\n\n1. **Invite 2–3 groups to share their life cycle diagrams** (2–3 minutes).\n   - Celebrate their thinking: \"I notice you thought about where the cicada lives and what happens in each stage. Great scientific thinking!\"\n   - Note any differences from the scientifically accurate sequence.\n\n2. **Reveal and discuss the actual cicada life cycle** (5–7 minutes):\n   - Display the correct sequence on a large poster: Egg → Underground Nymph (2–17 years!) → Above-Ground Nymph (sheds skin) → Adult Cicada.\n   - Use the photograph to point out: \"This is an adult cicada. See the wings and the long legs? This is what happens after many years underground!\"\n   - Emphasize: \"Some cicadas stay underground as nymphs for **17 years!** They drink juice from plant roots the whole time.\"\n\n3. **Introduce and define key vocabulary** (5 minutes):\n   - **Metamorphosis:** The way an animal's body changes and develops as it grows from a baby to an adult. (For cicadas, we call this *incomplete metamorphosis* because they don't have a pupal stage like butterflies do—but keep this simple for Fifth Grade.)\n   - **Nymph:** The young form of a cicada that lives underground and looks different from an adult. It eats plant root sap.\n   - **Adaptation:** A body part or behavior that helps an animal survive in its environment. (Point to the adult cicada's wings, legs, and mouthparts.)\n   - **Life cycle:** All the stages an animal goes through from birth to adulthood and reproduction.\n   - **Sap:** The watery juice inside plants that carries water and nutrients.\n\n4. **Connect back to the photograph and Explore activity** (3 minutes):\n   - \"Remember when we asked, 'What is the cicada eating?' The answer is plant sap! It uses its special mouthpart (like a straw) to drink juice from plants and tree branches, just like the one in our photo.\"\n   - \"The cicada depends on plants for food. The plant loses a tiny bit of sap, but the cicada grows big and strong. They're connected!\"\n\n5. **Check for understanding:**\n   - Ask students to turn to a partner and explain: \"What are the four stages of a cicada's life, starting from the egg?\"\n   - Take 2–3 quick verbal responses.\n   - Use a quick show of hands: \"Who thinks a cicada nymph eats the same thing as an adult cicada?\" (Both eat plant sap—yes!)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Life cycle** | All the stages an animal goes through from birth until it becomes an adult. |\n| **Nymph** | The young form of a cicada that lives underground. It looks different from an adult and eats plant root sap. |\n| **Metamorphosis** | The way an animal's body changes and develops as it grows bigger and changes form. |\n| **Adaptation** | A special body part or behavior that helps an animal survive in its home. |\n| **Sap** | The watery juice inside plants that carries water and nutrients to help the plant grow. |\n\n**Expected Student Outcomes:**\n- Students can identify the four main stages of a cicada's life cycle.\n- Students understand that both nymphs and adult cicadas eat plant sap.\n- Students recognize that cicadas depend on plants for food.\n- Students use new vocabulary correctly in sentences.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding of cicada life cycles and plant-insect relationships to develop a model showing the movement of matter (food and energy) between plants and cicadas.\n\n**Materials (per group of 2–3):**\n- Large sheet of poster board or paper (11\" × 17\")\n- Colored markers or pencils\n- Pre-cut pictures or drawings of:\n  - A plant/tree with roots and branches\n  - Underground soil\n  - A cicada nymph\n  - An adult cicada\n  - The sun\n- Glue or tape\n- Arrows (pre-cut or drawn)\n- Sentence frame cards (printed):\n  - \"The plant makes food with help from the sun and water.\"\n  - \"The cicada nymph eats plant sap from the roots.\"\n  - \"The cicada grows bigger and stronger from the food it eats.\"\n  - \"The adult cicada eats plant sap from branches and leaves.\"\n  - \"Energy and matter move from plants to cicadas.\"\n\n**Activity:**\n\n1. **Introduce the task:** \"Now you're going to build a model showing how plants and cicadas are connected. Think about how matter and energy move from the plant to the cicada.\"\n\n2. **Provide step-by-step directions:**\n   - \"Arrange your pictures on the poster to show a plant (with roots, soil, and branches) and a cicada at different life stages.\"\n   - \"Use arrows to show where the cicada gets its food. Start with the sun and water helping the plant, then show the cicada eating the plant sap.\"\n   - \"Glue the sentence frame cards on your model to explain what is happening at each step.\"\n   - \"Write one sentence on your poster explaining how plants help cicadas grow.\"\n\n3. **Teacher Role:**\n   - Circulate and ask: \"Where does the plant get its energy?\" (Answer: the sun), \"How does the cicada get energy?\" (Answer: by eating plant sap), \"Why is the sap important to the cicada?\" (Answer: it gives the cicada energy and materials to grow).\n   - Encourage students to think about the **connection** and **dependency** between the two organisms.\n\n4. **Expected Student Outcomes:**\n   - Students create a model showing the plant and cicada connected by arrows indicating food/matter transfer.\n   - Students explain with words or drawings how the plant provides food (sap) that the cicada needs to grow.\n   - Students demonstrate understanding that matter and energy move from plants to cicadas.\n   - Students recognize that plants are necessary for cicada survival.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of cicada life cycles, adaptations, and plant-insect relationships.\n\n**Formative Assessment (during the lesson):**\n- **During Explore:** Review student observation worksheets and life cycle diagrams to identify misconceptions (e.g., confusion about where cicadas live or how long they live).\n- **During Explain:** Use the partner explanation task to listen for accurate vocabulary use and understanding of life stages.\n- **During Elaborate:** Observe student models and check that arrows correctly show food/matter moving from plants to cicadas.\n\n**Summative Assessment – Exit Ticket (end of Session 2):**\n\nProvide each student with a printed or digital exit ticket with these questions. Students answer individually in 5–7 minutes.\n\n**Exit Ticket Prompt:**\n\n*Name: _____________ Date: _____________*\n\n**1. Draw the four stages of a cicada's life cycle. Label each stage.**\n\n**2. What does a cicada eat? Where does the cicada get its food?**\n   - ☐ It eats plants by drinking sap from roots and branches.\n   - ☐ It eats other insects.\n   - ☐ It gets energy from sunlight.\n\n**3. Explain why a cicada depends on plants. Use the word \"sap\" in your answer.**\n\n*(Example: A cicada depends on plants because...)*\n\n**4. True or False: A cicada nymph looks exactly the same as an adult cicada.**\n\n*(Circle your answer and explain why.)*\n\n---\n\n**Success Criteria for Student Understanding:**\n\n| Criteria | Proficient | Developing |\n|----------|-----------|-----------|\n| **Life Cycle Knowledge** | Student draws and labels all four stages in correct sequence (egg, underground nymph, above-ground nymph, adult). | Student identifies 2–3 stages or puts them slightly out of order. |\n| **Food Source** | Student explains that cicadas eat plant sap and identifies this as the reason they depend on plants. | Student knows cicadas eat plants but cannot fully explain why or what part of the plant. |\n| **Vocabulary Use** | Student uses terms like \"life cycle,\" \"nymph,\" \"adaptation,\" and \"sap\" correctly. | Student uses 1–2 terms correctly; may confuse others. |\n| **Argument Supported by Evidence** | Student argues that cicadas need plants and provides specific evidence (e.g., \"Cicadas eat sap, which plants have, and sap gives them energy to grow\"). | Student states cicadas need plants but provides limited or vague reasoning. |\n\n---\n\n## Differentiation\n\n### Support (for struggling learners):\n\n1. **Provide a visual life cycle strip:**\n   - Pre-sequence the four life cycle images and ask the student to trace the order with a finger, then glue them in sequence (rather than figuring out the order independently). This reduces cognitive load while still engaging the student.\n\n2. **Sentence frames for verbal or written responses:**\n   - Instead of open-ended questions, provide sentence starters: \"A cicada eats ____________ from the ____________.\" \"A nymph lives ____________.\" This scaffolds language production.\n\n3. **Pair with a peer mentor during Explore:**\n   - Assign a stronger reader/writer to work alongside the student, allowing them to listen to ideas, observe strategies, and contribute observations without pressure to lead.\n\n### Challenge (for advanced learners):\n\n1. **Research and present on periodical cicadas:**\n   - Provide access to kid-friendly articles or videos about the famous 17-year or 13-year cicada cycles (periodical cicadas). Ask: \"Why do you think some cicadas stay underground for 17 years? What might be the advantage?\" Students present findings to the class.\n\n2. **Create a detailed food web or food chain:**\n   - Expand the plant-cicada model to include predators (birds, wasps) and decomposers. Challenge students to explain: \"What would happen to the bird population if all the cicadas disappeared?\" This deepens ecosystem thinking.\n\n3. **Compare cicada metamorphosis to other insects:**\n   - Provide pictures of insect life cycles (butterfly, grasshopper, ladybug). Ask students to compare and contrast incomplete vs. complete metamorphosis. Create a Venn diagram: \"How are cicadas and butterflies alike? How are they different?\"\n\n---\n\n## Extension Activities\n\n1. **Cicada Sound Investigation (Auditory & Research):**\n   - Play a recording of cicada sounds (freely available online; search \"cicada sounds\"). Discuss: \"Why do you think cicadas make this loud sound? What purpose might it serve?\" If available, show a video of male cicadas vibrating their abdomens. Extend: Students research and write a short paragraph: \"Why do you think only male cicadas sing?\" (Hint: mating behavior.) This connects to life cycles and survival behaviors.\n\n2. **Design a Cicada Habitat Diorama (Engineering & Application):**\n   - Students design and build a small diorama showing both underground (nymph feeding on roots) and above-ground (adult on branches) cicada habitats. Include labels for sap sources, soil, roots, branches, and leaves. Display and have students explain their choices: \"Why did you put the nymph under the soil? Why did you show sap in the roots?\" This reinforces habitat needs and life stage adaptations.\n\n3. **Cicada Life Cycle Comic Strip or Graphic Novel (Creative Expression & Summarization):**\n   - Students create a 4-panel comic strip showing the cicada's journey from egg to adult. Each panel includes a simple illustration and a caption explaining what is happening and what the cicada needs at that stage. This provides a creative summary and is especially engaging for visual learners.\n\n---\n\n## Alignment Summary\n\nThis lesson directly aligns with **5-LS2-1** by developing a model that shows the movement of matter (plant sap) among plants and cicadas, and how that matter supports the cicada's growth and life cycle. It also supports **5-LS1-1** by having students argue that plants (as the source of sap) provide materials that cicadas need to grow. The cicada photograph serves as the concrete anchor for all abstract concepts, making the learning experience grounded, visible, and memorable for Fifth Grade students.",
  "inputTokens": 2835,
  "outputTokens": 4488,
  "cost": 0.025275000000000002,
  "generatedAt": "2026-02-13T01:07:13.302Z"
}