{
  "title": "Cicada Shell",
  "category": "life-science",
  "imageFile": "cicada_shell.jpg",
  "imagePath": "images/life-science/cicada_shell.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Cicada Shells on Tree Bark\n\n### Core Science Concepts from Image Analysis\n\n- **Animal life cycles and growth:** Cicadas shed their outer skin (exoskeleton) as they grow, leaving behind a brown shell-like structure on trees and bark.\n- **Organism needs and habitats:** Cicadas need trees and plants to survive—they live on and feed from trees, and use them as shelter during their development.\n- **Observable patterns in nature:** The presence of cicada shells on tree bark shows evidence that animals live in trees and use them in specific ways.\n- **Structural features of animals:** The shed shell displays the shape and body structure of the cicada, showing students what this animal looks like.\n\n---\n\n### Lesson Title\n\n**Whose Shell Is This? Discovering Cicadas and How They Grow**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 30-minute sessions (or one 50-60 minute session if taught consecutively)\n- **NGSS Standards:** K-LS1-1 (Use observations to describe patterns of what plants and animals need to survive)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Identify the cicada shell as evidence that an animal lived in or on a tree.\n- Observe and describe what animals need to survive (shelter, food, water).\n- Recognize that trees and plants provide homes and food for animals.\n- Use observations to explain why cicadas need trees.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-12 minutes)\n\n**Objective:** Capture student curiosity about the mysterious shell found on tree bark and activate prior knowledge about animals and trees.\n\n**Materials:**\n- Photograph of the cicada shell on tree bark (displayed on screen, printed, or shown on a document camera)\n- Optional: Real cicada shell (if available—handle gently)\n\n**Activity:**\n\n1. **Display the photograph** on a screen or large print. Point to the brown shell in the center and say: \"Look carefully at this tree bark. What do you see that looks unusual or interesting?\"\n\n2. **Ask these discovery questions** (pause after each to allow students to think and respond):\n   - \"What is this brown, bumpy thing on the tree? Has anyone ever seen something like this before?\"\n   - \"Do you think this is a toy, or something real? How can you tell?\"\n   - \"Could this be part of an animal? What animal do you think it might be?\"\n   - \"Why do you think an animal's shell would be left behind on a tree?\"\n\n3. **Make a prediction prompt:** \"I'm going to tell you something amazing—this is NOT a dead animal. A living creature made this shell and left it behind! Can you guess why an animal would leave its old shell on a tree?\"\n\n4. **Write student predictions** on chart paper or a whiteboard. Accept all ideas without judgment—this activates their prior knowledge and curiosity.\n\n**Transition:** \"Let's investigate and discover the truth about this mysterious shell and the amazing animal that made it!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover through observation and hands-on exploration what the shell tells us about the animal and why it needs a tree.\n\n**Materials:**\n- Photograph of cicada shell (printed copies for pairs or small groups, or displayed on screen)\n- Magnifying glasses (1 per pair or small group)\n- Real cicada shell (if available and safe to handle)\n- Chart paper or large sheet of paper (one per pair/group)\n- Crayons, colored pencils, or markers\n- Sticky notes or labels (optional)\n\n**Activity:**\n\n1. **Organize students** into pairs or small groups of 3-4.\n\n2. **Distribute materials:** Give each group a printed photograph (or access to the large displayed image) and a magnifying glass.\n\n3. **Guided observation exploration:**\n   - \"Use your magnifying glass to look very carefully at the shell. You are scientists now! What do you notice?\"\n   - \"Touch the photograph or the real shell gently. What does it feel like? Is it smooth or bumpy? Hard or soft?\"\n   - \"Look at the shape. Can you see where the head might be? Where legs might be? Draw what you see on your chart paper.\"\n\n4. **Record observations:**\n   - Students draw the shell on chart paper and label parts they observe (head, legs, bumpy sections, where it's attached to the bark).\n   - Teacher circulates and asks: \"Why do you think the shell is brown?\" \"Why is it stuck to the tree?\" \"Could the animal that lived in this shell have lived underground? Why or why not?\"\n\n5. **Connection to the photograph:**\n   - Point out the green lichen and tree bark surrounding the shell. \"Notice all the living things on this tree. The shell is in a safe place. Why might an animal choose this spot?\"\n\n**Teacher Role:**\n- Ask open-ended questions rather than giving answers.\n- Encourage students to observe carefully and describe what they see using sensory language.\n- Guide thinking with prompts like: \"What else do you notice?\" and \"Why do you think that?\"\n- Validate observations without confirming identity yet (save formal introduction for Explain phase).\n\n**Expected Student Outcomes:**\n- Students draw or describe the shell's shape and features.\n- Students observe and note texture, color, and position on the tree.\n- Students record ideas about why the shell is on a tree and what it might tell us.\n\n---\n\n#### 3. EXPLAIN (12-15 minutes)\n\n**Objective:** Introduce formal vocabulary and explain the cicada life cycle concept after exploration.\n\n**Materials:**\n- Chart paper with pre-written vocabulary terms\n- Photograph of cicada shell (displayed for group reference)\n- Picture of a live cicada (if available, from a book or image)\n- Picture of trees and plants (for context)\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Ask 2-3 groups to share their drawings and observations.\n   - Highlight observations: \"You noticed it was brown and bumpy!\" \"You saw it was stuck to the tree!\"\n   - Affirm all descriptions without correction.\n\n2. **Introduce the cicada and the concept (7-10 minutes):**\n   - \"The animal that made this shell is called a **cicada**. A cicada is an insect—a small animal with six legs.\"\n   - Show a picture of a live cicada: \"This is what a cicada looks like when it's alive and moving.\"\n   - \"Here's something amazing: When cicadas grow, their skin gets too tight, just like when you outgrow your clothes. So they wiggle out of their old skin and leave it behind. We call this old skin a **shell** or **exoskeleton**.\"\n   - Point to the photograph shell: \"This is the empty shell the cicada left behind. The cicada is no longer in here—it crawled out and flew away!\"\n\n3. **Explain why cicadas need trees (connect to K-LS1-1):**\n   - \"Cicadas need several things to survive. Let's see if you can figure them out by looking at where we found this shell.\"\n   - Point to the tree in the photograph: \"What does a cicada need from a tree?\" Guide students to discover:\n     - **Food:** \"Cicadas drink juice from plants and trees.\"\n     - **Shelter:** \"Trees provide a safe place to hide and grow.\"\n     - **Protection:** \"Being on a tree keeps them safe from animals on the ground.\"\n\n4. **Key vocabulary instruction:**\n\n   | Term | Student-Friendly Definition |\n   |------|---------------------------|\n   | **Cicada** | A small insect with six legs that lives on trees and plants. |\n   | **Shell** (or **exoskeleton**) | The hard outer skin that covers a cicada's body. When a cicada grows, it sheds its old shell and leaves it behind. |\n   | **Shed** | To leave behind or take off. Cicadas shed their shells when they grow too big. |\n   | **Insect** | A small animal with six legs and a body divided into parts. |\n   | **Survive** | To stay alive and healthy. Animals need food, water, shelter, and safety to survive. |\n\n5. **Check for understanding:**\n   - \"Why do you think the cicada shell is still on the tree? Is the cicada still inside?\" (No—it crawled out and is alive elsewhere.)\n   - \"What did the cicada need from this tree?\" (Food from the plant juice, shelter, safety.)\n   - \"Have you ever outgrown clothes? A cicada outgrows its skin the same way!\"\n\n**Expected Student Outcomes:**\n- Students understand that a cicada is a real animal that lives on trees.\n- Students learn that the shell is not the cicada anymore—it's what the cicada left behind.\n- Students can identify at least two things cicadas need from trees (food and shelter).\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding by investigating what other animals need trees for survival and exploring their own local environment.\n\n**Materials:**\n- Chart paper or whiteboard\n- Images of different tree-dwelling animals (birds, squirrels, insects, caterpillars) OR real observations from outside if available\n- Crayons, markers, colored pencils\n- Paper for drawing or writing\n- Optional: Pictures of trees with labeled parts (roots, trunk, branches, leaves)\n\n**Activity:**\n\n**Option A: Comparative exploration (indoor)**\n1. Show images or photographs of other animals that live on trees: birds, squirrels, caterpillars, beetles, ants.\n2. Ask: \"These animals also live on trees. What do you think they need from the tree? Is it the same as what cicadas need, or different?\"\n3. Create a class chart:\n   - **Animals:** cicada, bird, squirrel, caterpillar\n   - **What they need from the tree:** food (draw or write)\n4. Students draw their own animal that lives on a tree and label what it needs from the tree.\n\n**Option B: Outdoor exploration (if weather permits)**\n1. Take students on a brief walk to observe real trees (even if in a school courtyard or nearby park).\n2. Look for evidence of animals: insect shells, bird nests, holes in bark, spider webs, animal droppings.\n3. Ask: \"What animals live here? How do you know? What do they need from this tree?\"\n4. Return indoors and have students draw or dictate what they found.\n\n**Option C: Tree needs and survival role-play**\n1. Assign students roles: cicada, bird, squirrel, leaf, tree.\n2. Act out a simple scenario: \"The tree gives the cicada food (from the sap). The cicada gives the tree... a space to clean its shell!\"\n3. Discuss: \"Why do trees need animals too?\"\n\n**Teacher Role:**\n- Facilitate comparison thinking without leading to a single \"right\" answer.\n- Encourage observation of similarities and differences.\n- Ask follow-up questions: \"Why do you think both cicadas and birds need trees?\" \"What's the same? What's different?\"\n\n**Expected Student Outcomes:**\n- Students recognize that multiple animals depend on trees.\n- Students extend the concept of \"needs\" to other organisms.\n- Students begin to understand simple relationships between animals and their environment.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of what animals need to survive and the connection between cicadas and trees.\n\n**Activity:**\n\n**Formative Assessment (throughout lesson):**\n- Observe and listen during group exploration. Do students notice the shell's features? Do their questions show curiosity about why it's on the tree?\n- During share-out: Can students describe what they observed using sensory language?\n- During explanations: Do students connect the shell to an animal? Can they name at least one thing cicadas need from trees?\n\n**Exit Ticket / Summative Assessment:**\nConduct a brief individual or small-group conversation (2-3 minutes per child) using these prompt questions:\n\n1. **\"Tell me about the shell we found on the tree. What animal made it?\"** \n   - Success: Student identifies it as a cicada shell or explains that an insect left it behind.\n\n2. **\"Why do you think cicadas live on trees? What do they get from a tree?\"**\n   - Success: Student identifies at least one need: food, shelter, safety, or water.\n\n3. **\"The cicada is no longer in this shell. Where do you think it went?\"**\n   - Success: Student demonstrates understanding that the cicada outgrew its shell, left it, and is now elsewhere (alive and growing).\n\n**Alternative Assessment Option (for groups):**\n- Show the photograph again. Ask: \"Tell me one thing you learned about cicadas\" and \"Tell me one way trees help animals survive.\"\n- Record responses on audio or in writing.\n\n**Success Criteria:**\n- ✓ Students identify the shell as evidence of a cicada (an animal).\n- ✓ Students name at least one thing cicadas need from trees.\n- ✓ Students understand that the shell is empty and that the living cicada left it behind.\n- ✓ Students use observations to explain why animals need trees (directly aligns with K-LS1-1).\n\n**Expected Student Outcomes:**\n- Most kindergarteners will recognize the shell as part of an animal and can name at least one reason animals need trees.\n- Some students will make deeper connections, such as \"Trees give food and homes to many animals.\"\n- All students will have observed carefully and used language to describe what they found.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n1. **Simplified vocabulary:** Use shorter, concrete terms. Instead of \"exoskeleton,\" say \"old skin\" or \"shell.\" Repeat key words frequently and pair with visuals.\n2. **One-on-one observation:** Pair students with a buddy or teacher to observe the shell magnified. Ask simpler questions: \"Is this bumpy or smooth?\" \"Do you see legs?\"\n3. **Pre-teach with a story:** Before the lesson, read a short, simple story about insects or animals that live on trees (e.g., *The Greedy Python* or *Bugs* by Gail Gibbons). This activates background knowledge and builds context for the cicada shell.\n4. **Provide sentence stems for sharing:** \"The shell is ___.\" \"The cicada needs ___.\" This supports language production.\n\n**Challenge (for advanced learners):**\n1. **Dig deeper into life cycles:** Show pictures of a cicada egg, nymph, and adult. Ask: \"How many times do you think a cicada sheds its shell as it grows?\" Explain that cicadas shed their shells many times before they become adults.\n2. **Investigate other shed animal structures:** Provide pictures of snake skins, butterfly cocoons, or bird feathers. Ask: \"What other animals leave things behind? How are these things the same or different from the cicada shell?\"\n3. **Predict and test:** \"What other trees might have cicada shells? Why?\" Take a picture walk around the school to search for other insects or animal evidence on plants. Document findings.\n4. **Connect to personal growth:** \"You shed skin too! Not all at once like a cicada, but a little bit. Why do you think animals and people need to shed or change as they grow?\"\n\n---\n\n### Extension Activities\n\n1. **\"Animals and Trees\" matching game:** Create a simple matching activity pairing pictures of animals (bird, squirrel, caterpillar, cicada, beetle) with pictures of things they get from trees (food, shelter, water, nesting material). Students draw lines to match or sort into groups.\n\n2. **\"Tree Detective\" scavenger hunt:** (Can be done indoors with pictures or outdoors in nice weather.) Provide students with a simple picture guide of things to find on or near trees (insect shell, bird feather, animal droppings, spiderweb, hole in bark, rough bark, smooth bark). Students check off or draw what they find and share discoveries.\n\n3. **Cicada lifecycle collage:** Provide pre-cut pictures or have students draw and color the stages: egg on a tree, nymph underground, nymph climbing up tree, shedding shell on tree trunk, adult cicada flying. Assemble in order on a long strip of paper. Label with teacher's help: \"Cicada grows and changes!\"\n\n4. **Song or chant:** Create a simple class song to the tune of \"Twinkle, Twinkle Little Star\":\n   > *Cicada, cicada on the tree,*\n   > *What do you need to grow so free?*\n   > *Food and shelter, safe and sound,*\n   > *Shedding shells you've left around!*\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 124,
  "outputTokens": 3947,
  "cost": 0.0264565,
  "generatedAt": "2026-02-13T03:49:55.298Z"
}