{
  "id": 78,
  "title": "Cicada",
  "category": "life-science",
  "imageFile": "cicada.jpg",
  "imagePath": "images/life-science/cicada.jpg",
  "gradeLevel": "third-grade",
  "content": "## 📸 Photo Description\n\nA large cicada with golden-brown coloring sits on a tree branch. You can see its big, clear wings with dark lines running through them. The cicada has large eyes and a thick body, and it's holding onto the bark with its strong legs.\n\n## 🔬 Scientific Phenomena\n\nThis image captures the **Anchoring Phenomenon** of cicada emergence and adult transformation. The cicada has recently molted from its nymph stage, shedding its old exoskeleton to reveal its adult form with fully developed wings. This process is called metamorphosis, specifically incomplete metamorphosis, where the insect goes through three life stages (egg, nymph, adult) rather than four. The cicada's positioning on the tree bark represents its instinctual behavior to find a secure surface for this vulnerable transformation process.\n\n## 📚 Core Science Concepts\n\n1. **Life Cycles and Metamorphosis**: Cicadas demonstrate incomplete metamorphosis, progressing from egg to nymph to adult without a pupal stage.\n\n2. **Adaptation and Survival**: The cicada's strong claws, protective coloration, and wing structure are adaptations that help it survive in its tree habitat.\n\n3. **Animal Behavior**: Cicadas exhibit instinctual behaviors like climbing trees, molting in safe locations, and eventually producing sounds to attract mates.\n\n4. **Body Structure and Function**: The cicada's body parts (wings for flight, legs for gripping, eyes for seeing) are specifically designed for its survival needs.\n\n<pedagogical-tip>Use the \"See, Think, Wonder\" thinking routine when introducing this image. Have students first observe what they see, then share what they think is happening, and finally express what they wonder about the cicada.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to explore cicada sounds by playing audio recordings, showing videos, and allowing students to create their own \"cicada sounds\" with instruments or voice. This supports auditory learners and students who benefit from multi-sensory experiences.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In**: At the cellular level, the cicada's exoskeleton is made of chitin, a tough material that provides protection but cannot grow. When the cicada outgrows its shell, special hormones trigger the molting process where the old exoskeleton splits and the cicada emerges with a new, larger one.\n\n2. **Zoom Out**: Cicadas play important roles in forest ecosystems. As nymphs, they aerate soil and recycle nutrients. As adults, they serve as food for birds, spiders, and other predators. Their mass emergence every 13-17 years (for some species) affects the entire food web and forest health.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception**: \"Cicadas are the same as grasshoppers or crickets.\"\n   **Clarification**: While all are insects, cicadas have different life cycles, body structures, and behaviors. Cicadas spend most of their lives underground as nymphs.\n\n2. **Misconception**: \"The cicada in the photo is sick or dying because it's not moving.\"\n   **Clarification**: Cicadas often remain still during and after molting to let their new exoskeleton harden and their wings dry.\n\n3. **Misconception**: \"All cicadas come out every 17 years.\"\n   **Clarification**: Only some cicada species are periodical. Many species emerge annually during summer months.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation**: 3-LS1-1 - Develop models to describe that organisms have unique and diverse life cycles but all have in common birth, growth, reproduction, and death.\n- **Disciplinary Core Ideas**: [[NGSS:DCI:3-LS1.B]] - Growth and Development of Organisms\n- **Crosscutting Concepts**: [[NGSS:CCC:Patterns]] in the natural world can be observed and used as evidence\n\n## 💬 Discussion Questions\n\n1. What do you notice about the cicada's body parts and how might each part help it survive? (Bloom's: Analyze | DOK: 2)\n\n2. How do you think a cicada's life underground as a nymph compares to its life above ground as an adult? (Bloom's: Compare | DOK: 2)\n\n3. Why might it be important for cicadas to have strong claws and the ability to hold tightly to tree bark? (Bloom's: Evaluate | DOK: 3)\n\n4. What patterns do you see in how insects like cicadas grow and change throughout their lives? (Bloom's: Synthesize | DOK: 3)\n\n## 📖 Science Vocabulary\n\n* **Cicada:** An insect that spends most of its life underground and emerges to sing and find a mate.\n* **Metamorphosis:** The process of changing from one life stage to another as an animal grows.\n* **Nymph:** The young stage of insects like cicadas that looks similar to adults but without wings.\n* **Exoskeleton:** The hard outer shell that protects an insect's body.\n* **Molt:** When an animal sheds its old skin or shell to grow bigger.\n* **Adaptation:** A special feature that helps an animal survive in its environment.\n\n## 📚 External Resources\n\n**Children's Books:**\n- Cicadas! Strange and Wonderful by Laurence Pringle\n- Waiting for Wings by Lois Ehlert\n- The Very Hungry Caterpillar by Eric Carle\n\n**YouTube Videos:**\n- \"Cicada Emergence - Life Cycle\" - Shows the complete molting process of cicadas emerging from their nymph shells (https://www.youtube.com/watch?v=R0ys8Tdefg4)\n- \"Why Do Cicadas Make That Noise?\" by SciShow Kids - Explains how and why cicadas create their distinctive sounds (https://www.youtube.com/watch?v=mah26og11ms)",
  "generatedAt": "2026-02-04T18:00:13.052Z"
}