{
  "title": "Cicada Shell",
  "category": "life-science",
  "imageFile": "cicada_shell.jpg",
  "imagePath": "images/life-science/cicada_shell.jpg",
  "content": "# Engineering Design Challenge: Cicada Shell\n\n### Visible Elements in Photo\n\n- A tan/brown insect exoskeleton (shed cicada shell) clinging to tree bark\n- Lichen (pale green, crusty patches) covering the bark surface\n- Tree bark with varied texture and color (gray, brown, white patches)\n- The shell's segmented, ridged structure with distinct head and body sections\n- Organic debris and crevices in the bark that provide grip points\n\n---\n\n### Reasonable Inferences\n\n1. **From the shell's clinging position** → The exoskeleton adheres to the bark without glue or fasteners; it must have a design that grips or locks onto rough, irregular surfaces.\n2. **From the lichen and bark texture** → Natural outdoor surfaces are uneven and variable; a structure that works on one spot must adapt to different textures.\n3. **From the shell's segmented structure** → The overlapping rings and flexible joints allow the insect to grip and hold weight on a vertical or angled surface despite gravity.\n\n---\n\n### Engineering Task\n\n#### **K–2 Version**\n**\"Build a Bug Holder\"**\n\nYour job: Make a hollow shape (like a cup or shell) that can stick to a bumpy stick or tree branch without falling off. You can use paper, tape, and natural materials. Your holder must:\n- Stay on the stick even when you gently tilt it\n- Not use glue or tape on the stick itself (only on your holder)\n- Have bumps, ridges, or grippers on the inside to hold tight\n\n*Why?* Just like a cicada sheds its shell and leaves it clinging to bark, your holder needs a good grip!\n\n---\n\n#### **3–5 Version**\n**\"Design a No-Glue Clamp for Tree Bark\"**\n\nEngineers need structures that grip irregular surfaces without damaging them. Your challenge: Design and build a hollow shell or clamp (inspired by the cicada exoskeleton) that:\n\n- **Grips a cylindrical or angular bark-textured surface** (tree branch, PVC pipe wrapped in burlap, or actual bark sample)\n- **Holds a 500g mass** (water bottle, sand bag) suspended below for at least 30 seconds\n- **Uses only interlocking tabs, ridges, friction, or leverage**—no adhesives or fasteners through the surface\n- **Measures no more than 10 cm in length** along the grip zone\n- **Survives at least 3 release-and-reattach cycles** without breaking\n\nSuccess criteria: Your clamp stays secure, the mass doesn't slip, and the grip point shows no cracks or permanent damage.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo works best as an entry to the EDP because students must first *observe and wonder*: \"How does this shell stay stuck without glue?\" Nature provides the real-world problem (adhering to irregular surfaces), and students must then ask what features of the shell make gripping possible. This inquisitive phase builds motivation before they imagine solutions.\n\n---\n\n### Suggested Materials\n\n- **Paper cups, paper towel tubes, or rolled poster board** (base structure)\n- **Tape (duct, masking, or painter's tape)** (flexible fastening)\n- **Craft foam sheets or foam pipe insulation** (moldable gripping ridges)\n- **Rough textured materials: burlap, sandpaper, or corrugated cardboard** (friction surface)\n- **Tree branches, PVC pipes, or dowels** (test surfaces to grip)\n- **Optional: rubber bands, clothespins, or clothesline** (mechanical advantage)\n\n---\n\n### Estimated Time\n\n- **K–2**: 45–60 minutes (includes observation, design sketch, building, and one round of testing)\n- **3–5**: Two 45-minute sessions (Day 1: observe, sketch design, material prep; Day 2: build, test, troubleshoot, redesign)\n\n---\n\n### Why This Works for Teachers\n\nThis challenge directly addresses **NGSS 3-5-ETS1-1** (*Ask questions to define problems*) and **K-2-ETS1-1** (*ask questions, make observations, and gather information*) by anchoring the design task in a visible natural structure, making the \"why we build\" question concrete and observable rather than abstract.",
  "inputTokens": 2329,
  "outputTokens": 1009,
  "cost": 0.007374,
  "generatedAt": "2026-02-09T13:37:51.513Z"
}