{
  "title": "Crab",
  "category": "life-science",
  "imageFile": "crab.jpeg",
  "imagePath": "images/life-science/crab.jpeg",
  "content": "# Engineering Design Challenge: Crab Burrow & Shelter\n\n### Visible Elements in Photo\n- A crab with tan/brown coloring positioned on sand\n- Two prominent eye stalks (antennae-like structures) extending upward\n- Multiple walking legs visible on the sand surface\n- Granular sand substrate surrounding the crab\n- A shallow depression or burrow entrance visible near the crab's body\n\n### Reasonable Inferences\n- **From burrow depression**: Crabs dig and maintain underground shelters for protection from predators and harsh conditions.\n- **From eye stalks & leg structure**: The crab's body design allows it to sense danger and move quickly across unstable sand surfaces.\n- **From sand environment**: The crab must function in a loose, shifting material that offers both habitat and engineering challenge.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Safe Home for a Sand Crab**\n\nYour job is to design and build a burrow (hiding place) for a pretend sand crab using sand and other materials. Your crab home should:\n- Have an opening the crab can fit through\n- Keep the crab safe from a \"predator\" (teacher's hand swooping down)\n- Stay standing for at least 30 seconds\n\nTry different ways to pack, pile, and shape the sand. What works best?\n\n---\n\n**3-5: Design a Stable Burrow System**\n\nA hermit crab needs a burrow that is both safe and structurally sound. Your challenge: Design and build a burrow system using sand and reinforcement materials that meets these criteria:\n\n**Success Criteria:**\n- Entrance hole must be between 1–2 inches in diameter\n- Burrow tunnel must extend at least 4 inches into the sand without collapsing\n- Structure must withstand a \"wave surge\" (pouring water gently over it) without the entrance caving in\n- Must include at least one internal chamber (wider space inside)\n\n**Design Constraints:**\n- You may use sand, small pebbles, and ONE reinforcement material (straw, thin sticks, or clay)\n- Total build time: 20 minutes\n- Test your design, observe failures, and redesign once\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real organism solving a real environmental challenge (burrowing in unstable sand). Students begin by observing *why* crabs need burrows and *what problems* loose sand creates, then move to designing their own solution. The crab becomes a model for understanding structural engineering in natural systems.\n\n---\n\n### Suggested Materials\n- Sand (beach sand or play sand, 5+ lbs)\n- Water in a spray bottle or cup\n- Small pebbles or shells\n- Dried straw, toothpicks, or thin craft sticks\n- Small cardboard tubes or paper cups (to test tunnel stability)\n- Ruler or measuring tape\n\n---\n\n### Estimated Time\n- **K-2**: 30–40 minutes (exploration + build + test)\n- **3-5**: 50–70 minutes (discussion + design sketch + build + test + redesign cycle)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (*defining and delimiting engineering problems*) and **ETS1.B** (*developing possible solutions*) by asking students to identify the functional requirements of a natural structure and prototype a human-designed alternative that meets the same constraints.",
  "inputTokens": 2198,
  "outputTokens": 789,
  "cost": 0.006143000000000001,
  "generatedAt": "2026-02-12T06:42:49.487Z"
}