{
  "title": "Deceased Deer",
  "category": "life-science",
  "imageFile": "Deceased Deer.jpg",
  "imagePath": "images/life-science/Deceased Deer.jpg",
  "content": "# NGSS Engineering Design Challenge: Deceased Deer Photo\n\n### Visible Elements in Photo\n- A deceased deer (tan/brown fur, four legs extended) lying on ground\n- Decomposing forest floor (wood chips, leaf litter, scattered twigs)\n- Patches of grass and low vegetation nearby\n- Dry soil and organic matter in various states of breakdown\n- Body position suggests the animal came to rest naturally\n\n### Reasonable Inferences\n- **From decomposing body + forest floor**: Nutrients from the deer are being returned to soil through natural decomposition, but this process takes time and space—a real-world scenario where humans must decide how to manage animal remains responsibly.\n- **From visible vegetation patches**: The forest ecosystem continues to function around the remains; students can wonder how materials cycle and what role decomposition plays in nutrient cycling.\n- **From exposed legs and position**: The body is exposed to weather and scavengers, raising questions about how structures or barriers could protect remains or alter decomposition rates.\n\n### Engineering Task\n\n**K-2: Build a Cozy Home for Forest Creatures**\nDesign and build a shelter using sticks, leaves, and soil that keeps small forest animals (like bugs, beetles, and worms) safe and comfortable. Your shelter should use only natural materials you find outside and give creatures a dark, damp place to live. Test it by pouring a little water on top—does the water run off or soak in? Does your shelter stay dry inside?\n\n**3-5: Design a Decomposition Habitat Enclosure**\nEngineers and land managers must manage deceased animals in forests to balance wildlife safety, disease control, and nutrient cycling. Design a protective enclosure using wire mesh, wood stakes, and natural materials that:\n- Protects the remains from large scavengers for at least 2 weeks\n- Allows soil organisms (worms, beetles, fungi) and water to pass through\n- Is at least 1 meter in diameter and stands 30 cm tall\n- Can be built with materials costing under $15\n\nTest your design by placing raw chicken (as a stand-in) inside for 5–7 days and observing what organisms enter, whether predators can break in, and how moisture is managed.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real environmental scenario—animal remains in nature—without showing a solution. Students must first grapple with the *problem*: How do forests handle death naturally, and how can humans respectfully and safely manage animal remains while supporting decomposition and nutrient cycling? This is authentic problem definition grounded in ecology and land stewardship, making it the ideal entry point before planning a structure.\n\n---\n\n### Suggested Materials\n- Wire mesh or hardware cloth (chicken wire)\n- Wood stakes or branches\n- Natural materials: soil, leaves, wood chips, bark\n- Raw chicken pieces or fish (safe stand-in for testing)\n- Containers, rulers, observation sheets\n- Hand tools: garden gloves, shovel, scissors\n\n---\n\n### Estimated Time\n**Two 45-minute sessions** (or one 90-minute block)\n- Session 1: Observe, discuss the problem, design and build (40–45 min)\n- Session 2: Install, observe over 5–7 days, document and test (15 min setup + observation period)\n\n---\n\n### Why This Works for Teachers\nThis task directly supports **NGSS ETS1.B (Developing Possible Solutions)** and **MS-ETS1-2** by asking students to use criteria and constraints to design a solution to a real environmental management problem, while connecting to life-science standards on decomposition, nutrient cycling, and ecosystem interactions—without requiring graphic or upsetting classroom materials.",
  "inputTokens": 2329,
  "outputTokens": 838,
  "cost": 0.0065190000000000005,
  "generatedAt": "2026-02-09T13:15:48.054Z"
}