{
  "title": "Deceased Deer",
  "category": "life-science",
  "imageFile": "Deceased Deer.jpg",
  "imagePath": "images/life-science/Deceased Deer.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- One deceased ungulate (deer) in prone position on ground\n- Tan/brown fur coat with white markings on underside and tail area\n- Four long, thin legs extended outward\n- Decomposed state with visible skeletal structure\n- Ground surface covered with wood chips, leaf litter, and scattered green vegetation\n- Natural outdoor setting (likely forest floor or wildlife area)\n\n---\n\n## Reasonable Inferences\n1. **From decomposed state & outdoor setting** → This organism has been exposed to natural decomposition processes (bacteria, fungi, scavengers, weather) over time, suggesting a need to understand nutrient cycling and habitat restoration.\n2. **From fur and skeletal structure** → This animal once moved through its environment; the rigid position suggests the body is no longer flexible, indicating significant time has passed since death.\n3. **From vegetation patches near body** → Plants continue to grow despite the presence of decomposing organic matter, suggesting soil is still viable for new growth.\n\n---\n\n## Engineering Task\n\n### **K-2 Version:**\n**\"Build a Home for Nature's Helpers\"**\n\nImagine small creatures (bugs, worms, mushrooms) help break down things in nature and put nutrients back into the soil. Design a cozy space where these nature helpers can live and do their important work. Use wood chips, soil, leaves, and sticks to build a special \"decomposition home.\" Make sure your design:\n- Has places for bugs and worms to hide\n- Keeps things damp (like real forest floors)\n- Lets air get in\n\nTest your design by checking if worms or pill bugs want to live in it!\n\n---\n\n### **3-5 Version:**\n**\"Design a Controlled Decomposition Habitat\"**\n\nIn nature, dead organisms are broken down by decomposers (bacteria, fungi, insects, worms). Your challenge: design and build a small-scale decomposition system that speeds up the breakdown of organic waste while measuring nutrient release back into soil.\n\n**Constraints:**\n- Use only classroom materials (see list below)\n- System must fit in a container no larger than a shoebox\n- Must maintain moisture (wet as a wrung-out sponge) for 2+ weeks\n- Must allow air flow to bottom and sides\n\n**Success Criteria (measurable):**\n- Organic material visibly breaks down by 50% after 3 weeks\n- pH of soil layer changes (test with pH strips before/after)\n- Decomposer organisms present (observe with magnifying glass)\n- System produces no bad smells (subjective, but important!)\n\n---\n\n## EDP Phase Targeted\n\n**Ask / Define Problem** ← *This phase fits best.*\n\n**Why:** The photo shows a real-world phenomenon (natural decomposition) but presents a *problem to solve*—how can we harness decomposition safely and efficiently in a controlled way? Students start by observing what happens in nature and asking: \"How can we speed this up?\" or \"How can we use this to improve soil?\" This grounds the task in authentic need-finding before moving to design.\n\n---\n\n## Suggested Materials\n\n1. **Soil** (potting soil or garden soil from outdoors)\n2. **Organic waste** (shredded leaves, grass clippings, vegetable scraps—NO meat/dairy)\n3. **Wood chips or cardboard pieces** (for structure and carbon source)\n4. **Containers** (clear plastic storage boxes, 5-gallon buckets with drainage holes, or terrariums)\n5. **Decomposer starters** (compost from existing pile, or collected worms/pill bugs from outdoors with permission)\n6. **Optional: pH test strips, magnifying glass, thermometer**\n\n---\n\n## Estimated Time\n\n**K-2:** 45–60 minutes (initial build) + 10 minutes per week for 3–4 weeks (observation)\n\n**3-5:** Two 45-minute sessions (design/build + setup) + 15 minutes weekly for 3–4 weeks (measurement & observation)\n\n---\n\n## Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A (defining engineering problems)** and **ETS1.B (designing solutions)** while grounding learning in life science (K-LS1.C: organization for matter and energy flow, 3-LS1.B: information processing, 5-LS1.C: matter and energy in organisms)—students observe a natural system, identify a problem it solves, and engineer a controlled version.",
  "inputTokens": 2196,
  "outputTokens": 1040,
  "cost": 0.007396,
  "generatedAt": "2026-02-12T05:44:15.983Z"
}