{
  "id": 76,
  "title": "Deciduous Trees",
  "category": "life-science",
  "imageFile": "deciduous_trees.jpg",
  "imagePath": "images/life-science/deciduous_trees.jpg",
  "gradeLevel": "first-grade",
  "content": "## 📸 Photo Description\n\nTrees around a lake have leaves that changed colors to red, orange, and yellow. The wooden walkway goes out over the water. Some trees still have green leaves while others look bare.\n\n## 🔬 Scientific Phenomena\n\nThis image represents the **Anchoring Phenomenon** of seasonal change in deciduous trees during autumn. The trees are responding to shorter daylight hours and cooler temperatures by breaking down chlorophyll (the green pigment that helps make food) in their leaves. As chlorophyll disappears, other pigments like carotenoids (yellows and oranges) and anthocyanins (reds) become visible. Eventually, the trees will drop their leaves to conserve water and energy during winter months when photosynthesis becomes less efficient.\n\n## 📚 Core Science Concepts\n\n1. **Seasonal Changes:** Living things respond to changes in their environment throughout the year\n2. **Plant Adaptations:** Trees prepare for winter by changing and dropping their leaves to save energy\n3. **Observable Patterns:** We can observe and predict when trees will change colors each year\n4. **Living vs. Non-living:** Trees are living things that grow, change, and respond to their surroundings\n\n<pedagogical-tip>Use a simple chart to track one tree outside your classroom window throughout the school year. Have students draw and describe what they observe weekly to build understanding of seasonal patterns.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to demonstrate their understanding: drawing pictures, acting out tree changes, singing songs about seasons, or creating leaf rubbings to show different colors and textures.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** Inside each leaf, tiny parts called chloroplasts contain green chlorophyll that captures sunlight to make food for the tree. When it gets cold, the chlorophyll breaks apart and other colors show through.\n\n2. **Zoom Out:** This forest ecosystem is preparing for winter as a whole system. Animals are gathering food, some birds are migrating, and the entire forest community is responding to seasonal changes together.\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception:** Trees die in winter when they lose their leaves.\n   **Clarification:** Deciduous trees are still alive in winter - they're just resting and saving energy until spring.\n\n2. **Misconception:** Leaves change colors because they get cold.\n   **Clarification:** Leaves change colors because of less sunlight and the tree preparing for winter, not just cold temperatures.\n\n3. **Misconception:** All trees lose their leaves in fall.\n   **Clarification:** Only deciduous trees lose their leaves. Evergreen trees (like pine trees) keep their needles all year long.\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation:** 1-LS1-2: Read texts and use media to determine patterns in behavior of parents and offspring that help offspring survive\n- **Disciplinary Core Idea:** [[NGSS:DCI:1-LS1.B]] - Growth and Development of Organisms\n- **Crosscutting Concept:** [[NGSS:CCC:Patterns]]\n\n## 💬 Discussion Questions\n\n1. What do you notice about the different colored leaves in this picture? (Bloom's: Remember | DOK: 1)\n\n2. Why do you think some trees still have green leaves while others have changed colors? (Bloom's: Analyze | DOK: 2)\n\n3. What do you predict this forest will look like in winter? What makes you think that? (Bloom's: Evaluate | DOK: 3)\n\n4. How might the animals living in this forest prepare for the changes happening to the trees? (Bloom's: Apply | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Deciduous:** Trees that lose their leaves every fall and grow new ones in spring\n* **Seasons:** The four parts of the year that have different weather patterns\n* **Chlorophyll:** The green stuff in leaves that helps trees make food from sunlight\n* **Adaptation:** Ways that living things change to survive in their environment\n* **Pattern:** Something that happens the same way over and over again\n\n## 📚 External Resources\n\n**Children's Books:**\n- Red Leaf, Yellow Leaf by Lois Ehlert\n- Why Do Leaves Change Color? by Betsy Maestro\n- Leaf Man by Lois Ehlert\n\n**YouTube Videos:**\n- \"Why Do Leaves Change Colors? | Fall Science for Kids\" - Simple explanation with colorful animations perfect for first graders: https://www.youtube.com/watch?v=yKD4Ya6p1nU\n- \"Seasons Song for Kids | Learn About Spring, Summer, Fall, Winter\" - Catchy educational song about seasonal changes: https://www.youtube.com/watch?v=ksGiLaIx39c",
  "generatedAt": "2026-02-04T17:53:36.984Z"
}