{
  "title": "Deciduous Trees",
  "category": "life-science",
  "imageFile": "deciduous_trees.jpg",
  "imagePath": "images/life-science/deciduous_trees.jpg",
  "content": "### Visible Elements in Photo\n\n- A wooden boardwalk or pier extending into calm water\n- Metal mesh railings on both sides of the walkway\n- Deciduous trees in autumn foliage (orange, yellow, green, and brown leaves) lining the far shoreline\n- A body of water (lake or river) with visible surface\n- Fallen leaves scattered across the wooden deck\n- Overcast sky with gray and white clouds\n\n---\n\n### Reasonable Inferences\n\n- **From wooden boardwalk + metal railings**: The structure is designed to keep people safe while accessing water or viewing wildlife; it must withstand weather, foot traffic, and water exposure without rotting or rusting.\n- **From fallen leaves on deck**: Seasonal leaf drop creates a maintenance challenge; any structure built near trees needs to handle debris accumulation.\n- **From autumn trees + water habitat**: This location supports diverse plant and animal life; people may want to observe wildlife without disturbing it, suggesting a need for low-impact observation platforms.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Safe Walkway Over Water for Animal Watchers**\n\nImagine animals live in this lake and need a safe space to drink and rest. Build a long bridge using craft sticks and string that animals can walk under without getting wet. Your bridge must have strong railings (use popsicle sticks) on both sides so nothing falls into the water. Test it by placing toy animals underneath and making sure they stay dry!\n\n---\n\n**3-5: Design a Weather-Resistant Observation Deck**\n\nYour task: Design a 60-centimeter-long boardwalk section that allows people to safely observe a lake habitat during fall and winter. Your design must:\n- Support the weight of three textbooks placed on top without sagging more than 1 centimeter\n- Include railings that are at least 30 centimeters tall\n- Use materials that resist water damage and stay strong when exposed to leaves, rain, and temperature changes\n- Allow water and debris to drain through or off the platform\n\nBuild a prototype using wood strips, wire mesh, and fasteners. Test it by pouring water on top and observing how quickly it drains. Measure and record any sagging under load.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows an *existing solution* (the boardwalk) but doesn't reveal why it was built or what problems it solves. Students need to first ask: *Why do people need safe access to water? What happens to wood and metal when exposed to weather and water?* Once they understand the real-world need for durable, safe structures near water, they can design their own version. The natural setting invites observation and questioning before jumping into building.\n\n---\n\n### Suggested Materials\n\n- Wooden craft sticks or paint stirrers (for decking and railings)\n- Metal or plastic mesh/screening (for railings or drainage)\n- String, zip ties, or wire (for fastening)\n- Waterproof tape or wood sealant (optional, for weatherproofing)\n- Textbooks or weights (for load testing)\n\n---\n\n### Estimated Time\n\n**K-2**: 45–60 minutes (20 min. planning, 25 min. building, 15 min. testing and observation)\n\n**3-5**: Two 45-minute sessions or one 90-minute block (20 min. research/planning, 35 min. building, 25 min. testing and data collection)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A (Define Engineering Problems)** by asking students to identify constraints (weather, water exposure, safety) and design criteria (drainage, durability, load-bearing) based on real-world environmental challenges they can see and understand.",
  "inputTokens": 2329,
  "outputTokens": 857,
  "cost": 0.006614,
  "generatedAt": "2026-02-09T13:30:41.077Z"
}