{
  "title": "Earthworm",
  "category": "life-science",
  "imageFile": "earthworm.jpg",
  "imagePath": "images/life-science/earthworm.jpg",
  "content": "# NGSS Engineering Design Challenge: Earthworm Habitat\n\n### Visible Elements in Photo\n- One earthworm on soil surface with visible segmented body structure\n- Mix of green grass blades and dried/tan plant material covering the ground\n- Moist soil visible between plant material\n- Worm positioned horizontally across the surface (not burrowed)\n- Varied textures of decomposing organic matter (leaves, grass fragments)\n\n### Reasonable Inferences\n- **From worm on exposed surface**: Earthworms typically burrow underground to escape predators and find moisture; this worm may need shelter or be returning to soil after rain.\n- **From mixed fresh and decomposed plant material**: The soil contains organic layers that worms consume and move through; a good habitat requires layered soil with food sources.\n- **From moist appearance of worm and soil**: Earthworms depend on soil moisture and would struggle in dry conditions; a habitat design must manage water retention.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\n> **\"Build a Home for a Worm\"**\n>\n> Your job is to design a cozy underground home for an earthworm. The worm needs:\n> - A safe, dark tunnel to live in\n> - Soft soil it can move through\n> - Bits of dead leaves and grass to eat\n> - Just the right amount of wetness (not too dry, not soaked)\n>\n> Using a jar, soil, sand, and plant scraps, layer a worm home. Then predict: will your worm tunnel down, stay at the top, or move around? Build it and watch!\n\n**3-5 Version:**\n> **\"Design and Test an Optimal Earthworm Habitat\"**\n>\n> Earthworms improve soil by tunneling and breaking down organic matter. Your challenge: design a two-layer soil habitat in a clear container that meets these criteria:\n> - **Layer 1 (top)**: Mix soil with decomposed plant material; must be 5–7 cm deep\n> - **Layer 2 (bottom)**: Sandy loam or pure sand; must be 5–7 cm deep\n> - **Moisture requirement**: Soil should feel like a wrung-out sponge (not dusty, not dripping)\n> - **Success measure**: Observe and sketch where the worm burrows within 24 hours. Did it stay in one layer, move between layers, or create new tunnels?\n>\n> Modify one variable (organic matter amount, moisture level, or sand ratio) and test again. Which design change made the worm more active?\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real organism in its natural environment with an implicit challenge: \"What does this creature need to thrive?\" The worm on the surface (unusual behavior) prompts students to define what a *healthy* habitat looks like. Rather than handing them a solution direction, the task asks them to observe, infer needs, and design a testable habitat—making the **Ask** phase the natural entry point.\n\n---\n\n### Suggested Materials\n\n1. **Clear plastic containers or jars** (recycled takeout containers, mason jars, or plastic cups work well)\n2. **Potting soil or garden soil** (or a mix with sand)\n3. **Dry leaves, shredded newspaper, or grass clippings** (decomposed plant matter)\n4. **Water in a spray bottle** (for moisture control)\n5. **Live earthworms** (order from a bait shop or collect from your yard after rain; use 1–3 per habitat)\n\n*Optional add-ons:* black construction paper or cloth to cover containers (worms prefer darkness), thermometer, measuring tape or ruler.\n\n---\n\n### Estimated Time\n\n**K-2**: 20–30 minutes for setup + 5–10 minutes daily observation over 3–5 days  \n**3-5**: 30–40 minutes for design and build + 10 minutes per day for observation and data recording over 5–7 days (or two 30-minute sessions if testing a modified design)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K-ESS2-1** (K-2) and **3-LS4-3** (3-5) by having students design solutions based on observable organism needs and test how habitat conditions affect behavior—authentic engineering applied to a living system they can interact with safely and inexpensively.",
  "inputTokens": 2328,
  "outputTokens": 1028,
  "cost": 0.007467999999999999,
  "generatedAt": "2026-02-09T13:45:11.122Z"
}