{
  "title": "Earthworm",
  "category": "life-science",
  "imageFile": "earthworm.jpg",
  "imagePath": "images/life-science/earthworm.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Earthworms and What They Need\n\n### Core Science Concepts from Image Analysis\n\n- **Animal habitats and basic needs:** Earthworms live in soil and grass environments where they find food, moisture, and shelter to survive.\n- **Observable animal characteristics:** Earthworms have long, segmented bodies with a brown color that helps them blend into their environment; they move by stretching and contracting their bodies.\n- **How animals interact with their environment:** Earthworms tunnel through soil, eat decomposing matter, and help plants by loosening soil and adding nutrients.\n- **Survival patterns:** Earthworms need moisture, darkness, and organic material (food) in soil to stay alive and healthy.\n\n### Lesson Title\n\nWiggly Worms: What Do Earthworms Need to Survive?\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 30-minute sessions (or one 60-minute session with a break)\n- **NGSS Standards:** K-LS1-1 (Use observations to describe patterns of what plants and animals need to survive)\n\n### Learning Objectives\n\nStudents will be able to:\n- Observe and identify an earthworm and describe what it looks like\n- Identify at least two things earthworms need to survive (soil, moisture, food, darkness)\n- Explain in simple words why earthworms need these things to stay alive\n- Make predictions about where earthworms like to live based on what they need\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student curiosity about earthworms using the photograph and activate prior knowledge about animal needs.\n\n- **Materials:**\n  - Photograph of earthworm on grass and soil (displayed on screen, printed, or shown via projector)\n  - Chart paper and markers (for recording student ideas)\n\n- **Activity:**\n  1. Display the photograph and ask students to look closely without talking for 15 seconds.\n  2. Ask these specific discussion questions:\n     - \"What do you see wriggling in this picture? What is this animal?\"\n     - \"What color is the earthworm? Why do you think it is brown?\"\n     - \"Where is the earthworm in this picture? What is around it?\" (soil, grass, green plants)\n     - \"What do you think the earthworm is doing here?\"\n  3. Record student observations on chart paper using their own words (e.g., \"It's a worm,\" \"It's in dirt,\" \"It's brown\").\n  4. Pose a wonder prompt: \"I wonder what earthworms need to live and be healthy. What do you think earthworms need, just like you need food, water, and a home?\"\n  5. Record student predictions on a \"What We Think Earthworms Need\" anchor chart.\n\n- **Transition:** \"Today we are going to be earthworm scientists! We'll watch earthworms move and explore what they like so we can figure out what they need to survive.\"\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students observe live earthworms and discover their preferences for soil, moisture, and dark environments through hands-on investigation.\n\n- **Materials:**\n  - 2-3 live earthworms (obtain from garden or purchase from educational supplier; handle with care)\n  - Clear plastic container or shallow clear dish (so children can see the worm)\n  - Moist soil (about 4 inches deep)\n  - Dry soil in a separate small container\n  - Damp paper towels\n  - Paper towels (dry)\n  - Cardboard or dark cloth to cover part of the container\n  - Magnifying glasses (1 per student or pair)\n  - Hand lenses (optional)\n  - Observation recording sheet (simple pictures: worm, soil, water, darkness—students point to or color what they observe)\n\n- **Activity:**\n  1. Divide the class into 2-3 small groups (or conduct as a whole class with station rotation).\n  2. **Observation Round 1 — Body Features (5 minutes):**\n     - Place one earthworm in a clear container on damp paper towels.\n     - Give each student a magnifying glass.\n     - Ask: \"Look very carefully. What do you see on the worm's body? Count the bumpy parts (segments). Does it have legs? Eyes? A mouth?\"\n     - Students observe and share observations aloud. Teacher records: \"Earthworms have many bumpy parts called segments. They don't have legs. They don't have eyes like we do.\"\n  3. **Observation Round 2 — Movement (5 minutes):**\n     - Watch the worm move on the damp paper towel.\n     - Ask: \"How does the worm move? Does it hop? Crawl? Stretch? Where does it try to go?\"\n     - Students observe and describe movement: \"It wiggles. It stretches and shrinks. It tries to crawl away.\"\n  4. **Observation Round 3 — Preferences (10 minutes):**\n     - Show the worm two choices:\n       - **Soil vs. Paper:** Place the worm where it can crawl onto moist soil or stay on paper. Observe: Does it move toward the soil? Why?\n       - **Wet vs. Dry:** Show the difference between the damp paper towel and a dry paper towel. Does the worm stay on the wet one?\n       - **Light vs. Dark:** Partly cover the container with cardboard. Does the worm move toward the dark side?\n     - Students predict and then observe: \"Where does the worm go? Why?\"\n  5. **Recording:** Students mark or circle pictures on the observation sheet showing: soil, moisture, and darkness.\n\n- **Teacher Role:**\n  - Circulate between groups asking open-ended questions: \"Where is the worm now? Why do you think it went there? What does it seem to like?\"\n  - Keep the worms moist and safe; gently handle to prevent injury.\n  - Ask students not to squeeze or rough handle the worms.\n  - Record key student observations on the anchor chart.\n\n- **Expected Student Outcomes:**\n  - Students observe that earthworms have segmented bodies and move by stretching.\n  - Students notice earthworms move toward moist soil and darkness.\n  - Students recognize earthworms prefer wet environments over dry ones.\n  - Students begin to connect observations to survival needs (worms need moisture and soil to live).\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce key vocabulary and help students connect observations to survival concepts.\n\n- **Materials:**\n  - Chart paper with observations from Explore phase\n  - \"What Earthworms Need to Survive\" poster or sentence strips\n  - Photograph from initial engagement\n  - Picture cards (soil, water/moisture, food, dark place)\n\n- **Activity:**\n  1. **Group Share-Out (5 minutes):**\n     - Ask: \"What did we observe about earthworms?\" Review the observation chart.\n     - Ask: \"Where did the worm try to go? What does that tell us about what it needs?\"\n     - Celebrate observations: \"You were great scientists!\"\n  2. **Introduce Vocabulary (5-7 minutes):**\n     - Teach these terms using the photograph and observations:\n       - **Earthworm:** A small animal that lives in soil and helps plants grow.\n       - **Soil:** The dark, dirt-like material where plants and earthworms live.\n       - **Moisture:** Water in the soil that keeps things wet and damp.\n       - **Survive:** To stay alive and healthy.\n       - **Segments:** The bumpy rings on an earthworm's body.\n     - Point to the photograph: \"See the earthworm? It's in the soil and grass where it's damp and dark.\"\n  3. **Connect Back to Explore (3-5 minutes):**\n     - Display four picture cards: soil, water, food (decomposing leaves), darkness.\n     - Ask: \"Which of these did we see the worm move toward?\" \n     - Create a simple sentence together: \"Earthworms need **soil, moisture, food, and darkness** to survive.\"\n     - Write this on an anchor chart and leave it visible.\n  4. **Check for Understanding:**\n     - Ask: \"Why does the earthworm need moist soil?\" (Worms need water to breathe and move.)\n     - Ask: \"Why does the earthworm hide in the dark?\" (It's safe and worms don't like bright light.)\n     - Ask: \"Where do earthworms get their food?\" (From dead leaves and decomposing plants in the soil.)\n\n- **Vocabulary:**\n  - **Earthworm:** A small animal with a long, segmented body that lives in soil.\n  - **Soil:** The dark, crumbly material made of earth and rocks where plants and earthworms live.\n  - **Moisture:** Wetness or water in the soil.\n  - **Survive:** To stay alive and stay healthy.\n  - **Segments:** The bumpy rings that make up an earthworm's body.\n\n- **Expected Student Outcomes:**\n  - Students understand earthworms are animals with specific needs.\n  - Students can name at least two things earthworms need to survive (soil, moisture, darkness).\n  - Students can explain in simple words why earthworms prefer damp, dark soil.\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply their understanding by creating an earthworm habitat and predicting where earthworms would be found in nature.\n\n- **Materials:**\n  - Clear plastic cups or small containers (1 per student or pair)\n  - Moist soil (prepared in advance)\n  - Small pebbles or sand\n  - Dead leaves, grass clippings, or composting material\n  - Water in spray bottles\n  - Cardboard or black construction paper\n  - Tape\n  - Optional: 1-2 earthworms to observe in the completed habitat (if available)\n  - Picture cards of different environments (garden, sidewalk concrete, dark basement, wet riverbank, dry desert)\n\n- **Activity:**\n  1. **Build a Mini Earthworm Habitat (10 minutes):**\n     - Give each student or pair a clear cup.\n     - Direct students to layer materials in order:\n       - Pebbles at the bottom (about 1 inch)\n       - Moist soil (about 2 inches)\n       - Dead leaves, grass, or small food scraps (about ½ inch)\n       - More moist soil on top (about 1 inch)\n     - Spray lightly with water to keep moist.\n     - Explain: \"We're making a home that has everything an earthworm needs—soil, moisture, food, and we'll cover it to keep it dark.\"\n  2. **Make It Dark (3 minutes):**\n     - Wrap each cup with black construction paper or cardboard, leaving a small viewing window.\n     - Tape it securely.\n     - Explain: \"Earthworms like darkness, so we're covering the outside to make it dark inside.\"\n  3. **Predict and Discuss (5-7 minutes):**\n     - Show picture cards of different places: garden, sidewalk, basement, riverbank, desert, classroom.\n     - Ask: \"Where would an earthworm want to live? Point to the place that has what an earthworm needs.\"\n     - Guide students to recognize: Gardens and wet areas (not dry, bright places).\n     - Ask: \"Why wouldn't an earthworm live on a hot, dry sidewalk?\" (No moisture, no soil, too much light.)\n     - Ask: \"Why would an earthworm like a shady, wet garden?\" (Has soil, moisture, food, and darkness.)\n\n- **Teacher Role:**\n  - Circulate and ask guiding questions: \"Does your habitat have everything an earthworm needs? What's in there?\"\n  - Help students wrap containers carefully to ensure a dark space.\n  - If available, place one earthworm in a demo habitat to show students how it tunnels and hides.\n\n- **Expected Student Outcomes:**\n  - Students successfully create a habitat with soil, moisture, and food.\n  - Students understand that environments with these features support earthworms.\n  - Students can identify suitable places for earthworms in their school or home environment.\n  - Students predict that earthworms would be found in gardens, under logs, and in moist soil—not on sidewalks or dry places.\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of what earthworms need to survive using formative and summative assessment.\n\n- **Activity:**\n\n  **Formative Assessment (throughout lesson):**\n  - Observe student observations during Explore phase: Are they noticing where the worm moves?\n  - Listen to student language during Explain phase: Are they using vocabulary correctly?\n  - Monitor habitat building: Do students include soil, moisture, and food?\n  - Ask probing questions: \"What does your earthworm need? Why?\"\n\n  **Exit Ticket / Summative Assessment (5-10 minutes at end):**\n  \n  Provide each student with a simple picture sheet showing four images:\n  1. Sunny, dry dirt (crossed out or marked \"no\")\n  2. Dark, moist soil with leaves (marked \"yes\")\n  3. Dry paper (crossed out)\n  4. Wet soil in a dark place (marked \"yes\")\n  \n  **Assessment Questions (read aloud to Kindergarteners):**\n  \n  1. \"Point to the place where an earthworm would want to live. Why?\" (Expected: Student points to damp, dark soil and says \"because it's wet\" or \"because it's dark\" or \"because worms like soil.\")\n  \n  2. \"Tell me two things an earthworm needs to survive.\" (Expected: Student names any two: soil, water/moisture, food, darkness. Accept simple answers like \"water and dirt\" or \"wet dirt\" and \"dark.\")\n  \n  3. \"If you find an earthworm in the grass, what does that tell you about that place?\" (Expected: Student recognizes there is moisture, soil, and probably darkness nearby. Accept: \"It's wet,\" \"There's dirt,\" \"It's not hot,\" or \"It likes it there.\")\n\n  **Alternative Assessment Option (for students who struggle with pictures):**\n  - Show the photograph again.\n  - Ask: \"Do you see what the earthworm needs in this picture?\"\n  - Student points to or touches soil and grass.\n  - Ask: \"Can you wiggle like a worm?\" (Motor assessment of understanding.)\n  - Listen to student explanations and record observations on a checklist.\n\n- **Success Criteria:**\n  - ✓ Student identifies at least one place where earthworms would want to live (soil/garden/damp place).\n  - ✓ Student names or describes at least two things earthworms need (soil, water, food, dark).\n  - ✓ Student explains in simple words why earthworms need these things (e.g., \"to stay wet,\" \"to hide,\" \"to eat\").\n  - ✓ Student observes and makes a connection between earthworm behavior and survival needs from the Explore phase.\n\n- **Expected Student Outcomes:**\n  - Most students can identify that earthworms need soil and moisture.\n  - Most students can predict where earthworms would be found based on observation.\n  - Students demonstrate understanding through discussion, observation records, and habitat creation.\n\n### Differentiation\n\n**Support (for struggling learners):**\n- Provide a **picture-based observation sheet** with simple drawings (worm, soil, water, darkness) instead of written labels. Students point to or color what they see.\n- **Simplify vocabulary** to 2-3 key words: worm, soil, water. Repeat these throughout the lesson and use gestures (point down for soil, wiggle for worm movement).\n- **Pair students together** during Explore phase so they can observe with a partner and discuss what they see out loud.\n- Use **hand-over-hand support** when building habitats to ensure understanding of layers and moisture.\n- Ask **yes/no questions** instead of open-ended ones: \"Does the worm like the wet part? Yes or no?\" \n\n**Challenge (for advanced learners):**\n- Ask students to **predict and test:** \"If we took water away from the habitat, what would happen to the earthworm? Let's observe a worm on dry soil for 2 minutes and see what it does. Why did it act that way?\"\n- Introduce the concept of **decomposition:** \"Earthworms eat dead leaves and break them down to help new plants grow. Can you find tiny pieces of broken leaves in the soil? What do you think the earthworm is doing?\"\n- Have students **create a poster or drawing** showing all the things an earthworm needs and where they come from (draw soil, water drops, leaves for food, darkness).\n- Ask: **\"What other animals live in the soil with earthworms?\"** Introduce the idea of a soil community (beetles, millipedes, fungi, bacteria).\n- Challenge students to **design their own habitat** with specific conditions (more water, different soil type) and predict how earthworms would respond.\n\n### Extension Activities\n\n1. **Earthworm Hunt Observation Walk:** Take students on a short outdoor walk (garden, shaded area near grass) to find evidence of earthworms (moist soil, small tunnels, castings). Discuss: \"How do we know earthworms live here? What does this place have that earthworms need?\" Return to the classroom and create a class map showing where earthworms were found.\n\n2. **Earthworm Life Cycle Picture Book:** Create a simple 4-page booklet showing: Baby earthworm hatches → grows in soil → eats food → helps plants grow. Students can draw, color, and sequence the pages to show the life cycle and connect survival needs to each stage.\n\n3. **Decomposition Observation Jar:** Create a \"worm's view\" jar with layers (soil, sand, gravel, dead leaves) to observe over 2-3 weeks. Students predict what will happen to the leaves and predict what earthworms do to help. Optional: Add 2-3 earthworms to the jar (covered and kept dark). Observe and discuss how the leaves break down and worms tunnel.\n\n4. **Sensory Earthworm Exploration:** Create a sensory bin with damp soil, smooth stones, and earthworms (optional). Students explore the textures while wearing blindfolds or with eyes closed and describe what they feel. Discuss: \"Earthworms feel with their skin. Do they like it when the soil is wet or dry? What do they feel?\"\n\n5. **Class \"Earthworm Needs\" Mural:** Create a large floor or wall mural showing an underground scene. Students cut out or draw pictures and glue them to show: soil layers, water, fallen leaves, dark spaces, and earthworms. Label each thing the earthworm needs and discuss why each is important for survival.\n\n---\n\n## Summary\n\nThis 5E lesson sequence introduces Kindergarteners to earthworms as living animals with specific survival needs. By observing real earthworms, students discover that these animals require soil, moisture, food, and darkness—connecting abstract survival concepts to concrete, observable behaviors. The photograph serves as both an engagement hook and a reference point throughout the lesson, and students apply their learning by building their own earthworm habitats and predicting where earthworms would thrive. Assessment remains formative and picture-based, appropriate for Kindergarten learners, while differentiation supports all levels of understanding.",
  "inputTokens": 123,
  "outputTokens": 4602,
  "cost": 0.029730500000000003,
  "generatedAt": "2026-02-13T06:35:25.584Z"
}