{
  "title": "Find The Hidden Animal",
  "category": "life-science",
  "imageFile": "find the hidden animal.jpeg",
  "imagePath": "images/life-science/find the hidden animal.jpeg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- Mixed pebbles and rocks of varying sizes (small gravel to large stones), tan/brown/gray colors\n- Dried leaves scattered across the rock surface\n- At least two lizards (dark-colored, camouflaged among the rocks), visible in center and lower portions of the image\n- Soil or sandy substrate visible between rocks\n- Natural outdoor ground/habitat environment\n\n## Reasonable Inferences\n- **From rock and leaf scatter**: This is a natural habitat where small animals hide from predators and weather by blending in with their surroundings (camouflage behavior).\n- **From lizard presence and coloring**: The lizards' dark coloring matches the rocks, suggesting they survive by being hard to spot—animals need shelter and concealment to stay safe.\n- **From mixed rock sizes**: The rocky environment provides gaps and crevices that offer protection from heat, cold, and predators.\n\n## Engineering Task\n\n**K-2: Make a Safe Hide-Out for a Lizard**\n\nDesign a cozy hiding spot using rocks and sticks where a pretend lizard can stay safe and hidden. Your lizard friend should not be easy to see when it sits in your hideout. What rocks will you use? How will you arrange them so the lizard blends in?\n\n**3-5: Design a Camouflaged Shelter for a Desert Creature**\n\nEngineer a shelter for a small animal (like a lizard) using natural and recycled materials. Your shelter must:\n- Fit a 4-inch toy animal inside\n- Use at least two different material types (rocks, twigs, leaves, sand, soil)\n- Keep the animal hidden from view when observed from above (pass the \"spotting test\": a partner cannot find it in 10 seconds)\n- Protect against wind (withstand a gentle breath without collapsing)\n- Be built in 30 minutes or less\n\nTest your shelter and redesign if the animal is too visible or if it fails the wind test.\n\n## EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real-world habitat challenge: small animals *need* places to hide and stay safe, but blending in is difficult without the right shelter. Students must first understand *why* camouflage and shelter matter before they can design a solution. The hidden lizards visually prompt the question: \"How does this animal stay safe here?\"\n\n## Suggested Materials\n\n- Small pebbles and larger stones (collected or purchased aquarium rocks)\n- Twigs and small branches\n- Dried leaves or paper leaves\n- Soil or sand\n- Small plastic toy lizard or figurine (4–5 inches)\n- Optional: cardboard pieces, natural clay\n\n## Estimated Time\n\n**K-2**: 25–35 minutes (design, build, test once)\n\n**3-5**: 40–55 minutes (design, build, test, redesign, retest)\n\n## Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A (Define a Simple Design Problem)** by having students identify a real need—shelter and safety in nature—and create a solution that demonstrates understanding of how organisms adapt to their environment while practicing the full EDP cycle.",
  "inputTokens": 2305,
  "outputTokens": 736,
  "cost": 0.005985000000000001,
  "generatedAt": "2026-02-09T13:18:51.610Z"
}