{
  "title": "Food Chain",
  "category": "life-science",
  "imageFile": "food_chain.jpg",
  "imagePath": "images/life-science/food_chain.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- A small lizard (appears to be a desert or arid-climate species) with textured, grayish-brown skin\n- Dry soil and rocky ground with scattered wood chips, leaf debris, and small stones\n- Dead wood and bark fragments mixed into the soil\n- Sparse vegetation (minimal green growth visible in background)\n- Sunlit, exposed habitat with no visible shelter structures\n\n### Reasonable Inferences\n- **From lizard's coloring and habitat**: This creature relies on camouflage to hide from predators; the ground provides its primary protection.\n- **From dry soil and sparse vegetation**: The environment has limited water and shade; the lizard must have a way to regulate temperature and find shelter quickly.\n- **From exposed ground with debris**: Natural hiding spots (under rocks, logs, burrows) are critical for survival in this open habitat.\n\n---\n\n### Engineering Task\n\n#### **K-2: Simple Version**\n**\"Build a Safe Home for a Desert Lizard\"**\n\nYour lizard needs a place to hide from the hot sun and stay safe. Using rocks, sticks, soil, and leaves, design and build a cozy shelter on a patch of ground. Your shelter should:\n- Be big enough for the lizard to fit inside\n- Keep the lizard hidden (so a pretend hawk can't spot it!)\n- Use only natural or recycled materials from outside\n\nTest your shelter: Can you hide a small toy lizard inside where someone can't find it right away?\n\n---\n\n#### **3-5: Constraint-Based Version**\n**\"Engineer a Microhabitat That Provides Camouflage and Thermal Regulation\"**\n\nDesert lizards need shelters that hide them from predators AND keep them cool. Design a small enclosed shelter (no larger than 15 cm × 15 cm × 10 cm tall) that meets these criteria:\n\n**Must-Have Features:**\n- Entrance hole(s) no larger than 3 cm wide\n- Interior that matches the surrounding ground color for camouflage\n- At least two different materials used (e.g., soil, sand, bark, small rocks, dried plants)\n- A shaded interior area that stays cooler than exposed ground nearby (test with a thermometer after 10 minutes in sunlight)\n\n**Success Metrics:**\n- A toy lizard can enter and exit without the shelter collapsing\n- The shelter interior is at least 2°C cooler than open ground\n- An observer cannot immediately spot the shelter from 1 meter away\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows a real-world survival need (a small creature needing shelter in an exposed habitat). Students begin by observing the animal's actual environment and asking: *\"What does this lizard need to survive here? What problems does an open desert present?\"* Before building, they must understand the dual problem of predation and heat exposure, grounding their engineering work in authentic biological need rather than jumping to solutions.\n\n---\n\n### Suggested Materials\n- Soil, sand, and pebbles (collected or classroom-sourced)\n- Small sticks, bark chips, and dried leaves\n- Thermometer (for 3-5 temperature testing)\n- Small cardboard box or plastic container (optional frame for 3-5)\n- Tape and ruler (for 3-5 to measure dimensions)\n- Toy reptile or clay model (for testing fit)\n\n---\n\n### Estimated Time\n- **K-2**: One 30-45 minute session (build and test shelter)\n- **3-5**: Two 40-minute sessions (Session 1: observe, plan, and gather materials; Session 2: build, test temperature, and refine design)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Ask defining questions and make observations about products to determine what problems they are meant to solve*) by having students observe a real animal in its natural habitat and engineer a solution to a genuine survival challenge, bridging life science with engineering practice.",
  "inputTokens": 2332,
  "outputTokens": 935,
  "cost": 0.007006999999999999,
  "generatedAt": "2026-02-09T13:38:25.150Z"
}