{
  "title": "Frog",
  "category": "life-science",
  "imageFile": "frog.jpg",
  "imagePath": "images/life-science/frog.jpg",
  "content": "# Engineering Design Challenge: Tree Frog Habitat\n\n### Visible Elements in Photo\n\n- A small tree frog (appears to be a green tree frog species) clinging to a large green leaf\n- Textured leaf surface with visible veins and slight moisture/dewdrops\n- The frog's body is blue-green and flattened against the leaf surface\n- Large, prominent eye with a visible pupil\n- Blurred green foliage in the background, suggesting a dense forest or canopy environment\n\n### Reasonable Inferences\n\n- **From the frog's flattened posture on the leaf**: The animal needs a surface that provides grip and camouflage to hide from predators and hunt prey safely.\n- **From the moisture visible on the leaf surface**: Tree frogs depend on humid environments and need surfaces that retain moisture to keep their skin healthy.\n- **From the dense background foliage**: Frogs in this habitat require multi-layered structures that provide shelter, shade, and protection from extreme temperature changes.\n\n### Engineering Task\n\n**K-2: Build a Hiding Spot for a Tree Frog**\n\nDesign and build a cozy hiding place where a tree frog could rest and stay safe. Your hiding spot must:\n- Have a smooth, grippy leaf or branch the frog can hold onto\n- Be shady and cool (protected from bright light)\n- Keep the frog tucked away from view\n\nUse your materials to make layers that create a little \"forest\" for your frog to hide in. Test it by placing a toy frog on it—does it feel safe and hidden?\n\n---\n\n**3-5: Design a Micro-Habitat Enclosure**\n\nDesign and build a small, enclosed habitat (no larger than 12 inches tall) where a tree frog can survive for one week. Your design must include:\n\n- **Surface area**: At least two textured climbing surfaces (leaves, bark, or foam) that mimic the frog's natural environment\n- **Humidity retention**: A system to keep the air inside moist (e.g., a water source, layers of material that trap moisture)\n- **Temperature control**: Shaded areas and ventilation that prevent overheating\n- **Accessibility for observation**: One transparent side or opening so you can check on the frog without disturbing it\n\nMeasure and record humidity levels daily. Refine your design if humidity drops below acceptable levels.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real animal in its natural environment with no human-made structure visible. The starting point is to identify the *problem* the frog faces (finding shelter, staying moist, staying hidden) and define what a good habitat must do. Students observe the frog's needs first, then design solutions—this is classic problem-finding before problem-solving.\n\n### Suggested Materials\n\n- Paper towel tubes or small cardboard boxes (base structure)\n- Green construction paper, real leaves, or craft foam (climbing surfaces)\n- Spray bottle or shallow water dish (humidity source)\n- Mesh or cheesecloth (ventilation and observation window)\n- Soil, moss, or shredded paper (moisture-holding substrate)\n\n### Estimated Time\n\n**K-2**: 30–45 minutes (one session: planning, building, and quick testing)\n\n**3-5**: Two 45-minute sessions (Session 1: design and build; Session 2: test, observe, measure, and refine)\n\n### Why This Works for Teachers\n\nThis task directly aligns with **NGSS 3-5-ETS1-1** (\"Define a simple design problem that can be solved by applying scientific ideas about plants, animals, structures, or materials\") by asking students to observe a real organism's needs and translate them into measurable design constraints before building a solution.",
  "inputTokens": 1692,
  "outputTokens": 852,
  "cost": 0.005952,
  "generatedAt": "2026-02-09T13:31:52.746Z"
}