{
  "title": "Fungi04",
  "category": "life-science",
  "imageFile": "fungi04.jpeg",
  "imagePath": "images/life-science/fungi04.jpeg",
  "content": "# Engineering Design Challenge: Fungal Growth & Shelter Structures\n\n### Visible Elements in Photo\n- Bright coral/pink fungal fruiting bodies (likely jelly fungi or similar species) with rounded, bulbous shapes\n- Decaying wood pieces and bark fragments scattered throughout\n- Dark, decomposed mulch or forest floor material\n- Fungal masses in various stages of development (some clustered densely, others more sparse)\n- Natural crevices and gaps between wood pieces where fungi are concentrated\n\n---\n\n### Reasonable Inferences\n1. **From decaying wood + dense fungal growth**: Fungi thrive in moist, dark environments with organic material to decompose. The wood provides both shelter and food source.\n2. **From clustered fruiting bodies in protected spots**: Fungi seek microhabitats (gaps between wood pieces) that retain moisture and provide protection from direct exposure.\n3. **From varied colony sizes**: Successful fungal growth depends on access to water, nutrients, and stable microclimates—structures that offer these conditions allow populations to expand.\n\n---\n\n### Engineering Task\n\n#### **K-2 Version**\n**\"Build a Cozy Home for Tiny Creatures\"**\n\nFungi and other decomposers need dark, damp places to grow. Design a shelter using sticks, bark, and damp soil that mimics the spaces fungi like to live in. Your shelter should:\n- Have at least one covered spot where it stays dark and moist inside\n- Use only natural materials (wood, leaves, soil, bark)\n- Be sturdy enough to not fall apart when gently poked\n\nCan you build a place where decomposers would want to live?\n\n---\n\n#### **3-5 Version**\n**\"Design an Optimal Microhabitat for Fungal Growth\"**\n\nFungi in forest floors depend on specific conditions: moisture retention, organic matter, darkness, and protection from drying winds. Design and build a small-scale model structure (using cardboard strips, cork pieces, damp sphagnum moss, and leaf litter) that maintains these conditions better than an exposed pile.\n\n**Success Criteria:**\n- Structure must retain moisture for at least 5 days (measure with a moisture meter or visual inspection)\n- Must have at least 2 distinct sheltered chambers/crevices where spores could settle\n- Must fit within a 12×12 cm footprint\n- Must support the weight of 200g of moss/soil without collapsing\n- Sketch or photograph the structure before and after a 1-week observation period and note where (if any) visible decomposition or growth occurs\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This phase fits because the photo shows a real ecological need (decomposers require specific shelter conditions to thrive), and students must first observe what conditions fungi actually use before building a solution. Asking \"Why do fungi grow here and not there?\" precedes any design work.\n\n---\n\n### Suggested Materials\n1. Cardboard tubes or corrugated cardboard strips (for structure frame)\n2. Cork bark pieces or untreated wood splinters (natural shelter material)\n3. Damp sphagnum moss or leaf litter (organic substrate)\n4. Spray bottle filled with water (to maintain moisture)\n5. Moisture meter or simple observation journal (to track conditions over time)\n\n---\n\n### Estimated Time\n**3-5 class sessions over 1-2 weeks:**\n- Session 1 (30 min): Observe photo, ask questions, research fungal habitats\n- Session 2 (45 min): Design and build structure\n- Sessions 3-5 (10 min each, daily): Monitor moisture, observe decomposition, refine design\n\n**Total: ~2 hours active instruction + 1 week passive observation**\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) by having students identify real constraints fungi face in nature, then apply those constraints to their own design—making the link between observation and engineering tangible and meaningful.",
  "inputTokens": 2303,
  "outputTokens": 920,
  "cost": 0.006903000000000001,
  "generatedAt": "2026-02-09T13:19:36.155Z"
}