{
  "title": "Genetic Mutation",
  "category": "life-science",
  "imageFile": "genetic_mutation.jpg",
  "imagePath": "images/life-science/genetic_mutation.jpg",
  "content": "# Engineering Design Challenge: Flower Pollinator Landing Pad\n\n### Visible Elements in Photo\n\n- Large pink/magenta flower with radiating petals (appears to be a zinnia or similar compound flower)\n- Yellow and dark red/maroon center disk with clustered small florets\n- Small brown insect (possibly a bee or beetle) visible on the yellow center\n- Multiple smaller pink flowers in soft focus in the background\n- Green foliage and dark soil visible around the plant base\n\n### Reasonable Inferences\n\n- **From insect on flower center:** Pollinators need a stable landing platform to access pollen and nectar safely; the flower's structure must support insect weight and provide grip.\n- **From flower petal and center design:** The radiating petals may guide pollinators toward the center resource; curved or angled surfaces help direct movement.\n- **From multiple flowers in garden:** Plants compete for pollinator visits, so flower design affects reproductive success—a practical engineering problem in nature.\n\n---\n\n### Engineering Task\n\n**K-2:**  \n**\"Build a Bug Landing Pad\"**  \nMake a flower out of paper petals and a center that a toy bug (or your finger) can land on safely without sliding off. Your petals should stick out like the pink flower in the photo. Test: Can your bug reach the yellow center without falling?\n\n**3-5:**  \n**\"Design a Pollinator-Friendly Flower Landing System\"**  \nEngineer a model flower with petals and a central landing disk that:\n- Supports a 10-gram weight (marble or washers) on the center for at least 5 seconds without tipping\n- Has at least 6 petals angled to guide a rolling marble toward the center\n- Uses only paper, cardboard, tape, and natural materials (yarn, leaves, or twigs)\n\nSuccess criteria: The marble stays centered, petals don't collapse, and the structure stands upright on a table. Document: Which petal angle worked best?\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a *natural system at work*—a flower successfully attracting a pollinator. Students can observe the \"problem\" flowers solve (how to position resources to attract and guide insects) and reverse-engineer a solution. They're not redesigning an existing engineered product; they're identifying a real biological need and imagining how structure solves it.\n\n---\n\n### Suggested Materials\n\n- Colored paper or tissue paper (pink, yellow, red)\n- Cardboard tube or paper cup (flower base)\n- Tape and glue stick\n- Marbles or washers (10g weights for testing)\n- Optional: yarn, raffia, or dried leaves for texture\n\n---\n\n### Estimated Time\n\n**K-2:** 30–40 minutes (one session)  \n**3-5:** Two 30-minute sessions (design + build in session 1; test and iteration in session 2)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*define simple design problems reflecting a need or want*) by asking students to solve a real biological challenge visible in nature, bridging life science observation with engineering thinking.",
  "inputTokens": 2328,
  "outputTokens": 731,
  "cost": 0.0059830000000000005,
  "generatedAt": "2026-02-09T13:39:43.981Z"
}