{
  "title": "Germination",
  "category": "life-science",
  "imageFile": "germination.jpg",
  "imagePath": "images/life-science/germination.jpg",
  "content": "# Engineering Design Challenge: Seed Sprouting & Protective Structures\n\n### Visible Elements in Photo\n- A green plant stem with a seedling emerging from soil\n- A seed coat (brown, textured shell) attached to the top of the stem\n- A second seed coat visible lower on the stem or nearby on the ground\n- Moist dark soil surrounding the base\n- The seed coat appears to be splitting or separating as the plant grows upward\n\n### Reasonable Inferences\n- **From seed coat structure**: The hard, protective shell must break apart or separate to allow the delicate seedling to emerge, suggesting a need for a removable or flexible protective barrier.\n- **From soil and moisture**: Seeds require specific environmental conditions (moisture, support) to sprout successfully, implying students need to understand how growing structures interact with their surroundings.\n- **From the seed coat still attached**: Young seedlings are fragile and may need temporary protection during the critical sprouting phase before they develop their own toughness.\n\n### Engineering Task\n\n**K-2: Build a Seed Coat**\n*Design a protective shell for a sprouting seed using play dough, papier-mâché, or paper. Your shell must:*\n- *Fit snugly around a bean or pea seed*\n- *Break apart or open easily when the seed pushes it* (you can test by gently squeezing)\n- *Be made from only natural or recyclable materials*\n\n**What makes it work?** *Your seed coat should protect the seed but not stop it from growing!*\n\n---\n\n**3-5: Engineer a Seed Protection System**\n*Design a biodegradable protective casing for a sprouting seed that will:*\n- *Remain intact for at least 48 hours in moist conditions*\n- *Separate or dissolve within 5–7 days when the seedling reaches 2 cm in height*\n- *Be constructed from at least two different natural materials (examples: paper, gelatin, plant fibers, cardboard, cornstarch)*\n- *Allow water to pass through so the seed can absorb moisture*\n\n**Success criteria**: Test your design with a real seed in moist soil. Does your seed sprout? Does your casing release as the seedling grows?\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\n*This photo shows a real biological challenge—how does nature protect vulnerable sprouting seeds while still allowing them to grow?* Students must first understand what the seed coat does (protection, but not forever) before jumping to solutions. This natural observation naturally leads to the question \"What does a seed need?\" which frames the whole engineering problem.\n\n### Suggested Materials\n- Paper towels or coffee filters\n- Unflavored gelatin or agar powder\n- Play dough or air-dry clay\n- Cornstarch or biodegradable packing peanuts\n- Bean or pea seeds\n- Moist potting soil\n- Clear plastic cups or containers for testing\n\n### Estimated Time\n**3–4 weeks** (if testing with real seeds) *or* **2–3 class periods** (if testing with dummy seeds and water only)\n- Session 1: Observe, discuss the problem, design (30–40 min)\n- Session 2: Build prototypes (40–50 min)\n- Sessions 3+: Test, observe over days, refine (5–10 min check-ins daily)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a problem that can be solved by designing an object, tool, or system*) by grounding the challenge in observable natural phenomena, then asking students to solve a real biological constraint with engineered materials.",
  "inputTokens": 1803,
  "outputTokens": 843,
  "cost": 0.006018,
  "generatedAt": "2026-02-09T13:35:32.765Z"
}