{
  "title": "Giant Leopard Moth",
  "category": "life-science",
  "imageFile": "giant_leopard_moth.jpg",
  "imagePath": "images/life-science/giant_leopard_moth.jpg",
  "content": "### Visible Elements in Photo\n\n- A large moth with white/cream-colored wings marked with brown wavy patterns and geometric shapes\n- Dark-colored wooden beams or branches the moth is resting on\n- Clustered cream-colored spheres (eggs) on the dark surface below and near the moth\n- Green, bumpy plant material (possibly lichen or small flowering plants) on the wooden structure\n- Dark background suggesting a nighttime or sheltered environment\n\n### Reasonable Inferences\n\n- **From eggs clustered near moth**: This moth has just laid eggs or eggs are nearby, suggesting the need to protect offspring in a safe location on sturdy surfaces.\n- **From patterned wings + dark perch**: The moth's coloration matches the dark wood, implying camouflage helps the insect hide from predators during rest periods.\n- **From wooden structure + plant growth**: The moth chooses surfaces where food sources (plants) and shelter naturally occur together.\n\n### Engineering Task\n\n**K-2: Build a Safe Home for Moth Eggs**\n\nDesign a cozy spot where a moth can lay her eggs. Use blocks, twigs, and leaves to build a small platform or nest. Make it sturdy so the eggs don't roll away, and add hiding spots so the babies will be safe. Your moth house should fit in your hand.\n\n**3-5: Design a Protective Egg-Laying Structure**\n\nA leopard moth needs to lay 50–100 eggs on a surface where they won't dry out, won't be eaten by predators, and are close to food plants. Design a shelter structure using only natural materials (twigs, bark, moss, leaves) that:\n- Is at least 15 cm long and 8 cm wide\n- Keeps eggs clustered together (test by placing 20 small beads as \"eggs\")\n- Provides shade or cover on at least 3 sides\n- Stays stable when gently tilted 30 degrees\n\nTest your design by simulating \"rain\" (spray bottle) and \"wind\" (gentle shake). Measure how many eggs stay in place.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real organism in its natural behavior (egg-laying), and students must first identify *why* the moth chooses certain spots before designing a solution. The task begins with observation and asking \"What does a moth need?\" rather than jumping to building.\n\n### Suggested Materials\n\n- Small twigs and branches (collected or purchased craft wood)\n- Dried moss, bark pieces, or dead leaves\n- Small cardboard boxes or paper cups (as base structures)\n- 20–50 small beads, pebbles, or pasta shapes (to represent eggs)\n- Spray bottle (for rain simulation)\n\n### Estimated Time\n\n**K-2**: 30–45 minutes (one session: observe photo, discuss, build, test)  \n**3-5**: 60–90 minutes across two sessions (Session 1: design and build; Session 2: test, observe results, discuss improvements)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a design problem that can be solved by applying scientific ideas about living things*) by having students identify a real organism's needs, design a prototype solution, and test whether it meets the criteria—all grounded in observable moth behavior.",
  "inputTokens": 2331,
  "outputTokens": 761,
  "cost": 0.006136000000000001,
  "generatedAt": "2026-02-09T13:38:59.307Z"
}