{
  "title": "Grasshopper",
  "category": "life-science",
  "imageFile": "grasshopper.jpg",
  "imagePath": "images/life-science/grasshopper.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Grasshopper Body Parts and How They Help\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **External body parts have specific functions:** The grasshopper's legs, antennae, and wings are visible and have different purposes for survival (jumping, sensing the environment, flying).\n- **Animals use body parts to meet their needs:** The grasshopper is using its body parts to find and hold food (the flower head), demonstrating how structures help animals survive.\n- **Living things interact with their environment:** The grasshopper is on a plant, showing that animals depend on plants for food and habitat.\n- **Adaptations help animals survive:** The grasshopper's green and brown coloring helps it blend with plants, an adaptation for survival.\n\n---\n\n### Lesson Title\n\n**Grasshopper Helpers: How Body Parts Help Animals Survive**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 90–120 minutes total (can be split across two 45–60 minute sessions)\n- **NGSS Standards:** \n  - **1-LS1-1:** Use materials to design a solution to a human problem by mimicking how plants and/or animals use their external parts to help them survive, grow, and meet their needs.\n  - **1-LS3-1:** Make observations to construct an evidence-based account that young plants and animals are like, but not exactly like, their parents.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n\n1. **Identify** the external body parts of a grasshopper (legs, antennae, wings, head, body).\n2. **Explain** what each body part helps the grasshopper do (jump, sense, eat, move).\n3. **Describe** how a grasshopper's body parts help it survive and find food.\n4. **Design** a simple tool or model that mimics how a grasshopper's body part helps it do something (e.g., a jumping toy that mimics jumping legs).\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student curiosity about the grasshopper's body and how it uses its parts to survive.\n\n**Materials:**\n- Photograph of grasshopper on flower head (displayed on interactive board or printed large, 8.5\" × 11\")\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or hold it up for all students to see clearly. Give students 30 seconds to look silently and observe without talking.\n\n2. **Ask these specific discussion questions** (pause for 3–5 second think time before calling on students):\n   - \"What do you see in this picture? What animal is this?\"\n   - \"Look carefully at the grasshopper. What different parts of its body can you point out?\" (Point to antennae, legs, wings, body, head.)\n   - \"What do you think this grasshopper is doing right now?\"\n   - \"Why would a grasshopper need long legs and these long, thin things on its head?\" (Antennae—guide student thinking but don't answer yet.)\n\n3. **Wonder prompt:** \"I wonder what each part of the grasshopper's body helps it do. Do you think its legs help it do the same thing as its antennae? Why or why not?\"\n\n4. **Record student observations** on chart paper, using simple drawings and words. Keep this visible for the entire lesson.\n\n**Transition:** \"Let's explore grasshopper body parts more closely so we can discover what each one does!\"\n\n---\n\n#### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate grasshopper body parts through hands-on exploration and discover the function of each part.\n\n**Materials:**\n- Picture cards of grasshoppers with labels (one per pair): legs, antennae, wings, body, head (use simple line drawings with large labels)\n- Real grasshoppers in a clear container (if available and ethical; alternative: high-quality photograph close-ups, one per pair)\n- Observation recording sheet (see below)\n- Pencils and crayons\n- Index cards with labels: \"JUMP,\" \"SENSE,\" \"EAT,\" \"FLY,\" \"HOLD\"\n\n**Activity:**\n\n1. **Partner students** and distribute one picture card or container with a grasshopper to each pair (or small group of 3).\n\n2. **Give student directions:**\n   - \"Look very carefully at the grasshopper's body. Find these parts: legs, antennae, wings, head, and body.\"\n   - \"Touch each part gently (or point to it on the picture) and think: What do you think this part does?\"\n   - \"Draw or circle the body part you are looking at on your observation sheet.\"\n   - \"Now, match the body part to what it does by connecting it to a label card (JUMP, SENSE, EAT, FLY, HOLD). You can move the cards around!\"\n\n3. **Students record observations** by:\n   - Drawing or coloring the body part they're focusing on\n   - Writing or copying the word for what it does (teacher-scribed labels available)\n   - Placing tally marks if they see that part multiple times\n\n4. **Connection to photograph:** \"Remember the grasshopper on the flower? Its legs are helping it hold on, its antennae might be sensing the flower, and it's eating the flower with its mouth. Can you find those parts on your grasshopper?\"\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What do you think this part does?\" \"Why might a grasshopper need this?\"\n- Do NOT tell students the answers; instead, guide observation: \"Look at the size and shape of that part. What does that tell you?\"\n- Help students record but encourage them to try drawing or labeling themselves first.\n\n**Expected Student Outcomes:**\n- Students successfully identify at least 3–4 body parts.\n- Students make reasonable guesses about what body parts do (e.g., \"legs are for jumping,\" \"antennae are for feeling\").\n- Each pair produces a recording sheet with drawings and labels.\n\n---\n\n#### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and solidify understanding of grasshopper body parts and their functions.\n\n**Materials:**\n- Large labeled diagram of a grasshopper (teacher-created or downloaded poster)\n- Chart paper with vocabulary and definitions written in large, clear print\n- Photograph from opening activity (still displayed)\n\n**Activity:**\n\n1. **Group share-out:** Ask pairs to share one body part they explored and what they think it does. Write their ideas on the chart paper under the correct body part. Affirm accurate observations and gently correct misconceptions.\n\n2. **Introduce vocabulary** with student-friendly definitions:\n\n| **Vocabulary Term** | **Student-Friendly Definition** |\n|---|---|\n| **Antennae** | Long, thin body parts on the grasshopper's head that help it feel and smell things around it. |\n| **Legs** | Body parts that help the grasshopper jump, walk, and hold on to plants. |\n| **Wings** | Thin parts on the grasshopper's body that help it fly and move through the air. |\n| **Body Part** | Anything that is a piece of an animal's body that helps it do something. |\n| **Survive** | To stay alive and healthy. |\n\n3. **Connect back to the photograph:** Point to the original image and say, \"See how the grasshopper in our picture is holding the flower? Those are its legs helping it do that. Its antennae might be sensing the flower to see if it's good to eat.\"\n\n4. **Check for understanding:**\n   - Gesture to a body part on the diagram and ask: \"What is this part called? What does it help the grasshopper do?\"\n   - Hold up the original photograph and ask: \"Which body part is helping the grasshopper hold on to the flower?\"\n   - Ask a student: \"If a grasshopper didn't have legs, what would it NOT be able to do?\"\n\n**Vocabulary:**\n- **Antennae:** Long, thin body parts on the grasshopper's head that feel and smell.\n- **Legs:** Body parts that help jump, walk, and hold.\n- **Wings:** Thin parts that help the grasshopper fly.\n- **Body Part:** A piece of an animal's body that helps it do something.\n- **Survive:** To stay alive and healthy.\n\n**Expected Student Outcomes:**\n- Students can name at least 3 grasshopper body parts.\n- Students can explain in simple words what at least 2 body parts do.\n- Students understand that body parts help animals survive.\n\n---\n\n#### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply their understanding by designing a simple tool or toy that mimics a grasshopper body part.\n\n**Materials:**\n- Craft supplies: popsicle sticks, paper straws, pipe cleaners, tape, paper clips, rubber bands, springs (if available)\n- Pre-cut paper strips and strips of colored paper\n- Design sheet template (simple diagram of a tool with blank lines for \"What grasshopper part does it copy?\" and \"What can it do?\")\n- Examples: a jumping toy with attached legs, a \"sensor stick\" with antennae made of pipe cleaners\n\n**Activity:**\n\n1. **Set the scene:** \"Grasshoppers have amazing body parts that help them survive. Let's design a tool or toy that copies ONE grasshopper body part!\"\n\n2. **Show 1–2 simple examples:**\n   - A jumping toy made from popsicle sticks arranged like grasshopper legs (demonstrate how it mimics jumping motion)\n   - Pipe cleaner \"antennae\" on a stick that can move to \"sense\" things\n\n3. **Give student directions:**\n   - \"Choose ONE grasshopper body part you want to copy (legs, antennae, or wings).\"\n   - \"Use the craft materials to make a simple tool or toy that does what that body part does.\"\n   - \"For example: make jumping legs with popsicle sticks, or antennae with pipe cleaners.\"\n   - \"Test your tool! Does it work like a real grasshopper body part?\"\n\n4. **Students record on the design sheet:**\n   - Draw or label their tool.\n   - Write/copy the word for which grasshopper part they copied.\n   - Explain (verbally or with teacher help) what their tool does.\n\n**Teacher Role:**\n- Provide a material station where students can select supplies.\n- Ask guiding questions: \"Which grasshopper body part are you copying? How does your tool work like that body part?\"\n- Help students secure materials but encourage independence.\n- Celebrate effort and creative thinking, not just \"correctness.\"\n\n**Expected Student Outcomes:**\n- Each student creates a simple tool or toy mimicking one grasshopper body part.\n- Students can explain (with scaffolding) how their creation copies the grasshopper's body part.\n- Evidence of critical thinking: \"My leg toy jumps like a grasshopper's legs!\"\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of grasshopper body parts and their functions for survival.\n\n**Activity:**\n\n**Formative Assessment (throughout the lesson):**\n- **Observation during Explore:** Can students identify and match body parts to functions?\n- **Check-in during Explain:** Can students answer questions about which body part does what?\n- **During Elaborate:** Can students make a reasonable connection between their tool and a grasshopper body part?\n\n**Summative Assessment—Exit Ticket (end of lesson):**\n\nProvide each student with an exit ticket (can be verbal or written with teacher scribing for non-readers).\n\n**Exit Ticket Questions:**\n\n1. **Show a picture of a grasshopper.** \"Point to the legs. What do grasshopper legs help it do?\" (Success: Student points to legs and says \"jump\" or \"hold\" or \"walk.\")\n\n2. **Show the original photograph.** \"Why is this grasshopper ON the flower? What body part is helping it stay there?\" (Success: Student identifies legs or says \"it's eating\" and points to where it touches the flower.)\n\n3. **Open-ended:** \"Tell me one way a grasshopper's body parts help it survive.\" (Success: Student names a body part and describes one function, e.g., \"Legs help it jump away from bad things.\")\n\n**Success Criteria:**\n- ✓ Student correctly identifies at least 2 grasshopper body parts\n- ✓ Student explains how at least 1 body part helps the grasshopper survive\n- ✓ Student applies knowledge by connecting body parts to functions in the original photograph\n- ✓ Student demonstrates understanding through the tool/toy design (Elaborate phase)\n\n**Expected Student Outcomes:**\n- **Exceeds:** Student names 4+ body parts, explains multiple functions, and creates a sophisticated tool that clearly mimics a body part.\n- **Meets:** Student names 3 body parts, explains 2 functions, and creates a simple tool that mimics one body part.\n- **Developing:** Student names 2 body parts, explains 1 function with prompting, and attempts a tool with teacher support.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Reduce number of body parts:** Focus on only 3 body parts (legs, antennae, wings) instead of all 5. Provide a simplified diagram with only these three labeled.\n\n2. **Provide sentence frames:** For the Explain and Evaluate phases, offer stems such as:\n   - \"The _____ helps the grasshopper _____.\"\n   - \"I think the grasshopper uses its _____ to _____.\"\n\n3. **Pair with a strong partner:** During Explore and Elaborate, partner a struggling student with a peer who can model observation and recording skills. Assign roles: \"You watch and draw, and I'll help you describe what the body part does.\"\n\n4. **Use real or high-quality photographs:** Concrete images are more accessible than drawings for beginning readers and observers.\n\n**Challenge (for advanced learners):**\n\n1. **Compare to other animals:** Provide photographs of other insects (butterfly, beetle, ant). \"How are their body parts similar to or different from a grasshopper's? Why do you think that?\"\n\n2. **Design a more complex tool:** Challenge students to create a tool that copies TWO grasshopper body parts working together (e.g., legs AND wings to show jumping and flying). Ask: \"How do these parts work together to help the grasshopper survive?\"\n\n3. **Research and present:** Provide access to simple picture books or videos about grasshoppers (e.g., *National Geographic Little Kids First Big Book of Bugs*). Have advanced students find one new fact and share it: \"I learned that grasshoppers also have _____.\"\n\n4. **Predict adaptations:** Show photographs of grasshoppers in different habitats (desert, forest, grassland). Ask: \"Why might a grasshopper in the desert look different from a grasshopper in the grass? What body parts might be different?\"\n\n---\n\n### Extension Activities\n\n1. **Grasshopper Movement Dance (Physical Activity Connection):**\n   - Play music and ask students to move like grasshoppers using different body parts.\n   - Call out instructions: \"Now move like grasshopper LEGS! Jump, jump, jump!\"\n   - Then: \"Now move like grasshopper ANTENNAE! Feel around in the air!\"\n   - Repeat with wings (flying motions), body (wiggling).\n   - **Reinforces:** Body parts and their functions in a fun, kinesthetic way.\n\n2. **Design Your Own Insect (Engineering/Creativity Extension):**\n   - Provide craft materials and ask students to design a NEW insect that has body parts that help it survive.\n   - Prompt: \"Create an insect that lives in your classroom. What body parts would it need? Why?\"\n   - Students draw or build their insect and explain their choices.\n   - **Connects to 1-LS1-1:** Designing solutions by mimicking animal body parts.\n\n3. **Read-Aloud + Discussion: *Grasshopper on the Road* by Arnold Lobel:**\n   - Read this simple, engaging book about a grasshopper's adventures.\n   - After reading, ask: \"Which of the grasshopper's body parts helped it in the story?\" (e.g., legs for traveling, antennae for sensing)\n   - Have students draw their favorite part of the story and label a body part used.\n   - **Reinforces:** Vocabulary and function in a narrative context.\n\n4. **Observation Journal—Make Observations Over Time:**\n   - If possible, keep a live grasshopper in a classroom habitat for one week.\n   - Each day, have students draw the grasshopper and note which body parts they see it using.\n   - Discuss changes or new observations daily.\n   - **Connects to 1-LS3-1:** Observing living animals and their behaviors over time.\n\n---\n\n## Teacher Notes & Classroom Management Tips\n\n- **Safety:** If using live grasshoppers, handle gently and ensure students wash hands after observation. Check that the habitat is secure.\n- **Pacing:** First Grade students may move through phases at different rates. Build in wait time for responses, and allow flexible timing.\n- **Inclusion:** Provide visual supports (labeled diagrams) for English language learners and use clear, simple language.\n- **Connections:** This lesson aligns well with spring/summer outdoor exploration units or bug/insect studies.\n- **Follow-up:** Use concepts in this lesson to explore how OTHER animals have body parts that help them survive (birds' wings, fish gills, etc.).",
  "inputTokens": 2883,
  "outputTokens": 4135,
  "cost": 0.023558000000000003,
  "generatedAt": "2026-02-13T00:59:09.580Z"
}