{
  "title": "Herbivore",
  "category": "life-science",
  "imageFile": "herbivore.jpg",
  "imagePath": "images/life-science/herbivore.jpg",
  "content": "# Engineering Design Challenge: Animal Tracking & Shelter\n\n### Visible Elements in Photo\n\n- Two large footprints pressed into bare soil (center of image)\n- Surrounding vegetation: grasses, clover, and small flowering plants (pink flowers visible)\n- Bare, compacted earth with no grass coverage in the print area\n- Mixed ground cover around the prints suggests variable habitat conditions\n- Small rocks and plant debris scattered across the soil\n\n### Reasonable Inferences\n\n- **From footprints**: A larger animal (deer, raccoon, or similar) has walked through this area recently, indicating it uses this space as a path or feeding ground. The prints suggest weight and size we can measure and compare.\n- **From bare soil surrounded by vegetation**: This spot may receive heavy foot traffic, which could indicate an animal trail that forms a \"highway\" through the grass.\n- **From mixed vegetation coverage**: The animal may need shelter or cover nearby to stay safe from predators while foraging in this open area.\n\n### Engineering Task\n\n**K-2: Design a Safe Path for Animals**\n\nYour job: Make a walking path that an animal can use without getting stuck in mud or leaving deep footprints. Use only leaves, twigs, and grass to build a sturdy trail that keeps the animal's feet dry and safe. Your path should be at least as long as your arm!\n\n---\n\n**3-5: Design a Durable Wildlife Trail**\n\nAn animal repeatedly walks through muddy ground, leaving deep footprints. Design and build a trail surface that:\n- Reduces sinking depth by at least half compared to bare soil\n- Uses only natural or recycled materials (leaves, twigs, straw, wood chips, cardboard strips)\n- Measures at least 30 cm long and 15 cm wide\n- Can support weight (test with a 500g book or similar) without collapsing after 5 \"animal walks\" (5 passes of your hand or foot)\n\nSuccess criteria: Measure footprint depth *before* and *after* your trail is built. Calculate the reduction percentage.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a real environmental challenge—an animal creating erosion and mud by repeatedly walking the same route. Students first need to *observe and measure* the problem (print depth, soil type, vegetation loss) before they can design a solution. The task asks them to identify *why* this is a problem for the animal (mud, exposure, energy loss) before jumping to building.\n\n### Suggested Materials\n\n- Dry leaves and plant clippings\n- Small twigs and branches\n- Straw or dried grass\n- Cardboard strips or newspaper\n- Wood chips (if available)\n- Ruler or measuring tape\n- Optional: sandbox or outdoor soil patch for testing\n\n### Estimated Time\n\n**K-2**: 30–40 minutes (10 min observation, 15–20 min building, 10 min testing)  \n**3-5**: 60–75 minutes (10 min measuring/documentation, 20–25 min material planning and building, 15–20 min testing and data collection, 10 min reflection)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Ask and define problems*) by having students observe a real animal behavior, identify a design problem, and test a solution using natural materials—all rooted in authentic outdoor evidence.",
  "inputTokens": 2328,
  "outputTokens": 771,
  "cost": 0.006182999999999999,
  "generatedAt": "2026-02-09T13:41:33.655Z"
}