{
  "title": "Hummingbird",
  "category": "life-science",
  "imageFile": "hummingbird.jpg",
  "imagePath": "images/life-science/hummingbird.jpg",
  "content": "# NGSS Engineering Design Challenge: Hummingbird Feeder\n\n### Visible Elements in Photo\n- A hummingbird (small bird with long, thin beak) hovering mid-flight\n- Three pink/magenta flowers (Zinnias) on green stems at different heights\n- The bird's wings are blurred, indicating rapid motion\n- Flower petals are open and clustered at bloom tips\n- The bird is positioned to access the flower's center\n\n### Reasonable Inferences\n- **From flower structure**: The clustered petals create a landing zone and protect nectar; hummingbirds must access nectar deep within the flower (suggests a challenge of creating access points at specific depths).\n- **From bird's hovering posture**: Hummingbirds need stable or semi-stable ways to reach food; they expend enormous energy hovering, so an efficient feeder design would reduce energy use (identifies a design constraint: minimize hovering time needed).\n- **From multiple flowers at varied heights**: Different flower heights suggest hummingbirds forage across a range of positions; a feeder must work at multiple angles (identifies a constraint: solution must function at various orientations).\n\n### Engineering Task\n\n**K-2: Make a Flower Feeder for Hummingbirds**\n\nDesign a pretend flower feeder that looks like a real flower and lets a tiny bird (your finger) reach the \"nectar\" inside. Your feeder must:\n- Have an open shape so a bird can get close\n- Have a place where the \"nectar\" (colored water or paint) sits where the bird can reach it\n- Stand up on its own without tipping over\n\n**3-5: Design an Efficient Hummingbird Feeder**\n\nDesign a feeder that mimics a natural flower's efficiency. Your feeder must:\n- Include at least 3 separate feeding ports (openings where nectar is accessed) positioned at different heights (minimum 5 cm apart)\n- Allow a simulated hummingbird (a straw or stick) to access nectar without the feeder tipping, even when the bird applies light pressure\n- Hold at least 100 mL of liquid without leaking\n- Be testable: measure how many seconds it takes for the \"bird\" to access nectar at each port (faster = more efficient)\n- Use only recyclable or natural materials (paper cups, straws, twigs, leaves)\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo is ideal for *Ask / Define* because it shows a real creature with a real need (accessing nectar efficiently from flowers at varied heights). Students can observe the hummingbird's challenge directly and ask questions: *\"Why does the bird hover? What shape helps it feed? How could we make feeding easier?\"* The visible problem is clear without needing invented context, and students will naturally want to redesign the flower to meet the bird's needs.\n\n### Suggested Materials\n1. Paper cups or plastic bottles (container for nectar)\n2. Plastic straws or small twigs (feeding ports and structural supports)\n3. Colored water and food coloring (simulated nectar)\n4. Tape, string, or hot glue (assembly)\n5. Tissue paper, craft paper, or paper petals (to mimic flower appearance)\n\n### Estimated Time\n- **K-2**: 45–60 minutes (design, build, decorate, test with finger once)\n- **3-5**: Two 40-minute sessions (Session 1: design and build; Session 2: test at multiple ports, measure access times, redesign for efficiency)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.B (Developing Possible Solutions)** by asking students to design a solution that meets multiple constraints inspired by nature's own design, then test and refine based on observable performance data—exactly as a hummingbird's feeding behavior shapes real flowers.",
  "inputTokens": 2329,
  "outputTokens": 888,
  "cost": 0.006769000000000001,
  "generatedAt": "2026-02-09T13:42:56.041Z"
}