{
  "id": 13,
  "title": "Blue Dragonfly Resting",
  "category": "life-science",
  "imageFile": "IMG_4274.jpeg",
  "content": "## 📸 Photo Description\n\nThis close-up photo shows a beautiful dragonfly perched on a piece of wood! The dragonfly has bright blue eyes that look like tiny glass beads, and its body has yellow and black stripes with hints of green. You can see its four transparent wings spread out, showing the network of veins that make them strong. The dragonfly is taking a rest on weathered gray wood.\n\n## 🔬 Scientific Phenomena\n\nThis image showcases the amazing adaptations of dragonflies as aerial predators. Those enormous compound eyes can see in almost every direction at once – perfect for spotting tiny flying insects to catch! Dragonflies are some of nature's best hunters, catching about 95 out of every 100 prey they chase. Their four wings can move independently, allowing them to fly forward, backward, hover in place, and even fly upside down! This makes them incredibly agile hunters.\n\n## 📚 Core Concepts\n\n1. **Compound Eyes**: Dragonfly eyes are made up of thousands of tiny lenses (up to 30,000!), giving them nearly 360-degree vision.\n\n2. **Predator Adaptations**: Dragonflies have special features that make them excellent hunters – huge eyes for seeing prey, fast flying wings, and spiny legs for grabbing insects in mid-air.\n\n3. **Wing Structure**: Unlike other insects, dragonflies cannot fold their wings against their body. The wings have a strong structure of veins that keeps them stiff for powerful flight.\n\n<pedagogical-tip>\nCreate \"dragonfly vision goggles\" using clear plastic cups or bottles with small holes poked throughout! Students can look through them to simulate how compound eyes see the world (multiple images). Then play a prey-catching game where \"dragonflies\" try to tag flying paper insects. This helps students understand why these adaptations matter for survival.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multi-Sensory Exploration**: Use slow-motion videos to show dragonfly flight and hunting\n- **Tactile Models**: Provide insect models or diagrams students can touch to explore body parts\n- **Movement Integration**: Have students practice hovering, flying forward/backward to understand flight mechanics\n- **Visual Comparisons**: Show images comparing human eyes vs. compound eyes side-by-side\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS4.C]]: Adaptation\n- [[NGSS:DCI:3-LS2.D]]: Social Interactions and Group Behavior\n- [[NGSS:DCI:3-LS4.B]]: Natural Selection\n- [[NGSS:CCC:Structure]]: Understanding how structure relates to function\n\n## 💬 Discussion Questions\n\n1. How are dragonfly eyes different from human eyes? (DOK 1: Recall)\n2. Why would it be helpful for a hunting insect to see in almost every direction at once? (DOK 2: Skill/Concept)\n3. How do you think dragonflies' wings help them catch other insects? (DOK 2: Skill/Concept)\n4. If dragonflies couldn't fly backward or hover, how might this change their ability to catch food? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made of thousands of tiny lenses that work together\n- **Predator**: An animal that hunts and eats other animals\n- **Aerial**: Relating to the air or flying\n- **Adaptation**: A feature that helps an organism survive in its environment\n- **Agile**: Able to move quickly and easily\n\n## 🔬 Extension Activities\n\n- Research dragonfly fossil records (they've existed for over 300 million years!)\n- Compare dragonfly flight to helicopter mechanics\n- Investigate how scientists are using dragonfly wing designs to improve drone technology\n- Create detailed labeled diagrams of dragonfly anatomy",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThe photo shows a beautiful blue dragonfly resting on a piece of wood. The dragonfly has bright blue eyes that sparkle in the sunlight, and its body has stripes of yellow, black, and green. Its four delicate wings are spread out, showing the intricate network of veins that make them strong. The dragonfly looks peaceful as it takes a break on the weathered gray wood.\n\n## 🔬 Scientific Phenomena\n\nThe dragonfly in this photo is showcasing its incredible adaptations for life as a flying hunter. Dragonflies have some of the best eyesight in the insect world! Their large compound eyes are made up of thousands of tiny lenses, giving them almost 360-degree vision. This helps them spot tiny flying insects, their favorite food, from far away. Dragonflies are also amazing flyers - they can move their four wings independently to zip forward, backward, and even hover in place. This makes them excellent hunters, able to catch up to 95 out of every 100 insects they try to eat!\n\n## 📚 Core Science Concepts\n\n1. **Compound Eyes**: Dragonflies have large eyes made up of thousands of tiny lenses, allowing them to see in almost every direction.\n\n2. **Predator Adaptations**: Dragonflies have special features like powerful flying skills and sharp vision that help them catch other insects.\n\n3. **Insect Anatomy**: Dragonflies have four wings that can move independently, giving them incredible agility in the air.\n\n<pedagogical-tip>\nHave students make \"dragonfly vision goggles\" using clear cups or bottles with small holes poked all over. They can look through the \"eyes\" to see how a dragonfly's vision works. Then play a fun game where \"dragonfly\" students try to catch \"insect\" students, testing their hunting skills. This hands-on activity will help students understand how a dragonfly's adaptations are important for survival.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Supports**: Use slow-motion videos to show dragonfly flight and hunting in detail\n- **Tactile Models**: Provide insect models or diagrams so students can explore dragonfly body parts\n- **Movement Integration**: Have students practice flying, hovering, and chasing to understand dragonfly flight\n- **Visual Aids**: Display side-by-side images comparing human eyes and compound eyes\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:DCI:K-LS1.A]]: Structure and Function\n- [[NGSS:CCC:Structure]]: Understanding how the structure of something is related to its function\n\n## 💬 Discussion Questions\n\n1. How many eyes does a dragonfly have? (DOK 1: Recall)\n2. Why do you think it's helpful for a dragonfly to have eyes that can see in almost every direction? (DOK 2: Skill/Concept)\n3. What are some ways the dragonfly's wings help it catch other insects? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made of many tiny lenses that work together\n- **Predator**: An animal that hunts and eats other animals\n- **Adaptations**: Special features that help an animal survive\n- **Agile**: Able to move quickly and easily\n\n## 🌡️ Extension Activities\n\n- Explore how dragonflies have existed for over 300 million years, making them one of the oldest flying insects\n- Compare how dragonfly wings work to the design of helicopter blades\n- Investigate how scientists are using dragonfly wing designs to improve the technology of drones and other flying machines\n- Draw detailed diagrams labeling the different parts of a dragonfly's body",
    "grade1": "## 📸 Photo Description\n\nThis photo shows a beautiful blue dragonfly resting on a piece of wood. The dragonfly has big compound eyes that look like shiny glass beads. Its body is striped with bright blue, yellow, and black colors. You can see the dragonfly's four transparent wings spread out, with a network of thin veins running through them.\n\n## 🔬 Scientific Phenomena\n\nThis dragonfly is taking a break from its amazing flying abilities. Dragonflies are incredible hunters that can fly in all directions - forward, backward, and even upside down! This is because their wings are structured with strong veins that keep them stiff and flexible. Dragonflies also have huge compound eyes made up of thousands of tiny lenses, giving them almost 360-degree vision to spot prey.\n\n## 📚 Core Science Concepts\n\n1. **Adaptations**: Dragonflies have special features like their compound eyes and wing structure that help them survive and thrive as predators.\n\n2. **Life Cycle**: Dragonflies start their lives as nymphs, living underwater, before transforming into the amazing flying adults we see here.\n\n3. **Camouflage**: The dragonfly's bright colors may help it blend in with its surroundings and avoid being seen by prey or predators.\n\n<pedagogical-tip>\nEngage students in a \"dragonfly hunt\" around the classroom or school yard. Have them look carefully for resting dragonflies and observe their features up close. Encourage them to notice the dragonfly's incredible flying abilities by gently blowing on it to make it take flight. Discuss how the dragonfly's adaptations help it survive.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Supports**: Provide magnifying glasses so students can closely observe the dragonfly's compound eyes and wing structure.\n- **Flexible Grouping**: Allow students to work in pairs or small groups to share their observations and ideas.\n- **Multimodal Representation**: Use diagrams, models, and videos to supplement the real-life observations.\n- **Choice and Autonomy**: Give students the freedom to choose where and how they want to conduct their \"dragonfly hunt.\"\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-LS1.A]]: Structure and Function\n- [[NGSS:DCI:1-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:CCC:Structure]]: Observing how the shape and stability of structures are related to their function\n\n## 💬 Discussion Questions\n\n1. What features of the dragonfly do you notice? (DOK 1: Recall)\n2. How do you think the dragonfly's big eyes and flexible wings help it catch other insects? (DOK 2: Skill/Concept)\n3. Why might the dragonfly's bright colors be important for its survival? (DOK 2: Skill/Concept)\n4. If a dragonfly couldn't fly backward or hover, how would that affect its ability to catch food? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made up of thousands of tiny lenses\n- **Predator**: An animal that hunts and eats other animals\n- **Adaptation**: A special feature that helps an animal survive\n- **Camouflage**: Colors or patterns that help an animal blend in with its surroundings\n- **Nymph**: The immature stage of an insect, like a dragonfly, that lives in water\n\n## 🌡️ Extension Activities\n\n- Create a life cycle diagram to show how dragonflies transform from underwater nymphs to flying adults\n- Build a simple paper helicopter to explore how dragonfly wings work\n- Go on a scavenger hunt around the school to find different types of camouflaged insects or animals",
    "grade2": "## 📸 Photo Description\n\nThis close-up photo shows a beautiful blue dragonfly resting on a piece of wood. The dragonfly's body has shimmering blue and black stripes, and its large compound eyes look like tiny glass beads. You can clearly see the veined structure of its four transparent wings spread out as it takes a break.\n\n## 🔬 Scientific Phenomena\n\nDragonflies are fascinating flying insects with incredible abilities. Their huge, compound eyes allow them to see in almost every direction at once, which helps them spot and catch small flying prey like mosquitoes and flies. Dragonflies are aerial predators, using their fast, agile flight to chase and capture insects midair. Their four strong, independently moving wings give them incredible maneuverability, allowing them to hover, fly backwards, and even upside down!\n\n## 📚 Core Science Concepts\n\n1. **Compound Eyes**: Dragonflies have large compound eyes made of thousands of tiny lenses, giving them nearly 360-degree vision.\n\n2. **Adaptations for Hunting**: Dragonflies have specialized features like fast flight, maneuverable wings, and spiny legs that help them effectively hunt and catch other insects.\n\n3. **Insect Life Cycles**: Dragonflies start their lives as aquatic nymphs before undergoing metamorphosis to become the aerial adults we see.\n\n<pedagogical-tip>\nTo help students understand how dragonfly eyes and flight work, try creating \"compound eye goggles\" using a clear cup or bottle and poking small holes all over it. Students can look through these to see how multiple images come together. You can also have them practice \"dragonfly flight\" by moving their arms to mimic the independent wing movements.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multisensory Exploration**: Use videos, models, and hands-on activities to let students investigate dragonfly adaptations.\n- **Choice and Autonomy**: Allow students to choose which aspects of dragonflies to research or model in more depth.\n- **Scaffolded Support**: Provide sentence starters, word banks, or visual aids to help students explain dragonfly features and behaviors.\n- **Representation of Content**: Use a variety of formats like diagrams, charts, and simulations to show how dragonfly eyes and wings work.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-LS4.D]]: Biodiversity and Humans\n- [[NGSS:DCI:2-LS1.A]]: Structure and Function\n- [[NGSS:CCC:Patterns]]: Observing patterns in nature\n\n## 💬 Discussion Questions\n\n1. How are dragonfly eyes different from human eyes? (DOK 1: Recall)\n2. What adaptations help dragonflies be such successful hunters? (DOK 2: Skill/Concept)\n3. How do you think dragonflies' wings allow them to move in so many different ways? (DOK 3: Strategic Thinking)\n4. What other insects or animals have similar hunting adaptations to dragonflies? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made up of thousands of tiny lenses that work together\n- **Predator**: An animal that hunts and eats other animals\n- **Metamorphosis**: A major physical transformation, like a caterpillar becoming a butterfly\n- **Adaptations**: Features that help an organism survive in its environment\n- **Maneuverability**: The ability to change direction and move easily\n\n## 🌡️ Extension Activities\n\n- Research the life cycle of dragonflies, from aquatic nymphs to adult flying insects\n- Investigate how dragonfly wing designs are inspiring new technologies like drones\n- Observe and sketch the behaviors of dragonflies in your local environment\n- Create a diorama or model showing the different parts of a dragonfly's body and their functions",
    "grade3": "## 📸 Photo Description\n\nThis close-up photo shows a beautiful blue dragonfly resting on a piece of wood. The dragonfly has bright blue eyes that sparkle like tiny gems. Its body is striped with shades of green, yellow, and black, and its four clear wings are spread out, revealing the intricate network of veins that give them strength. The dragonfly is taking a break, perching on the weathered gray wood.\n\n## 🔬 Scientific Phenomena\n\nThis image highlights the remarkable adaptations that allow dragonflies to be such successful predators. Their large compound eyes, made up of thousands of tiny lenses, give them nearly 360-degree vision, perfect for spotting tiny flying insects to catch. Dragonflies are incredibly agile flyers, able to dart forward, backward, and even hover in place with ease thanks to the independent movement of their four wings. This makes them expert hunters, able to catch around 95 out of every 100 prey they chase!\n\n## 📚 Core Science Concepts\n\n1. **Compound Eyes**: Dragonflies have complex eyes made up of thousands of tiny visual units called ommatidia, allowing them to see in almost every direction at once.\n\n2. **Predator Adaptations**: Dragonflies have specialized features like huge eyes, swift flight, and spiny legs that make them excellent hunters and aerial predators.\n\n3. **Wing Structure**: The strong, veined structure of dragonfly wings allows them to move independently and perform amazing acrobatic maneuvers in flight.\n\n<pedagogical-tip>\nTo help students understand dragonfly vision, create \"compound eye goggles\" using clear plastic cups or bottles with small holes poked throughout. Students can look through them to simulate how dragonflies see the world with multiple images. Then, play a prey-catching game where \"dragonflies\" try to tag flying paper insects, reinforcing how their adaptations make them such skilled hunters.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multi-Sensory Exploration**: Use slow-motion videos to show dragonfly flight and hunting behaviors in action.\n- **Tactile Models**: Provide insect models or diagrams that students can touch and explore to better understand dragonfly anatomy.\n- **Movement Integration**: Have students practice flying like dragonflies, darting forward, backward, and hovering, to experience the mechanics of their flight.\n- **Visual Comparisons**: Display images comparing human eyes and compound eyes side-by-side to highlight the key differences.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS4.C]]: Adaptation\n- [[NGSS:DCI:3-LS2.D]]: Social Interactions and Group Behavior\n- [[NGSS:CCC:Structure]]: Understanding how structure relates to function\n\n## 💬 Discussion Questions\n\n1. How are dragonfly eyes different from human eyes? (DOK 1: Recall)\n2. Why would having 360-degree vision be helpful for a hunting insect like a dragonfly? (DOK 2: Skill/Concept)\n3. Describe how the structure of dragonfly wings helps them catch other insects. (DOK 2: Skill/Concept)\n4. If dragonflies couldn't fly backward or hover, how might this affect their ability to catch food? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made up of thousands of tiny lenses that work together.\n- **Predator**: An animal that hunts and eats other animals.\n- **Aerial**: Relating to the air or flying.\n- **Adaptation**: A feature that helps an organism survive in its environment.\n- **Agile**: Able to move quickly and easily.\n- **Ommatidia**: The individual visual units that make up a compound eye.\n\n## 🌡️ Extension Activities\n\n- Research dragonfly fossil records to learn about their long history (over 300 million years!)\n- Compare dragonfly flight mechanics to the technology used in helicopters and drones\n- Investigate how scientists are studying dragonfly wing designs to improve drone and aircraft performance\n- Create detailed, labeled diagrams of dragonfly anatomy and adaptations",
    "grade4": "## 📸 Photo Description\n\nThis stunning close-up photo shows a bright blue dragonfly resting on a piece of weathered wood. You can see its long, slender body with bold yellow and black stripes, and its huge compound eyes that look like tiny glass beads. Its four transparent wings are spread out, revealing the intricate network of veins that give them strength and flexibility. The dragonfly appears to be taking a peaceful break, perched on the rough, gray surface.\n\n## 🔬 Scientific Phenomena\n\nDragonflies are amazing aerial hunters, able to see their prey from all angles with their incredible compound eyes. Each of their eyes is made up of thousands of tiny lenses, allowing them to detect even the smallest movements around them. This gives them incredible vision for spotting and catching other flying insects. Dragonflies are also known for their lightning-fast flight and agility, which they use to chase down and capture their prey in mid-air.\n\n## 📚 Core Science Concepts\n\n1. **Compound Eyes**: Dragonflies have large, complex eyes made up of thousands of tiny lenses that work together to provide a wide field of vision.\n\n2. **Adaptations for Flight**: Dragonflies have four strong, transparent wings that allow them to fly forward, backward, hover, and even flip upside down with ease.\n\n3. **Predator-Prey Interactions**: Dragonflies are voracious predators, using their keen eyesight and agile flight to hunt and catch other small insects.\n\n<pedagogical-tip>\nTo help students understand the power of dragonflies' compound eyes, have them create \"dragonfly vision goggles\" using clear plastic cups or bottles with small holes poked throughout. By looking through these goggles, they can simulate how a dragonfly sees the world with multiple images overlapping. Then, play a predator-prey game where \"dragonflies\" try to tag flying paper \"insects\" to reinforce how their vision and flight adaptations make them such successful hunters.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multi-Sensory Exploration**: Use slow-motion videos to show dragonfly flight and hunting behaviors.\n- **Tactile Models**: Provide insect models or diagrams that students can touch and explore to better understand dragonfly anatomy and adaptations.\n- **Movement Integration**: Have students practice flying movements like hovering, darting forward/backward, and flipping upside down to physically experience the mechanics of dragonfly flight.\n- **Visual Comparisons**: Display side-by-side images comparing human eyes to compound eyes, highlighting the key differences.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-LS1.A]]: Structure and Function\n- [[NGSS:DCI:4-LS1.D]]: Information Processing\n- [[NGSS:CCC:Structure]]: Understanding how the structure of organisms relates to their function\n\n## 💬 Discussion Questions\n\n1. How are dragonfly eyes different from human eyes? (DOK 1: Recall)\n2. Why would it be helpful for a hunting insect to have such a wide field of vision? (DOK 2: Skill/Concept)\n3. Describe how dragonflies' wings and flight abilities help them catch other insects. (DOK 2: Skill/Concept)\n4. If dragonflies couldn't fly backward or hover, how might this change their ability to hunt successfully? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made up of thousands of tiny lenses that work together to form an image\n- **Predator**: An animal that hunts and eats other animals\n- **Aerial**: Relating to the air or flying\n- **Adaptation**: A feature that helps an organism survive in its environment\n- **Agile**: Able to move quickly and easily\n- **Prey**: An animal that is hunted and eaten by other animals\n\n## 🌡️ Extension Activities\n\n- Research how dragonfly fossils provide evidence of their ancient origins and evolution\n- Compare dragonfly flight mechanics to the design of modern helicopters and drones\n- Investigate how scientists are studying dragonfly wings to improve drone technology\n- Create detailed labeled diagrams or 3D models of dragonfly anatomy and adaptations",
    "grade5": "## 📸 Photo Description\n\nThis beautiful close-up photograph shows a vibrant blue dragonfly resting on a piece of weathered wood. The dragonfly's long, slender body has distinct black and yellow stripes, and its large, compound eyes are a mesmerizing bright blue color. The dragonfly's four delicate, transparent wings are spread out, showcasing the intricate network of veins that give them strength and flexibility.\n\n## 🔬 Scientific Phenomena\n\nThe dragonfly in this image is demonstrating some of the unique adaptations that make these insects such successful predators. Their enormous compound eyes, which can contain up to 30,000 individual lenses, provide them with almost 360-degree vision - perfect for spotting potential prey. Dragonflies are also incredibly agile flyers, able to dart forward, backward, and hover with ease thanks to the independent movement of their four wings. These special adaptations allow dragonflies to efficiently hunt and catch small flying insects in mid-air.\n\n## 📚 Core Science Concepts\n\n1. **Compound Eyes**: Dragonflies have complex eyes made up of thousands of tiny lenses, giving them nearly panoramic vision to spot prey.\n\n2. **Insect Flight Mechanics**: Dragonflies can independently control the movement of their four wings, allowing for incredible aerial maneuverability.\n\n3. **Predator Adaptations**: Dragonflies have evolved specialized features like large eyes and nimble flight to successfully hunt and catch other insects.\n\n<pedagogical-tip>\nTo help students understand the unique adaptations of dragonflies, have them create their own \"dragonfly vision goggles\" using clear plastic cups or bottles with small holes poked throughout. Students can look through these to simulate how compound eyes see the world. Then, engage them in a predator-prey game where \"dragonflies\" try to tag \"flying insects\" to see how their vision and flight capabilities give them an advantage.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Instruction**: Use slow-motion videos to show dragonfly flight and hunting in action.\n- **Hands-on Exploration**: Provide physical models or diagrams that students can touch and manipulate to better understand dragonfly anatomy and adaptations.\n- **Movement Integration**: Have students practice movements like hovering and flying in different directions to connect to the mechanics of dragonfly flight.\n- **Visual Supports**: Display side-by-side comparisons of human eyes and compound eyes to highlight the differences.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:DCI:5-LS2.A]]: Interdependent Relationships in Ecosystems\n- [[NGSS:CCC:Structure and Function]]: The way an object is shaped or structured determines many of its properties and functions.\n\n## 💬 Discussion Questions\n\n1. How are dragonfly eyes different from human eyes, and how does this help them as predators? (DOK 2: Skill/Concept)\n2. What specific adaptations do dragonflies have that make them such skilled flyers and hunters? (DOK 2: Skill/Concept)\n3. If dragonflies couldn't fly backward or hover, how might this change their ability to catch other insects? (DOK 3: Strategic Thinking)\n4. How do you think the compound eye structure of dragonflies affects the way they perceive the world around them? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Compound eyes**: Eyes made up of thousands of individual light-detecting units called ommatidia.\n- **Predator**: An animal that hunts and eats other animals.\n- **Adaptation**: A physical or behavioral trait that helps an organism survive and thrive in its environment.\n- **Agile**: Able to move quickly and easily.\n- **Maneuverability**: The ability to change direction and position with ease.\n- **Panoramic**: Providing a wide, unobstructed view.\n\n## 🌡️ Extension Activities\n\n- Research how dragonfly wing designs are inspiring new drone and aircraft technologies.\n- Investigate the fossil record of dragonflies, which date back over 300 million years.\n- Compare the flight mechanics of dragonflies to those of other insects or birds.\n- Create detailed, labeled diagrams of dragonfly anatomy and adaptations."
  }
}