{
  "title": "Parts of a Plant",
  "category": "life-science",
  "gradeLevel": "kindergarten",
  "questions": [
    {
      "questionText": "What do you notice about how this seed is changing?",
      "bloomsLevel": "Remember",
      "dokLevel": 1,
      "rubric": {
        "exceeds": "Student identifies multiple specific changes (roots growing, leaves appearing, seed getting bigger) and uses descriptive words to explain what they see.",
        "meets": "Student notices at least two changes to the seed, such as roots coming out or green leaves starting to grow.",
        "approaching": "Student notices one change happening to the seed but description is vague or incomplete.",
        "beginning": "Student makes a simple observation but it is unclear, inaccurate, or shows minimal understanding of the seed's growth."
      }
    },
    {
      "questionText": "Why do you think the roots came out before the leaves?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that roots need to come out first to find water and hold the plant in the soil, showing understanding of root functions.",
        "meets": "Student gives a reasonable explanation that roots come out first to help the plant (such as getting water or staying in place).",
        "approaching": "Student attempts an explanation but it is partially correct or incomplete (such as saying roots come first but not explaining why it matters).",
        "beginning": "Student provides a guess or reason that shows little understanding of what roots do for a plant."
      }
    },
    {
      "questionText": "What do you predict will happen to this plant if we give it sunlight and water?",
      "bloomsLevel": "Predict",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student predicts specific growth changes (taller, more leaves, bigger roots) and explains why sunlight and water help plants grow.",
        "meets": "Student predicts the plant will grow and mentions that sunlight and water help it grow bigger or get more leaves.",
        "approaching": "Student makes a prediction about growth but does not clearly explain how sunlight and water help, or prediction is only partially accurate.",
        "beginning": "Student makes a simple prediction with little or no explanation of why sunlight and water matter to the plant."
      }
    },
    {
      "questionText": "How is this baby plant the same as and different from a big plant?",
      "bloomsLevel": "Compare",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student identifies multiple similarities (both have roots and leaves) and differences (baby plant is smaller, has fewer leaves, newer) using clear comparisons.",
        "meets": "Student describes at least one similarity and one difference between the baby plant and a big plant.",
        "approaching": "Student compares the plants but mentions mostly similarities OR differences, with limited explanation of at least one comparison.",
        "beginning": "Student attempts a comparison but it is vague, mostly incorrect, or shows minimal understanding of plant parts."
      }
    }
  ],
  "generatedAt": "2026-02-15T05:00:48.608Z",
  "cost": 0.004157
}