{
  "id": 6,
  "title": "Predator and Prey",
  "category": "life-science",
  "imageFile": "IMG_0506.jpeg",
  "imagePath": "images/life-science/IMG_0506.jpeg",
  "gradeLevel": "kindergarten",
  "content": "## 📸 Photo Description\n\nA green lizard sits on a big dragonfly with clear wings. The dragonfly has pretty patterns on its wings that look like lines and dots. They are both sitting on green plants.\n\n## 🔬 Scientific Phenomena\n\nThis image captures a **predator-prey interaction** in nature. The gecko (lizard) has caught a dragonfly as food. This represents the natural feeding relationships that exist in ecosystems, where animals must eat other living things to survive and get energy. The gecko's sticky toe pads allow it to climb on plants and catch flying insects like dragonflies.\n\n## 📚 Core Science Concepts\n\n1. **Animals need food to live and grow** - The gecko must eat other animals (like insects) to survive\n2. **Body parts help animals survive** - The gecko has special sticky feet for climbing and a long tongue for catching prey\n3. **Animals live in habitats** - Both the gecko and dragonfly live among green plants that provide shelter and food sources\n4. **Living and non-living things** - Students can identify the living animals and plants versus non-living elements in the photo\n\n<pedagogical-tip>Use this image to help students practice sorting living vs. non-living things. Have them point to each element and explain why it's alive (grows, needs food, moves) or not alive.</pedagogical-tip>\n\n<udl-suggestions>Provide multiple ways for students to engage with this concept by offering hands-on manipulatives like toy animals, picture cards for sorting, and opportunities for students to act out predator-prey relationships through movement and role-play.</udl-suggestions>\n\n## 🔍 Zoom In / Zoom Out Concepts\n\n1. **Zoom In:** The gecko's toe pads have millions of tiny hairs called setae that use molecular forces to stick to any surface, even upside down on glass\n2. **Zoom Out:** This predator-prey relationship is part of a larger food web where energy flows from plants to insects to reptiles to larger predators, maintaining ecosystem balance\n\n## 🤔 Potential Student Misconceptions\n\n1. **Misconception:** \"The lizard is being mean to the dragonfly\"\n   **Clarification:** Animals aren't mean when they eat other animals - they need food to live, just like we do\n\n2. **Misconception:** \"All lizards eat bugs\"\n   **Clarification:** Different lizards eat different foods - some eat plants, some eat insects, and some eat both\n\n3. **Misconception:** \"The dragonfly could have flown away easily\"\n   **Clarification:** Geckos are very fast hunters with special adaptations that help them catch quick prey\n\n## 🎓 NGSS Connections\n\n- **Performance Expectation:** K-LS1-1 - Use observations to describe patterns of what plants and animals need to survive\n- **Disciplinary Core Ideas:** [[NGSS:DCI:K-LS1.C]] - All animals need food in order to live and grow\n- **Crosscutting Concepts:** [[NGSS:CCC:Patterns]] - Patterns in the natural world can be observed and used as evidence\n\n## 💬 Discussion Questions\n\n1. What does the gecko need the dragonfly for? (Bloom's: Understand | DOK: 1)\n2. How do you think the gecko was able to catch the flying dragonfly? (Bloom's: Analyze | DOK: 2)\n3. What would happen if there were no insects for geckos to eat? (Bloom's: Evaluate | DOK: 3)\n4. What other animals might eat insects like this dragonfly? (Bloom's: Apply | DOK: 2)\n\n## 📖 Science Vocabulary\n\n* **Predator:** An animal that hunts and eats other animals\n* **Prey:** An animal that gets eaten by other animals\n* **Habitat:** The place where an animal lives and finds everything it needs\n* **Adaptation:** Special body parts that help animals survive\n* **Insect:** A small animal with six legs and three body parts\n\n## 📚 External Resources\n\n**Children's Books:**\n- What Do You Do With a Tail Like This? by Steve Jenkins\n- Who Eats What? Food Chains and Food Webs by Patricia Lauber\n- Geckos by James E. Gerholdt\n\n**YouTube Videos:**\n- \"Gecko Feet - How Do They Stick?\" - SciShow Kids explanation of gecko toe adaptations https://www.youtube.com/watch?v=hFt4zj1-daI\n- \"Dragonfly Life Cycle\" - National Geographic Kids video showing dragonfly development https://www.youtube.com/watch?v=iJi61NAIsjs",
  "generatedAt": "2026-02-04T01:09:42.600Z"
}