{
  "title": "Dragonfly",
  "category": "life-science",
  "imageFile": "IMG_4274.jpeg",
  "imagePath": "images/life-science/IMG_4274.jpeg",
  "content": "# Engineering Design Challenge: Dragonfly Perch\n\n### Visible Elements in Photo\n- A dragonfly (with transparent wings, segmented blue-green body, and large compound eyes) perched on a rough, weathered wooden or concrete edge\n- A textured, gray surface with visible cracks and ridges\n- Clear detail of the insect's grip and body position on the angled surface\n- Blurred background suggesting an outdoor environment\n\n### Reasonable Inferences\n- **From the dragonfly's perch location**: The insect requires a landing surface that provides grip and stability despite being a fast, aerial flier—suggesting landing spots are not random but need specific surface properties.\n- **From the textured surface**: The rough, irregular texture of the perch likely helps the dragonfly's legs grip more easily than a smooth surface would.\n- **From outdoor context**: Dragonflies hunt insects near water and need reliable resting spots between flights, implying a shelter or landing structure must account for natural behavior patterns.\n\n### Engineering Task\n\n**K-2: Build a Landing Pad for Dragonflies**\nDesign a safe resting spot where a dragonfly (or toy dragonfly) can land and stay still. Use natural materials like twigs, bark, and leaves to create a bumpy, grippy surface. Test it by gently placing a toy bug on it. Does it stay? Can you make it stickier or grippier?\n\n**3-5: Design a Dragonfly Habitat Landing Structure**\nEngineer a landing perch for dragonflies using only natural and recycled materials. Your structure must:\n- Be at least 15 cm tall and positioned at a 30–45° angle\n- Have a textured surface with at least 3 different grip-enhancing features (bark, rough fabric, ridges)\n- Support a 5-gram weight (washer or small stone) without sliding for 10 seconds\n- Be placed within 1 meter of a water source (real or simulated)\n\nTest your design by placing the weight on the perch at different angles and record which materials grip best. Redesign using your findings.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis phase fits because the photo shows a *real organism solving a real problem*—how to perch reliably on natural surfaces. Students observe the dragonfly's actual choice of landing spot and infer the *need* (stable grip, secure rest between flights). This observation-to-problem framing is authentic and motivates the design work that follows.\n\n### Suggested Materials\n- Small twigs, bark strips, or fallen branches\n- Burlap, textured fabric, or sandpaper\n- Recycled cork or foam padding\n- Small weights (washers, stones, or paper clips)\n- Tape, glue, or rubber bands for assembly\n\n### Estimated Time\n**One 45-minute session (K-2) or two 40-minute sessions (3-5)**\n\nFor grades 3–5, split across two days: Day 1 for build and initial testing; Day 2 for observation, data recording, and redesign.\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) by grounding the challenge in observable animal behavior, making the \"need for a solution\" tangible and student-driven rather than teacher-imposed.",
  "inputTokens": 2305,
  "outputTokens": 763,
  "cost": 0.0061200000000000004,
  "generatedAt": "2026-02-09T13:17:10.511Z"
}