{
  "title": "Predator and Prey",
  "category": "life-science",
  "imageFile": "IMG_0506.jpeg",
  "imagePath": "images/life-science/IMG_0506.jpeg",
  "content": "# Engineering Design Challenge: Dragonfly Wings & Lightweight Structures\n\n---\n\n### Visible Elements in Photo\n\n- A dragonfly with four transparent, intricately patterned wings positioned horizontally on green plant stems\n- Multiple green, elongated leaves (appear to be grass or sedge blades) supporting the insect\n- Fine vein patterns visible across each dragonfly wing\n- The dragonfly's small, segmented body positioned between its wings\n- Yellow and pale coloring visible on some plant parts (aging or flowering structures)\n\n---\n\n### Reasonable Inferences\n\n1. **From wing structure (delicate veins + transparency):** Dragonfly wings are designed to be lightweight yet strong enough to support fast, precise movement. The vein pattern distributes force across the wing without adding weight.\n\n2. **From positioning on thin stems:** The dragonfly's weight and wing span are proportional to the slender plant material available—suggesting a natural balance between an organism's size and the support systems in its environment.\n\n3. **From transparent wing material:** Wings that allow light through are stronger per unit mass than opaque alternatives, which relates to material efficiency in nature.\n\n---\n\n### Engineering Task\n\n#### **K-2: Make Wings for a Bug**\nDesign and build a pair of wings for a toy bug (or cardboard cutout) using thin, see-through materials. Your wings must:\n- Be light enough that the bug can stay balanced on a pencil or stick\n- Have lines or patterns on them (like real dragonfly wings)\n- Be able to \"flap\" or move without tearing when you move the stick gently\n\n**Success check:** Can your bug balance on the stick without tipping? Do the wings stay attached after 5 gentle wiggles?\n\n---\n\n#### **3-5: Design a Lightweight Structural Wing**\nDesign a model wing (8–10 cm long) that mimics dragonfly wing efficiency. Your wing must:\n- Be made using no more than 3 grams of material total\n- Support a small load (3 washers or paper clips) hung from its center without bending more than 1 cm\n- Include at least 3 internal support lines or \"veins\" that mirror the pattern visible in the photo\n- Use transparent or translucent material for at least 50% of its surface\n\n**Success criteria:**  \n✓ Total mass recorded and ≤ 3g  \n✓ Load remains suspended without touching the ground  \n✓ Wing bends ≤ 1 cm when load is applied  \n✓ Vein pattern sketched and labeled before building  \n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real solution already in nature (the dragonfly's efficient wing design), so students should begin by observing and asking: *What problem does the dragonfly wing solve?* (lightweight, strong, fast-moving). This phase builds curiosity and biomimicry thinking before students move to planning their own designs. The visible structure invites questioning rather than prescribing a solution path.\n\n---\n\n### Suggested Materials\n\n- Cellophane or clear plastic wrap\n- Straws or thin wooden dowels (for veins/frame)\n- Tape (masking or clear)\n- String or fishing line (for hanging washers)\n- Washers, paper clips, or small metal weights\n- Markers or colored pencils (for vein patterns)\n- Scissors and rulers\n\n---\n\n### Estimated Time\n\n**K-2:** 30–40 minutes (15 min. design, 15 min. build, 10 min. test & adjust)\n\n**3-5:** Two 35–40 minute sessions (Session 1: observation, sketching, vein planning; Session 2: build, test, measure, revise)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem that can be solved by applying scientific ideas about how living organisms use materials to accomplish specific functions*) by having students observe a real organism's structure and replicate its efficiency principles using classroom materials.",
  "inputTokens": 2305,
  "outputTokens": 939,
  "cost": 0.007000000000000001,
  "generatedAt": "2026-02-09T13:16:34.008Z"
}