{
  "title": "Swallowtail Butterfly",
  "category": "life-science",
  "imageFile": "IMG_2566.jpeg",
  "imagePath": "images/life-science/IMG_2566.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Butterflies and Flowers Working Together\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Body structures help organisms meet their needs:** The butterfly's long, thin mouth part (proboscis) is specially designed to drink nectar from flowers, and the flower's shape helps the butterfly land and feed.\n- **Living things have external parts:** Both butterflies and flowers have visible body parts (wings, petals, antennae) that help them survive and do their jobs.\n- **Animals and plants interact in nature:** Butterflies visit flowers to eat, and flowers depend on butterflies to help them make seeds—this is a helpful relationship between two different living things.\n- **Patterns in behavior help organisms survive:** Both the butterfly and flower \"know\" what to do without being taught—the butterfly finds food and the flower attracts the butterfly.\n\n---\n\n## Lesson Title\n\n**Butterflies and Flowers: Perfect Partners**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 90–120 minutes across two sessions (Session 1: Engage + Explore = 45 minutes; Session 2: Explain + Elaborate + Evaluate = 45–60 minutes)\n- **NGSS Standards:** \n  - 1-LS1-1 (Use materials to design a solution by mimicking how plants/animals use external parts)\n  - 1-LS3-1 (Make observations to construct an evidence-based account that young plants and animals are like, but not exactly like, their parents)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Identify the external body parts of a butterfly and a flower and describe what each part does.\n2. Explain how a butterfly's body parts help it find food from a flower.\n3. Observe and record evidence that butterflies and flowers work together to help each other survive.\n4. Design a simple flower shape that would help a butterfly land and feed.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Large, high-resolution color printout of the photograph (or projected image on screen)\n- Chart paper and markers\n- Sticky notes (optional, for wonder questions)\n\n**Activity:**\n\n1. **Display the photograph** on a screen or large printout. Let students look silently for 20–30 seconds without talking.\n\n2. **Ask these discovery questions one at a time, pausing for responses:**\n   - \"What two living things do you see in this picture?\" (Butterfly and flower)\n   - \"What is the butterfly doing? Why do you think it's sitting on the flower?\" (It looks like it's eating or drinking. Plants might have food the butterfly likes.)\n   - \"Look at the butterfly's long, curly mouth part. What do you think it uses that for?\" (Drinking the sweet juice from the flower)\n   - \"Do you think the butterfly needs the flower? Do you think the flower needs the butterfly? Why?\" (Accept all reasonable responses; this is pre-teaching.)\n\n3. **Prediction prompt:** \"I wonder what would happen if there were no flowers. What do you think the butterfly would do?\"\n\n4. **Chart student responses** on a \"What We Wonder\" poster to revisit after Explore.\n\n**Transition:** \"Today, we're going to act like scientists and explore how butterflies and flowers are special partners. Let's find out!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Large flower cutouts (pre-made from pink/red construction paper, one per small group; see template below)\n- Butterfly cutouts with thin straws or pipe cleaners attached as \"proboscis\" (one per student; pre-made)\n- Small yellow pom-poms or bead \"nectar\" in shallow containers\n- Recording sheets (simple line drawings of a flower with labels for parts; one per student)\n- Colored pencils or crayons\n\n**Preparation:** Before the lesson:\n- Cut flower shapes with a center circle (where \"nectar\" will be placed).\n- Attach one thin straw or pipe cleaner to each butterfly cutout to represent the proboscis.\n- Place 5–10 yellow pom-poms in a cup labeled \"Flower Nectar.\"\n\n**Activity:**\n\n1. **Explain the setup:** \"You are going to be butterflies. Your flower is here. Your job is to use your long mouth part (the straw) to find the sweet food—nectar—inside the flower. See how it works?\"\n\n2. **Demonstrate once:** Show how to hold the butterfly cutout and lower the straw into the flower's center circle to touch the pom-poms (nectar). Explain: \"The real butterfly's long mouth part goes deep into the flower to drink the sweet juice.\"\n\n3. **Student exploration (in pairs or small groups):**\n   - Pair students. Give each pair a flower cutout and 1–2 butterfly models.\n   - Students take turns being the butterfly and feeding from the flower center.\n   - After 2–3 turns each, switch to a new \"flower\" (different group).\n\n4. **Guided observation while exploring:**\n   - Teacher circulates and asks:\n     - \"Can your butterfly's mouth part reach the nectar in the middle?\"\n     - \"What happens when you move the straw around?\"\n     - \"Does the butterfly's wing shape help it land on the flower?\"\n\n5. **Documentation:**\n   - Students return to their seats and draw or label the flower parts on their recording sheet.\n   - Prompt: \"Draw what the butterfly's mouth part does. Show where it goes in the flower.\"\n   - Students color and label: petals, center/nectar, butterfly's mouth part.\n\n**Teacher Role:**\n- Circulate and observe without correcting immediately.\n- Ask open-ended questions: \"What are you discovering?\" \"How does that work?\"\n- Take notes on student observations for the Explain phase.\n- Ensure all students get a turn to explore.\n\n**Expected Student Outcomes:**\n- Students discover that the straw-proboscis can reach into the flower center.\n- Students notice that the flower's shape makes it easier for the butterfly to land.\n- Student drawings show the relationship between the butterfly's mouth part and the flower's center.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Chart paper and markers\n- Labeled diagram of a real butterfly and flower (teacher-made or printed)\n- The original photograph\n- Student recording sheets from Explore phase\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Invite 3–4 students to share their drawings and explain what they discovered.\n   - Prompt: \"Tell us what you found out about the butterfly's mouth part. How did it help the butterfly get food from the flower?\"\n\n2. **Introduce vocabulary and connect to the real photograph (7 minutes):**\n   - Display the original butterfly-and-flower photograph alongside the student exploration.\n   - Explain and write each term on chart paper:\n\n     **Vocabulary:**\n     - **Proboscis** (pro-BOS-sis): A long, thin tube-shaped mouth part that butterflies use to drink sweet juice (nectar) from flowers. (Show with your finger how thin and long it is.)\n     - **Nectar** (NEK-tar): Sweet liquid inside flowers that butterflies and other insects drink for food energy.\n     - **Petals** (PET-als): The colorful leaf-like parts of a flower that attract butterflies and insects.\n     - **External parts** (ex-TER-nal): Body parts on the outside of an animal or plant that you can see and touch.\n     - **Partner** (PART-ner): Two living things that work together and help each other.\n\n3. **Make connections (5 minutes):**\n   - Point to the photo: \"This real butterfly has a proboscis just like your straw did. It's drinking nectar from this real flower.\"\n   - \"The flower's petals are bright pink. Can the butterfly see pink? Yes! Pink petals help the butterfly find the food.\"\n   - \"The butterfly needs the flower for food. The flower needs the butterfly to help it make baby flowers. They are partners!\"\n\n4. **Check for understanding:**\n   - Ask: \"Show me with your finger where the butterfly's proboscis goes.\" (Students point to flower center in the photo.)\n   - Ask: \"What do we call the sweet juice inside the flower?\" (Nectar.)\n   - Ask: \"Why do you think the flower is bright pink?\" (To help the butterfly find it; to attract the butterfly.)\n\n**Expected Student Outcomes:**\n- Students can name at least 2 external body parts of a butterfly (proboscis, wings) and a flower (petals, center).\n- Students understand that the proboscis helps the butterfly eat.\n- Students recognize the butterfly and flower as partners.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Colored construction paper (pink, red, yellow, orange, purple)\n- Pipe cleaners (for stems)\n- Scissors (teacher-cut or pre-cut for younger students)\n- Glue sticks\n- Student-made butterfly models from Explore (or new ones)\n- Markers\n- Optional: googly eyes for decoration\n\n**Activity: Design a Perfect Flower**\n\n1. **Set the challenge (2 minutes):**\n   - \"We learned that flowers have special parts that help butterflies find food. Now you are going to design your own flower. Your flower should help a butterfly land on it and drink nectar. Think about what shape, color, and size would work best.\"\n\n2. **Student design and creation (12–15 minutes):**\n   - Provide students with pre-cut flower petal shapes OR guide them to cut their own (teacher-adapted for first grade ability).\n   - Students assemble petals into a flower shape using glue, add a yellow center circle for \"nectar,\" and attach a pipe-cleaner stem.\n   - Students decorate with bright colors and patterns.\n   - Encourage students to think aloud: \"I made big petals so the butterfly can land easily\" or \"I made it bright red so the butterfly can see it far away.\"\n\n3. **Test the design (3–5 minutes):**\n   - Students use their butterfly model to \"land\" on and \"feed\" from their designed flower.\n   - Peer testing: Swap designs with a neighbor and test whether their butterfly can easily reach the nectar.\n   - Ask: \"Does your flower work well for the butterfly? What could you change?\"\n\n**Teacher Role:**\n- Facilitate cutting and gluing (provide hand-over-hand help if needed).\n- Ask questions: \"Why did you choose that color?\" \"How will the butterfly know where to land?\"\n- Encourage trial-and-error: \"Try it out. Does it work? What would make it better?\"\n\n**Expected Student Outcomes:**\n- Students create a flower design that is visually distinct.\n- Students test and explain why their design does or does not work for a butterfly.\n- Students demonstrate understanding that flower features (size, color, shape) help butterflies.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of learning objectives.\n\n**Activity:**\n\n**Formative Assessment (ongoing throughout lesson):**\n- Observations during Explore: Can students identify where nectar is and how the proboscis reaches it?\n- Observations during Explain: Do students use vocabulary correctly when talking about butterfly and flower parts?\n- Observations during Elaborate: Can students explain why their designed flower would help a butterfly?\n\n**Exit Ticket (Summative Assessment) — Administer at end of Session 2 (5 minutes):**\n\n**Option A (Pictures + Words):**\nProvide students with a simple worksheet with three questions:\n\n1. **Draw or point:** \"Show me the butterfly's mouth part that drinks nectar.\" (Student points to or draws the proboscis.)\n2. **Fill in the blank:** \"The butterfly drinks __________ from the flower.\" (Answer: nectar or sweet juice)\n3. **Yes or No:** \"Do butterflies and flowers help each other?\" (Answer: Yes) \"How do they help each other?\" (Student response: Butterfly gets food; flower gets help making babies.)\n\n**Option B (Observational):**\n- Show the original photograph again.\n- Ask: \"What is the butterfly doing? Point to the part that helps it drink.\"\n- Ask: \"Why is this flower important to the butterfly?\"\n- Listen for responses that mention feeding, the proboscis, and the relationship.\n\n**Success Criteria:**\n- ✓ Students can identify at least one external body part of a butterfly and one of a flower.\n- ✓ Students can explain that the butterfly drinks nectar from the flower.\n- ✓ Students can tell or show that the butterfly and flower help each other (at least one reason).\n- ✓ Students' designed flower demonstrates understanding that shape, color, or size helps butterflies find and feed from flowers.\n\n**Expected Student Outcomes:**\n- Most students (80%+) will correctly identify the proboscis as the butterfly's feeding part.\n- Most students will explain that butterflies eat from flowers and that the flower's bright color helps the butterfly find it.\n- Students' drawings and descriptions will show evidence of understanding the relationship between butterfly and flower parts.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified vocabulary:** Use \"butterfly mouth\" instead of \"proboscis\" during initial instruction; introduce the formal term later or skip it for struggling students.\n\n2. **Pre-made visual aids:** Provide laminated, labeled diagrams of butterfly and flower parts that students can reference during all activities. Use picture cards instead of written words.\n\n3. **Guided exploration:** During Explore, assign a peer buddy or paraprofessional to sit with the student and model the activity first (\"Watch me feed the butterfly. Now you try.\"). Repeat the activity 2–3 times with support.\n\n4. **Exit ticket modification:** Allow students to point and answer yes/no questions instead of writing. Provide three picture choices: \"What does the butterfly do at the flower? A) Sleep, B) Drink nectar, C) Build a nest.\" Correct answer is B.\n\n### Challenge (For Advanced Learners)\n\n1. **Research and compare:** Provide picture cards of 3–4 different butterfly and flower types. Ask: \"Do all butterflies have the same mouth part? Do all flowers look the same? Why do you think there are different kinds?\"\n\n2. **Design for a purpose:** Instead of designing one flower, challenge students to design two different flowers: one for a small butterfly and one for a large butterfly. Ask: \"How would the flower shape or size change? Why?\"\n\n3. **Write or illustrate a story:** \"Write (or draw and tell) what happens when a butterfly visits a flower. What does the butterfly do? What happens to the flower? Use words like nectar, petals, and proboscis.\"\n\n4. **Extend the ecosystem:** Introduce a third organism. \"If the butterfly needs nectar, what else might eat the butterfly? What might eat the flower?\" Begin exploring simple food chains.\n\n---\n\n## Extension Activities\n\n1. **Butterfly and Flower Observation Walk:** Take students on a nature walk around the school grounds or a nearby park (if available). Have them look for real butterflies and flowers. Provide clipboards with a simple checklist: \"Did you see a butterfly? □ Did you see a flower? □ Do they look like our pictures? □\" Students draw or photograph (with teacher's phone) any butterflies or flowers they find. Return to class and discuss: \"Were the real butterflies and flowers the same or different from what we made?\"\n\n2. **Butterfly Life Cycle Sorting Activity:** Introduce the four life cycle stages of a butterfly (egg, caterpillar, chrysalis, butterfly) using simple pictures. Students sort the pictures in order and place a real flower at the end: \"The butterfly needs flowers to eat.\" This connects to 1-LS3-1 (young and adult organisms are alike but not identical) and preps for future life cycle lessons.\n\n3. **Create a Pollinator Garden Plan:** In small groups, students design a simple garden for butterflies using construction paper cutouts of different flowers. They arrange flowers, add drawn butterflies, and explain their design: \"I put red flowers next to yellow flowers so the butterfly can find lots of food.\" Display designs around the classroom or in the hallway as a \"butterfly garden gallery.\"\n\n---\n\n## Notes for Teacher Success\n\n- **Pacing:** If time is tight, combine Explain and Elaborate into one 30–35 minute session; reduce the design complexity of the flower project.\n- **Real-world connection:** If possible, show a short video clip (2–3 minutes) of a real butterfly feeding from a flower in slow motion. This dramatically reinforces the lesson and keeps attention high.\n- **Cross-curricular link:** Partner with the Art teacher to have students create large flower sculptures using tissue paper, pipe cleaners, and paper plates. Integrate math by counting petals or comparing flower sizes.\n- **Parent engagement:** Send home a simple observation sheet asking families to observe and draw any butterflies or flowers they see in their yard or neighborhood. Have students share findings the next day.",
  "inputTokens": 2892,
  "outputTokens": 4051,
  "cost": 0.023146999999999997,
  "generatedAt": "2026-02-12T19:32:51.192Z"
}