{
  "id": 12,
  "title": "Swallowtail Butterfly Feeding",
  "category": "life-science",
  "imageFile": "IMG_2566.jpeg",
  "content": "## 📸 Photo Description\n\nThis stunning photo shows a large butterfly feeding on a pink flower! The butterfly is a swallowtail, with beautiful cream and black patterns on its wings and distinctive tail-like points at the bottom. You can see the butterfly's long, curled tongue (called a proboscis) reaching into the flower to drink nectar. The pink flower with its bright yellow center provides the perfect landing pad for this hungry visitor.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates pollination and the mutualistic relationship between butterflies and flowers. While the butterfly drinks sweet nectar for energy, pollen from the flower sticks to its body. When the butterfly visits the next flower, some of that pollen rubs off, helping the plant reproduce. This is a win-win relationship – the butterfly gets food, and the flower gets pollinated! The butterfly's long proboscis is a special adaptation that allows it to reach nectar deep inside tubular flowers.\n\n## 📚 Core Concepts\n\n1. **Pollination**: The transfer of pollen from one flower to another, which allows plants to make seeds and reproduce.\n\n2. **Mutualism**: A relationship where two different organisms help each other – butterflies get food, and flowers get pollinated.\n\n3. **Adaptations for Feeding**: The butterfly's proboscis works like a drinking straw, uncoiling to reach deep into flowers and coiling back up when not in use.\n\n<pedagogical-tip>\nDemonstrate how a proboscis works using a party blower! Have students try drinking juice through a curly straw, then explain that butterflies coil and uncoil their \"tongue\" the same way. Create model flowers with straws and colored water as \"nectar\" so students can practice reaching in like a butterfly. This makes the abstract concept tangible and fun.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Hands-On Models**: Provide party blowers and straws to demonstrate proboscis mechanics\n- **Visual Supports**: Show macro photography or videos of butterflies drinking nectar\n- **Movement Activity**: Have students act out pollination with students as \"flowers\" and \"butterflies\"\n- **Graphic Organizers**: Use flow charts to show how pollination benefits both organisms\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS2.C]]: Ecosystem Dynamics, Functioning, and Resilience\n- [[NGSS:DCI:3-LS4.B]]: Natural Selection\n- [[NGSS:DCI:3-LS2.D]]: Social Interactions and Group Behavior\n- [[NGSS:CCC:Systems]]: Understanding how organisms interact in ecosystems\n\n## 💬 Discussion Questions\n\n1. What is the butterfly using to drink nectar from the flower? (DOK 1: Recall)\n2. How does the butterfly help the flower while getting food for itself? (DOK 2: Skill/Concept)\n3. What would happen to flowers if there were no butterflies, bees, or other pollinators? (DOK 3: Strategic Thinking)\n4. Why do you think flowers have bright colors and sweet nectar? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Proboscis**: A long, tube-like tongue that butterflies use to drink nectar\n- **Nectar**: Sweet liquid inside flowers that attracts pollinators\n- **Pollination**: The transfer of pollen from one flower to another\n- **Mutualism**: A relationship where two organisms help each other\n- **Swallowtail**: A type of butterfly with tail-like extensions on its hind wings\n\n## 🦋 Extension Activities\n\n- Plant a butterfly garden with nectar-rich flowers (zinnias, coneflowers, milkweed)\n- Observe and document butterfly visits, recording which flowers they prefer\n- Research butterfly migration patterns (like Monarchs)\n- Create a pollination diagram showing the step-by-step process",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis amazing photo shows a beautiful swallowtail butterfly feeding on a pink flower. The butterfly's large, black-and-yellow wings have distinctive tail-like points at the bottom. You can see its long, curled tongue, called a proboscis, reaching deep into the flower to drink the sweet nectar. The bright pink flower with a yellow center provides the perfect landing spot for this hungry butterfly visitor.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of pollination and the special relationship between butterflies and flowers. As the butterfly drinks the nectar from the flower, pollen from the flower sticks to its body. When the butterfly visits the next flower, some of that pollen rubs off, helping the plant make seeds and reproduce. This is a great example of mutualism, where both the butterfly and the flower benefit - the butterfly gets food, and the flower gets pollinated.\n\n## 📚 Core Science Concepts\n\n1. **Pollination**: The transfer of pollen from one flower to another, which allows plants to make seeds and reproduce.\n\n2. **Adaptations for Feeding**: The butterfly's long, curled proboscis is a special adaptation that helps it reach deep into flowers to drink the sweet nectar.\n\n3. **Mutualism**: A relationship where two different organisms help each other - the butterfly gets food, and the flower gets pollinated.\n\n<pedagogical-tip>\nTo help students understand how a butterfly's proboscis works, you can use a party blower or a curly straw. Demonstrate how the proboscis can uncoil and coil back up, just like a straw. Then, have students practice \"drinking\" juice through the straw, just like a butterfly drinks nectar. This hands-on activity will make the abstract concept of a proboscis more tangible and engaging for young learners.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Hands-On Models**: Provide party blowers or curly straws for students to explore how a proboscis works.\n- **Visual Supports**: Show close-up photos or videos of butterflies feeding on flowers to help students visualize the process.\n- **Movement Activity**: Have students act out the pollination process, with some students being \"flowers\" and others being \"butterflies\".\n- **Graphic Organizers**: Use simple diagrams or flow charts to show how pollination benefits both the butterfly and the flower.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:DCI:K-ESS3.A]]: Interdependent Relationships in Ecosystems\n- [[NGSS:CCC:Cause and Effect]]: Understanding how the butterfly's proboscis helps it get food, and how that benefits the flower.\n\n## 💬 Discussion Questions\n\n1. What is the butterfly using to drink the nectar from the flower? (DOK 1: Recall)\n2. How does the butterfly help the flower while it is getting food for itself? (DOK 2: Skill/Concept)\n3. What do you think would happen to the flowers if there were no butterflies or other pollinators? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Proboscis**: The long, tube-like tongue that butterflies use to drink nectar from flowers.\n- **Nectar**: The sweet liquid inside flowers that attracts pollinators like butterflies.\n- **Pollination**: The process of transferring pollen from one flower to another, which allows plants to make seeds and reproduce.\n- **Mutualism**: A relationship where two different organisms help each other, like how butterflies and flowers work together.\n- **Swallowtail**: A type of butterfly with distinctive tail-like points on its hind wings.\n\n## 🦋 Extension Activities\n\n- Plant a butterfly garden with nectar-rich flowers, like zinnias, coneflowers, or milkweed, and observe which flowers the butterflies visit.\n- Create a simple diagram or model to show the step-by-step process of pollination.\n- Research and learn about the amazing migration patterns of some butterflies, like the Monarch butterfly.",
    "grade1": "## 📸 Photo Description\n\nThis picture shows a beautiful butterfly called a swallowtail feeding on a pink flower. The swallowtail has stunning black and yellow patterns on its large wings. You can see the butterfly's long, curled tongue, called a proboscis, reaching into the center of the flower to drink the sweet nectar. The flower has bright pink petals and a yellow middle, providing a perfect landing spot for this hungry visitor.\n\n## 🔬 Scientific Phenomena\n\nThe swallowtail butterfly is feeding on the nectar from the flower. This is an example of a special relationship called pollination. As the butterfly drinks the nectar, pollen from the flower sticks to its body. When the butterfly visits the next flower, some of that pollen rubs off, helping the plant make seeds and reproduce. So the butterfly gets food, and the flower gets pollinated - it's a win-win for both!\n\n## 📚 Core Science Concepts\n\n1. **Pollination**: The process where pollen is transferred from one flower to another, allowing plants to make seeds and reproduce.\n\n2. **Adaptations for Feeding**: The butterfly's long, curled proboscis is a special adaptation that helps it reach deep into flowers to drink nectar.\n\n3. **Mutualism**: A relationship where two different organisms help each other, like how butterflies get food and flowers get pollinated.\n\n<pedagogical-tip>\nTo help students understand how a butterfly's proboscis works, try using a party blower or curly straw. Have students pretend to be butterflies and practice \"drinking\" from model flowers. This hands-on activity will make the concept of a proboscis more concrete and engaging for first graders.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Supports**: Provide real flowers or nectar-filled cups for students to observe and interact with\n- **Visual Aids**: Show close-up photos or videos of butterflies feeding to supplement the main image\n- **Movement Activities**: Act out the pollination process with students as \"butterflies\" and \"flowers\"\n- **Graphic Organizers**: Use simple diagrams to illustrate the mutualistic relationship between butterflies and flowers\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-LS1.A]]: Structure and Function\n- [[NGSS:DCI:1-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:CCC:Systems]]: Understanding how organisms interact in an ecosystem\n\n## 💬 Discussion Questions\n\n1. What part of the butterfly's body is it using to drink the nectar from the flower? (DOK 1: Recall)\n2. How does the butterfly help the flower while getting food for itself? (DOK 2: Skill/Concept)\n3. What might happen to the flowers if there were no butterflies or other pollinators? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Proboscis**: The long, curled \"tongue\" that butterflies use to drink nectar from flowers.\n- **Nectar**: The sweet liquid inside flowers that attracts pollinators like butterflies.\n- **Pollination**: The process of pollen being transferred from one flower to another, allowing plants to reproduce.\n- **Mutualism**: A relationship where two different organisms help each other, like how butterflies and flowers do.\n- **Swallowtail**: A type of large butterfly with distinctive \"tails\" on its hind wings.\n\n## 🦋 Extension Activities\n\n- Go on a nature walk and try to spot different types of butterflies visiting flowers.\n- Create a painting or drawing of a swallowtail butterfly feeding on a flower.\n- Research how butterflies find and identify the flowers they like best.\n- Plant a butterfly garden with nectar-rich flowers to attract these beautiful pollinators.",
    "grade2": "## 📸 Photo Description\n\nThis amazing photo shows a large swallowtail butterfly drinking nectar from a beautiful pink flower. The butterfly has stunning black and yellow patterns on its wings, and you can see its long, curled proboscis (tongue) sticking out to reach deep into the flower. The butterfly is feeding on the sweet nectar inside the flower, which provides it with energy. The pink flower with its bright yellow center makes a perfect landing spot for this hungry visitor.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the process of pollination and the special relationship between butterflies and flowers. As the butterfly drinks the nectar, pollen from the flower sticks to its body. When the butterfly visits the next flower, some of that pollen rubs off, helping the plant to make seeds and reproduce. This is a win-win situation - the butterfly gets the food it needs, and the flower gets pollinated!\n\nThe butterfly's long, curled proboscis is a special adaptation that allows it to reach deep inside the tubular flower to access the nectar. This is an example of how the butterfly's body is perfectly suited for its feeding behavior.\n\n## 📚 Core Science Concepts\n\n1. **Pollination**: The process of transferring pollen from one flower to another, which allows plants to make seeds and reproduce.\n\n2. **Adaptations**: Special features or characteristics that help an organism survive and thrive in its environment, like the butterfly's long proboscis.\n\n3. **Mutualism**: A symbiotic relationship where two different organisms help each other, such as butterflies getting food and flowers getting pollinated.\n\n<pedagogical-tip>\nTo help students understand the butterfly's proboscis, demonstrate how it works using a party blower or curly straw. Let students practice \"drinking\" colored water (like nectar) from a model flower. This hands-on activity will make the abstract concept of a proboscis more concrete and engaging for second graders.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimodal Instruction**: Use visuals, models, and hands-on activities to demonstrate pollination and the butterfly's feeding adaptations.\n- **Choice and Flexibility**: Allow students to choose how they want to demonstrate their understanding, such as creating a diagram, writing a story, or acting out the pollination process.\n- **Scaffold and Support**: Provide sentence starters, graphic organizers, or sentence frames to help students articulate their ideas about the scientific concepts.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-LS2.A]]: Interdependent Relationships in Ecosystems\n- [[NGSS:DCI:2-LS4.D]]: Biodiversity and Humans\n- [[NGSS:CCC:Cause and Effect]]: Understanding how the butterfly's adaptations lead to its ability to feed on nectar and pollinate flowers.\n\n## 💬 Discussion Questions\n\n1. What is the butterfly using to drink the nectar from the flower? (DOK 1: Recall)\n2. How does the butterfly help the flower while it is getting food for itself? (DOK 2: Skill/Concept)\n3. What would happen to the flowers if there were no butterflies, bees, or other pollinators? (DOK 3: Strategic Thinking)\n4. Why do you think flowers have bright colors and sweet nectar? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Proboscis**: The long, tube-like tongue that butterflies use to drink nectar from flowers.\n- **Nectar**: The sweet liquid inside flowers that attracts pollinators like butterflies.\n- **Pollination**: The process of transferring pollen from one flower to another, which allows plants to make seeds and reproduce.\n- **Mutualism**: A symbiotic relationship where two different organisms help each other, like butterflies and flowers.\n- **Swallowtail**: A type of butterfly with distinctive tail-like extensions on its hind wings.\n- **Adaptation**: A special feature or characteristic that helps an organism survive and thrive in its environment.\n\n## 🦋 Extension Activities\n\n- Create a pollination diagram showing the step-by-step process.\n- Observe and document butterfly visits to a butterfly-friendly garden, recording which flowers they prefer.\n- Research the amazing migration patterns of Monarch butterflies.\n- Design and build a model of a flower with a proboscis-like straw to demonstrate how butterflies feed.",
    "grade3": "## 📸 Photo Description\n\nThis beautiful photo shows a swallowtail butterfly feeding on a vibrant pink flower. The butterfly has distinctive black and yellow markings on its large, elegant wings. You can clearly see its long, thin proboscis (or tongue) uncoiled and inserted deep into the flower's center, where it is drinking sweet nectar. The bright pink petals and sunny yellow center of the flower provide the perfect platform for the butterfly to land and feed.\n\n## 🔬 Scientific Phenomena\n\nThis image beautifully demonstrates the process of pollination and the mutualistic relationship between butterflies and flowering plants. As the butterfly drinks the nectar from the flower, pollen grains stick to its body. When the butterfly flies to the next flower, some of that pollen rubs off, allowing the plant to be pollinated and reproduce. This is a win-win situation - the butterfly gets a nutritious meal, and the flower gets pollinated so it can make seeds and grow. The butterfly's long, coiled proboscis is a special adaptation that allows it to reach deep into the tubular flowers to access the nectar.\n\n## 📚 Core Science Concepts\n\n1. **Pollination**: The transfer of pollen from one flower to another, which allows plants to reproduce and make seeds.\n2. **Mutualism**: A type of symbiotic relationship where two different organisms benefit each other - in this case, the butterfly gets food and the flower gets pollinated.\n3. **Adaptations for Feeding**: The butterfly's long, coiled proboscis is perfectly suited to reach deep into the flower and drink the nectar.\n\n<pedagogical-tip>\nTo help students understand the butterfly's proboscis, have them pretend to be butterflies and use a straw or party favor to \"drink\" colored water from a model flower. This hands-on activity will make the concept more concrete and memorable. You can also show videos of butterflies feeding to further illustrate this adaptation.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Supports**: Allow students to feel the coiled proboscis of a real butterfly specimen (if available) or use a model/toy\n- **Visual Aids**: Display close-up photos and videos of butterflies feeding to support visual learners\n- **Kinesthetic Activities**: Have students act out the pollination process, with some as \"butterflies\" and others as \"flowers\"\n- **Graphic Organizers**: Use diagrams or flow charts to show the mutualistic relationship between butterflies and flowers\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:DCI:3-LS2.C]]: Ecosystem Dynamics, Functioning, and Resilience\n- [[NGSS:CCC:Cause and Effect]]: Understand how the proboscis adaptation allows butterflies to feed on nectar\n\n## 💬 Discussion Questions\n\n1. What part of the butterfly's body does it use to drink nectar from the flower? (DOK 1: Recall)\n2. How does the butterfly help the flower while it is getting food for itself? (DOK 2: Skill/Concept)\n3. What would happen to the flowers if there were no butterflies or other pollinators? (DOK 3: Strategic Thinking)\n4. Why do you think flowers have bright colors and sweet nectar? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Proboscis**: The long, tube-like \"tongue\" that butterflies use to drink nectar from flowers\n- **Nectar**: The sweet liquid inside flowers that attracts pollinators like butterflies\n- **Pollination**: The transfer of pollen from one flower to another, allowing the plant to reproduce\n- **Mutualism**: A type of symbiotic relationship where both organisms benefit from the interaction\n- **Swallowtail**: A type of butterfly known for its distinctive \"tails\" on the hind wings\n- **Adaptation**: A physical or behavioral feature that helps an organism survive and thrive in its environment\n\n## 🦋 Extension Activities\n\n- Plant a butterfly garden with nectar-rich flowers and observe which ones attract the most butterflies\n- Research the migration patterns of butterflies like the Monarch and create a map showing their journeys\n- Conduct an experiment to see how different colors or shapes of flowers affect butterfly visitation\n- Design and build a model of a butterfly's proboscis using straws, pipe cleaners, or other materials",
    "grade4": "## 📸 Photo Description\n\nThis gorgeous photo shows a large swallowtail butterfly feeding on a vibrant pink flower. The butterfly's distinctive black and yellow wings are clearly visible, with its unique \"tails\" extending from the hind wings. The butterfly's long, coiled tongue, called a proboscis, is carefully inserted into the flower's center to drink the sweet nectar inside.\n\n## 🔬 Scientific Phenomena\n\nThis image demonstrates the important process of pollination and the mutualistic relationship between butterflies and flowers. As the butterfly feeds on the nectar, pollen from the flower's stamens sticks to its body. When the butterfly visits the next flower, some of that pollen is transferred, allowing the plant to reproduce. This is a win-win situation - the butterfly gets the energy-rich nectar it needs, while the flower is pollinated and can create seeds and fruits. The butterfly's long proboscis is a special adaptation that allows it to reach deep into the tubular flower to access the nectar.\n\n## 📚 Core Science Concepts\n\n1. **Pollination**: The transfer of pollen from one flower to another, which is essential for plant reproduction.\n2. **Mutualism**: A symbiotic relationship where two different organisms benefit each other, like butterflies and flowers.\n3. **Adaptations for Feeding**: The butterfly's long, coiled proboscis is an adaptation that allows it to drink nectar from deep inside flowers.\n\n<pedagogical-tip>\nTo help students understand the concept of proboscis adaptation, demonstrate how a butterfly's \"tongue\" works using a party blower or coiled straw. Let students practice \"drinking\" from model flowers filled with colored water. This hands-on activity will make the abstract idea of a proboscis more concrete and engaging for 4th graders.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multisensory Instruction**: Use visual aids (photos, videos), tactile models (party blowers), and kinesthetic activities (acting out pollination) to appeal to diverse learning styles.\n- **Scaffolding**: Break down the complex process of pollination into simpler steps, using graphic organizers or step-by-step diagrams.\n- **Choice and Autonomy**: Allow students to select their own \"flower\" models or choose how to represent the pollination process (drawing, writing, etc.).\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-LS1.A]]: Structure and Function\n- [[NGSS:DCI:4-LS1.D]]: Information Processing\n- [[NGSS:CCC:Systems]]: Understanding how organisms interact in ecosystems\n\n## 💬 Discussion Questions\n\n1. How does the butterfly's proboscis help it get food from the flower? (DOK 2: Skill/Concept)\n2. Explain how the butterfly and the flower both benefit from their relationship. (DOK 3: Strategic Thinking)\n3. What would happen if there were no more butterflies or other pollinators in the world? (DOK 3: Strategic Thinking)\n4. Why do you think flowers have bright colors and sweet nectar? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Proboscis**: The long, tube-like tongue that butterflies use to drink nectar from flowers.\n- **Nectar**: The sweet liquid inside flowers that attracts pollinators like butterflies.\n- **Pollination**: The transfer of pollen from one flower to another, allowing plants to reproduce.\n- **Mutualism**: A symbiotic relationship where two different organisms both benefit.\n- **Swallowtail**: A type of large butterfly with distinctive \"tails\" on its hind wings.\n- **Adaptation**: A physical or behavioral feature that helps an organism survive and thrive.\n\n## 🦋 Extension Activities\n\n- Create a classroom butterfly garden by planting nectar-rich flowers.\n- Observe and document the butterflies that visit the garden, noting which flowers they prefer.\n- Research the life cycle and migration patterns of swallowtail butterflies or other local species.\n- Design a diagram or model showing the step-by-step process of pollination.",
    "grade5": "## 📸 Photo Description\n\nThis beautiful photograph shows a swallowtail butterfly feeding on a vibrant pink flower. The butterfly has distinctive black and yellow patterned wings with two \"tails\" extending from the hind wings. Its long, coiled proboscis, or tongue-like structure, is clearly visible as it extends into the center of the flower to drink the sweet nectar. The bright pink petals provide a lovely backdrop, highlighting the butterfly's intricate coloring and graceful feeding motion.\n\n## 🔬 Scientific Phenomena\n\nThe scene in this photograph demonstrates the important process of pollination. As the swallowtail butterfly feeds on the nectar of the flower, pollen from the flower's reproductive parts sticks to the butterfly's body. When the butterfly moves to the next flower, some of that pollen rubs off, allowing the plant to reproduce by forming seeds and fruits. This mutually beneficial relationship between the butterfly and the flower is called pollination. The butterfly gains energy from the nectar, while the flower is able to spread its genetic material.\n\n## 📚 Core Science Concepts\n\n1. **Pollination**: The transfer of pollen from the male parts of a flower to the female parts, allowing the plant to reproduce.\n\n2. **Adaptations for Feeding**: The swallowtail butterfly's long, coiled proboscis is a specialized adaptation that allows it to reach deep into tubular flowers to access the nectar.\n\n3. **Mutualism**: A symbiotic relationship where both organisms benefit, as seen in the interaction between the butterfly and the flower.\n\n<pedagogical-tip>\nTo help students understand the concept of pollination, have them act out the process. Designate some students as \"flowers\" and others as \"butterflies.\" The \"butterflies\" can pretend to feed on the \"flowers\" while a teacher or student leader explains how the pollen is transferred. This kinesthetic activity will make the abstract concept more concrete and engaging for 5th grade students.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Hands-On Modeling**: Use pipe cleaners or straws to demonstrate how a butterfly's proboscis works.\n- **Visual Aids**: Show close-up photographs or videos of butterflies feeding to reinforce the observed behavior.\n- **Varied Instruction**: Incorporate a mix of direct instruction, group activities, and independent research to cater to different learning styles.\n- **Vocabulary Support**: Provide visual aids or mnemonics to help students remember key terms like \"proboscis\" and \"mutualism.\"\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:DCI:5-LS2.A]]: Interdependent Relationships in Ecosystems\n- [[NGSS:CCC:Systems and System Models]]: Understanding how components within a system interact\n\n## 💬 Discussion Questions\n\n1. What do you think the butterfly is using to drink the nectar from the flower? (DOK 1: Recall)\n2. How does the butterfly help the flower while getting its own food? (DOK 2: Skill/Concept)\n3. What would happen to the flowers if there were no butterflies, bees, or other pollinators? (DOK 3: Strategic Thinking)\n4. Why do you think flowers have bright colors and sweet nectar? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Proboscis**: The long, tube-like tongue that butterflies use to drink nectar from flowers.\n- **Nectar**: The sweet liquid produced inside flowers that attracts pollinators like butterflies.\n- **Pollination**: The transfer of pollen from the male parts of a flower to the female parts, allowing the plant to reproduce.\n- **Mutualism**: A symbiotic relationship where two different organisms both benefit from the interaction.\n- **Swallowtail**: A type of butterfly that has distinctive \"tails\" extending from the hind wings.\n- **Adaptation**: A physical or behavioral feature that helps an organism survive and thrive in its environment.\n\n## 🦋 Extension Activities\n\n1. Plant a butterfly garden with nectar-rich flowers and observe which species visit.\n2. Research the life cycle of the swallowtail butterfly and how it undergoes complete metamorphosis.\n3. Investigate other examples of mutualistic relationships in nature, such as the relationship between bees and flowers."
  }
}