{
  "title": "Predator and Prey",
  "category": "life-science",
  "imageFile": "IMG_0506.jpeg",
  "imagePath": "images/life-science/IMG_0506.jpeg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Insects and What They Need to Survive\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Living organisms have specific body structures:** The insect in the photograph (a dragonfly) has wings, legs, a body, and eyes—structures that help it survive and move in its habitat.\n- **Animals need specific things to survive:** This insect lives near plants and water, which are essential for its survival and growth.\n- **Adaptation and habitat:** The dragonfly's body structure (wings, size, color) matches its environment among green plants, showing how animals fit their homes.\n- **Insects are important living things:** Insects are animals that live in nature and are part of our world, just like pets, people, and other creatures students know.\n\n---\n\n## Lesson Title\n\n**Wings, Legs, and What Bugs Need: Discovering Dragonflies**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 90–120 minutes across two sessions (Session 1: Engage & Explore, ~60 minutes; Session 2: Explain, Elaborate, & Evaluate, ~60 minutes)\n- **NGSS Standards:** K-LS1-1 (Use observations to describe patterns of what plants and animals need to survive)\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. Observe and identify body parts of an insect (wings, legs, eyes, body).\n2. Describe what animals need to stay alive (food, water, air, shelter/safe place).\n3. Explain that insects live in places that help them survive.\n4. Compare what a dragonfly needs to what they (kindergarteners) need to survive.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10–15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about insects and animals using the photograph.\n\n**Materials:**\n- Printed or projected photograph of the dragonfly (large enough for all students to see clearly)\n- Chart paper and markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or projector. Say: \"Look at this amazing creature! Who can tell me what they see?\" Allow students to point and describe freely for 1–2 minutes without correction.\n\n2. **Ask these specific discussion questions** (pause after each for responses):\n   - \"Do you think this is an animal? How do you know?\" (Help them connect it to animals they know: pets, insects they've seen outside.)\n   - \"What body parts can you see? Can you point to the wings? The legs? The eyes?\" (Use a pointer or your finger to indicate parts on the projected image.)\n   - \"Where do you think this animal lives? What do you see around it?\" (Guide attention to the green plants—this is a clue!)\n   - \"What do you think this creature needs to stay alive, just like you need food and water?\"\n\n3. **Wonder prompt:** Hold up the photo and say: \"I wonder... what does this dragonfly need to be healthy and happy, just like you need breakfast and a safe place to sleep?\" Write the word \"dragonfly\" and \"What do insects need?\" on chart paper. Tell students: \"Today, we're going to be insect detectives and find out!\"\n\n**Transition:** \"Let's go explore and build our own insect homes to see what these amazing creatures might need!\"\n\n---\n\n### 2. EXPLORE (20–25 minutes)\n\n**Objective:** Students investigate insect body parts and habitats through hands-on exploration.\n\n**Materials:**\n- Pre-made \"insect habitat boxes\" (one per small group): plastic containers or shoeboxes with:\n  - Soil or sand (2 inches)\n  - Leaves, twigs, small plants (optional: potted small plants)\n  - Water source (damp sponge or shallow water dish)\n  - Rocks or bark pieces\n- Pictures of insects (dragonflies, ants, beetles, ladybugs) printed on cards—3–4 different types\n- Large format body-part label cards: \"wings,\" \"legs,\" \"eyes,\" \"body\"\n- Chart paper and markers\n- Crayons and paper for documentation\n- Hand lenses (magnifying glasses)—optional but helpful\n\n**Activity:**\n\n1. **Divide students into small groups** (3–4 per group). Assign each group an insect picture (or let them choose).\n\n2. **Give these step-by-step directions:**\n   - \"Look at your insect picture carefully. Use the hand lens if you have one.\"\n   - \"Find and point to the wings. Do all insects have wings? Point to the legs. How many legs do you see?\"\n   - \"Point to the eyes and the body. Talk with your group: What body parts help this insect survive?\"\n   - \"Now, look at the habitat box. What do you see that an insect might need? Point to the water. Point to the plants. Point to the place to hide.\"\n   - \"Draw a picture of your insect and the things it needs to stay alive. Label at least two body parts and two things from the habitat.\"\n\n3. **How the activity connects:** Students discover that insects have specific body parts (like the dragonfly's wings and legs visible in the photo) and that they need water, plants, and safe places to hide—just like the dragonfly in the photograph among green plants.\n\n4. **What students should record:** Drawings with labels showing:\n   - The insect and its body parts (at least wings, legs, eyes, or body)\n   - Elements of the habitat (water, plants, shelter)\n\n**Teacher Role:**\n- Circulate and ask guiding questions: \"What body part helps this insect move? Why do you think it needs water? Where would this insect hide?\"\n- Avoid telling answers; instead, point to the photo and habitat box to help students discover.\n- Encourage students to use hand lenses and compare different insects.\n\n**Expected Student Outcomes:**\n- Students identify at least 2–3 body parts on their insect.\n- Students recognize that habitats include water, plants, and shelter.\n- Students create simple drawings showing insects and their needs.\n\n---\n\n### 3. EXPLAIN (15–20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to key life science concepts.\n\n**Materials:**\n- Chart paper from Engage phase (with \"What do insects need?\" question)\n- The dragonfly photograph (displayed again)\n- Vocabulary cards with pictures: \"insect,\" \"habitat,\" \"wings,\" \"shelter,\" \"needs\"\n- Small poster or chart: \"What All Animals Need\"\n\n**Activity:**\n\n1. **Group share-out:** Call students back to a meeting area. Ask volunteers from each group to show their drawing and tell one thing they discovered about their insect's body part or what it needs.\n\n2. **Introduce key vocabulary** with Kindergarten-friendly definitions and point to examples in the photograph:\n\n   | **Term** | **Student-Friendly Definition** | **Photo Connection** |\n   |----------|--------------------------------|----------------------|\n   | **Insect** | A tiny animal with six legs, wings, and a body made of three parts | The dragonfly is an insect! |\n   | **Wings** | Special body parts that help insects fly through the air | See the dragonfly's big wings? |\n   | **Habitat** | The home and neighborhood where an animal lives | The green plants are the dragonfly's habitat. |\n   | **Shelter** | A safe, protected place where an animal can hide and rest | Rocks, leaves, and plants give shelter. |\n   | **Needs** | Things a living thing must have to stay alive and healthy | Water, food, air, and a safe place |\n\n3. **Connect back:** Point to the dragonfly photo and say: \"This dragonfly lives near water and plants. It has wings to fly, legs to hold on, and big eyes to see. All of these things help it survive. The green plants around it are its habitat. It has everything it needs!\"\n\n4. **Check for understanding:**\n   - Hold up the dragonfly photo: \"Is this an insect? How do you know?\" (Look for students to identify wings, legs, or body.)\n   - Ask: \"What does this dragonfly need to survive?\" (Listen for: water, plants/food, shelter, safe place.)\n   - Show the habitat box: \"Does our habitat box have the things a real insect needs? What are they?\" (Students point to water, plants, shelter.)\n\n**Vocabulary:**\n- **Insect:** A small animal with six legs, wings, and three body parts.\n- **Wings:** Body parts insects use to fly.\n- **Habitat:** Where an animal lives; its home and neighborhood.\n- **Shelter:** A safe place to hide and rest.\n- **Needs:** Things living things must have to survive (food, water, air, home).\n\n**Expected Student Outcomes:**\n- Students can identify an insect and name at least two body parts.\n- Students can name at least two things an animal needs to survive.\n- Students understand that a habitat provides what animals need.\n\n---\n\n### 4. ELABORATE (15–20 minutes)\n\n**Objective:** Students apply and deepen understanding by designing a habitat for an insect and considering real-world survival.\n\n**Materials:**\n- Small shoebox or plastic container (one per student or pair)\n- Craft materials: soil, sand, leaves, twigs, small plants (real or paper), stones, bark\n- Construction paper, crayons, markers\n- Water (in a spray bottle or small container for dampening)\n- Optional: pictures of different insects (to choose from)\n- Chart: \"What do insects need?\" (from Explain phase)\n\n**Activity:**\n\n1. **Set the scenario:** \"Now you're going to create a perfect habitat for an insect. You can choose which insect lives in your habitat, like the dragonfly, an ant, a ladybug, or another bug you've seen.\"\n\n2. **Student task:**\n   - \"Choose an insect (or use the one we talked about).\"\n   - \"Use the materials to build a safe home that has everything your insect needs.\"\n   - \"Make sure your habitat has: a place to drink water, plants or food, a place to hide, and air.\"\n   - \"Draw a picture of your insect in its new home. Label what it needs.\"\n\n3. **Facilitation:**\n   - Ask: \"Where would your insect hide in this habitat? Why does it need that?\"\n   - \"Does your insect have wings? Will your habitat give it room to fly (or move)?\"\n   - \"Where is the water? Where is the shelter?\"\n\n4. **Real-world connection:** Say: \"Just like your insect needs a safe home with water and food, you need a home with food, water, and people who keep you safe. All living things need these things!\"\n\n**Expected Student Outcomes:**\n- Students create a simple habitat that includes at least three things an insect needs.\n- Students can explain (verbally or through drawing) how their habitat helps the insect survive.\n- Students make connections between insect needs and their own needs.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of insect body parts, habitats, and basic survival needs.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation checklist** (observe during Explore and Elaborate):\n  - Can students identify at least 2 insect body parts? ✓\n  - Do students recognize that insects need water and shelter? ✓\n  - Can students compare insect needs to their own? ✓\n- **Questioning:** Ask students during group work and transitions to check understanding.\n\n**Exit Ticket / Summative Assessment (End of Lesson 2):**\n\nShow students the dragonfly photograph one final time. Ask these questions (accept verbal responses, drawing responses, or pointing):\n\n1. **\"Show me with your hand: Does this creature have wings? (Point to the wings.) Are wings a body part that helps insects?\"**\n   - **Success criterion:** Student identifies wings and understands they help movement.\n\n2. **\"What does this dragonfly need to stay alive? Can you name one thing?\"**\n   - **Success criterion:** Student names at least one: water, plants, shelter, or food.\n\n3. **\"Where does this dragonfly live? (Point to the green plants.) Is that its habitat?\"**\n   - **Success criterion:** Student understands the habitat is the place where the animal lives with the things it needs.\n\n4. **\"You need food, water, and a home. Does this dragonfly need those things too? Tell me yes or no, and why.\"**\n   - **Success criterion:** Student recognizes that insects and people share basic needs.\n\n**Success Criteria for Meeting Learning Objectives:**\n- **Objective 1 (Body parts):** Student can identify ≥2 insect body parts from the photo or their drawings.\n- **Objective 2 (Needs):** Student can name ≥2 things animals need (food, water, shelter, safe place).\n- **Objective 3 (Habitat):** Student explains that insects live in places with things they need (e.g., \"The dragonfly lives by plants and water\").\n- **Objective 4 (Comparison):** Student makes a simple connection between what insects and people need (e.g., \"We both need water and a home\").\n\n**Expected Student Outcomes:**\n- All students can name at least one insect body part and one thing insects need.\n- Most students can explain that a habitat provides what animals need.\n- Advanced students make connections to other animals and survival strategies.\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners):\n\n1. **Reduce vocabulary load:** Use only 2–3 key terms (insect, wings, needs) instead of all five. Point to the photo repeatedly to reinforce.\n\n2. **Simplified drawings:** Allow students to draw or trace body parts rather than create detailed pictures. Provide template outlines of insects with blanks for labels.\n\n3. **Partner with peers:** Pair struggling students with a buddy during Explore and Elaborate phases. Provide sentence frames: \"This insect has ___.\" \"My insect needs ___.\"\n\n4. **Hands-on scaffolds:** Use actual insects (catch-and-release: ladybug, ant, grasshopper in a clear cup) rather than pictures only, so students see real movement and body parts.\n\n### Challenge (For Advanced Learners):\n\n1. **Compare multiple insects:** Provide pictures of 4–5 different insects (dragonfly, ant, butterfly, ladybug, bee). Have students identify which have wings, which live in water vs. soil, and how their needs differ slightly.\n\n2. **Create a field guide:** Ask students to draw three different insects and label habitat needs for each. Example: \"Ants live under the ground and need soil. Dragonflies live near water and need water.\"\n\n3. **Story/role-play extension:** \"If you were a dragonfly, what would your day look like? Where would you go to find food and water? Where would you sleep?\" Students can draw or dictate a short story.\n\n4. **Investigate real habitats:** If possible, visit a school garden, pond edge, or outdoor space to observe real insects in their habitats. Have students sketch or photograph what they find.\n\n---\n\n## Extension Activities\n\n1. **Insect Hunt Outdoor Walk (15–20 minutes):**\n   - Take students outside to search for insects in grass, on plants, under leaves, or near water.\n   - Provide a checklist: \"Find something with wings. Find something with legs. Find a hiding place where an insect might live.\"\n   - Document findings with drawings or photos. Compare real habitats to the boxes created in class.\n\n2. **Build a Classroom \"Insect Hotel\" (Ongoing project):**\n   - Create a tiered structure using boxes, logs, straw, leaves, and bark.\n   - Explain: \"This is a safe home where real insects can rest, hide, and find food.\"\n   - Students help gather and arrange materials. Observe what insects visit over weeks. Discuss: \"What did the insects need? Did our hotel give them that?\"\n\n3. **Story/Picture Book Extension:**\n   - Read a Kindergarten-level book about insects (e.g., *The Very Hungry Caterpillar* or *Dragonfly* from National Geographic Little Kids).\n   - Have students draw or dictate: \"What does [insect name] need to be happy?\"\n   - Create a class book: \"Insects All Around Us\" with student pages, each showing a different insect and its needs.\n\n4. **Sensory Exploration (Rainy Day or Indoor Activity):**\n   - Set up a sensory bin with soil, sand, leaves, twigs, and water.\n   - Students manipulate materials and imagine: \"How would an insect feel in this habitat? Is it safe? Does it have food?\"\n   - Ask: \"Which materials would make a good shelter?\"\n\n---\n\n## Teacher Notes & Tips\n\n- **Photograph use:** Display the dragonfly image throughout all five phases. Return to it repeatedly so students deepen their observations and connections.\n- **Safety:** If creating outdoor habitats or catching live insects, ensure gentle handling and release protocols. Wash hands after outdoor activities.\n- **Vocabulary:** Use consistent, simple language. Repeat key words in context across all phases.\n- **Assessment flexibility:** Kindergarteners may respond verbally, through drawing, or with gestures. Accept all forms of communication.\n- **Real experience:** If possible, observe a live dragonfly or other insect near water to deepen understanding. Time spent observing nature is invaluable for this age group.\n\n---\n\nThis lesson aligns with **K-LS1-1** by having students observe and describe patterns in what insects need to survive (shelter, water, food, safe places) and compare those needs to their own, building foundational life science thinking.",
  "inputTokens": 2784,
  "outputTokens": 4167,
  "cost": 0.023619,
  "generatedAt": "2026-02-12T19:27:23.319Z"
}