{
  "title": "Dragonfly",
  "category": "life-science",
  "imageFile": "IMG_4274.jpeg",
  "imagePath": "images/life-science/IMG_4274.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Dragonflies Up Close\n\n---\n\n### Core Science Concepts from Image Analysis\n\n- **Body structures and their functions:** Dragonflies have large compound eyes, wings, and long, segmented bodies that help them see prey and fly quickly to catch food.\n- **Animal adaptations for survival:** Dragonflies' special features (big eyes, fast wings, body shape) help them survive by hunting insects and escaping predators.\n- **Habitats and environmental needs:** Dragonflies live near water and need specific places to grow and survive, just like all animals.\n- **Observable characteristics:** Young dragonflies (nymphs) look different from adult dragonflies, showing that animals change as they grow.\n\n---\n\n### Lesson Title\n\n**Dragonflies: Amazing Insects That Zoom!**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes across two days)\n- **NGSS Standards:** 1-LS1-1 (External parts help animals survive); 1-LS3-1 (Young animals are like, but not exactly like, their parents)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Identify the external body parts of a dragonfly and describe what each part does.\n2. Explain how a dragonfly's body parts help it survive and find food.\n3. Observe and compare pictures of young and adult dragonflies to notice how they look different.\n4. Design a simple drawing or model showing how a dragonfly's special features help it live near water.\n\n---\n\n### 5E Lesson Sequence\n\n---\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student curiosity about dragonflies and activate prior knowledge using the striking photograph.\n\n**Materials:**\n- Printed copy of the dragonfly photograph (8.5\" × 11\" or larger, color if possible)\n- Document camera or projector to display the image\n- Chart paper and marker\n\n**Activity:**\n\n1. **Display the photograph** on the projector or document camera without explanation. Let students look silently for 10 seconds.\n\n2. **Ask these specific discovery questions** (pause between each to allow thinking time):\n   - \"What do you see in this picture? Can you tell me about the creature?\"\n   - \"Look at the eyes. What shape are they? Why do you think this animal has such big eyes?\"\n   - \"See those long, thin, clear wings? What do you think those are for? Have you ever seen an animal move that fast?\"\n   - \"This insect lives near water. What do you wonder about why it needs to live near water?\"\n\n3. **Record student observations** on chart paper as they share. Use drawings and words together.\n\n4. **Wonder prompt:** \"I wonder... if this insect's body parts help it do special things. Let's find out!\"\n\n**Transition:** \"Now we're going to explore how dragonflies use their special body parts to survive and stay safe. Let's become dragonfly scientists!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate dragonfly adaptations through hands-on exploration and observation.\n\n**Materials:**\n- Printed dragonfly anatomy picture cards (simple, labeled images showing: wings, eyes, body segments, legs) — 1 set per pair of students\n- Printed photograph of the dragonfly from the lesson (1 per student)\n- Colored pencils or crayons\n- Clipboards\n- \"What Does It Do?\" worksheet (see directions below)\n- Optional: Photos of dragonflies hunting, resting on water, and in flight\n\n**Activity:**\n\n1. **Pair students** and distribute photograph and anatomy cards to each pair.\n\n2. **Give clear student directions:**\n   - \"Look very carefully at the dragonfly picture. Now look at your body part cards.\"\n   - \"Match each body part card to the same part you see in the photo. Use your colored pencil to lightly circle or point to each part.\"\n   - \"For each part (eyes, wings, body, legs), talk with your partner and think: *What does this part help the dragonfly DO?* Does it help the dragonfly see? Fly? Move? Catch food?\"\n   - \"On your worksheet, draw or write (with teacher help) what you think each part does.\"\n\n3. **Connection to photograph:** Students are using the exact image from the Engage phase to discover that body parts have jobs.\n\n4. **Documentation:** Students complete simple worksheet with pictures or teacher-scribed labels showing: *Eyes help the dragonfly see small insects. Wings help the dragonfly fly very fast. Body holds all the parts together. Legs help catch food.*\n\n5. **Teacher facilitation:**\n   - Circulate and ask: \"Why do you think the dragonfly needs *fast* wings?\" (Don't answer—guide thinking.)\n   - Model the activity with one pair first if needed.\n   - Scribe for students who cannot write independently.\n   - Ask follow-up questions: \"What would happen if the dragonfly didn't have big eyes?\" \"How would it catch food with no legs?\"\n\n**Expected Student Outcomes:** \n- Students recognize that dragonfly body parts serve specific survival purposes.\n- Students can point to and name at least 3 body parts and state one function for each.\n- Drawings/worksheets show emerging understanding of form-function relationships.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and formalize understanding of animal adaptations.\n\n**Materials:**\n- Chart paper from Engage phase\n- Dragonfly body parts poster (teacher-made or printed)\n- Printed vocabulary cards with pictures\n- The original photograph (displayed again)\n- Picture book: *Dragonflies* by Gail Gibbons or similar (optional, 5-7 minutes)\n\n**Activity:**\n\n1. **Gather students on the carpet.** Display the dragonfly photograph again.\n\n2. **Group share-out (3-4 minutes):**\n   - \"Who can show us a body part you found? Tell us what it does.\"\n   - Invite 3-4 pairs to share one discovery each.\n   - Add to the chart paper: *\"Our Dragonfly Body Parts Chart\"* with drawings and words.\n\n3. **Introduce vocabulary (5 minutes):** Teach these terms using the photograph and body parts poster:\n\n   **Vocabulary:**\n   - **Adaptation:** A special body part or behavior that helps an animal survive and stay safe. *Example: A dragonfly's big eyes are an adaptation that helps it see insects to eat.*\n   - **Compound eyes:** Very large, special eyes made of many tiny parts that help the dragonfly see really well in all directions.\n   - **Wings:** Thin, clear parts on the dragonfly's body that help it fly fast to catch food and escape danger.\n   - **Insect:** A small animal with six legs, wings, and a body divided into three parts. *Dragonflies are insects.*\n   - **Predator:** An animal that hunts and eats other animals. *The dragonfly is a predator because it eats other insects.*\n\n4. **Make connections (5 minutes):**\n   - Point to the eyes in the photograph: \"These are compound eyes. How are they different from your eyes? Why does the dragonfly need such big eyes?\"\n   - Point to the wings: \"These wings help the dragonfly move super fast. A dragonfly can fly forward, backward, and sideways! That helps it catch food and stay safe.\"\n   - Point to the long body: \"The dragonfly's body is made of parts stacked together. This helps it balance in the air.\"\n\n5. **Check for understanding:**\n   - Ask: \"If I cover up the dragonfly's wings, what would happen? Why?\"\n   - Show the photo and ask: \"Which body part helps this animal see its food?\"\n   - Ask students to show with their bodies: \"Can you move your arms like dragonfly wings? Can you move your eyes from side to side?\"\n\n**Expected Student Outcomes:**\n- Students can use the word *adaptation* to describe why animals have certain body parts.\n- Students understand that big eyes and fast wings are adaptations for survival.\n- Students can name at least 2 body parts and explain their function using simple sentences.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply understanding to a new context and explore how dragonflies change as they grow.\n\n**Materials:**\n- Printed images of dragonfly nymph (baby) vs. adult dragonfly (4-5 pictures per student)\n- \"Young and Grown-Up Dragonflies\" comparison worksheet\n- Colored pencils\n- Optional: Video clip (2 minutes) of a dragonfly nymph transforming into an adult (YouTube has age-appropriate clips)\n\n**Activity:**\n\n1. **Introduce the concept (3 minutes):**\n   - \"Remember, we learned that dragonflies have special body parts to help them survive. But here's something amazing: baby dragonflies look *very different* from grown-up dragonflies!\"\n   - Show a picture of a dragonfly nymph (underwater, no wings, shorter, stockier). \"This is a baby dragonfly. It's called a *nymph.* It looks pretty different, doesn't it?\"\n\n2. **Guided observation (7 minutes):**\n   - Distribute nymph and adult comparison images.\n   - Ask:\n     - \"Does the baby dragonfly have wings? Does the adult? What's different?\"\n     - \"Where does a baby dragonfly live? Where does the adult live?\"\n     - \"How do you think the baby dragonfly catches food without wings? What does it use?\"\n   - Complete a simple chart together on chart paper:\n     - **Baby Dragonfly:** Lives in water, no wings, catches food with legs, shorter body\n     - **Adult Dragonfly:** Flies in the air, has wings, catches flying insects, longer body\n\n3. **Application activity (5 minutes):**\n   - Students complete \"Young and Grown-Up Dragonflies\" worksheet.\n   - Students draw or circle which features belong to the baby and which belong to the adult.\n   - Teacher scribe for non-writers: \"What changed? Why do you think the dragonfly grew wings?\"\n\n4. **Teacher facilitation:**\n   - Guide students to see that both young and adult dragonflies are adapted to *their* environments.\n   - Ask: \"Why is it helpful for the baby dragonfly to live in water? Why is it good for the adult to fly?\"\n   - Avoid heavy life-cycle detail; focus on observable differences and how each form is suited to its habitat.\n\n**Expected Student Outcomes:**\n- Students observe and describe differences between young and adult dragonflies.\n- Students begin to understand that animals change and their body parts change as they grow.\n- Students can explain why growing wings helps a dragonfly survive better as an adult.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess understanding of dragonfly adaptations and body-part function.\n\n**Activity:**\n\n**Formative Assessment (used throughout lesson):**\n- Observation during Explore: Can students identify body parts and suggest functions?\n- Listen to responses during Explain: Do students use vocabulary correctly?\n- Circulate during Elaborate: Can students compare young and adult dragonflies?\n\n**Exit Ticket / Summative Assessment (5-7 minutes at end of Session 2):**\n\nAdminister one or more of the following:\n\n**Option A: Oral Assessment**\nAsk each student individually:\n1. \"Point to the dragonfly's eyes. Why are they so big?\"\n2. \"Show me the wings with your hands. What do wings help the dragonfly do?\"\n3. \"Can you tell me one way a baby dragonfly is different from a grown-up dragonfly?\"\n\n**Option B: Drawing & Labeling**\n- Give each student a blank dragonfly outline.\n- Ask: \"Draw and label the body parts that help a dragonfly catch food and fly fast.\"\n- Teacher scribe or accept invented spelling/drawings.\n\n**Option C: Quick Written Response (teacher reads aloud)**\n- Provide a picture of a dragonfly.\n- Ask: \"Why do you think dragonflies have such big eyes? Circle the best answer:\n  - To look pretty\n  - To see insects to eat\n  - To stay warm\"\n- Repeat with 1-2 similar questions.\n\n**Success Criteria for Understanding:**\n- ✓ Student can identify at least 2 dragonfly body parts.\n- ✓ Student can explain what 1 body part does (e.g., \"Wings help it fly\" or \"Eyes help it see\").\n- ✓ Student can identify 1 difference between young and adult dragonflies.\n- ✓ Student uses or understands the word *adaptation* in context.\n\n**Expected Student Outcomes:**\n- Most students will demonstrate basic understanding of form-function relationships.\n- Students will show emerging vocabulary use (adaptation, wings, eyes, nymph).\n- Advanced students will explain multi-step benefits (\"Big eyes help it see insects, and fast wings help it catch them\").\n\n---\n\n### Differentiation\n\n**SUPPORT (for struggling learners):**\n\n1. **Reduce visual complexity:** Provide a large, clearly labeled dragonfly diagram instead of a photograph during Explore. Highlight the body parts in different colors.\n\n2. **Use partner support and sentence frames:** Pair students strategically. Provide sentence starters:\n   - \"The dragonfly's _____ helps it _____.\"\n   - \"A baby dragonfly has _____, but an adult dragonfly has _____.\"\n   - Teacher or peer scribe writes responses.\n\n3. **Focus on fewer body parts:** Instead of eyes, wings, body, AND legs, concentrate on just eyes and wings. Simplify vocabulary. Use repetition and multi-sensory reinforcement (show pictures, act it out, discuss multiple times).\n\n---\n\n**CHALLENGE (for advanced learners):**\n\n1. **Research and compare:** Provide pictures of other water insects (damselflies, water beetles, aquatic larvae). Ask: \"How are their body parts similar to or different from a dragonfly? Why?\" Students create a simple comparison chart.\n\n2. **Predict and explain:** Show a photo of a dragonfly in a different environment (a dry field instead of near water). Ask: \"How would the dragonfly need to change its body or behavior to survive here instead of near water?\" Encourage creative thinking.\n\n3. **Design a dragonfly:** \"If you could create a dragonfly that hunted at night instead of during the day, what body parts would you change and why?\" Students sketch and label their design, explaining their reasoning.\n\n---\n\n### Extension Activities\n\n1. **Dragonfly Movement Exploration (15 minutes, indoors or outdoors):**\n   - Students move like dragonflies: \"Fly\" forward, backward, and sideways while making buzzing sounds.\n   - Discuss: \"Why does a dragonfly need to move in so many directions? What is it chasing?\"\n   - Can be done in PE time or as a brain break.\n\n2. **Habitat Diorama or Collage (30-45 minutes, homework or art period):**\n   - Students create a simple diorama or collage showing where dragonflies live (near water with reeds, rocks, lily pads).\n   - Label the dragonfly and its habitat.\n   - Include a label for \"nymph area\" (underwater) and \"adult area\" (flying above water).\n   - Discuss: \"What does a dragonfly need in its habitat to survive?\"\n\n3. **Dragonfly Life Cycle Flip Book (20-30 minutes, can span multiple days):**\n   - Students create a simple 4-page flip book showing: egg, nymph, transformation, adult.\n   - Use simple drawings or provided image cutouts.\n   - One sentence per page: *\"Dragonfly eggs are in the water.\" \"The nymph grows in the water.\" \"The nymph changes.\" \"The adult flies!\"*\n   - Practice retelling the life cycle to a partner.\n\n---\n\n## Additional Notes for the Teacher\n\n- **Safety:** No live dragonflies need to be captured for this lesson. The photograph and printed images are sufficient.\n- **Timing flexibility:** If 90 minutes is unavailable, split as: Day 1 (Engage + Explore, ~40 min) and Day 2 (Explain + Elaborate + Evaluate, ~50 min).\n- **Real-world connection:** If your school is near a pond or water feature, a brief outdoor observation of real dragonflies is a powerful extension (even just watching from a distance).\n- **Inclusive language:** Refer to dragonflies as \"he\" and \"she\" interchangeably, or use \"it,\" to normalize all identities.\n- **Assessment note:** First graders are still developing writing skills. Prioritize oral responses, drawings, and teacher-scribed notes over independent writing.\n\n---\n\nThis lesson honors the striking detail in the photograph while keeping activities concrete, hands-on, and developmentally appropriate for First Grade. Students leave understanding that animals' body parts are not random—they serve survival purposes—and that animals change as they grow. Both concepts align directly with NGSS 1-LS1-1 and 1-LS3-1.",
  "inputTokens": 2860,
  "outputTokens": 4072,
  "cost": 0.023219999999999998,
  "generatedAt": "2026-02-12T19:37:27.782Z"
}