{
  "title": "Predator and Prey",
  "category": "life-science",
  "imageFile": "IMG_0506.jpeg",
  "imagePath": "images/life-science/IMG_0506.jpeg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Insects and Their Amazing Body Parts\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **External body parts help animals survive:** The insect in the photograph has wings, legs, and other body structures that help it live in its habitat and meet its needs.\n- **Different animals have different body parts:** Insects have unique features (like wings and compound eyes) that are different from other animals students know.\n- **Living things are adapted to their environments:** This insect's green coloring and wings help it survive among plants and leaves.\n- **Animals use their bodies to meet their needs:** The insect uses its legs to hold onto plants and its wings to move and escape danger.\n\n---\n\n## Lesson Title\n\n**Wings, Legs, and Eyes: How Insects Use Their Body Parts to Survive**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 90 minutes total (three 30-minute sessions, or two 45-minute blocks)\n- **NGSS Standards:** \n  - 1-LS1-1: Use materials to design a solution to a human problem by mimicking how plants and/or animals use their external parts to help them survive, grow, and meet their needs\n  - 1-LS3-1: Make observations to construct an evidence-based account that young plants and animals are like, but not exactly like, their parents\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n1. **Identify and name at least three external body parts of insects** (wings, legs, eyes) visible in photographs and real observations.\n2. **Explain how at least one body part helps an insect survive** using simple sentences and drawings (e.g., \"Wings help insects fly away from danger\").\n3. **Compare their own body parts to an insect's body parts** and explain one way insects are different from humans.\n4. **Design a simple solution to a problem** by copying how an insect uses its body parts (e.g., creating wings to help something move).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph.\n\n**Materials:**\n- Printed or projected photograph (large enough for whole class to see clearly)\n- Chart paper or whiteboard\n- Markers\n\n**Activity:**\n\n1. **Display the photograph** on the board or project it. Do NOT explain what it is yet. Ask students to look carefully for 10-15 seconds in silence.\n\n2. **Ask these discussion questions** (one at a time, wait for multiple responses):\n   - \"What do you see in this picture? Can you describe it?\"\n   - \"What are these body parts?\" (Point to wings, legs, eyes)\n   - \"Do you see anything that moves or helps this animal? What do you think it does?\"\n   - \"Where do you think this insect lives? Why do you think that?\"\n\n3. **Wonder prompt:** \"I wonder what those see-through parts are... they look like they could help this insect do something special. What do YOU think they're for?\"\n\n4. **Record student ideas** on chart paper without correcting them. Celebrate curiosity.\n\n**Transition:** \"Let's explore and discover how insects use their body parts to stay alive and do what they need to do!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover concepts through hands-on activity.\n\n**Materials:**\n- Picture cards or printed photographs of 5-6 different insects (ant, butterfly, grasshopper, dragonfly, ladybug, beetle) — one per pair\n- Large paper templates of insect body parts (wings, legs, eyes, antennae) — cut-outs or printed\n- Crayons and colored pencils\n- Glue sticks\n- Large blank paper (11\" × 14\" construction paper or poster board)\n- Observation observation sheets (simple, 1-page handout with labeled diagram and space for drawing/writing)\n\n**Activity — \"Insect Body Parts Hunt\":**\n\n**Step-by-step student directions:**\n\n1. \"You and your partner will get a picture of an insect. Look very carefully at it.\"\n\n2. \"Find and point to these body parts:\n   - **Wings** (the see-through or colored parts that help it fly)\n   - **Legs** (the thin parts coming down from the body)\n   - **Eyes** (the small round parts on the head)\n   - **Antenna** (the long, thin feelers on top)\"\n\n3. \"On your observation sheet, draw a picture of your insect and label the parts we found.\"\n\n4. \"Now, talk with your partner: **How do YOU think this insect uses its wings? Its legs? Its eyes?** Draw or write what you think.\"\n\n5. \"Create an insect collage: Use the cut-out body parts and glue them onto your large paper to make your own insect. Make it colorful and interesting!\"\n\n**Teacher Role:**\n- Circulate and ask guiding questions without giving answers:\n  - \"What is this part doing in the picture?\"\n  - \"Why might this insect need wings?\"\n  - \"Can you show me where the legs are? How many do you count?\"\n- Listen to student thinking and record interesting observations.\n- Help students who struggle to identify body parts by pointing to the photograph together.\n\n**Expected Student Outcomes:**\n- Students locate and point to wings, legs, eyes, and antennae.\n- Students create labeled drawings or collages.\n- Students share initial ideas about how body parts help insects survive (some ideas may be incorrect; this is expected).\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts after exploration.\n\n**Materials:**\n- Large labeled diagram of an insect (projected or printed, 11\" × 14\" minimum)\n- Vocabulary cards with pictures\n- The original photograph used in Engage\n- Chart paper for recording definitions\n\n**Activity:**\n\n1. **Group share-out (5 minutes):**\n   - Ask 3-4 volunteers to share their insects and describe one body part they drew.\n   - Affirm all responses: \"You noticed the **wings**! Great observation!\"\n   - Show the original photograph again: \"This insect has body parts just like the ones you found!\"\n\n2. **Introduce key vocabulary (8-10 minutes):**\n   - Show large insect diagram on the board.\n   - Teach each term using the photograph and students' observations:\n\n**Vocabulary:**\n- **Wings:** \"Thin, see-through parts that help insects fly through the air to find food and escape danger.\"\n- **Legs:** \"Thin parts that help insects walk, hold onto plants, and jump. Most insects have six legs.\"\n- **Eyes:** \"Small parts on the insect's head that help it see where it's going and find food.\"\n- **Antenna (antennae):** \"Long, thin feelers on top of the insect's head that help it smell and feel the world around it.\"\n- **Insect:** \"A small animal with six legs, wings (sometimes), and a body made of three parts.\"\n\n3. **Connect back to photograph (3-5 minutes):**\n   - Point to each part on the screen: \"Look at the **wings** on this insect. What color are they? Do you see how they're see-through? That helps it fly!\"\n   - \"See these **six legs**? They hold it on to the plant so it doesn't fall.\"\n   - \"The **eyes** are watching for danger.\"\n\n4. **Check for understanding:**\n   - Ask: \"Who can point to the **wings**?\" (Students point to board or photograph)\n   - Ask: \"Why do you think insects have legs?\" (Listen for responses: walk, hold on, jump)\n   - Thumbs up/sideways/down: \"Do insects have body parts that help them survive? Thumbs up if you think yes!\"\n\n**Expected Student Outcomes:**\n- Students use vocabulary terms when discussing insect body parts.\n- Students explain one reason a body part helps an insect survive.\n- Students demonstrate understanding through physical responses (pointing, thumbs).\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding.\n\n**Materials:**\n- Large paper (11\" × 14\")\n- Crayons, colored pencils, markers\n- Craft materials: pipe cleaners, tissue paper, construction paper scraps\n- Real images of humans (optional, for comparison)\n- Mirror (optional)\n\n**Activity — \"How Are We Like Insects? How Are We Different?\":**\n\n1. **Comparison discussion (5 minutes):**\n   - Hold up the insect photograph: \"Insects have legs, eyes, and body parts. Do WE have legs and eyes?\"\n   - Have students point to their own eyes, legs, arms: \"Yes! But are our legs the same as insect legs?\"\n   - Guide students to notice: Insects have **six legs** and can be **very tiny**. Humans have **two legs** and are **much bigger**.\n\n2. **Create a comparison drawing (10-15 minutes):**\n   - \"Draw yourself and an insect side by side on your paper.\"\n   - \"Label the parts that are the SAME (eyes, legs).\"\n   - \"Circle or color the parts that are DIFFERENT.\"\n   - Sentence frame: \"Insects have _______, and I have _______.\"\n\n3. **Share findings (2-3 minutes):**\n   - Invite 2-3 students to show their drawings and complete the sentence frame aloud.\n\n**Teacher Role:**\n- Model the comparison drawing on chart paper before students begin.\n- Ask follow-up questions: \"What does the insect do that you can't do?\" (Fly with wings!)\n- Help students articulate differences in simple language.\n\n**Expected Student Outcomes:**\n- Students create labeled comparison drawings.\n- Students articulate at least one similarity and one difference between humans and insects.\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding.\n\n**Activity:**\n\n**Formative Assessment (ongoing, throughout lesson):**\n- Listen to student responses during Engage and Explain phases.\n- Observe student drawings and labels in Explore phase.\n- Check for correct identification of body parts (can students point to or name wings, legs, eyes, antennae?).\n- Notice if students use vocabulary terms in their explanations.\n\n**Exit Ticket / Summative Assessment (end of lesson, 3-5 minutes):**\n\nAdminister ONE of the following based on your class needs:\n\n**Option A (Visual/Kinesthetic):**\n- Show the original insect photograph again.\n- Ask: \"Point to one body part that helps this insect survive. Show me with your finger.\"\n- Follow-up: \"Tell me: What does that body part do?\"\n- **Success criteria:** Student correctly identifies and names a body part, explains one function (e.g., \"Wings help it fly\" or \"Legs help it walk\").\n\n**Option B (Drawings):**\n- Provide a simple outline drawing of an insect.\n- Ask: \"Label the wings and legs. Draw a picture showing how this insect uses one of these parts to survive.\"\n- **Success criteria:** Student correctly labels wings and legs, drawing shows attempt to show function (e.g., wings drawn as moving, legs on plant).\n\n**Option C (Oral Response):**\n- Ask each student (can be done in small group): \n  - \"Can you name one body part of an insect?\"\n  - \"How does that body part help the insect live?\"\n- **Success criteria:** Student names a body part and gives a reasonable explanation (even if not perfectly worded).\n\n**How to Determine Success:**\n- **Met standard:** Student identifies 2+ body parts, names or explains the function of at least one body part, and shows understanding that body parts help insects survive.\n- **Approaching:** Student identifies 1 body part or gives a vague explanation of function; may need reinforcement.\n- **Beginning:** Student cannot identify insect body parts or explain function; needs additional scaffolding and exploration.\n\n---\n\n## Differentiation\n\n### Support (Scaffolding for Struggling Learners)\n\n1. **Provide a labeled reference chart** posted in the classroom with large, clear pictures of insect body parts with simple labels. Allow students to refer to it while drawing and discussing.\n\n2. **Use hand-over-hand or partner support** during the Explore phase. Pair struggling students with a stronger partner or have them work with you. Physically point to body parts together: \"Here is the wing. Feel it with your finger. Now you find the other wing.\"\n\n3. **Simplify the vocabulary:** Focus on only two body parts (wings and legs) instead of four. Use shorter, simpler sentences: \"Wings fly. Legs walk.\" Skip more complex concepts like antennae until students master basic structures.\n\n4. **Offer pre-drawn insect templates** where body parts are outlined but not labeled. Students only need to color and label using a word bank.\n\n### Challenge (Extensions for Advanced Learners)\n\n1. **Compare three different insects:** Provide pictures of a butterfly, an ant, and a grasshopper. Ask: \"How are their legs different? Why do you think their wings look different?\" Guide students to hypothesize about how different body parts help different insects survive in different habitats.\n\n2. **Design an insect solution:** \"Imagine you needed to climb a tall tree like an ant does. What body parts would you need? Design and draw a 'super insect' that could solve this problem. Label the special body parts.\"\n\n3. **Research and present:** Challenge students to find one additional fact about how an insect uses a body part (e.g., \"Dragonflies have super eyes that see in many directions\"). Have them share with the class in a short 1-2 sentence explanation with a drawing.\n\n4. **Create an insect movement game:** Students design movements that mimic how insects use their body parts. Example: \"Hop like a grasshopper using your legs. Twist like a butterfly using your wings.\"\n\n---\n\n## Extension Activities\n\n1. **Take a nature walk to find real insects** (or picture hunt if outdoor observation isn't possible). Have students observe insects in the school garden, playground, or through pictures. Ask: \"Can you find the wings? The legs? Count the legs!\" Document findings with drawings or photographs. Create a class \"Insect Body Parts Chart\" with student observations.\n\n2. **\"Design a Bug\" engineering challenge:** Provide craft materials (pipe cleaners, tissue paper, foam balls, popsicle sticks) and ask students to build a model insect. Challenge: \"Make sure your insect has wings so it can fly away from danger!\" Students test their designs by gently tossing them. Discuss how each body part helps the insect survive.\n\n3. **Insect body parts book or poster series:** Over several weeks, create a class book where each page features one insect. Students draw the insect, label body parts, and write or dictate one sentence about how each part helps it survive. Bind pages and read aloud to celebrate learning. This extends the lesson across multiple science sessions and reinforces vocabulary.\n\n4. **\"If I Were an Insect\" creative writing:** Students complete sentence frames:\n   - \"If I were a butterfly, I would use my wings to _______.\"\n   - \"If I had six legs like an insect, I could _______.\"\n   - Pair with drawings for a class book.\n\n5. **Insect sensory bin exploration:** Create a sensory exploration station with insect pictures, textured materials (tissue paper for wings, pipe cleaners for legs, googly eyes), and magnifying glasses. Students explore and discuss how insect body parts feel and look.\n\n---\n\n## Teacher Notes\n\n- **Photography connection:** Return to the original photograph throughout all five phases. Its high-quality detail makes it an excellent anchor for discussions and helps students connect abstract concepts to a real organism.\n- **First Grade considerations:** This age group learns best through concrete exploration, movement, and sensory experiences. The Explore phase is intentionally hands-on. Vocabulary should be repeated frequently and paired with visual images.\n- **Safety reminder:** If collecting real insects, ensure students observe from a distance and do not harm them. Use pictures as alternatives if live observation is not feasible.\n- **Cultural relevance:** Some cultures have traditional stories about insects. If appropriate, briefly share a simple story about an insect to deepen engagement and show how insects are valued in the world.",
  "inputTokens": 2860,
  "outputTokens": 3819,
  "cost": 0.021954999999999995,
  "generatedAt": "2026-02-12T19:28:03.094Z"
}