{
  "title": "Swallowtail Butterfly",
  "category": "life-science",
  "imageFile": "IMG_2566.jpeg",
  "imagePath": "images/life-science/IMG_2566.jpeg",
  "content": "# Engineering Design Challenge: Butterfly Landing Platform\n\n---\n\n### Visible Elements in Photo\n\n- A swallowtail butterfly with black and cream-colored wings and long antennae, perched on a pink/magenta flower\n- A pink zinnia flower with yellow center stamens and multiple layered petals\n- A green stem supporting the flower\n- Blurred green foliage background\n- The butterfly's body positioned at an angle to the flower surface\n\n---\n\n### Reasonable Inferences\n\n1. **From the butterfly's perch position** — Butterflies need stable surfaces with the right texture and angle to land safely and access nectar without slipping or tipping over.\n\n2. **From the flower structure** — Flowers must support the weight of visiting insects while providing accessible landing zones (petals) that guide the creature to the nectar source.\n\n3. **From the natural setting** — In gardens or meadows, flowers compete for pollinator visits; a well-designed landing surface increases a flower's \"appeal\" to insects.\n\n---\n\n### Engineering Task\n\n**K–2 Version:**\nDesign a flower landing pad for butterflies! Using paper, fabric scraps, and tape, create a pretend flower with wide petals that a toy butterfly (or your finger) can land on without sliding off. Your flower needs petals that are bumpy or textured so the butterfly doesn't slip. Can you make it pretty and safe at the same time?\n\n**3–5 Version:**\nDesign and build a butterfly landing platform that mimics the zinnia flower's structure. Your platform must:\n- Be at least 10 cm wide with a textured landing surface (petals or a center disk)\n- Support the weight of a small object (toy butterfly or 50-gram weight) at a 30° angle without tipping\n- Include a \"nectar guide\" (contrasting color or pattern) that directs the butterfly toward the center\n- Use only paper, fabric, wire, and glue\n\nTest your design by gently placing the object on the petals from different angles. Which petal shape works best? Why?\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real-world need: butterflies must land safely on flowers to feed, and flowers must provide stable, attractive landing zones. Students can observe the challenge (\"How does the flower keep the butterfly from falling?\") and work backward to design a solution. The natural context makes the problem authentic and engaging.\n\n---\n\n### Suggested Materials\n\n- Colored tissue paper or construction paper\n- Fabric scraps (felt, cotton, or netting for texture)\n- Pipe cleaners or floral wire (for stems and antennae)\n- Hot glue gun or craft glue\n- Small toy butterfly, or a 50-gram weight (for testing stability)\n- Markers or watercolors (to add patterns and \"nectar guides\")\n\n---\n\n### Estimated Time\n\n**45–60 minutes** for a single session (K–2: design and build; 3–5: design, build, and run 2–3 test cycles). Extended to **two 30-minute sessions** if you want time for redesign based on test results.\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K.ETS1.1** (ask questions and define simple problems) and **3-5.ETS1.1** (define problems with specific criteria and constraints), grounding engineering in observable nature and giving students a tangible reason to think about structure, stability, and biomimicry.",
  "inputTokens": 2337,
  "outputTokens": 792,
  "cost": 0.0062970000000000005,
  "generatedAt": "2026-02-09T13:17:00.017Z"
}