{
  "id": 11,
  "title": "Dragonfly Emerging",
  "category": "life-science",
  "imageFile": "IMG_0506.jpeg",
  "content": "## 📸 Photo Description\n\nThis incredible photo shows a dragonfly hanging on a green leaf! The dragonfly has a pale blue-green body and see-through wings with delicate veins running through them. Its large eyes are bright blue like tiny jewels. You can see the dragonfly is holding onto the leaf while resting. Behind it are more green leaves, creating a peaceful garden scene.\n\n## 🔬 Scientific Phenomena\n\nThis image shows a newly emerged adult dragonfly. Dragonflies go through incomplete metamorphosis – they hatch from eggs as nymphs that live underwater, sometimes for years! When ready, the nymph climbs up a plant stem out of the water, and the adult dragonfly breaks out of its old skin. At first, its wings are soft and need time to harden and dry. The pale color tells us this dragonfly recently emerged and is resting while its wings strengthen for flight.\n\n## 📚 Core Concepts\n\n1. **Incomplete Metamorphosis**: Some insects (like dragonflies) go through three life stages: egg → nymph → adult (unlike butterflies which have four stages with a pupa).\n\n2. **Aquatic Larvae**: Young dragonflies (nymphs) live underwater and look completely different from adults – they don't have wings and they breathe through gills!\n\n3. **Insect Anatomy**: Dragonflies have compound eyes (made of thousands of tiny lenses), four wings, six legs, and three body parts (head, thorax, abdomen).\n\n<pedagogical-tip>\nCreate a life cycle wheel! Students can make circular diagrams showing the dragonfly life cycle with movable parts. Include: egg → underwater nymph → emerging adult → flying adult. This hands-on tool helps students understand cyclical processes. Compare to butterfly metamorphosis to highlight the differences between complete and incomplete metamorphosis.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Video Documentation**: Show videos of dragonfly emergence for students who benefit from seeing movement\n- **3D Models**: Provide toy insects or models students can manipulate to understand body parts\n- **Outdoor Observation**: Take students to a pond or stream to observe dragonflies in their natural habitat\n- **Comparison Strategy**: Use Venn diagrams to compare dragonfly and butterfly life cycles\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:DCI:3-LS4.B]]: Natural Selection\n- [[NGSS:DCI:3-LS2.D]]: Social Interactions and Group Behavior\n- [[NGSS:CCC:Patterns]]: Observing patterns in life cycles\n\n## 💬 Discussion Questions\n\n1. Where do baby dragonflies (nymphs) live before they become adults? (DOK 1: Recall)\n2. How is a dragonfly's life cycle different from a butterfly's life cycle? (DOK 2: Skill/Concept)\n3. Why do you think dragonflies need such large eyes? (DOK 2: Skill/Concept)\n4. What advantages might a dragonfly have by spending part of its life in water and part in air? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from one life stage to another\n- **Nymph**: The young form of insects that go through incomplete metamorphosis\n- **Compound eyes**: Eyes made up of thousands of tiny lenses that help insects see in many directions\n- **Emergence**: When an adult insect breaks out of its old skin or cocoon\n- **Aquatic**: Living in or relating to water\n\n## 🔬 Extension Activities\n\n- Research dragonfly hunting abilities (they catch 95% of prey they chase!)\n- Compare complete vs. incomplete metamorphosis with charts\n- Visit a pond to collect water samples and look for dragonfly nymphs\n- Create dragonfly art focusing on wing patterns and iridescent colors",
  "educational": {
    "kindergarten": "## 📸 Photo Description\n\nThis photo shows a beautiful dragonfly with delicate see-through wings resting on a green leaf. The dragonfly's body is a stunning blue-green color and its large eyes glisten like tiny jewels. It is holding onto the leaf, taking a break after emerging from its old skin.\n\n## 🔬 Scientific Phenomena\n\nThe dragonfly in this photo has just completed an incredible transformation! Dragonflies start their lives as underwater nymphs, breathing through gills. When they are ready to become adults, the nymphs crawl out of the water and their old skin splits open. The adult dragonfly then slowly emerges, with its wings soft and crumpled at first. As the dragonfly rests, its wings expand and stiffen, preparing it for its new life flying through the air.\n\n## 📚 Core Science Concepts\n\n1. **Life Cycle**: Dragonflies go through incomplete metamorphosis, changing from an aquatic nymph to a flying adult. \n2. **Adaptations**: Dragonflies have special adaptations like large compound eyes and two pairs of strong wings that allow them to be excellent flyers.\n3. **Habitats**: Dragonflies spend part of their lives underwater and part in the air, moving between aquatic and land environments.\n\n<pedagogical-tip>\nUse a hands-on life cycle model or diagram to help students visualize the dragonfly's transformation. Let them act out the different stages, crawling like nymphs and flapping their wings like adults. This kinesthetic learning helps reinforce the concepts.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Experiences**: Bring in natural items like leaves, sticks, and water samples so students can observe and feel the different dragonfly habitats.\n- **Differentiated Instruction**: Provide leveled texts and visual aids about dragonfly life cycles to support diverse learners.\n- **Multiple Modalities**: Incorporate videos, illustrations, and hands-on models to appeal to students with different learning preferences.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:K-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:DCI:K-ESS3.A]]: Natural Resources\n- [[NGSS:CCC:Patterns]]: Observe patterns in life cycles\n\n## 💬 Discussion Questions\n\n1. What are the differences between a dragonfly nymph and a dragonfly adult? (DOK 2: Skill/Concept)\n2. Why do you think dragonflies need to spend time resting after emerging from their old skin? (DOK 2: Skill/Concept)\n3. How do you think dragonflies' large eyes help them? (DOK 3: Strategic Thinking)\n4. What might happen if a dragonfly nymph couldn't leave the water to become an adult? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Nymph**: The young form of a dragonfly that lives underwater\n- **Metamorphosis**: The process of changing from one life stage to another\n- **Compound eyes**: The large, multifaceted eyes of insects that give them a wide field of vision\n- **Adaptation**: A special feature that helps an organism survive in its environment\n- **Habitat**: The natural home or environment of an animal or plant\n\n## 🌡️ Extension Activities\n\n- Go on a nature walk to search for dragonflies and their habitats\n- Create a poster showing the dragonfly life cycle with drawings or pictures\n- Experiment with paper airplanes to understand how dragonfly wings work\n- Read books about amazing dragonfly facts and abilities",
    "grade1": "## 📸 Photo Description\n\nThis photo shows a beautiful dragonfly that is just starting to emerge from its old skin. The dragonfly has a bright blue-green body and delicate, see-through wings. Its large, shiny eyes look like little jewels. The dragonfly is resting on a green leaf, gently holding on as its wings slowly unfurl and dry out.\n\n## 🔬 Scientific Phenomena\n\nThe dragonfly in this photo is going through a special process called incomplete metamorphosis. This means the dragonfly starts out as an egg, then hatches into a nymph that lives underwater. After growing and developing for months or even years, the nymph climbs up a plant stem out of the water. Then, the adult dragonfly breaks out of its old skin, allowing its wings to unfurl and harden. This is an amazing transformation to watch!\n\n## 📚 Core Science Concepts\n\n1. **Life Cycles**: Dragonflies go through an incomplete metamorphosis with three main stages: egg, nymph, and adult. This is different from a complete metamorphosis like a butterfly.\n\n2. **Adaptations**: Dragonflies have special adaptations like their large compound eyes and four strong wings that let them be skilled hunters and amazing flyers.\n\n3. **Habitats**: Dragonfly nymphs live underwater, but the adult dragonflies fly and hunt in the air. This means they need both aquatic and land habitats to survive.\n\n<pedagogical-tip>\nTo help students understand the dragonfly life cycle, create a hands-on model using craft materials. Students can make a 3D representation of the egg, nymph, and adult stages. Encourage them to add details like the nymph's gills or the adult's wings. This kinesthetic activity will help cement the concept of incomplete metamorphosis.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimedia Supports**: Show videos of dragonfly nymphs and adults to see the differences in their appearance and behavior.\n- **Sensory Aids**: Provide specimens or models of dragonfly body parts for students to touch and explore.\n- **Real-World Connections**: Take a field trip to observe dragonflies in their natural habitats, like ponds or streams.\n- **Varied Presentation**: Use diagrams, timelines, or other visual aids to help students grasp the dragonfly life cycle.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:1-LS1.A]]: Structure and Function\n- [[NGSS:DCI:1-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:CCC:Patterns]]: Observe and describe patterns in the natural world\n\n## 💬 Discussion Questions\n\n1. How is a dragonfly's life cycle different from a butterfly's life cycle? (DOK 2: Skill/Concept)\n2. Why do you think dragonflies need such large, complex eyes? (DOK 2: Skill/Concept)\n3. Where do you think the dragonfly nymphs live before they become adults? (DOK 1: Recall)\n4. What advantages might a dragonfly have by living in both water and air during its lifetime? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of changing from one form to another, like from a caterpillar to a butterfly.\n- **Nymph**: The young form of an insect that goes through incomplete metamorphosis.\n- **Compound eyes**: Eyes made up of thousands of tiny lenses that help insects see in many directions.\n- **Emerge**: To come out or appear from somewhere.\n- **Aquatic**: Relating to or living in water.\n\n## 🌡️ Extension Activities\n\n- Create a life cycle diagram or model to show the stages of a dragonfly's life.\n- Observe dragonflies in your local area and keep a nature journal of your observations.\n- Research the hunting and flying abilities of adult dragonflies and how they use their unique adaptations.\n- Explore the differences between complete and incomplete metamorphosis by comparing dragonflies and butterflies.",
    "grade2": "## 📸 Photo Description\n\nThis stunning photo shows a dragonfly in the process of emerging from its old skin! The dragonfly's body is pale and soft, with wrinkly wings that are still drying out. You can see its large compound eyes and its long, spindly legs gripping onto the green leaf. The dragonfly is taking a break after its amazing transformation from a water-dwelling nymph to a beautiful flying insect.\n\n## 🔬 Scientific Phenomena\n\nThe image captures the incredible process of incomplete metamorphosis in dragonflies. Unlike butterflies, dragonflies do not have a pupal stage. Instead, the young dragonfly nymphs live underwater for months or even years, breathing through gills. When they are ready to become adults, the nymphs crawl out of the water and climb up a plant stem. Their old skin then splits open, and the soft, pale adult dragonfly emerges, pumping fluid into its wings to inflate and strengthen them. This resting period allows the dragonfly's body to fully harden before it takes its first flight.\n\n## 📚 Core Science Concepts\n\n1. **Incomplete Metamorphosis**: Dragonflies undergo three main life stages - egg, nymph, and adult - rather than the four stages (egg, larva, pupa, adult) seen in complete metamorphosis.\n\n2. **Aquatic Nymphs**: Dragonfly nymphs are aquatic, living underwater and breathing through gills, before transforming into the flying adult dragonfly.\n\n3. **Insect Anatomy**: Dragonflies have large compound eyes made up of thousands of tiny lenses, four transparent wings, and a long, slender abdomen.\n\n<pedagogical-tip>\nEngage students in hands-on exploration of incomplete metamorphosis by having them create a life cycle model using craft materials. They can make moveable cutouts or drawings to show the dragonfly's transformation from egg to nymph to adult. Encourage them to compare this process to the complete metamorphosis of butterflies. Kinesthetic activities like this help cement students' understanding of these complex biological processes.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimedia Resources**: Show videos of dragonfly emergence to supplement the static image\n- **Manipulatives**: Provide model dragonflies or other insects that students can handle to explore anatomy\n- **Outdoor Observation**: Take students on a field trip to observe dragonflies in their natural habitats\n- **Graphic Organizers**: Use Venn diagrams or T-charts to compare and contrast complete and incomplete metamorphosis\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:2-LS4.D]] Biodiversity and Humans\n- [[NGSS:DCI:2-LS1.B]] Growth and Development of Organisms\n- [[NGSS:CCC:Patterns]] Observing patterns in life cycles\n\n## 💬 Discussion Questions\n\n1. How is a dragonfly's life cycle different from a butterfly's life cycle? (DOK 2: Skill/Concept)\n2. Why do you think dragonflies need such large, compound eyes? (DOK 2: Skill/Concept)\n3. What adaptations might help dragonfly nymphs survive in the water before becoming adults? (DOK 3: Strategic Thinking)\n4. How might the dragonfly's transformation from water-dwelling nymph to flying adult be important for the ecosystem? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from one life stage to another\n- **Nymph**: The young form of insects that go through incomplete metamorphosis\n- **Compound eyes**: Eyes made up of thousands of tiny lenses that help insects see in many directions\n- **Emergence**: When an adult insect breaks out of its old skin or cocoon\n- **Aquatic**: Living in or relating to water\n- **Adapt**: To change or adjust to a new environment\n\n## 🌡️ Extension Activities\n\n- Observe and draw the different stages of a dragonfly's life cycle\n- Research how dragonfly nymphs hunt and survive underwater\n- Investigate the various wing patterns and colors of different dragonfly species\n- Create a diorama or model showing the dragonfly's habitat and life cycle",
    "grade3": "## 📸 Photo Description\n\nThis amazing photo shows a newly emerged dragonfly clinging to a leaf. The dragonfly's body is pale and soft, not yet the vibrant blue-green color of an adult. Its large, compound eyes are bright and shiny like jewels. The dragonfly's delicate, transparent wings are still unfurling and drying, getting ready for its first flight.\n\n## 🔬 Scientific Phenomena\n\nThe dragonfly in the photo is undergoing a process called incomplete metamorphosis. Unlike butterflies that go through a complete transformation with four distinct life stages, dragonflies have only three stages: egg, nymph, and adult. The nymph stage is spent living underwater, where the dragonfly grows and develops, eventually crawling up a plant stem to emerge as a winged adult. This dragonfly is just finishing its emergence, with its wings still soft and pale as it rests and allows them to fully harden before taking flight for the first time.\n\n## 📚 Core Science Concepts\n\n1. **Incomplete Metamorphosis**: Dragonflies and other insects that do not have a pupal stage undergo incomplete metamorphosis, transitioning directly from nymph to adult.\n\n2. **Aquatic Nymphs**: Dragonfly nymphs are aquatic, living and breathing underwater for months or even years before emerging as adults.\n\n3. **Insect Anatomy**: Dragonflies have compound eyes, four wings, six legs, and a segmented body - characteristics common to many insects.\n\n<pedagogical-tip>\nTo help students understand incomplete metamorphosis, have them create a life cycle diagram or model, with movable parts to show the egg, nymph, and adult stages. Encourage them to compare and contrast this with the complete metamorphosis of butterflies. Hands-on activities like this allow students to actively explore and visualize the differences.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Sensory Supports**: Provide images, videos, and physical models for students to observe the dragonfly's anatomy and emergence process.\n- **Multimodal Representations**: Use diagrams, timelines, and interactive activities to help visual, auditory, and kinesthetic learners understand the life cycle.\n- **Flexible Grouping**: Allow students to work individually, in pairs, or small groups to explore and discuss the dragonfly's transformation.\n- **Choice and Autonomy**: Offer students options for how they demonstrate their understanding, such as creating a poster, writing a story, or building a 3D model.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:3-LS1.B]]: Growth and Development of Organisms\n- [[NGSS:DCI:3-LS4.B]]: Natural Selection\n- [[NGSS:CCC:Patterns]]: Observing patterns in life cycles\n\n## 💬 Discussion Questions\n\n1. How is a dragonfly's life cycle different from a butterfly's life cycle? (DOK 2: Skill/Concept)\n2. Why do you think dragonfly nymphs live underwater for so long before becoming adults? (DOK 3: Strategic Thinking)\n3. What adaptations do you think help dragonflies survive as both aquatic nymphs and flying adults? (DOK 3: Strategic Thinking)\n4. How might the dragonfly's compound eyes and four wings help it in its environment? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Metamorphosis**: The process of transformation from one life stage to another.\n- **Nymph**: The young, immature form of an insect that undergoes incomplete metamorphosis.\n- **Compound eyes**: Eyes made up of thousands of tiny visual units, allowing insects to see in many directions at once.\n- **Emergence**: The process of an adult insect breaking out of its old skin or cocoon.\n- **Aquatic**: Relating to or living in water.\n- **Adaptation**: A physical or behavioral feature that helps an organism survive and thrive in its environment.\n\n## 🔬 Extension Activities\n\n- Research the hunting and feeding behaviors of dragonfly nymphs and adults.\n- Observe dragonflies in a local pond or stream and sketch their movements and behaviors.\n- Design an experiment to test how dragonfly wing shape or eye structure affects their flight and vision.\n- Create a diorama or model showing the different stages of the dragonfly life cycle.",
    "grade4": "## 📸 Photo Description\n\nThis stunning photo shows a dragonfly in the process of emerging from its old skin or \"exoskeleton\". The dragonfly's body is pale and soft, and its wings are just starting to unfold and expand. You can see the delicate wing veins and the dragonfly's large, compound eyes as it rests on a green leaf. The background is blurry, keeping the focus on this incredible moment of transformation.\n\n## 🔬 Scientific Phenomena\n\nThe image captures a dragonfly undergoing incomplete metamorphosis. Unlike a butterfly's complete metamorphosis (egg → caterpillar → pupa → adult), dragonflies have three life stages: egg → nymph (underwater) → adult. The nymph, which lives underwater, climbs up a plant stem and splits open its old exoskeleton. The adult dragonfly then emerges, pumping fluid into its new, soft wings to expand them. As the wings harden, the dragonfly can take its first flight as an adult.\n\n## 📚 Core Science Concepts\n\n1. **Incomplete Metamorphosis**: Dragonflies go through three main life stages (egg, nymph, adult) rather than the four stages of complete metamorphosis.\n\n2. **Aquatic Nymphs**: Dragonfly nymphs are adapted to live underwater, breathing through gills and hunting other small aquatic creatures.\n\n3. **Insect Anatomy**: Dragonflies have specialized features like compound eyes, two pairs of strong wings, and a long slender abdomen.\n\n<pedagogical-tip>\nProvide hands-on materials for students to explore dragonfly anatomy, such as pinned specimens or 3D models. Encourage close observation and labeling of body parts. Then have students draw and label their own diagrams to solidify their understanding.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Multimedia Resources**: Show videos of dragonfly emergence to engage visual learners\n- **Sensory Exploration**: Allow students to feel the texture of a dragonfly's wings or exoskeleton\n- **Modeling Activities**: Have students act out the dragonfly life cycle using their bodies\n- **Differentiated Instruction**: Provide reading materials at varying complexity levels for students\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:4-LS1.A]]: Structure and Function\n- [[NGSS:DCI:4-LS1.D]]: Biodiversity and Humans\n- [[NGSS:CCC:Patterns]]: Observing patterns in life cycles\n\n## 💬 Discussion Questions\n\n1. How is a dragonfly's life cycle different from a butterfly's? (DOK 2: Skill/Concept)\n2. What adaptations do you think help dragonfly nymphs survive underwater? (DOK 3: Strategic Thinking)\n3. Why do you think dragonflies have such large, compound eyes? (DOK 2: Skill/Concept)\n4. How might the dragonfly's incredible flight abilities be useful in its environment? (DOK 3: Strategic Thinking)\n\n## 📖 Vocabulary\n\n- **Exoskeleton**: The hard, external \"skeleton\" that covers and protects an insect's body\n- **Nymph**: The immature, wingless stage of an insect that undergoes incomplete metamorphosis\n- **Compound eyes**: Eyes made up of thousands of individual visual units, giving insects a wide field of view\n- **Adaptation**: A characteristic that helps an organism survive and thrive in its environment\n- **Biodiversity**: The variety of living species in a particular habitat or ecosystem\n- **Metamorphosis**: The process of transformation from one life stage to another\n\n## 🔬 Extension Activities\n\n- Research how dragonflies use their amazing flying abilities to catch prey\n- Observe and sketch the life cycle stages of a dragonfly, from egg to adult\n- Visit a local pond or stream to look for dragonfly nymphs and emerging adults\n- Create a 3D model or diorama showing the dragonfly's aquatic nymph stage and adult life",
    "grade5": "## 📸 Photo Description\n\nThis image shows a dragonfly emerging from its old exoskeleton, or skin, as it transitions from its nymph stage to becoming an adult. The dragonfly's newly formed wings are still soft and pale in color, but you can see its bright blue eyes and sleek blue-green body as it rests on the leaf, getting ready to take its first flight.\n\n## 🔬 Scientific Phenomena\n\nThe dragonfly in this photo is undergoing a process called incomplete metamorphosis. Unlike butterflies and moths, which go through four distinct life stages (egg, larva, pupa, adult), dragonflies have only three stages: egg, nymph, and adult. The nymph stage, which lives underwater, is where most of the dragonfly's growth and development occurs. When the nymph is ready to become an adult, it climbs out of the water and attaches itself to a plant. The exoskeleton then splits open, and the soft, pale adult dragonfly emerges, pumping fluid into its wings to expand them. This is an incredible moment as the dragonfly prepares for its new life in the air.\n\n## 📚 Core Science Concepts\n\n1. **Incomplete Metamorphosis**: Dragonflies go through an incomplete metamorphosis, with only three life stages (egg, nymph, adult), unlike the four stages of a complete metamorphosis in butterflies and moths.\n\n2. **Aquatic Nymphs**: Dragonfly nymphs live underwater, breathing through gills, and look very different from the adult dragonflies we see flying around.\n\n3. **Insect Anatomy**: Dragonflies have compound eyes, four wings, and a slender, segmented body with three main parts (head, thorax, abdomen).\n\n<pedagogical-tip>\nTo help students understand the dragonfly's life cycle, have them create a hands-on model or diagram. They can draw the three stages (egg, nymph, adult) and then use movable parts to show the transition from nymph to adult. This will reinforce the concept of incomplete metamorphosis and allow students to actively engage with the process.\n</pedagogical-tip>\n\n<udl-suggestions>\n- **Visual Aids**: Provide images, diagrams, or videos to support students' understanding of the dragonfly's life cycle and anatomy.\n- **Hands-on Activities**: Allow students to explore and manipulate 3D models or physical specimens of dragonflies and their different life stages.\n- **Sensory Experiences**: Take students on a field trip to observe dragonflies in their natural habitats, allowing them to use multiple senses to explore the organisms.\n- **Collaborative Learning**: Encourage students to work together in small groups to compare and contrast the life cycles of dragonflies and butterflies.\n</udl-suggestions>\n\n## 🎓 NGSS Connections\n\n- [[NGSS:DCI:5-LS1.C]]: Organization for Matter and Energy Flow in Organisms\n- [[NGSS:DCI:5-LS2.A]]: Interdependent Relationships in Ecosystems\n- [[NGSS:CCC:Patterns]]: Observe patterns in the life cycle of dragonflies\n\n## 💬 Discussion Questions\n\n1. How is the life cycle of a dragonfly different from the life cycle of a butterfly? (DOK 2: Skill/Concept)\n2. Why do you think dragonfly nymphs live underwater, while the adult dragonflies live and fly in the air? (DOK 3: Strategic Thinking)\n3. What adaptations do you think the dragonfly has that allow it to be successful both underwater and in the air? (DOK 3: Strategic Thinking)\n4. How might the dragonfly's compound eyes and four wings help it catch its prey? (DOK 2: Skill/Concept)\n\n## 📖 Vocabulary\n\n- **Exoskeleton**: The hard, protective outer covering of an insect's body.\n- **Nymph**: The immature, aquatic stage of an insect that goes through incomplete metamorphosis.\n- **Compound eyes**: Eyes made up of thousands of individual visual units, allowing insects to see in many directions.\n- **Incomplete metamorphosis**: A type of insect development where the young (nymph) resembles the adult, with gradual changes.\n- **Adaptation**: A characteristic that helps an organism survive and thrive in its environment.\n- **Ecosystem**: A community of living organisms (plants, animals, and microbes) interacting with each other and their physical environment.\n\n## 🌡️ Extension Activities\n\n- Research how dragonfly nymphs hunt and feed underwater, and compare their hunting strategies to the adult dragonfly.\n- Investigate the role of dragonflies in different ecosystems, and how they contribute to the balance of these environments.\n- Conduct a field study to observe dragonflies in their natural habitats, collecting data on their behavior and life cycle stages.\n- Design and build model dragonflies, focusing on the unique features that make them successful predators, both in the water and in the air."
  }
}