{
  "title": "Mourning Dove",
  "category": "life-science",
  "imageFile": "IMG_0318.jpg",
  "imagePath": "images/life-science/IMG_0318.jpg",
  "content": "### Visible Elements in Photo\n- A ground-dwelling bird (appears to be a plover or similar species) resting on bare soil and dark mulch/wood chips\n- Small purple flowers scattered across the ground\n- Exposed ground with minimal vegetation cover\n- The bird's low, camouflaged coloring (tan/grey plumage blending with soil tones)\n- Twigs, leaf litter, and organic debris covering much of the ground surface\n\n### Reasonable Inferences\n- **From low ground cover and bird behavior**: This bird nests on open ground with little shelter, exposing it to predators and harsh weather—it needs a safe place to rest and raise young.\n- **From camouflaged plumage**: The bird's coloring matches its surroundings, suggesting that survival depends partly on hiding from threats in plain sight.\n- **From sparse vegetation**: The habitat lacks dense plants or structures for protection, meaning any shelter must be built from available natural materials.\n\n### Engineering Task\n\n**K-2: Build a Safe Resting Nest**\n\"This bird sleeps and lays eggs on the ground where predators can see it. Design and build a cozy nest using sticks, leaves, and soil that hides the bird and keeps it safe. Your nest should be big enough for the bird to fit inside and blend in with the ground so it's hard to see.\"\n\n**3-5: Design a Ground Nest with Predator Protection**\n\"Design a ground nest for a ground-nesting bird that must meet these criteria: (1) constructed entirely from natural materials found in the habitat (twigs, leaves, soil, grass); (2) camouflaged to blend with surrounding mulch and soil within 30 cm radius; (3) provides shelter from at least three sides; (4) can hold a tennis ball (representing an egg) without rolling out. Test your design by placing it in a \"predator search zone\" and measuring how long it takes a partner to spot it. Iterate to improve camouflage.\"\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real organism in its natural habitat with a visible need (ground nester exposed to predators and weather). Students can observe the bird's vulnerability and the habitat constraints, making this ideal for starting with \"What problem does this bird face?\" and \"What would help it survive?\" This grounds the entire EDP in authentic observation rather than jumping to solutions.\n\n### Suggested Materials\n- Twigs and small branches\n- Dried leaves and leaf litter\n- Soil or potting mix\n- Grass clippings or dried grass\n- Small rocks or pebbles\n- Tennis ball (for testing egg safety)\n- Hand lens or magnifying glass (optional, for observing bird details)\n\n### Estimated Time\n- **K-2**: One 40-45 minute session (design and build)\n- **3-5**: Two 45-minute sessions (Session 1: design, build, and initial testing; Session 2: observe camouflage results, iterate, and refine)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem reflecting a need or a want*) and **K-2-ETS1-1** (*Ask questions, make observations, and gather information*) by asking students to identify a real survival challenge from nature and prototype a solution using constraints drawn from the actual habitat.",
  "inputTokens": 2329,
  "outputTokens": 769,
  "cost": 0.006174000000000001,
  "generatedAt": "2026-02-09T13:15:58.173Z"
}