{
  "title": "Inherited Traits",
  "category": "life-science",
  "imageFile": "inherited_traits.jpg",
  "imagePath": "images/life-science/inherited_traits.jpg",
  "content": "# Engineering Design Challenge: Bird Nest Protection\n\n### Visible Elements in Photo\n- Adult bird (tan/beige plumage, black curved beak, distinctive eye ring) with two chicks (speckled gray-brown feathers, darker beaks)\n- Dry straw or grass nest material visible at bottom of frame\n- Indoor or sheltered setting (white/gray surfaces visible in background)\n- Close proximity of parent to offspring, suggesting active caregiving\n- Exposed nest structure with minimal covering\n\n### Reasonable Inferences\n- **From nest material visibility**: The nest is constructed from lightweight, flexible plant material gathered from the environment—suggesting natural materials provide both structural support and insulation.\n- **From chick vulnerability and parent proximity**: Young birds need protection from predators and weather; the parent's constant presence implies nests must be positioned or designed to allow monitoring while providing shelter.\n- **From indoor/sheltered setting**: This bird may nest in protected locations (eaves, ledges, cavities) rather than open ground, indicating environmental factors (wind, rain, predators) drive nest design choices.\n\n### Engineering Task\n\n**K-2:**\nMake a cozy, safe bed for baby birds using straw, twigs, and leaves. Your nest should hold two toy birds and not fall apart when you gently shake it. Can you make it strong enough to keep the babies safe?\n\n**3-5:**\nDesign and build a protective nest structure using only natural materials (straw, twigs, grass, small branches) that:\n- Holds two small objects (representing chicks) without collapsing\n- Remains stable when tilted at a 20° angle (simulating wind)\n- Provides at least three \"covered\" areas where chicks could hide from predators\n- Uses only materials that could realistically be gathered outdoors\n\nTest your design by tilting it slowly and recording how long it stays stable. Redesign one element based on what fails first.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real-world biological need (shelter and protection for vulnerable young) without showing an active solution attempt. Students must first identify *why* birds build nests the way they do before designing their own. Starting with \"Ask\" allows students to observe the problem (exposed chicks, simple materials) and articulate what a good nest must do.\n\n### Suggested Materials\n1. Dry straw, hay, or raffia\n2. Small twigs and branches\n3. Dried grass or leaves\n4. Small feathers (craft feathers or collected)\n5. Pipe cleaners or flexible wire (optional, for frame support)\n6. Modeling clay (to anchor nest to a base board)\n\n### Estimated Time\n**One 45-minute session** (K-2: observation + building + one shake test) or **Two 30-minute sessions** (3-5: observation + design sketch + building + tilt testing + redesign iteration)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (*Define design problems that describe a specific need or problem*) by having students identify real constraints birds face and apply them to their own designs, grounding engineering in observable biology.",
  "inputTokens": 1804,
  "outputTokens": 711,
  "cost": 0.005359,
  "generatedAt": "2026-02-09T13:36:51.456Z"
}