{
  "title": "Insect",
  "category": "life-science",
  "gradeLevel": "third-grade",
  "questions": [
    {
      "questionText": "What body parts does this insect have that help it survive on flowers?",
      "bloomsLevel": "Understand",
      "dokLevel": 1,
      "rubric": {
        "exceeds": "Student identifies at least three body parts (such as long legs, antennae, and mouthparts) and explains how each specific part helps the insect interact with or get food from flowers.",
        "meets": "Student identifies at least two body parts (such as legs and antennae) and describes how they help the insect on flowers.",
        "approaching": "Student names one or two body parts visible on the insect but provides limited or incomplete explanation of how they help with survival on flowers.",
        "beginning": "Student identifies a body part but provides vague or inaccurate information about its purpose, or confuses insect parts with flower parts."
      }
    },
    {
      "questionText": "Why might an insect with longer legs be better at visiting flowers than an insect with shorter legs? How could this help it survive?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that longer legs help the insect reach farther or move more easily between flowers, and connects this advantage to gathering more food or energy needed for survival and reproduction.",
        "meets": "Student explains that longer legs allow the insect to reach flowers more easily or travel between them, and identifies how this helps the insect survive.",
        "approaching": "Student states that longer legs are helpful but provides incomplete reasoning about how this helps the insect access flowers or get food.",
        "beginning": "Student mentions longer legs but gives vague or illogical explanation of the advantage, or does not connect the trait to survival."
      }
    },
    {
      "questionText": "If all the flowers in this area died, what would happen to insects like this one? Use what you know about survival and food.",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that without flowers, insects would lose their food source and could starve or move away; may also mention effects on other animals that depend on insects for food.",
        "meets": "Student describes that insects need flowers for food and would have trouble surviving or staying in that area if flowers disappeared.",
        "approaching": "Student recognizes that flowers are food for insects, but explanation of consequences is incomplete or unclear.",
        "beginning": "Student makes a simple statement about insects and flowers but shows little understanding of how insects depend on flowers for survival."
      }
    },
    {
      "questionText": "How do you think this insect's babies would look? Would they be exactly like the parent, or might they be different? What traits might they inherit?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student predicts babies would resemble the parent and explains that traits like leg length, antennae, or color might be inherited; recognizes some differences might occur due to variation.",
        "meets": "Student predicts that baby insects would look similar to the parent and identifies at least one inherited trait (such as leg length, color, or antennae).",
        "approaching": "Student attempts to compare babies to parents but provides incomplete description of inherited traits or shows uncertainty about which traits pass from parent to offspring.",
        "beginning": "Student makes a vague prediction about what babies might look like but does not identify specific traits or how inheritance works."
      }
    }
  ],
  "generatedAt": "2026-02-15T06:24:34.849Z",
  "cost": 0.004901
}