{
  "title": "Insect Characteristics",
  "category": "life-science",
  "imageFile": "insect_characteristics.jpg",
  "imagePath": "images/life-science/insect_characteristics.jpg",
  "content": "# Engineering Design Challenge: Grasshopper Grip\n\n### Visible Elements in Photo\n- A green grasshopper with textured body and legs clinging to a thin green plant stem\n- Long, thin antennae extending from the grasshopper's head\n- A smooth, cylindrical green stem (appears to be grass or a plant blade)\n- The grasshopper's powerful hind legs positioned for gripping and jumping\n- Slight color variation (brown and green) on the grasshopper's back\n\n### Reasonable Inferences\n- **From the leg structure & stem contact**: The grasshopper's legs are specially shaped to grip smooth, narrow surfaces without slipping—students might invent tools or devices that solve the same \"grip smooth objects\" problem.\n- **From the thin antennae & small body**: The grasshopper uses lightweight appendages to sense its environment, suggesting that effective designs don't always require heavy or bulky parts.\n- **From the vertical perch**: The grasshopper must resist gravity and wind to stay on this plant—any shelter or clinging mechanism needs to work on angled or moving surfaces.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nMake a tool or hand that can grab and hold a thin stick (like a pencil or dowel rod) without dropping it. Your hand should use only string, tape, or paper. Can your tool pick up the stick, hold it in the air for 10 seconds, and not let it slip?\n\n**3-5 Version:**\nDesign and build a gripping device that can securely hold a smooth dowel rod (or straw) in a vertical position for at least 30 seconds without the rod slipping. Your device must:\n- Use only 5 materials from the provided list\n- Not be longer than 15 cm\n- Support the weight of the rod as it would cling to a real plant\n- Be tested on rods of two different diameters (thin and thick)\nRecord which design works best and why.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real-world problem: *How do small creatures grip smooth surfaces without falling?* Students begin by observing the grasshopper's strategy, then reframe it as their own design challenge. They're not copying the grasshopper—they're solving the underlying problem the grasshopper solves. This naturally opens the \"Ask\" phase: *What makes a good grip? What would fail? What do we need to test?*\n\n---\n\n### Suggested Materials\n1. **String or yarn** (various thicknesses)\n2. **Foam pipe insulation** (cut into sections to wrap around dowels)\n3. **Rubber bands** (elastic grip properties)\n4. **Masking tape or duct tape** (adhesion and flexibility)\n5. **Craft foam or sponge pieces** (cushioning and grip texture)\n6. **Dowel rods or drinking straws** (test objects in two sizes)\n\n---\n\n### Estimated Time\n**Two 30-minute sessions**\n- Session 1 (20 min): Observe the photo, discuss how the grasshopper grips, brainstorm ideas, and build a first prototype (10 min planning + 10 min building).\n- Session 2 (30 min): Test prototypes on both dowel sizes, record observations, iterate on designs, and test again.\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem reflecting a need or a want*) by having students extract a real engineering problem from nature and solve it with their own hands, bridging life science and design thinking in one activity.",
  "inputTokens": 2329,
  "outputTokens": 834,
  "cost": 0.0064990000000000004,
  "generatedAt": "2026-02-09T13:42:30.793Z"
}