{
  "title": "Insect",
  "category": "life-science",
  "imageFile": "insect.jpg",
  "imagePath": "images/life-science/insect.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- White daisy flower with yellow center (disk florets)\n- Orange and black striped insect (appears to be an assassin bug or similar predatory insect) standing on flower petals\n- Green plant stems and foliage in background\n- Pale stone or concrete surface (left side)\n- Multiple white petals arranged radially around the flower center\n\n## Reasonable Inferences\n- **From the insect's position on the flower**: The insect is visiting the flower to hunt smaller insects or feed, suggesting flowers attract diverse creatures.\n- **From the flower structure**: The large, accessible disk center and broad petals serve as a landing platform for insects of various sizes.\n- **From the natural setting**: This outdoor environment shows a pollination or predation relationship that depends on flower design features.\n\n---\n\n## Engineering Task\n\n### **K-2: Build a Bug Landing Pad**\nDesign and build a flower landing pad that a toy bug can safely stand on without tipping over. Your pad should have:\n- A big, flat center where the bug can balance (like the yellow part of the daisy)\n- Petals or flaps sticking out around it (like the white petals)\n- No sharp edges that might hurt the bug\n\nTest it: Can your toy bug stand on the center without falling? Can it walk across the petals?\n\n---\n\n### **3-5: Design a Flower Structure for Insect Stability**\nEngineer a flower model that maximizes insect accessibility and stability. Your design must:\n- **Support criterion**: Hold a 10-gram weight (representing a visiting insect) on the flower center without tipping for 30 seconds.\n- **Access criterion**: Provide at least three different \"landing zones\" (petals or extensions) where an insect could approach the center.\n- **Durability criterion**: Survive at least five test cycles (placing and removing the weight) without structural failure.\n\nUse measurements: petals must be at least 4 cm long; the center disk must be at least 3 cm in diameter. Sketch your design before building.\n\n---\n\n## EDP Phase Targeted\n**Ask / Define Problem**\n\n**Why**: The photo shows a real organism solving a structural problem naturally (how to support visiting insects while allowing them access to pollen/nectar). Students begin by observing *what problem the flower solves* before imagining their own design solutions. This grounds the engineering challenge in authentic biological observation.\n\n---\n\n## Suggested Materials\n1. Paper plates or cardboard circles (flower center)\n2. Tissue paper, construction paper, or crepe paper (petals)\n3. Pipe cleaners or straws (stems)\n4. Tape and glue\n5. Weights: washers, pennies, or plasticine (to represent insects)\n\n---\n\n## Estimated Time\n- **K-2**: 30–40 minutes (design, build, test)\n- **3-5**: Two 35–40 minute sessions (sketch & plan, build, test & iterate)\n\n---\n\n## Why This Works for Teachers\nThis task directly addresses **NGSS 3-5-ETS1-1** (defining engineering problems based on human needs or wants) and **K-2-ETS1-1** (asking questions about how the natural world works), by having students reverse-engineer a biological structure and apply its principles to a human-made design.",
  "inputTokens": 2194,
  "outputTokens": 773,
  "cost": 0.006059,
  "generatedAt": "2026-02-15T06:10:41.404Z"
}