{
  "title": "Insect",
  "category": "life-science",
  "gradeLevel": "third-grade",
  "questions": [
    {
      "questionText": "What do you think the insect is doing on the flower, and why?",
      "bloomsLevel": "Understand",
      "dokLevel": 1,
      "rubric": {
        "exceeds": "Student identifies that the insect is feeding on nectar or pollen and explains that insects need food to survive, showing understanding of the insect's basic needs and behavior.",
        "meets": "Student correctly states that the insect is eating or getting food from the flower with a simple, accurate explanation of why.",
        "approaching": "Student recognizes the insect is on the flower for food but provides incomplete or unclear reasoning about why the insect needs to be there.",
        "beginning": "Student makes a vague guess about what the insect is doing (such as 'it's playing') with little or no explanation of purpose."
      }
    },
    {
      "questionText": "How might this flower be different if no insects ever visited it?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that without insects, the flower would not be pollinated and could not make seeds or new flowers, demonstrating understanding of the relationship between insects and flower reproduction.",
        "meets": "Student identifies that the flower would not make seeds or would not be able to reproduce without insects visiting it.",
        "approaching": "Student recognizes that insects affect the flower in some way but provides limited or partially accurate details about what would change.",
        "beginning": "Student offers a response that shows minimal understanding, such as 'the flower would be sad' or a response unrelated to the insect's role."
      }
    },
    {
      "questionText": "What features of the flower do you think attract insects?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student identifies multiple specific features (bright color, sweet smell, nectar, pollen, or shape) and explains how each feature helps attract insects to the flower.",
        "meets": "Student names at least two features of the flower (such as color and smell, or yellow center and petals) that attract insects.",
        "approaching": "Student identifies one feature that might attract insects but provides limited explanation or mentions only obvious visual characteristics.",
        "beginning": "Student gives a vague response like 'insects like it' or 'it's pretty' with no specific features mentioned."
      }
    },
    {
      "questionText": "If all the insects disappeared from an area, what might happen to the flowers?",
      "bloomsLevel": "Evaluate",
      "dokLevel": 3,
      "rubric": {
        "exceeds": "Student explains that flowers would not be pollinated, could not make seeds, and would eventually disappear from the area, demonstrating clear understanding of how insects and flowers depend on each other.",
        "meets": "Student predicts that flowers would have problems making seeds or reproducing, showing understanding that insects are needed for flowers to continue growing.",
        "approaching": "Student recognizes that something bad would happen to flowers but provides incomplete reasoning or unclear connections between insects and flower survival.",
        "beginning": "Student makes a prediction that shows minimal understanding, such as 'the flowers would die' without explanation of why insects matter."
      }
    }
  ],
  "generatedAt": "2026-02-15T03:36:37.907Z",
  "cost": 0.004547
}