{
  "title": "Insect",
  "category": "life-science",
  "imageFile": "insect.jpg",
  "imagePath": "images/life-science/insect.jpg",
  "content": "# Engineering Design Challenge from Insect Photo\n\n### Visible Elements in Photo\n- A white daisy flower with a yellow center disk\n- A brown-and-black assassin bug (or similar predatory insect) positioned on a petal\n- Multiple delicate white petals arranged radially around the yellow disk\n- Green foliage visible in the background\n- Textured stone or concrete surface (blurred) in the upper left\n\n### Reasonable Inferences\n- **From the insect's position on the petal**: The bug is hunting or seeking food, suggesting insects need stable landing platforms that can support their weight.\n- **From the flower's petal arrangement**: The radial petal design funnels pollinators toward the yellow center, implying a structural principle that directs movement toward a goal.\n- **From visible green stems/foliage**: Plants in gardens require support systems to hold flowers upright against wind and the weight of visiting insects.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Flower Landing Pad**\n\nDesign a flower with petals that an insect can safely land on. Use paper petals and a paper cup center. Make sure the petals are wide enough and strong enough that a toy bug (or small block) can sit on one without tipping over. Can you make 6 or 8 petals?\n\n---\n\n**3-5: Design a Pollinator Landing Platform**\n\nDesign a flower structure (using only paper, straws, and tape) that:\n- Has at least 6 petals, each **at least 10 cm long**\n- Can support a 30-gram weight (small toy or washers) on any single petal **for 10 seconds** without bending more than 2 cm downward\n- Includes a central disk at least 5 cm in diameter\n- Remains upright when placed on a flat surface with no additional support\n\nTest your design by placing the weight on different petals. Which petal design (width, thickness, angle) holds the weight best? Adjust your design and test again.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This phase fits best.\n\n**Why**: The photo shows a real biological need (insects require stable landing surfaces on flowers), but no existing human-made solution. Students must first identify *why* flowers have the shape they do before designing their own. This mirrors how engineers observe nature and define what problem they're solving.\n\n---\n\n### Suggested Materials\n- White and yellow construction paper or card stock\n- Paper straws or rolled paper tubes (for stem support)\n- Tape and scissors\n- Small weights (washers, coins, or toy figures: ~30 grams)\n- Ruler (for measuring petal length and deflection)\n- Optional: markers or colored pencils for decoration\n\n---\n\n### Estimated Time\n- **K-2**: 30–40 minutes (design, build, and one round of testing)\n- **3-5**: 60–75 minutes (two 30–40 minute sessions: design + first test, then redesign + retest)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining engineering problems) by asking students to identify the real structural need flowers solve for pollinators, then design a solution with testable criteria, grounding abstract engineering in observable nature.",
  "inputTokens": 2327,
  "outputTokens": 754,
  "cost": 0.006097,
  "generatedAt": "2026-02-09T13:33:00.089Z"
}