{
  "title": "Insect",
  "category": "life-science",
  "gradeLevel": "fifth-grade",
  "questions": [
    {
      "questionText": "Why do you think this flower is bright white and yellow instead of green like the rest of the plant?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that bright colors attract insects for pollination and identifies how the specific white petals and yellow center work together as a visual signal to insects; may mention that green is for photosynthesis in leaves.",
        "meets": "Student correctly identifies that bright colors attract insects and explains that this helps with pollination or getting insects to visit the flower.",
        "approaching": "Student recognizes that the bright colors attract insects but provides incomplete reasoning about why this matters, or confuses the purpose of flower colors.",
        "beginning": "Student provides a vague answer such as 'flowers are pretty' or 'it's just how flowers look' with no connection to insect attraction or pollination."
      }
    },
    {
      "questionText": "If all the insects in an area disappeared, what might happen to the flowering plants, and how would that affect other animals that depend on those plants?",
      "bloomsLevel": "Analyze",
      "dokLevel": 3,
      "rubric": {
        "exceeds": "Student describes a chain of effects: insects disappear → flowers cannot be pollinated → fewer seeds and fruits form → flowering plants decline → animals that eat plants or seeds lose food sources; demonstrates understanding of food chains and ecosystem interdependence.",
        "meets": "Student explains that without insects, flowers would not be pollinated and produce fewer seeds, and that this would reduce food for animals that depend on plants.",
        "approaching": "Student identifies that insects disappearing would harm plants or mentions pollination or food chains, but the explanation lacks clear connections between causes and effects.",
        "beginning": "Student provides a minimal response such as 'plants would die' or 'animals would have no food' without explaining the connection to insects or pollination."
      }
    },
    {
      "questionText": "What do you think the insect is doing when it lands on the flower, and what is it getting from the flower?",
      "bloomsLevel": "Understand",
      "dokLevel": 1,
      "rubric": {
        "exceeds": "Student explains that the insect is collecting or eating pollen and nectar as food, and describes how the insect benefits from this resource; may note that pollen sticks to the insect's body for pollination.",
        "meets": "Student correctly identifies that the insect is feeding on pollen and/or nectar from the flower as a food source.",
        "approaching": "Student recognizes the insect is interacting with the flower for food but provides vague language like 'eating something' or 'getting stuff' without naming pollen or nectar.",
        "beginning": "Student provides an unclear or inaccurate answer such as 'it's sitting on the flower' or 'it's playing' with no mention of feeding or food."
      }
    },
    {
      "questionText": "How is the relationship between this insect and the flower different from a relationship where one animal eats another animal for food?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that both the insect and flower benefit (the insect gets food, the flower gets pollinated), making it a mutually beneficial relationship, unlike predator-prey where only one benefits; may use the term 'symbiosis' or 'mutualism.'",
        "meets": "Student identifies that the insect-flower relationship is beneficial to both (insect gets food, flower gets help with pollination), while a predator-prey relationship only benefits the predator.",
        "approaching": "Student recognizes that the relationships are different and mentions that the insect and flower both gain something, but the explanation is unclear or incomplete about how predator-prey differs.",
        "beginning": "Student provides a vague response such as 'they help each other' or 'it's different' without explaining how the insect-flower relationship differs from predator-prey relationships."
      }
    }
  ],
  "generatedAt": "2026-02-15T06:24:51.269Z",
  "cost": 0.00557
}