{
  "title": "Katydid Camouflage",
  "category": "life-science",
  "imageFile": "katydid_camouflage.jpg",
  "imagePath": "images/life-science/katydid_camouflage.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- A green katydid (or grasshopper-like insect) resting on green grass and plant stems\n- Thin, blade-shaped grass blades in various shades of green\n- Thicker plant stems with visible segmentation (appearing yellowish-green)\n- Dense vegetation creating a layered, cluttered natural environment\n- The insect's body color closely matching the surrounding plants\n\n### Reasonable Inferences\n- **From insect coloring & plant environment**: The katydid's green body blends into the grass and stems around it, suggesting that camouflage (color and shape matching) helps this creature avoid being spotted by predators in its natural habitat.\n- **From dense vegetation**: The creature relies on hiding among many overlapping plant structures; a simple solid background would not provide adequate concealment.\n- **From thin vs. thick stems**: Different plant sizes and shapes may offer varying levels of cover; the insect's flat, elongated body seems suited to pressing against narrow stems.\n\n---\n\n### Engineering Task\n\n**K-2: Hide the Bug**\nDesign a hiding place (nest or shelter) for a toy bug using grass, leaves, and sticks. Your bug should be hard to see when it's inside. Can you make it so a friend has to search to find your bug?\n\n**3-5: Camouflage Shelter Challenge**\nDesign and build a shelter for a small toy insect (or foam model) using natural materials (grass, leaves, small sticks, soil) that meets these criteria:\n- The shelter must be at least 10 cm wide\n- The toy insect must be completely hidden from view when placed inside\n- The shelter must stay intact for at least 2 minutes when gently nudged\n- It must use at least 3 different types of natural materials\n- Test it: Have a partner try to spot the bug in less than 10 seconds\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a *real problem in nature*—an animal that needs to hide from predators. By starting with \"Ask,\" students identify the problem (predators hunt by sight) and define what \"good camouflage\" actually means (hard to spot, blends in, stays hidden). This grounding in observation makes the design task feel purposeful rather than arbitrary. Students aren't just building; they're solving a problem they can see.\n\n---\n\n### Suggested Materials\n\n- Fresh grass clippings and whole grass tufts (harvested from outdoors)\n- Dried leaves or leaf litter\n- Small twigs and thin branches\n- Soil or potting soil\n- A small toy insect, foam figure, or painted pebble (to represent the \"bug\")\n- Optional: moss, bark pieces, or plant stems\n\n---\n\n### Estimated Time\n\n**K-2**: 30–40 minutes (including outdoor material collection, building, and 1–2 testing rounds)\n\n**3-5**: 45–60 minutes (including observation of real katydid/grasshopper images, material gathering, building, testing, and group feedback on why designs succeed or fail)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-2** (*Generate and compare multiple possible solutions based on how well they meet the criteria and constraints of a design problem*) by requiring students to test real camouflage principles and iterate on shelter designs based on measurable success criteria (visibility, durability, material diversity).",
  "inputTokens": 2333,
  "outputTokens": 793,
  "cost": 0.006298000000000001,
  "generatedAt": "2026-02-09T13:42:43.775Z"
}