{
  "title": "King Snake",
  "category": "life-science",
  "imageFile": "king_snake.jpg",
  "imagePath": "images/life-science/king_snake.jpg",
  "content": "# Engineering Design Challenge: King Snake Handling & Habitat\n\n### Visible Elements in Photo\n- A coral snake (red, black, and white/yellow banded pattern) coiled on a child's open hand\n- Child's bare hand (palm up, fingers relaxed)\n- Indoor background with neutral-colored walls and doorway\n- Snake's body curved and resting across the palm and fingers\n- Snake's head visible at the top of the coil\n\n### Reasonable Inferences\n- **From snake's position on hand**: The snake is small enough to be safely held and observed by a child, suggesting it is a juvenile or a non-venomous species (coral snake mimic). This implies handlers need containment structures that prevent escape while allowing observation.\n- **From relaxed hand posture**: The snake is calm and accustomed to handling, which means any design for a temporary viewing or handling enclosure must minimize stress (smooth surfaces, secure but not restrictive).\n- **From banded coloration**: The snake's pattern provides camouflage in natural environments with similar striped vegetation or rocky terrain, suggesting a habitat design should include visual cover.\n\n### Engineering Task\n\n**K-2 Version:**\nDesign a safe, cozy \"snake home\" using paper towel tubes, fabric scraps, and a small box. Your snake home needs:\n- A place for the snake to hide and feel safe\n- Openings that let you see the snake without it escaping\n- Soft materials so the snake doesn't get hurt\n\n**3-5 Version:**\nDesign a temporary observation enclosure for a small snake that meets these criteria:\n- Dimensions: 12\" × 8\" × 6\" (length × width × height)\n- Must include at least 2 shelter spaces made from natural or recycled materials (cork bark, paper tubes, fabric)\n- Must have transparent viewing panels on at least 2 sides so observers can see the snake without disturbing it\n- Must be escape-proof: test by placing the snake inside for 5 minutes with no exits\n- Must be easy to clean and disassemble in under 3 minutes\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a living creature in human hands with no permanent structure around it. The natural question is: *\"How can we safely house and observe this animal without stressing it or letting it escape?\"* This is a real-world need observation, making **Ask / Define Problem** the strongest entry point. Students must first understand what a snake needs (shelter, safety, visibility) before designing anything.\n\n### Suggested Materials\n- Paper towel tubes or toilet paper tubes\n- Cardboard boxes (small gift boxes or repurposed packaging)\n- Fabric scraps, felt, or soft cloth\n- Clear plastic wrap or plastic report covers (for viewing panels)\n- Cork bark pieces or moss (optional, for natural feel)\n- Duct tape or masking tape for assembly\n- Newspaper or paper for lining the base\n\n### Estimated Time\n- **K-2**: 45–60 minutes (one session with teacher guidance)\n- **3-5**: 60–90 minutes (planning sketch + building + testing, may extend to two 45-minute sessions)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (*defining and delimiting engineering problems*) and **ETS1.B** (*developing possible solutions*) by asking students to identify the needs of a living organism and design a functional structure that balances safety, usability, and the animal's welfare—a meaningful real-world constraint that goes beyond abstract building.",
  "inputTokens": 1804,
  "outputTokens": 804,
  "cost": 0.005824,
  "generatedAt": "2026-02-09T13:35:43.592Z"
}