{
  "title": "King Snake",
  "category": "life-science",
  "imageFile": "king_snake.jpg",
  "imagePath": "images/life-science/king_snake.jpg",
  "gradeLevel": "Fifth Grade",
  "gradeLevelKey": "fifth-grade",
  "content": "# Lesson Plan: Adaptations in Action - Understanding the King Snake\n\n### Core Science Concepts from Image Analysis\n\n- **External Structures and Adaptation:** The king snake's distinctive red, black, and white banding pattern is a visible external structure that serves as an adaptation; this coloration mimics the venomous coral snake, providing protection through deceptive appearance (Batesian mimicry).\n- **Organism Diversity and Survival:** Different snake species have evolved different characteristics to survive in their environments; the king snake's specific coloration allows it to exploit this resemblance to increase its survival chances.\n- **Matter and Energy Movement in Ecosystems:** The king snake, as a predator in food chains, plays a role in the movement of matter and energy through ecosystems—it consumes other organisms and becomes food for larger predators, cycling nutrients and energy through the environment.\n- **Behavioral and Structural Traits:** The snake's body structure (elongated form, scales) and its hunting behaviors are adaptations that allow it to capture, consume, and digest prey efficiently, demonstrating how organisms' traits support their ecological roles.\n\n---\n\n### Lesson Title\n\n**The Colorful Protector: How King Snakes Survive Through Adaptation**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** Fifth Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (or 90 minutes over one extended block)\n- **NGSS Standards:** \n  - 5-LS2-1: Develop a model to describe the movement of matter among plants, animals, decomposers, and the environment.\n  - (Note: This lesson emphasizes the organism's role in energy/matter cycles; 5-LS1-1 could be incorporated in a companion plant-focused lesson)\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n1. Identify and describe how the king snake's external features (banding pattern, body structure) function as adaptations that help it survive in its environment.\n2. Explain how the king snake fits into an ecosystem food chain and participates in the movement of matter and energy through the environment.\n3. Create a visual model or diagram showing how a predator like the king snake moves energy and matter through multiple food chains in an ecosystem.\n4. Support a claim with evidence about how an organism's physical traits directly relate to its survival and ecological role.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about animal adaptations using the photograph of the king snake.\n\n**Materials:**\n- Printed or digital photograph of the king snake on a child's hand\n- Chart paper and markers\n- Optional: brief video clip (30 seconds) of a king snake in its natural habitat\n\n**Activity:**\n\n1. **Display the photograph** on a screen or projector. Allow students 30 seconds of silent observation before any discussion.\n\n2. **Ask these specific discussion questions:**\n   - \"What do you notice about this snake's colors and patterns? Why might a snake have red, black, and white stripes in this specific pattern?\"\n   - \"If you were a large bird hunting for food, would this snake look dangerous to you? Why or why not?\"\n   - \"Do you think this snake lives alone, or is it part of a larger group of animals in a habitat? What other animals might interact with it?\"\n   - \"This snake is being held by a human—but in nature, what do you think this snake actually eats, and what might eat this snake?\"\n\n3. **Prediction Prompt:** \"Before we learn more, make a prediction: Do you think this snake's bright colors help it stay safe or put it in danger? Write or draw your thinking on a sticky note.\"\n\n4. **Record student responses** on chart paper. Do not correct misconceptions yet; these will be addressed in Explain phase.\n\n**Transition:** \"Today we're going to investigate how this king snake's appearance and role in nature help it survive. Let's explore what we can learn from this image and from designing our own food chain model.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate predator-prey relationships and the movement of energy through food chains by creating an ecosystem model inspired by the king snake.\n\n**Materials:**\n- Index cards or cardstock (1 per student)\n- Colored pencils, markers, or crayons\n- String or yarn (12-18 inches per student pair)\n- Tape\n- Printed cards with labels: \"Sun,\" \"Plants,\" \"Insects,\" \"Mice,\" \"King Snake,\" \"Hawk,\" \"Decomposer\"\n- Large poster board or bulletin board space\n- Optional: images of ecosystem organisms (to reference)\n\n**Activity:**\n\n1. **Divide students into pairs or small groups** (groups of 3-4 work well).\n\n2. **Introduce the scenario:** \"The king snake lives in an ecosystem with other plants and animals. We're going to create a food chain model that shows how energy and matter move through this ecosystem, with the king snake as a key player.\"\n\n3. **Provide student directions:**\n   - \"Each group will receive a set of organism cards (Sun, Plants, Insects, Mice, King Snake, Hawk, Decomposer). You also get string and tape.\"\n   - \"Arrange these organisms in an order that shows what eats what. The Sun provides energy to start the chain.\"\n   - \"Use string to connect each organism to the one that depends on it for food or energy. One end of the string should connect to what is eaten, and the other end to what eats it.\"\n   - \"Draw arrows on your string or label it with words like 'eaten by' or 'provides energy to.'\"\n   - \"For each organism, write one fact about what it eats or what eats it.\"\n\n4. **Connection to photograph:** \"Remember the king snake in the picture? In our ecosystem model, where does it belong? What does it eat, and what might eat it? How does it help move energy through the system?\"\n\n5. **Recording/Documentation:**\n   - Students photograph or sketch their food chain model.\n   - Each group completes a short worksheet: \"In our food chain, the king snake is a **[predator/prey]** because ___________. The energy in the king snake's body came from ___________.\"\n\n**Teacher Role:**\n- Circulate and ask probing questions: \"What did your organism eat? Where did that organism get its energy? Can you trace the energy all the way back to the Sun?\"\n- Do not provide the \"correct\" answer; guide students to discover relationships.\n- Prompt students who are stuck: \"What do snakes eat in real life? Once you know that, what must the snake eat to get energy?\"\n- Note: Do not correct misconceptions about the mimicry defense yet; this will be explained in the Explain phase.\n\n**Expected Student Outcomes:**\n- Each group produces a working food chain or simple ecosystem model showing the king snake's position.\n- Students can verbally explain at least one food chain connection (e.g., \"Mice eat plants, and the king snake eats mice\").\n- Students recognize that energy flows from organisms they eat to their bodies.\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and ecological concepts, and explain the king snake's adaptive coloration and role in matter/energy movement.\n\n**Materials:**\n- Chart paper with vocabulary terms pre-written\n- Photographs or illustrations: coral snake, king snake, and other local predators\n- Food chain diagram template on chart paper or digital display\n- Optional: National Geographic or PBS Kids video clip (2-3 minutes) on snake adaptations\n\n**Activity:**\n\n1. **Group Share-Out (5 minutes):**\n   - Ask 2-3 groups to share their food chains with the class.\n   - Highlight commonalities: All chains begin with the Sun; the king snake appears as a middle predator in most models.\n   - Address any misconceptions gently: \"Some groups thought the king snake eats plants—let's clarify that snakes are carnivores.\"\n\n2. **Introduce Key Vocabulary (8-10 minutes):**\n   - Present each term on chart paper with student-friendly definitions:\n\n   **Vocabulary:**\n   - **Predator:** An animal that hunts and eats other animals for food. *Example: A king snake is a predator because it hunts mice and lizards.*\n   - **Prey:** An animal that is hunted and eaten by another animal. *Example: A mouse is prey for a king snake.*\n   - **Adaptation:** A trait or characteristic that helps an organism survive and thrive in its environment. *Example: A king snake's striped coloring is an adaptation.*\n   - **Batesian Mimicry:** When a harmless animal looks like a dangerous animal to protect itself. *Example: The king snake's colors mimic the venomous coral snake, making predators avoid it.*\n   - **Energy Flow:** The movement of energy from the Sun through plants and animals in an ecosystem. *Example: Energy flows from plants to mice to king snakes.*\n   - **Food Chain:** A sequence showing which organisms eat which, starting with the Sun's energy. *Example: Sun → Plants → Insects → King Snake → Hawk.*\n\n3. **Connect Back to the Photograph (5 minutes):**\n   - Display the king snake photo again.\n   - \"Look at the bright red, black, and white stripes. In nature, there's another snake—the coral snake—that is venomous and dangerous. The king snake looks very similar! This is called Batesian mimicry. Predators that might eat the king snake see these colors and think, 'That's dangerous—I won't eat it!' But the king snake isn't venomous; it's just pretending by looking similar. This adaptation keeps the king snake safe.\"\n   - \"Even though the king snake has this colorful pattern to stay safe, it also plays an important role in its ecosystem. It eats other animals and becomes food for larger predators. Through eating and being eaten, the king snake moves energy and matter through the ecosystem.\"\n\n4. **Check for Understanding:**\n   - Ask: \"Why is the king snake's coloring an adaptation? What problem does it solve?\"\n   - Ask: \"If the king snake eats five mice, and a hawk eats the king snake, how has matter moved through the ecosystem?\"\n   - Provide sentence stems: \"The king snake survives because _____. This is important to the ecosystem because _____.\"\n\n**Expected Student Outcomes:**\n- Students can define predator, prey, and adaptation in their own words.\n- Students understand that the king snake's coloration mimics a venomous snake, providing protection.\n- Students can trace energy movement through a food chain and identify the king snake's role in cycling matter.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply concepts to a new scenario and deepen understanding of how organisms fit into ecosystems.\n\n**Materials:**\n- Scenario cards (printed or projected)\n- Large paper or digital format for creating extended food webs\n- Colored pencils or digital drawing tools\n- Optional: pictures of 6-8 organisms from a local or unfamiliar ecosystem\n\n**Activity:**\n\n1. **Present a new scenario:** \"Now that you understand how the king snake survives and moves energy through an ecosystem, let's imagine a bigger picture. A king snake lives in a habitat with not just mice, but also insects, lizards, frogs, and birds. Create a food web—not just a chain—that shows all these connections.\"\n\n2. **Provide directions:**\n   - \"A food web is like multiple food chains all connected together. Draw or arrange pictures of at least 6 organisms from this ecosystem.\"\n   - \"Use arrows to show who eats whom. An arrow points FROM the organism being eaten TO the organism doing the eating.\"\n   - \"The king snake should connect to at least 3 different food sources (things it eats). The king snake should also be connected to at least one predator that eats it.\"\n   - \"Label each arrow with the type of matter or energy being transferred. You can write 'energy' or 'nutrients' or be specific like 'proteins' or 'stored energy.'\"\n\n3. **Real-World Connection:**\n   - \"In a real ecosystem, organisms are part of many overlapping food chains. Just like the king snake eats mice AND lizards AND insects, hawks eat king snakes, but they also eat other prey. This keeps the ecosystem balanced.\"\n   - \"When we remove one organism—say, if king snakes disappeared—what would happen? Mice might increase, plants might decrease, hawks might have less food. The whole web would change.\"\n\n4. **Application to Local Context (optional):**\n   - \"Are there snakes or similar predators in our local area? How might they fit into OUR ecosystem? What would their food web look like?\"\n\n**Teacher Role:**\n- Provide examples of food webs; do not create the web for students.\n- Ask guiding questions: \"What happens if this organism has no food source shown? Can you add a connection?\"\n- Challenge advanced students: \"What would happen if the number of mice decreased? Trace the effect through your food web.\"\n\n**Expected Student Outcomes:**\n- Students create a food web with at least 6 organisms and 8+ feeding relationships.\n- Students can explain how the king snake's role connects multiple food chains.\n- Students articulate the concept of matter/energy movement through multiple pathways.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of adaptations, predator-prey roles, and energy/matter movement through ecosystems.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- Observe student discussions during Explore and Elaborate phases; note who can identify predator-prey relationships and energy flow.\n- Review student worksheets from Explore phase for accurate food chain understanding.\n- Listen for correct use of vocabulary (predator, prey, adaptation, energy flow) during group discussions.\n\n**Exit Ticket (Summative Assessment):**\nProvide this written or oral exit ticket at the end of the lesson:\n\n1. **Look at this picture of a king snake again.** Describe one way this snake's appearance helps it survive. (Accept: \"Its colors scare predators,\" \"It looks like a venomous snake,\" \"It has Batesian mimicry,\" etc.)\n\n2. **In a food chain, the king snake eats mice and a hawk eats the king snake.** Draw or write what happens to the energy and matter in this chain. Where does the energy start, and where does it end up?\n\n3. **True or False (with explanation):** The king snake is not important to its ecosystem because it's not a plant. *Explain your answer.* (Accept: \"False—it moves energy through the food web, keeps prey populations in check, and provides food for larger predators.\")\n\n4. **Challenge Question (for advanced learners):** If someone removed all the king snakes from a habitat, predict what would happen to the mouse population and the hawk population. Explain your reasoning using the term \"food chain\" or \"energy flow.\"\n\n**Success Criteria for Understanding:**\n- ✓ Student correctly identifies at least one adaptation of the king snake.\n- ✓ Student can trace energy movement from the Sun through at least two organisms.\n- ✓ Student accurately places the king snake as a predator and identifies at least one organism it eats and one that eats it.\n- ✓ Student uses vocabulary (predator, prey, energy, matter, food chain) accurately in at least one explanation.\n- ✓ Student recognizes the king snake's ecological role in moving matter and energy through the ecosystem.\n\n**Expected Student Outcomes:**\n- Most students (80%+) will correctly identify the king snake as a predator and place it in a food chain.\n- Most students (70%+) will use the term \"energy\" or \"matter\" accurately when describing ecosystem connections.\n- Students can create a working food web with logical feeding relationships.\n- Advanced students will predict ecosystem consequences of removing a species.\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n\n1. **Provide a pre-made, incomplete food chain diagram** with some organisms already positioned. Students complete the chain by adding the king snake and labeling relationships. Simplify to 4 organisms instead of 6+.\n\n2. **Use manipulatives and visual anchors:** Give students actual images or models of organisms that they can arrange and rearrange physically before drawing. Provide a color-coded legend (e.g., \"Green = plant, Red = animal that eats meat, Blue = predator\").\n\n3. **Offer sentence stems and word banks** during Explain and Elaborate:\n   - \"The king snake is a __________ because it eats __________.\"\n   - \"Energy moves from the __________ to the __________ to the king snake.\"\n   - \"Word bank: predator, prey, plants, mice, insects, energy, food chain, adaptation.\"\n\n4. **Pair struggling students with a peer mentor** during Explore and Elaborate activities for peer modeling and support.\n\n---\n\n**Challenge (for advanced learners):**\n\n1. **Introduce the concept of secondary and tertiary consumers:** \"The king snake eats herbivores (primary consumers), which makes it a secondary consumer. If a hawk eats the king snake, what does that make the hawk? Create a food chain that labels each organism by its consumer level.\"\n\n2. **Explore food web complexity and energy loss:** \"In a real ecosystem, only about 10% of energy is transferred from one organism to the next. If a plant has 1,000 units of energy, how much energy reaches the king snake? How much would a hawk get? Create a diagram showing this energy loss at each level.\"\n\n3. **Investigate real-world mimicry scenarios:** \"Research other animals that use Batesian mimicry (like viceroy butterflies and monarch butterflies, or harmless hognose snakes). Create a comparison chart showing how different species use mimicry as an adaptation. What happens if predators 'learn' the mimicked animal isn't actually dangerous?\"\n\n4. **Design a conservation scenario:** \"Suppose a species of mouse that the king snake hunts is becoming endangered. Design a plan to protect both the mice and the king snakes. What would you need to consider about the ecosystem?\"\n\n---\n\n### Extension Activities\n\n1. **Local Ecosystem Investigation:** Take students on a nature walk or outdoor exploration (or use digital images of a local habitat) to identify a real food chain or food web in your region. Students research and create a poster showing how local organisms—including local predators similar to the king snake—interact and move energy through the ecosystem. This extends the lesson to their immediate environment.\n\n2. **Adaptation Adaptation Game:** Students create their own hypothetical animal with specific adaptations (not just coloration) suited to survive in a particular habitat. They must explain:\n   - What habitat their animal lives in\n   - What its predators are and what it eats\n   - What physical or behavioral adaptations it has\n   - How those adaptations help it survive and move energy through its food chain\n   \n   Students present their animals and defend their adaptations' usefulness.\n\n3. **Food Web Simulation Activity:** Assign each student or small group an organism role (plant, herbivore, carnivore, decomposer). Using string or yarn, students physically move around the room to show feeding connections, then remove one organism and observe how the \"web\" falls apart. This kinesthetic activity reinforces energy flow and ecosystem interdependence. Follow up with a discussion: \"What happened when we removed the king snake from our food web?\"\n\n4. **Historical Ecosystem Change Project:** Research and present how the introduction or removal of a predator species (like wolves in Yellowstone, or the removal of snakes from an island) changed an entire ecosystem. Create a before-and-after food web and explain cause and effect.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 158,
  "outputTokens": 4566,
  "cost": 0.023463400000000002,
  "generatedAt": "2026-02-13T03:05:20.861Z"
}