{
  "title": "King Snake",
  "category": "life-science",
  "imageFile": "king_snake.jpg",
  "imagePath": "images/life-science/king_snake.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "### Core Science Concepts from Image Analysis\n\n- **Animal External Parts and Their Functions:** The king snake's distinctive banded pattern (red, black, and yellow/white stripes) is an external feature that serves a protective function—mimicking the appearance of venomous coral snakes to warn predators, even though king snakes are non-venomous.\n- **Adaptation and Survival:** The snake's body structure (long, cylindrical shape) and coloration are adaptations that help it survive in its environment by moving through grass and hiding, and by deterring predators through warning coloration.\n- **Observation of Animal Characteristics:** First graders can observe the snake's distinctive markings, smooth scales, and body shape as observable external parts that are different from humans and other animals they know.\n- **Behavioral Observation:** The snake's coiled position on the hand demonstrates how animals interact with their environment and how they can be handled safely—connecting to patterns of animal behavior.\n\n---\n\n### Lesson Title\n\n**The Striped Snake: A Master of Disguise**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 40-minute sessions (or four 20-minute sessions spread across the week)\n- **NGSS Standards:** 1-LS1-1, 1-LS3-1\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Identify and describe the external parts of a snake that help it survive (color pattern, body shape, scales)\n- Explain how the snake's striped pattern helps keep it safe from predators\n- Compare the snake's body parts to their own body parts and describe how they are different\n- Use materials to design their own warning pattern that could help an animal stay safe\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (12-15 minutes)\n\n**Objective:** Capture student curiosity about animal adaptations using the photograph of the king snake and activate prior knowledge about how animals look different.\n\n**Materials:**\n- Printed photograph of the king snake on a hand (or displayed on interactive board)\n- Chart paper and markers\n- Optional: A stuffed snake toy or snake picture book\n\n**Activity:**\n\n1. **Display the Photograph:** Show the image of the king snake on the child's hand to the whole group. Keep the photograph visible throughout the discussion.\n\n2. **Spark Curiosity with Questions:**\n   - \"What do you notice about this snake? What colors do you see?\" (Guide students to identify the red, black, and white/yellow stripes)\n   - \"Why do you think this snake has stripes instead of being just one color?\"\n   - \"Have you ever seen an animal with stripes? What animal was it?\" (Accept responses: tigers, zebras, etc.)\n   - \"Do you think the stripes help the snake in some way? How?\"\n\n3. **Make a Prediction:** Ask students to turn to a partner and share: \"If you were a bird or other animal that eats snakes, would you want to eat this striped snake? Why or why not?\" Allow 2-3 pairs to share their thinking aloud.\n\n4. **Wonder Prompt:** Write on chart paper: \"I wonder why some animals have bright stripes...\" Ask students to think about this question as they explore in the next activity.\n\n**Transition:** \"Today we're going to become snake scientists! We'll look very carefully at this snake and learn how its stripes help keep it safe. Then we'll design our own striped pattern to help keep an animal safe.\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate animal external parts and adaptations through hands-on observation and a design activity.\n\n**Materials:**\n- Index cards or paper (one per student)\n- Colored markers, crayons, or colored pencils\n- Tape or glue sticks\n- Scissors\n- Construction paper in red, black, and white/yellow\n- Large printed images of snakes (optional, for reference)\n- The original photograph of the king snake (displayed for reference)\n\n**Activity:**\n\n1. **Guided Observation (5 minutes):**\n   - Display the snake photograph again. Ask students to trace their finger in the air following the snake's pattern.\n   - Point out: \"The snake's stripes go all the way around its long, thin body. What colors do you see in order?\" (Red, black, yellow/white, red, black, yellow/white...)\n   - Show students the scale of the snake by comparing it to the child's hand. \"The snake is long and thin. That helps it move through grass and hide.\"\n\n2. **Individual Design Activity (15-20 minutes):**\n   - Explain: \"Now YOU are going to design a striped pattern that helps keep an animal safe. We call this a 'warning pattern.' Bright stripes tell other animals, 'Stay away! I might be dangerous!'\"\n   - Give each student a large paper or card and colored materials.\n   - **Student Directions:**\n     - Choose an animal you want to help (examples: a frog, a caterpillar, a lizard, a fish).\n     - Think about what stripes or patterns would warn predators to stay away.\n     - Create your warning pattern on your paper. You can draw stripes, circles, or other shapes.\n     - Use at least two colors (like the king snake uses red and black).\n     - When you're done, write or tell the teacher: \"My animal is a _____ and my warning pattern is _____.\"\n\n3. **What Students Should Record:**\n   - Their designed warning pattern drawing\n   - Dictation or writing of their animal choice and how their pattern helps it\n\n**Teacher Role:**\n- Circulate and ask prompting questions: \"Why did you choose those colors?\" \"What animal is this pattern for?\" \"How will this pattern keep your animal safe?\"\n- Guide students to think about *why* bright colors warn predators without giving the answer away\n- Encourage students to refer back to the snake photograph for inspiration\n- For students who finish early, ask them to imagine: \"What if your animal's stripes were dull brown instead of bright colors? Would it still scare predators away?\"\n\n**Expected Student Outcomes:**\n- Students create a colorful striped or patterned design intended to warn predators\n- Students can explain (verbally or with dictation) what animal their pattern protects and why the pattern helps\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and scientific concepts after hands-on exploration.\n\n**Materials:**\n- Chart paper and markers\n- The original king snake photograph\n- Student designs from Explore phase\n- Picture cards or images of other animals with warning colors (optional: poison dart frog, ladybug, bees with yellow/black stripes)\n\n**Activity:**\n\n1. **Group Share-Out (8-10 minutes):**\n   - Invite 4-5 students to share their designed warning pattern.\n   - After each student shares, ask the group: \"Do you think predators would stay away from this pattern? Why?\"\n   - Point out similarities between student designs and the king snake's pattern.\n\n2. **Teacher-Led Explanation (7-10 minutes):**\n   - Show the king snake photograph again.\n   - Explain: \"This snake is called a **king snake**. It has bright red, black, and white stripes. These bright colors are a **warning pattern**. They tell other animals, 'Don't eat me! I might be dangerous!' Even though this king snake is actually not poisonous, it *looks* like a poisonous snake called a coral snake. That trick keeps it safe!\"\n   - Point to the snake's external parts: \"Look at its **scales** (the tiny bumps that cover its body), its **pattern** (the stripes), its **shape** (long and thin). All of these are **external parts**—the parts we can see on the outside.\"\n   - Compare to humans: \"We have external parts too. We have skin, hair, eyes, ears, a nose. But a snake is very different from us. Snakes don't have arms or legs. They have a long body and scales instead of skin like ours.\"\n\n3. **Check for Understanding:**\n   - Ask: \"What color stripes does the king snake have?\" (Red, black, and yellow/white)\n   - Ask: \"Why do you think the king snake has bright stripes?\" (To warn other animals to stay away)\n   - Ask: \"How is the snake's body different from your body?\" (Accept: It's long and thin, it has no arms or legs, it has scales, etc.)\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **External Parts** | The parts of an animal you can see on the outside, like fur, feathers, scales, or skin |\n| **Pattern** | A design that repeats, like the red, black, and white stripes on the king snake |\n| **Adaptation** | A body part or color that helps an animal survive and stay safe |\n| **Warning Pattern** (or Warning Colors) | Bright colors or stripes that tell other animals \"Stay away!\" |\n| **Scales** | The tiny, flat pieces that cover a snake's body to protect it |\n\n**Expected Student Outcomes:**\n- Students understand that the king snake's stripes are an external feature that helps it survive\n- Students can name the colors of the king snake's pattern\n- Students can describe how the snake's body is different from a human body\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen their understanding by exploring how other animals use external parts to survive.\n\n**Materials:**\n- Images or picture books of animals with warning colors or adaptations (poison dart frogs, ladybugs, zebras, tigers, caterpillars)\n- Chart paper titled \"How Do Animals Use Their External Parts?\"\n- Colored pencils or crayons\n- Paper for drawing\n\n**Activity:**\n\n1. **Explore Other Animals' Adaptations (10-12 minutes):**\n   - Show images of 2-3 other animals that use color or pattern as an adaptation:\n     - **Poison dart frog:** Bright colors warn \"I'm poisonous!\"\n     - **Ladybug:** Red with black spots warns \"I taste bad!\"\n     - **Zebra:** Stripes help it hide in grass or confuse predators\n   - For each animal, ask: \"What color or pattern does this animal have? How does it help the animal stay safe or survive?\"\n\n2. **Create a Comparison Chart (5-8 minutes):**\n   - On chart paper, create a simple 3-column chart:\n     - **Animal** | **External Part or Pattern** | **How It Helps**\n   - Fill in one row with the king snake as an example\n   - Add rows for the other animals you discussed\n   - Read the chart aloud together to reinforce learning\n\n3. **Optional Extension Drawing:**\n   - If time allows, students draw their own animal and label one external part that helps it survive\n   - Students dictate or write a simple sentence: \"[Animal] has [external part] that helps it [survive/stay safe/find food]\"\n\n**Teacher Role:**\n- Facilitate discussion about how different animals use their external parts in different ways\n- Ask follow-up questions: \"Is this animal warning predators like the king snake? Or is it hiding? Or using its body part a different way?\"\n- Guide students to make connections between the king snake and other animals without expecting exact answers\n\n**Expected Student Outcomes:**\n- Students recognize that multiple animals use external parts (colors, patterns, body shapes) for survival\n- Students can make simple comparisons: \"The king snake and the poison dart frog both have bright colors to warn other animals\"\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of animal external parts, adaptations, and how they function to help animals survive.\n\n**Activity:**\n\n**Formative Assessment (Throughout Lesson):**\n- **Observation Notes:** As students design their warning patterns, listen to their explanations. Do they understand that bright colors warn predators?\n- **Discussion Responses:** During Engage and Explain phases, listen to students' answers to guiding questions. Can they identify the snake's colors and explain why they matter?\n- **Comparison Answers:** During Elaborate, can students name an external part and explain how it helps an animal?\n\n**Exit Ticket or Summative Assessment (End of Lesson or next day):**\n\nChoose one or more of these assessment methods based on your students' literacy levels:\n\n**Option 1: Verbal Exit Interview (1:1 or small group)**\n- Show the king snake photograph again and ask:\n  1. \"What colors do you see on this snake?\"\n  2. \"Why do you think this snake has these bright colors?\"\n  3. \"Tell me one way this snake is different from your body.\"\n  4. \"Draw or show me what an external part is.\"\n\n**Option 2: Picture-Sorting Activity**\n- Show students 4-5 pictures of different animals\n- Ask students to point to or circle \"the animal that has a warning pattern like the king snake\"\n- Ask: \"Why did you choose that one?\"\n\n**Option 3: Draw and Label**\n- Provide students with a large outline of a snake\n- Ask students to: Draw and color the stripes on the snake to make a warning pattern, and dictate/write: \"This pattern helps the snake because _____\"\n\n**Success Criteria for Understanding:**\n\n✓ **Developing:** Student can identify at least two colors on the king snake and name one external part (scales, stripes, long body)\n\n✓ **Proficient:** Student can identify the colors on the king snake, explain that the stripes warn other animals to stay away, and describe one way the snake's body is different from a human body\n\n✓ **Advanced:** Student can identify the snake's pattern and colors, explain the function of the warning pattern, describe multiple external parts, and make a connection to another animal with a warning pattern or adaptation\n\n**Expected Student Outcomes:**\n- Most first graders will be able to identify the snake's colors and pattern\n- Many will understand that the pattern is a warning\n- Some will make deeper connections about how external parts help animals survive\n\n---\n\n### Differentiation\n\n**Support (For Struggling Learners):**\n\n1. **Reduce Language Demand:** Use picture cards and gestures to support understanding. Instead of asking complex questions, ask yes/no questions: \"Does the snake have stripes? Are the stripes bright colors? Do the stripes help the snake?\"\n\n2. **Provide a Patterning Template:** For students who struggle with the design activity, provide a pre-printed snake outline with blank stripes and have them simply color in the pattern rather than create from scratch. They can choose from 2-3 color options.\n\n3. **Pair with a Peer or Aide:** During exploration and explanation, pair the student with a strong language model or paraprofessional who can narrate what they're observing: \"Look, we see red. Now we see black. The snake is long...\"\n\n4. **Use Concrete Comparisons:** Hold up a real pencil or marker next to the photograph: \"The snake is long like this marker. It has no arms or legs like your body does. See how different?\"\n\n**Challenge (For Advanced Learners):**\n\n1. **Deepen the Mimicry Concept:** Explain the king snake/coral snake relationship in more detail. Show pictures of both snakes and ask: \"What's the same? What's different? Why does looking similar help the king snake?\" Have students research or discuss: \"What other animals look like dangerous animals but aren't?\"\n\n2. **Predict Other Adaptations:** Ask: \"If the king snake lives in grass, what color might be even better than red and black? Why? What about a king snake that lives on rocks?\" Have students redesign a warning pattern for a different habitat.\n\n3. **Create a Life Cycle or Family Connection:** Introduce the concept that baby king snakes look similar to their parents (1-LS3-1). Ask: \"Do you think baby king snakes are born with these stripes? Why? How does that help them survive?\" Have them draw a baby king snake and a parent king snake showing similarities.\n\n4. **Write a Simple Explanation:** Have advanced students write (or dictate for you to scribe) a short sentence or caption: \"The king snake has red, black, and white stripes. The stripes keep it safe because...\" This addresses writing and deeper conceptual understanding.\n\n---\n\n### Extension Activities\n\n1. **Snake Safety & Handling Information Sheet:** Create a take-home paper with photos of different snake types, emphasizing that all snakes (venomous or not) should be observed from a distance and that king snakes are often safe to observe. Encourage families to research local snakes and share what they learn.\n\n2. **Create a Classroom \"Warning Pattern Gallery\":** Display all student-designed warning patterns in a designated area. Create simple labels for each: \"This warning pattern protects a [animal]. It has [colors] to scare away predators.\" Students can do a gallery walk and \"vote\" on the scariest pattern using stickers or tallies.\n\n3. **Camouflage vs. Warning Colors Exploration:** Introduce the concept of camouflage as an opposite adaptation. Provide printed images of a green snake on leaves, a brown snake on dirt, and ask: \"How is this snake different from the king snake? This snake is hiding, not warning. Where would you put this snake so predators can't see it?\" Have students create a camouflaged animal pattern using colors that blend in.\n\n4. **Snake Movement Investigation:** Collect large fabric tubes or pool noodles. Have students practice moving like a snake (without arms or legs) on a mat. Discuss: \"A snake's long body helps it move this way. What body parts help YOU move?\" This connects external parts to function.\n\n5. **Read-Aloud Connection:** Read a simple snake-themed picture book such as *The Hissing Cockroach* or *Tale of the Firefly* (if snake-focused), or *Who Has Spots?* by Christiane Gunzi. Have students identify external parts and adaptations after reading.\n\n---",
  "inputTokens": 205,
  "outputTokens": 4190,
  "cost": 0.0216304,
  "generatedAt": "2026-02-13T03:02:09.708Z"
}