{
  "title": "King Snake",
  "category": "life-science",
  "imageFile": "king_snake.jpg",
  "imagePath": "images/life-science/king_snake.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: Snakes and What They Need to Survive\n\n### Core Science Concepts from Image Analysis\n- **Animal body structures:** Snakes have scales, elongated bodies, and eyes that help them survive and move through their environment.\n- **Patterns in animal needs:** Animals need food, shelter, and safe spaces to live and grow, just like humans do.\n- **Observation skills:** Students can observe real or pictured animals to learn about their characteristics and how these help them survive.\n- **Diversity in nature:** Different animals look different and live in different places, but all animals need similar basic things to survive.\n\n### Lesson Title\nSnakes and Their Special Needs\n\n### Lesson Overview\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total)\n- **NGSS Standards:** K-LS1-1\n\n### Learning Objectives\nStudents will be able to...\n- Identify what animals (like snakes) need to survive (food, water, shelter, safety).\n- Describe patterns between what snakes need and what humans need.\n- Use observations from pictures and objects to explain how an animal's body helps it survive.\n- Sort and match animal needs into categories (food, home, water, safety).\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n- **Objective:** Capture student interest and activate prior knowledge about animals and their needs using the photograph of the snake.\n\n- **Materials:** \n  - Printed copy or projected image of the king snake photograph (large enough for all students to see)\n  - Chart paper and markers\n  - Picture cards of various animals (optional)\n\n- **Activity:** \n  1. Display the photograph of the snake resting on a person's hand without any introduction. Let students look silently for 15-20 seconds.\n  2. Ask students to turn to a partner and whisper one word that describes what they see.\n  3. Gather responses and write them on chart paper as students share (e.g., \"colorful,\" \"long,\" \"pretty,\" \"smooth\").\n  4. Ask these discussion questions, pausing for 3-5 student responses each:\n     - \"What do you notice about this animal? What does it look like?\"\n     - \"Have you ever seen a snake? Where?\"\n     - \"What do you think this snake needs to be healthy and safe? Does it need food? Water? A home?\"\n     - \"How is this snake the same as you? How is it different?\"\n  5. Prediction prompt: \"I wonder... what does this snake need every day to stay alive and healthy, just like you need food and water every day?\"\n\n- **Transition:** Today, we're going to learn all about what snakes and other animals need to survive, and we'll discover that animals need many of the same things we do!\n\n#### 2. EXPLORE (20-25 minutes)\n- **Objective:** Students investigate and discover the needs of animals through hands-on sorting and observation activities.\n\n- **Materials:**\n  - Picture cards of animals (at least 6-8 different animals: dog, cat, bird, fish, lion, elephant, bear, and the snake)\n  - Picture cards of animal needs (food, water, shelter/home, safe place, air)\n  - Glue stick or tape\n  - Large sheet of paper or poster board for each small group (or use a table)\n  - Real or plastic models of animal homes (optional: pictures of nest, burrow, cave, dog house, fish tank, etc.)\n\n- **Activity:**\n  1. Divide students into small groups of 3-4.\n  2. Give each group a set of animal picture cards and a set of animal need cards.\n  3. Provide this student direction: \"Look at your animal pictures. For each animal, decide what it needs to survive. Move the need cards near the animal picture that needs them. You can put more than one need with each animal. It's okay if needs go with more than one animal!\"\n  4. While students work, circulate and ask guiding questions (see Teacher Role below).\n  5. After 10-12 minutes, have groups post their sorting work or hold up their arrangements.\n  6. Students should record or draw: Have students draw one animal and label one thing it needs to survive (or scribe for them).\n\n- **Teacher Role:** \n  - Observe without immediately correcting.\n  - Ask questions like: \"Why do you think this snake needs water?\" or \"What would happen if this animal didn't have a home?\"\n  - Guide thinking: \"Can you find another animal that needs the same thing?\" or \"Do you think a snake eats the same food as a dog?\"\n  - Encourage discussion between group members.\n\n- **Expected Student Outcomes:** \n  - Students will match multiple animal needs to animals, discovering that most animals need food, water, shelter, and safety.\n  - Students will notice patterns (e.g., \"The bird and the snake both need food, but different kinds\").\n  - Students will begin to articulate why these things matter for survival.\n\n#### 3. EXPLAIN (15-20 minutes)\n- **Objective:** Introduce formal vocabulary and concepts after exploration; connect learning back to the photograph.\n\n- **Materials:**\n  - Chart paper with the four main animal needs written at the top\n  - Photograph of the snake (enlarged or projected)\n  - Real or plastic model of a snake (optional, for tactile learners)\n  - Picture book excerpt about snakes (e.g., *Snakes* by Gail Gibbons, pages about diet/habitat—optional)\n\n- **Activity:**\n  1. Gather students in a circle or on the carpet with the snake photograph visible.\n  2. Say: \"Let's talk about what we discovered. Every animal needs special things to be healthy and survive.\"\n  3. Point to the chart and introduce the four main animal needs with simple, concrete language:\n     - **Food:** \"Animals eat food to give their bodies energy to move and grow. Snakes eat small animals like mice.\"\n     - **Water:** \"Animals drink water to stay healthy. Snakes get water from the places they live and from their food.\"\n     - **Shelter/Home:** \"Animals need a safe place to live and rest. Snakes live in places like trees, under rocks, or in the ground.\"\n     - **Safety:** \"Animals need to stay safe from things that might hurt them. Snakes hide to stay safe.\"\n  4. Point back to the snake photograph: \"This snake is being held gently by a person. This snake is safe right now. In nature, snakes hide in safe places.\"\n  5. Ask: \"Can you think of a time when YOU needed food? Water? A safe place to sleep?\"\n  6. Check for understanding: \"What is one thing this snake needs every day?\" (Have 2-3 students respond.)\n\n- **Vocabulary:**\n  - **Animal:** A living thing that can move, eat food, and grow.\n  - **Survive:** To stay alive and healthy.\n  - **Food:** Something an animal eats for energy and growth.\n  - **Shelter:** A safe home or place where an animal rests and is protected.\n  - **Snake:** A long animal with scales, no legs, and a forked tongue that eats small animals.\n\n- **Expected Student Outcomes:** \n  - Students will understand and use the four basic animal needs vocabulary.\n  - Students will recognize that the snake in the photo is an animal with the same basic needs as other animals.\n  - Students will begin to see connections between human needs and animal needs.\n\n#### 4. ELABORATE (15-20 minutes)\n- **Objective:** Students apply and deepen their understanding by creating and sharing a simple animal need plan.\n\n- **Materials:**\n  - Large paper or poster board (one per student or pair)\n  - Colored pencils, crayons, or markers\n  - Picture cards, stickers, or magazines for cutting and pasting (optional)\n  - Snake images to glue onto posters (printed copies)\n\n- **Activity:**\n  1. Say: \"Now we're going to become snake experts and help someone understand what snakes need.\"\n  2. Give each student (or pair) a large paper with a simple snake drawing already on it (or let them draw one).\n  3. Student directions: \"Draw or glue a picture of ONE thing this snake needs to survive. You can draw: food (a mouse), water (a puddle or stream), a home (a hole in the ground, a tree), or a safe hiding place. Then, we'll share our ideas!\"\n  4. As students work, ask: \"Tell me about what you drew. Why does the snake need this?\" Scribe their words on the poster or have them dictate.\n  5. Gallery walk: Post all posters around the room. Have students do a silent walk to observe each other's work (2-3 minutes).\n  6. Discussion: \"What did you notice? Did everyone pick different needs, or did some of us pick the same ones? Why?\"\n\n- **Teacher Role:**\n  - Provide sentence stems: \"This snake needs _____ because _____.\"\n  - Ask follow-up questions: \"Where would a snake find this?\" \"What happens if a snake doesn't have this?\"\n  - Encourage students to move around and observe peers' work without talking.\n\n- **Expected Student Outcomes:** \n  - Students will create a visual representation of one animal need.\n  - Students will explain verbally why snakes need that thing.\n  - Students will recognize that there are multiple correct answers and that all animals need similar categories of things.\n\n#### 5. EVALUATE\n- **Objective:** Assess student understanding of animal needs and patterns.\n\n- **Activity:**\n\n  **Formative Assessment (During the lesson):**\n  - Observe student sorting during Explore: Do students match at least 2-3 needs to animals correctly?\n  - Listen to student explanations during Explain: Can students name at least two things an animal needs to survive?\n  - Watch student creations during Elaborate: Does the student's drawing or project show ONE animal need? Does their explanation connect the need to survival?\n\n  **Exit Ticket / Summative Assessment (End of Lesson):**\n  \n  Gather students and ask them to respond to these prompts (accept verbal responses, drawings, or both):\n  \n  1. **\"Point to the animal needs chart. Pick one thing a snake needs to survive. What is it?\"** (Success: Student names food, water, shelter, or safety.)\n  \n  2. **\"Why does a snake need that?\"** (Success: Student gives a reason, even if simple: \"To eat,\" \"To drink,\" \"To hide,\" \"To stay alive.\")\n  \n  3. **\"Is a snake the same as you? What does a snake need that you need too?\"** (Success: Student identifies at least one shared need: \"We both eat food\" or \"We both need water\" or \"We both need a safe place.\")\n\n  Alternatively, provide a picture card of a snake and three images (food, shelter, water). Ask: \"What does this snake need?\" Students point to or hold up the correct image.\n\n- **Success Criteria:**\n  - **Proficient:** Student can name 2+ animal needs and explain why at least one is important for survival.\n  - **Developing:** Student can name 1-2 animal needs but needs support explaining why.\n  - **Beginning:** Student can identify an animal but needs significant support naming needs or explaining their purpose.\n\n- **Expected Student Outcomes:** \n  - Students will demonstrate understanding that animals have specific needs to survive.\n  - Students will use observational and conceptual vocabulary from the lesson.\n  - Students will show emerging understanding of patterns (similarities between different animals' needs and between human and animal needs).\n\n---\n\n### Differentiation\n\n**Support (Scaffolding for Struggling Learners):**\n- **Reduce choices:** During Explore, provide only 2-3 animal pictures and 2-3 need pictures instead of many. This reduces cognitive load and helps students succeed with fewer decisions.\n- **Use real or manipulative models:** If available, allow students to touch a real (safe) scale, hold a picture of a snake's food, or see a model snake burrow. Tactile and visual supports help concrete thinkers.\n- **Pre-teach vocabulary:** Before the lesson, show pictures and introduce words like \"snake,\" \"food,\" \"shelter\" one-on-one or in a small group using repetition and familiar examples.\n- **Partner with a stronger peer:** Pair during Explore and Elaborate so students can observe and learn from peers' thinking.\n- **Shorten explanations:** Accept one-word or two-word answers (\"Snakes eat food\"; \"They hide\") rather than full sentences.\n\n**Challenge (Extensions for Advanced Learners):**\n- **Compare multiple animals:** Instead of sorting, ask: \"How is what a snake needs different from what a fish needs? Why?\" This pushes deeper thinking about adaptation and habitat.\n- **Predict and reason:** Ask, \"If a snake couldn't find food for a whole month, what would happen to it?\" or \"Why might a snake need a warmer home in winter?\"\n- **Research and present:** Encourage students to find out one specific fact about snakes (What do king snakes eat? Where do they live?) and share it with the class.\n- **Design a snake home:** Provide materials and ask, \"What would make a good home for a snake? Draw or build a safe place where a snake could find food, water, and hide from danger.\"\n\n---\n\n### Extension Activities\n\n1. **Snake Habitat Diorama:** Students create a shoebox diorama showing where a snake lives and what it needs. Include drawings or models of food, water, shelter, and a hiding place. Students present their diorama and explain each element.\n\n2. **Animal Needs Sorting Game (Center Activity):** Create a matching or sorting game where students sort animal pictures into bins labeled \"Food,\" \"Water,\" \"Shelter,\" and \"Safety.\" Students can return to this center repeatedly to deepen automaticity with the concept.\n\n3. **Our Needs Match Animals' Needs (Whole-Class Chart):** Over several days, create a two-column chart comparing human needs to animal needs. During transitions or morning meeting, ask, \"What did you eat for breakfast? What do snakes eat?\" Build evidence that humans and animals share common needs, reinforcing K-LS1-1.\n\n4. **Book Connection & Discussion:** Read aloud a simple, age-appropriate snake or animal book (e.g., *Snakes* by Gail Gibbons, *A Snake Is Totally Cool* by Barney Saltzberg, or a National Geographic Kids snake video). Pause and ask: \"What do you see the snake doing? What does it need right now?\"\n\n5. **Sensory Observation Table:** Set up a science table with shed snake skin (if available from a local nature center—sanitized), pictures of snake eggs, dried food pellets used in reptile feeding, and a temperature dial. Students explore and discuss: \"What does this tell us about what snakes need?\"\n\n---\n\n**Teacher Notes:**\n- Keep the lesson concrete and rooted in the photograph and students' own experiences. Kindergarteners learn best when connecting abstract concepts (animal needs) to visible, tangible examples.\n- Use the king snake image throughout to anchor learning. Refer back to it frequently: \"Remember the snake? Let's talk about what it needs...\"\n- Emphasize that *all* animals (including snakes) have the same basic categories of needs, even though the *specific* food, shelter, and water might look different.\n- Be aware of any student fears of snakes. Frame snakes positively and factually. The lesson is about understanding animals, not overcoming phobias, but be sensitive.\n- Consider inviting a local naturalist or reptile educator to bring a (very) safely-contained snake for a brief, supervised observation (not handling) if students are interested and school policy allows.",
  "inputTokens": 123,
  "outputTokens": 3674,
  "cost": 0.0244355,
  "generatedAt": "2026-02-13T03:01:23.788Z"
}