{
  "title": "Larvae",
  "category": "life-science",
  "imageFile": "larvae.jpg",
  "imagePath": "images/life-science/larvae.jpg",
  "content": "# Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- A pale, C-shaped larva (likely a beetle or fly larva) with a brown/orange head capsule\n- Granular soil or decomposing wood material surrounding the larva\n- Multiple chunks and particles of the substrate, showing a loose, friable texture\n- The larva's soft, segmented body adapted for moving through soil\n\n### Reasonable Inferences\n- **From larva's soft body and burrowing posture**: This creature needs protection from drying out and predators; it likely moves through soil to find food and create shelter.\n- **From the granular substrate**: The larva relies on loose material to create and maintain tunnels; compacted or missing material would limit its mobility and safety.\n- **From head capsule hardness vs. body softness**: The creature's toughest part is its head, suggesting it pushes through soil headfirst to tunnel—the substrate must be manageable but stable enough not to collapse.\n\n### Engineering Task\n\n**K-2: Build a Cozy Home for a Tiny Bug**\nMake a safe, dark home for a small creature (like a pill bug or larva) using soil, sand, and leaves. Your home should:\n- Be big enough for the creature to move around inside\n- Keep the creature safe and hidden\n- Stay moist (not too wet, not too dry)\n- Not fall apart when you gently shake it\n\nTest it: Does your creature want to stay in the home? Did it make tunnels?\n\n**3-5: Design a Stable Underground Tunnel System**\nDesign and build a larval habitat using a transparent container, soil, and sand that allows a mealworm or beetle larva to tunnel safely while you observe its behavior. Your design must:\n- Provide a minimum 5cm depth of loose substrate that stays structurally stable (does not collapse when the larva burrows)\n- Maintain soil moisture between 40–60% (test with a moisture meter or by hand-squeeze method) for at least 7 days\n- Support at least 3 distinct tunnels without cave-ins over a 5-day observation period\n- Allow you to measure and sketch the larva's tunnel patterns every 24 hours\n\nTest and refine: Which soil mixture (sand vs. peat vs. garden soil ratios) creates the strongest, most stable tunnels?\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows a *real creature with a real need*—the larva must burrow safely through soil. Students aren't being asked to mimic an existing solution; they're identifying the problem (\"How do we create stable tunnels in loose material?\") and then imagining ways to solve it. This mirrors how actual larval behavior drives the design constraints, making the task authentic and student-centered.\n\n### Suggested Materials\n\n- Potting soil or garden soil (varied types: clay-heavy, sandy, peat-based)\n- Play sand or fine sand\n- Dried leaves, small pebbles, or wood chips\n- Transparent plastic containers or shoe boxes (for observation)\n- Mealworms, beetle larvae, or pill bugs (readily available from biological supply companies)\n- Spray bottle (for moisture management)\n- Ruler or measuring tape\n- Simple moisture meter or water-absorption test strips\n\n### Estimated Time\n\n**45–60 minutes** for initial design and build (K-5)  \n**Two 30-minute sessions over 5 days** if observing tunnel stability and larval behavior (3-5 extension)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-2** (*Generate and compare multiple possible solutions based on how well they meet the criteria and constraints of a design problem*) by having students test different soil mixtures and refine their tunnel designs based on observable larval behavior—a real, measurable outcome that connects engineering to life science.",
  "inputTokens": 1802,
  "outputTokens": 888,
  "cost": 0.006242,
  "generatedAt": "2026-02-09T13:36:05.704Z"
}