{
  "title": "Life Cyle",
  "category": "life-science",
  "imageFile": "life_cyle.jpg",
  "imagePath": "images/life-science/life_cyle.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n## Visible Elements in Photo\n- Two cracked, pale eggshells partially buried in soil and organic mulch\n- Green plant stems and shoots emerging nearby\n- Decomposing wood chips and dark, rich soil material\n- Small white fragments scattered around the shells\n- Evidence of moisture and organic matter breakdown in the soil layer\n\n---\n\n## Reasonable Inferences\n\n1. **From eggshells + emerging plants** (Life Cycle): The shells are breaking down and returning nutrients to soil, supporting new plant growth—a natural decomposition process.\n\n2. **From rich soil layer + shell fragments** (Material Breakdown): The acidic, moist soil environment is actively breaking down the calcium-based shells over time.\n\n3. **From proximity of stems to shells** (Nutrient Recycling): Decomposing organic matter in this microhabitat creates conditions plants need to grow.\n\n---\n\n## Engineering Task\n\n### **K-2: Build a Safe Home for Seeds**\nYour job: **Design a \"seed protector\" using natural materials** that keeps seeds safe underground while letting them grow up to sunlight. Use sticks, leaves, soil, and paper scraps to build a shelter around a seed. Test it by gently pouring water on top—does the seed stay dry? Can a sprout still push through?\n\n**Success looks like:** Your shelter doesn't fall apart when wet, and a seed planted inside can still grow.\n\n---\n\n### **3-5: Design a Decomposition Chamber**\n**Challenge:** Create a sealed container that mimics the soil environment in the photo. Your goal is to design a system that breaks down eggshells as fast as possible while supporting plant growth.\n\n**Constraints:**\n- Use only a clear plastic container, soil, water, and natural materials (leaves, twigs, food scraps).\n- Must fit on a windowsill.\n- No more than 5 inches tall.\n\n**Success Criteria:**\n- Eggshell fragments noticeably smaller after 2 weeks (measure with a ruler).\n- At least one plant seedling germinates and reaches 2 inches tall.\n- pH of soil measured before and after (use pH strips) shows change of at least 0.5 units.\n\n**Design questions to consider:** How much water? How much air flow? What size soil particles work best?\n\n---\n\n## EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real-world natural phenomenon (nutrient cycling through decomposition) without showing an active engineering solution. Students see the *problem or need* (breaking down eggshells to feed plants) but must first understand what's happening before they can design. Starting with \"Ask\" lets them observe, ask questions (\"Why are shells breaking down?\" \"How does this help plants?\"), and *then* design a solution that mimics or speeds up the natural process.\n\n---\n\n## Suggested Materials\n\n1. **Clear plastic containers** (yogurt cups, small storage boxes, or gallon jugs with lids)\n2. **Potting soil and garden soil** (different types to test acidity/decomposition speed)\n3. **Eggshells** (rinsed and crushed to various sizes)\n4. **Seeds** (fast-growing like radish, bean, or lettuce)\n5. **Water, pH test strips, and a ruler** (for measuring and monitoring)\n6. *(Optional)* Leaves, shredded newspaper, food scraps, and small twigs to layer\n\n---\n\n## Estimated Time\n\n**K-2:** 20–30 minutes for building + 5–10 minutes daily observation over 1–2 weeks.\n\n**3-5:** 30 minutes initial setup + 10 minutes every 2–3 days for 2–3 weeks of monitoring and data collection.\n\n---\n\n## Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.B** (*Developing Possible Solutions*) by asking students to design a system that mimics a natural decomposition process, bridging life science observation with engineering design while using readily available classroom materials.",
  "inputTokens": 2329,
  "outputTokens": 927,
  "cost": 0.006964,
  "generatedAt": "2026-02-09T13:43:57.606Z"
}