{
  "title": "Live_oak",
  "category": "life-science",
  "imageFile": "live_oak.jpg",
  "imagePath": "images/life-science/live_oak.jpg",
  "content": "# Engineering Design Challenge: Live Oak Tree Support System\n\n### Visible Elements in Photo\n- A large, mature live oak tree with a thick trunk and massive horizontal branches extending widely\n- Dark, textured bark showing age and weathering\n- Multiple strong branches that fork and spread, creating a complex canopy structure\n- Green grass and bare soil around the tree base\n- Urban setting with buildings, vehicles, and fencing visible in background\n\n### Reasonable Inferences\n- **From massive horizontal branches**: The tree's weight is unevenly distributed, with heavy limbs extending far from the trunk, creating structural stress points that may need support as the tree ages.\n- **From visible age and bark texture**: This is an old tree that has survived weather events; students could infer that natural or human-made supports might help preserve it for future generations.\n- **From urban park setting**: The tree is a community resource; protecting its health through engineering could benefit the neighborhood.\n\n---\n\n### Engineering Task\n\n**K-2 (Concrete & Playful):**\nYour giant tree has big, heavy arms stretching out far from its body. Design a helper or prop to hold up one of its tired branches so it doesn't get hurt. You can use sticks, string, clay, or cardboard. Your prop must be strong enough to hold a toy block or small weight without breaking.\n\n**3-5 (Constraints & Measurable):**\nThis old oak tree's large branches extend far from the trunk, putting stress on the connection points. Design a support system (brace, cable, or prop) that could safely support one of these heavy branches without damaging the bark. Your design must:\n- Support a 5-pound weight hung from the branch point for 2 minutes without sagging more than 1 inch\n- Use only non-toxic, removable materials (no permanent fasteners)\n- Minimize contact damage to the bark\n- Be adjustable for different branch angles\nTest your design and measure how much weight it actually holds before failing.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\n**Why this fits:** The photo shows a real, visible challenge—a tree's structural needs in an aging organism. Students can observe the problem directly and ask clarifying questions: *How do old branches stay healthy? What happens when they get too heavy? How can we help without hurting the tree?* This authentic, nature-based scenario naturally invites problem definition before jumping to solutions.\n\n---\n\n### Suggested Materials\n- Wooden dowels or small branches\n- Twine or rope\n- Foam blocks or soft padding\n- PVC pipe or plastic tubing (for non-damaging contact)\n- Weights (washers, sand bags, or known-weight objects)\n- Cardboard tubes and tape (for prototyping)\n\n---\n\n### Estimated Time\n**Two 40-minute sessions** (or three 25-minute periods)\n- Session 1: Observe the tree (if possible, or study photos), ask/define the problem, sketch designs\n- Session 2: Build and test the prototype, measure results, iterate if time allows\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.B (Developing Possible Solutions)** by having students identify constraints and criteria for supporting a real structure, while also connecting to **MS-LS1 (Structure and Function in Living Systems)** by exploring how large organisms distribute weight and stay healthy.",
  "inputTokens": 2195,
  "outputTokens": 762,
  "cost": 0.006005,
  "generatedAt": "2026-02-10T04:22:23.950Z"
}