{
  "title": "Mourning Dove",
  "category": "life-science",
  "imageFile": "mourning dove 06062020.jpg",
  "imagePath": "images/life-science/mourning dove 06062020.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: A Dove's Garden Home\n\n## Core Science Concepts from Image Analysis\n\n- **Animals need specific places to live (habitats)** – The dove is in a garden with plants, soil, and shelter, which provides food, water, and protection\n- **Animals have body structures that help them survive** – The dove's body is designed for movement and finding food in this environment\n- **Plants and animals live together in shared spaces** – Multiple organisms (dove, flowering plants, herb plant, grasses) depend on the same garden ecosystem\n- **Animals need food and shelter to survive** – The garden provides both necessities for the dove\n\n---\n\n## Lesson Title\n\n**What Does a Dove Need to Live?**\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** 75-90 minutes (can be split into two 40-45 minute sessions)\n- **NGSS Standards:** \n  - K-LS1-1: Use observations to describe patterns of what plants and animals (including humans) need to survive.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Identify what a dove needs to survive by observing and discussing the photograph.\n2. Describe at least two things animals need to live (food, water, shelter, or a safe place).\n3. Match animals to the habitats or shelters where they find what they need.\n4. Explain why plants and animals live together in a garden using words and pictures.\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (12 minutes)\n\n**Objective:** Capture student curiosity about the dove and what it needs in its garden home using the photograph as an anchor.\n\n**Materials:**\n- Photograph printed large (11\" × 14\" or displayed on projector)\n- Chart paper and markers\n- Optional: small stuffed dove toy to hold up\n\n**Activity:**\n\n1. **Display the photograph** on the board or pass it around in a document camera so all students can see clearly. Say: \"Look carefully at this picture. I see a small bird called a dove. It's visiting a garden. What do you notice?\"\n\n2. **Ask these discussion questions** (pause for responses after each):\n   - \"Where is this dove? What do you see around it?\" *(Listen for: garden, plants, flowers, dirt, things to hide under)*\n   - \"Why do you think the dove came to this garden? What could it find here?\" *(Listen for: food, plants, bugs, safe place)*\n   - \"Do you see any plants or other living things? What are they doing near the dove?\" *(Listen for: growing, standing, providing shade)*\n   - \"If this dove wants to stay safe and healthy, what might it need? Where would it find those things?\" *(Listen for: food, water, shelter, hiding spots)*\n\n3. **Wonder prompt:** Say: \"I wonder... what does this dove NEED to survive and be happy in this garden? Let's be nature detectives and find out!\"\n\n4. **Document thinking:** Record student ideas on chart paper with quick sketches. Label it: \"What Do Doves Need?\"\n\n**Transition:** Now let's explore a garden ourselves and discover what animals might need to survive.\n\n---\n\n### 2. EXPLORE (22 minutes)\n\n**Objective:** Students investigate what living things need by creating and exploring a miniature habitat model.\n\n**Materials (per small group of 3-4 students):**\n- Shallow plastic container or shoebox\n- Potting soil (about 2 cups)\n- Small plants or plant cuttings (basil, parsley, or grass from outside)\n- Small decorative rocks or pebbles\n- Spray bottle with water\n- Toy animals (small bird, insect, lizard) OR pictures of animals\n- Hand lens (optional)\n- Paper and crayons for recording\n\n**Activity:**\n\n**Student Directions:**\n\n1. \"You and your team are going to build a tiny garden home for an animal. First, pour soil into your container—about this much.\" *(Demonstrate with hands, about 2 inches.)*\n\n2. \"Now, place your plants into the soil. You can nestle them in gently. These plants will give your animal food and a place to hide.\"\n\n3. \"Add rocks and pebbles around the plants. These can be rocks where an animal rests or hides.\"\n\n4. \"Using the spray bottle, gently mist your garden with water. Animals need water to survive. Where do you think the water goes? Does it help the plants?\"\n\n5. \"Now, choose a small animal (toy or picture). Walk it around your garden. Where would it find food? Where could it hide? Where would it find water? Point to each place.\"\n\n6. \"Draw a picture of your garden and label or point to: *food, water,* and *shelter*.\" *(Teacher can write these words while students point.)*\n\n**How This Connects to the Photograph:**\nSay: \"Just like our garden model, the dove in the picture found a real garden with plants for food, places to hide, and space to move around. Your miniature garden shows the same things!\"\n\n**What Students Record:**\n- A simple drawing of their garden model\n- Verbal descriptions or teacher-scribed labels showing where food, water, and shelter are found\n- Photos of their model (optional)\n\n**Teacher Role:**\n- Circulate to each group and ask guiding questions without giving answers:\n  - \"Where do you think this animal would find food?\"\n  - \"Show me a safe hiding place in your garden.\"\n  - \"What happens to the water when you spray it? Where does it go?\"\n- Help students identify and name what they observe\n- Encourage collaboration and discussion within groups\n- Scribe student words on their drawings if needed\n\n**Expected Student Outcomes:**\nStudents will:\n- Create a functioning miniature habitat with at least three of the four basic animal needs\n- Identify at least two places in their model where an animal finds food, water, or shelter\n- Begin using vocabulary: *plants, food, water, shelter, hide, survive*\n\n---\n\n### 3. EXPLAIN (18 minutes)\n\n**Objective:** Formalize vocabulary and connect students' exploration to the scientific concept that animals need specific things to survive.\n\n**Materials:**\n- Chart paper from Engage phase\n- Student garden models from Explore\n- Printed word cards or picture cards: *FOOD, WATER, SHELTER, HABITAT*\n- Photograph displayed again\n- Optional: picture book excerpt about garden animals (e.g., *Guess Who?* by Margaret Wise Brown or similar)\n\n**Activity:**\n\n1. **Gather students on the carpet** with their garden models in front of them or nearby.\n\n2. **Share-out from Explore:**\n   - Ask: \"Who would like to show us their garden? Point to a place where an animal could find food. Food gives animals energy to grow and play.\"\n   - Repeat for 2-3 groups, highlighting different answers.\n   - Affirm: \"You found so many different food sources! Some animals eat seeds from plants. Some eat bugs. Some eat leaves.\"\n\n3. **Introduce key vocabulary** using the photograph and student models as reference:\n\n   **HABITAT** – \"A habitat is a home for animals. It has everything the animal needs. Our dove's habitat is a garden.\"\n   \n   **FOOD** – \"Food is what animals eat to grow strong. The dove might find seeds or bugs in the garden.\"\n   \n   **WATER** – \"Water is what all living things need to drink. Rain fills puddles. Damp soil holds water. The dove drinks when it finds water.\"\n   \n   **SHELTER** – \"Shelter is a safe, cozy place to hide and rest. In our garden, bushes and plants give shelter from rain and scary things.\"\n   \n   **SURVIVE** – \"To survive means to stay alive and healthy. Animals survive when they have food, water, shelter, and a safe place.\"\n\n4. **Connect back to the photograph:**\n   Point to the dove in the picture. Say: \"This dove is in a garden habitat. Let's find what it needs here. Where do you see FOOD? Where could it find WATER? Where is SHELTER?\" *(Point out plants, soil, shaded areas, etc.)*\n\n5. **Check for Understanding:**\n   - Hold up word cards one at a time. Ask: \"Is this something the dove needs? How do you know?\"\n   - Ask students to point to their own garden model and say: \"Show me where food is... where water is... where shelter is.\"\n   - Use a quick thumbs-up/sideways/down check: \"Thumbs up if you think doves need shelter!\"\n\n**Vocabulary:**\n\n| Term | Student-Friendly Definition |\n|------|---------------------------|\n| **Habitat** | A home for animals with everything they need to live |\n| **Food** | What animals eat to grow strong and have energy |\n| **Water** | A liquid all living things drink to stay healthy |\n| **Shelter** | A safe, cozy place where animals hide, rest, and stay dry |\n| **Survive** | To stay alive and healthy by getting what you need |\n\n**Expected Student Outcomes:**\nStudents will:\n- Recognize and use 3-5 new vocabulary words with teacher support\n- Identify food, water, and shelter in both the photograph and their model garden\n- Understand that animals need a habitat with specific things to survive\n\n---\n\n### 4. ELABORATE (18 minutes)\n\n**Objective:** Apply and deepen understanding by exploring a new context: what different animals need in their habitats.\n\n**Materials:**\n- Picture cards of different habitats (forest, pond, desert, meadow, sky) and animals that live there (squirrel, frog, lizard, butterfly, eagle, dove)\n- Chart paper labeled \"Animal Habitat Matching\"\n- Real or pictured items: seeds, water droplet, leaves, twigs, rocks, flowers\n- Optional: field guide or photos of garden creatures\n\n**Activity:**\n\n**Option A: Habitat Matching Game**\n\n1. Show picture cards of different animals and habitats.\n\n2. Ask: \"Where does THIS animal live? What does it need there?\" \n   - \"A squirrel lives in a FOREST. It finds acorns (food) under trees (shelter).\"\n   - \"A frog lives in a POND. It drinks water and hides under lily pads (shelter).\"\n   - \"A butterfly visits FLOWERS. It drinks nectar (food) from the flowers.\"\n\n3. Have students match animals to their habitats and name one thing each animal needs.\n\n4. Say: \"Just like the dove in our photograph, every animal needs a special home—a habitat—where it can find what it needs to survive.\"\n\n**Option B: \"What's in Our Garden?\" Scavenger Hunt**\n\n1. Take students outside to a real garden, schoolyard, or green space (or view photographs if outdoor access is limited).\n\n2. Point out real plants, insects, shelter spots.\n\n3. Ask: \"What animals might live here? What would they eat? Where would they hide?\"\n\n4. Collect small natural items (leaves, twigs, a flower photo) and return to create a class habitat display.\n\n5. Label together: \"Our Garden Habitat Provides Food, Water, and Shelter.\"\n\n**Teacher Role:**\n- Ask open-ended questions: \"Why did you put the butterfly with the flowers?\"\n- Prompt deeper thinking: \"What would happen if there were no plants in this habitat?\"\n- Validate student reasoning even if unconventional\n\n**Expected Student Outcomes:**\nStudents will:\n- Match at least two animals to appropriate habitats with a reason\n- Identify that different animals live in different places\n- Explain that all habitats provide food, water, or shelter in different ways\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of what animals need to survive and why habitats matter.\n\n**Formative Assessment (Ongoing):**\n- **Observation during Explore:** Could students identify food, water, or shelter in their model?\n- **Vocabulary check during Explain:** Did students use habitat, food, water, shelter correctly?\n- **Questioning during Elaborate:** Could students connect animals to their habitat needs?\n\n**Summative Assessment (Exit Ticket / Closing Activity):**\n\nChoose one of these options based on your students' abilities:\n\n**Option A: Picture Sort (Easiest)**\n- Show three pictures: a dove, a garden with plants, an empty concrete area.\n- Ask: \"Which picture shows where a dove should live? Why?\" *(Students point and tell you or show thumbs up/down.)*\n- Listen for: mentions of food, water, plants, or shelter.\n\n**Option B: Draw and Label (Moderate)**\n- Give each student a paper divided into three sections labeled: FOOD, WATER, SHELTER.\n- Say: \"Draw one thing a dove needs in each section. You can draw, color, or I can write your words.\"\n- Success: Student draws or identifies at least one appropriate item in each category.\n\n**Option C: Retell with Support (Challenge)**\n- Ask: \"Tell me one thing a dove needs to survive. Where in the garden does it find that thing?\"\n- Record the student's answer. Prompt if needed: \"Does it need food? Water? A place to hide?\"\n- Success: Student names one need and connects it to the garden.\n\n**Success Criteria:**\nA student demonstrates understanding if they can:\n\n✓ Identify at least TWO things animals need (from: food, water, shelter, safe place)\n\n✓ Connect those needs to the dove in the photograph or garden environment\n\n✓ Use or understand at least ONE vocabulary word (habitat, food, water, shelter, or survive)\n\n✓ Recognize that plants and animals live together in gardens\n\n**Expected Student Outcomes:**\n- Most Kindergarteners will identify food and shelter as animal needs\n- Some will articulate water as a need\n- Students will begin connecting specific habitat features to animal survival\n- Students will use new vocabulary with scaffolding\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Vocabulary:** Use only 2-3 core words instead of five. Focus on *food*, *water*, *home*.\n   - Repetition: Use the same words consistently across the lesson.\n   - Visuals: Pair every word with a clear picture or icon.\n\n2. **Guided Exploration:** \n   - Assign an adult or peer helper to the Explore group.\n   - Provide a visual checklist showing pictures of food, water, and shelter.\n   - Pre-plant one plant in the soil before the activity to reduce complexity.\n\n3. **Concrete Supports:**\n   - Use real items (actual seeds, real water droplet, real leaves) rather than just pictures.\n   - Have students physically walk a toy animal through their model and narrate: \"Here's food. Here's water. Here's a hiding place.\"\n   - Offer hand-over-hand guidance if motor skills are a challenge.\n\n### Challenge (For Advanced Learners)\n\n1. **Deeper Questioning:**\n   - \"What would happen if there was no water in this habitat? Where else could the dove find water?\"\n   - \"Do you think all animals need the SAME food? Why or why not?\"\n   - \"Can you tell me a reason why gardens are good habitats?\"\n\n2. **Complex Habitat Design:**\n   - Challenge students to design a habitat for TWO different animals and explain how both could survive there.\n   - Ask: \"Which animal needs more shelter? Why?\"\n\n3. **Real-World Connection:**\n   - Assign \"habitat researcher\" role: observe outside and sketch where they see animals finding food or shelter.\n   - Create a field guide page: \"How to Spot Garden Animals and What They Need.\"\n\n---\n\n## Extension Activities\n\n1. **\"All About Doves\" Research & Storytelling**\n   - Show photos of different dove species (mourning dove, rock dove, etc.).\n   - Ask: \"What do you think doves like to eat?\" Provide images of seeds, berries, grain.\n   - Have students create a one-page illustrated story: \"Where Does a Dove Go to Find...?\" (food/water/shelter).\n\n2. **Create a Class Garden**\n   - Plant seeds (sunflower, basil, marigold) in a classroom or outdoor raised bed.\n   - Observe and document which insects, birds, and animals visit over weeks.\n   - Create a classroom habitat journal: \"Who visits our garden? What do they need?\"\n   - This extends the lesson to life cycles, observation, and real-world impact.\n\n3. **Habitat Walk & Sketch**\n   - Take students on a guided nature walk (schoolyard, local park, or even around school building).\n   - Ask: \"Is THIS a good habitat for a dove? For a butterfly? For a squirrel? Why?\"\n   - Students sketch or photograph evidence: plants, water source, shelter.\n   - Create a class \"Habitats We Found\" poster with photos and labels.\n\n---\n\n## Teacher Notes\n\n- **Timing:** This lesson is designed to be flexible. You can complete it in two 40-minute sessions (Engage + Explore on Day 1; Explain + Elaborate + Evaluate on Day 2) or across a full week with daily 15-minute check-ins.\n- **Safety:** Ensure soil is clean and pesticide-free. Supervise water use carefully. If using outdoor exploration, establish clear boundaries and check for hazards.\n- **Photograph as Anchor:** Return to the photograph throughout the lesson. Each phase should reference it: \"Remember the dove we saw? Here's where it found...\"\n- **Real-World Relevance:** Kindergarteners learn best when they see immediate connections to their own lives. Personalize: \"Do YOU need food, water, and a safe place? That's what animals need too!\"\n- **Vocabulary Repetition:** Use the same vocabulary words daily and in multiple contexts to build retention.",
  "inputTokens": 2811,
  "outputTokens": 4147,
  "cost": 0.023546,
  "generatedAt": "2026-02-12T21:06:45.054Z"
}