{
  "title": "Mourning Dove",
  "category": "life-science",
  "imageFile": "mourning dove 06062020.jpg",
  "imagePath": "images/life-science/mourning dove 06062020.jpg",
  "content": "# Engineering Design Challenge: Shelter for Small Ground Creatures\n\n---\n\n### Visible Elements in Photo\n- A small ground-dwelling bird (mourning dove) on dark soil/mulch in a garden bed\n- Dense, low green shrub vegetation providing cover\n- White flowering plants (foreground, out of focus)\n- Yellow flowering plants (background)\n- Rust-colored ceramic pot (upper left)\n- Dark mulch and soil\n- Tall grass or plant stems (left side)\n\n---\n\n### Reasonable Inferences\n1. **From the bird's position on open soil near vegetation**: Small ground creatures need accessible shelter from predators and weather, but must still be able to move freely to forage and escape danger.\n2. **From the dense shrub and layered plantings**: Natural structures like bushes and varied plant heights work together to create multiple escape routes and hiding spots.\n3. **From the garden setting with mixed plants**: The environment shows intentional design—plants are grouped to create microhabitats, suggesting humans can engineer spaces to support wildlife needs.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Hide-Away House for Garden Bugs**\n\nYour job: Design and build a safe hiding place for bugs in a garden. Use sticks, leaves, grass, and soil to make a cozy spot where a bug can hide from birds and stay dry when it rains. Your shelter should have an opening small enough that a pencil can fit through, but big enough for a bug to get in and out. Test it by gently spraying it with water—does the inside stay dry?\n\n---\n\n**3-5: Design a Low-Profile Shelter System for Ground-Foraging Wildlife**\n\n**Problem**: Small ground-dwelling creatures (like ground-feeding birds or insects) need shelter that protects them from predators and weather, but they must be able to see predators approaching and escape quickly.\n\n**Your Challenge**: Design a shelter structure using natural and recycled materials (sticks, leaves, cardboard tubes, soil, mulch) that:\n- Fits within a 20 cm × 20 cm × 15 cm footprint (to match garden bed spacing)\n- Has at least 2 separate escape routes (openings)\n- Keeps a \"test object\" (small sponge or moss) dry when exposed to simulated rain (spray bottle, 10 spritzes)\n- Allows clear sight lines so an animal inside can detect movement above and around it\n\n**Success Criteria**:\n1. Shelter stays intact after 3 days of classroom testing.\n2. Interior stays dry after water test.\n3. You can clearly explain why your design allows the creature to sense danger.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo is best used to launch the **Ask / Define Problem** phase. The image shows a real creature in its natural habitat, revealing an unmet need: small animals require shelter, but that shelter must balance safety with the ability to escape. Students must observe the creature and its environment, then articulate *why* simple hiding spots aren't enough—the creature needs both protection and awareness. This problem-finding mindset is the foundation of engineering thinking.\n\n---\n\n### Suggested Materials\n\n- Sticks and twigs (various sizes)\n- Dried leaves and grass\n- Soil and mulch\n- Cardboard paper towel tubes\n- Recycled plastic containers (cut open)\n- Moss or dry sponges (for water-resistance testing)\n- Spray bottle (for water testing)\n- Tape or natural plant fibers (for binding)\n\n---\n\n### Estimated Time\n\n**K-2**: 2 sessions of 20–30 minutes each (Day 1: design and build; Day 2: test and observe)\n\n**3-5**: 2–3 sessions of 40–50 minutes each (Day 1: observe photo and define criteria; Day 2: build and test; Day 3: refine and document findings)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (*defining engineering problems*) and **ETS1.B** (*developing possible solutions*) by asking students to identify what a real creature needs and then design a solution that balances competing demands—the heart of authentic engineering work.",
  "inputTokens": 2332,
  "outputTokens": 962,
  "cost": 0.007142000000000001,
  "generatedAt": "2026-02-09T13:21:09.989Z"
}