{
  "title": "Mourning Dove",
  "category": "life-science",
  "imageFile": "mourning dove 06062020.jpg",
  "imagePath": "images/life-science/mourning dove 06062020.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "# 5E Lesson Plan: Garden Homes for Little Animals\n\n---\n\n## Core Science Concepts from Image Analysis\n\n- **Animal Habitats and Shelter:** The photograph shows a mourning dove in a garden setting surrounded by plants, soil, rocks, and a clay pot—all elements that provide shelter and living spaces for animals.\n- **Plant and Animal Relationships:** Multiple plants (flowering herbs, green foliage) share the same space with the bird, demonstrating how organisms live together in ecosystems.\n- **Adaptation to Environment:** The dove's coloring and size are suited to blending into and moving through the garden environment.\n- **Human and Natural Spaces:** The garden shows how humans create environments that support both plants and animals, illustrating the connection between organisms and their surroundings.\n\n---\n\n## Lesson Title\n\nWhere Do Garden Animals Live and What Do They Need?\n\n---\n\n## Lesson Overview\n\n- **Grade Level:** First Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 45-minute sessions (90 minutes total)\n- **NGSS Standards:** \n  - 1-LS1-1: Use materials to design a solution to a human problem by mimicking how plants and/or animals use their external parts to help them survive, grow, and meet their needs.\n  - 1-LS1-2: Read texts and use media to determine patterns in behavior of parents and offspring that help offspring survive.\n\n---\n\n## Learning Objectives\n\nStudents will be able to:\n\n1. Identify at least three things that animals need to live and survive in a habitat (food, water, shelter, space).\n2. Explain how plants and other objects in a garden provide shelter and protection for small animals.\n3. Design a simple habitat using natural and classroom materials that would help an animal survive.\n4. Describe one way a bird's body helps it live in its environment (wings for flying, beak for eating, feathers for warmth).\n\n---\n\n## 5E Lesson Sequence\n\n### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge using the photograph to spark curiosity about where animals live.\n\n**Materials:**\n- Large printed photograph of the mourning dove in the garden (or display on interactive board)\n- Chart paper and markers\n- Chart titled \"What Do Animals Need to Live?\"\n\n**Activity:**\n\n1. **Display the Photograph:** Show students the garden image with the mourning dove prominently featured. Say: \"Look carefully at this picture. There's a special visitor here. Can you find it?\"\n\n2. **Discovery Discussion:** Guide students to locate the dove. Once found, ask:\n   - *\"What do you see the bird standing on?\"* (soil, ground, garden)\n   - *\"What plants and things are around the bird?\"* (green plants, flowers, rocks, a pot)\n   - *\"Why do you think this bird chose to live in this garden instead of in the middle of a road?\"* (Accept all answers; look for ideas about safety, food, plants)\n   - *\"What do YOU need to stay healthy and safe?\"* (food, water, home, family)\n\n3. **Wonder Prompt:** Say: \"I wonder... what does this bird need to live and be happy in this garden, just like you need things to be happy at home?\"\n\n4. **Record Ideas:** Write student responses on the chart titled \"What Do Animals Need to Live?\" without correcting misconceptions—they'll refine these in later phases.\n\n**Transition:** \"Let's become garden explorers and build our own little homes for animals, and see what things help them survive!\"\n\n---\n\n### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate and discover what animals need by building a model habitat using hands-on materials.\n\n**Materials (per pair or small group):**\n- Shallow plastic bin or cardboard box base (6\" × 8\" minimum)\n- Potting soil or sand (enough to cover bottom, about 2 inches)\n- Small potted plant or cutting of fresh plant (herb, grass, or small houseplant)\n- Pebbles or small rocks\n- Sticks or twigs\n- Leaves (fresh or dried)\n- Small cups of water\n- Picture cards of small animals (bird, bug, lizard, mouse) — laminated\n- Paper and pencil for recording observations\n\n**Activity:**\n\n1. **Introduction to Task:** Tell students: \"You are going to build a little garden home for a small animal. Think about what that animal needs: a safe place to hide, things to eat, water to drink, and space to move around.\"\n\n2. **Step-by-Step Student Directions:**\n   - **Step 1:** Spread the soil or sand evenly in your bin. (Talk aloud: \"This is the ground where the animal walks.\")\n   - **Step 2:** Place your small plant in one corner. Pat the soil around it gently. (Say: \"Plants give the animal shade and food.\")\n   - **Step 3:** Arrange pebbles and rocks to create small caves or hiding spots. (Say: \"Animals like safe places where bigger animals can't see them.\")\n   - **Step 4:** Add sticks and leaves to make the home more natural. (Say: \"This looks like a real garden!\")\n   - **Step 5:** Carefully pour a small amount of water into a corner so it soaks into the soil. (Say: \"Animals need water, just like we do.\")\n   - **Step 6:** Place an animal picture card in your habitat. (Say: \"Imagine this animal living here. Is it safe? Does it have food?\")\n\n3. **Connection to Photograph:** Point out: \"Remember the garden in our photo? We saw plants, soil, rocks, and water. You just made something like that!\"\n\n4. **What Students Record:**\n   - Have each group/pair draw or label the items in their habitat.\n   - Ask: \"What would your animal eat in this home? Where would it hide? Where would it drink?\"\n   - Write simple sentence stems: \"Our animal can hide in the ___.\" \"Our animal eats ___.\"\n\n5. **Teacher Role:**\n   - Circulate and listen to student thinking without correcting.\n   - Ask open-ended questions: *\"Tell me why you put that rock there?\"* *\"Where is the safest place in your habitat?\"*\n   - Observe which students understand the concept of shelter vs. those still developing the idea.\n   - Provide sentence starters but let students finish their own thoughts.\n\n6. **Expected Student Outcomes:**\n   - Each student/group will have a tangible model habitat showing at least 3-4 key elements (soil, plant, hiding spot, water).\n   - Students will articulate at least two reasons why each element is important (e.g., \"The plant gives food\" or \"The rocks make a hiding place\").\n\n---\n\n### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and concepts, connect observations back to the dove photograph, and formalize understanding.\n\n**Materials:**\n- Student habitats from Explore phase\n- Photograph of mourning dove garden (displayed again)\n- Picture cards or photos of: shelter, food, water, space\n- Vocabulary anchor chart with pictures\n\n**Activity:**\n\n1. **Group Share-Out:** Ask 3-4 groups/pairs to show their habitats briefly. Facilitate with prompts:\n   - *\"What did your group build that helps the animal survive?\"*\n   - *\"How is your habitat like the garden in our photo?\"*\n   - Listen for student language and affirm effort and thinking.\n\n2. **Introduce Key Vocabulary with Pictures/Demonstrations:**\n\n   | **Vocabulary Term** | **First Grade-Friendly Definition** | **Connection to Habitat** |\n   |---|---|---|\n   | **Habitat** | A home where animals live and find everything they need. | Your bin with soil, plants, rocks, and water is a habitat. |\n   | **Shelter** | A safe, protected place where an animal can hide and rest. | The rocks and plants give the dove a safe place. |\n   | **Food** | Something an animal eats to grow strong and healthy. | Plants and seeds are food for birds. |\n   | **Water** | A liquid that all living things need to stay healthy. | You drink it; so do animals. |\n   | **Space** | Room for an animal to move around and live. | Your habitat has room for the animal to walk and fly. |\n\n3. **Anchor Chart Creation:** Build a simple visual anchor chart with:\n   - Picture/word for each vocabulary term\n   - A drawing of the dove from the photo in the center\n   - Arrows pointing to things the dove needs around it (plant = food, rocks = shelter, soil = space, water = water)\n\n4. **Return to the Photograph:** Display the original photo and say:\n   - *\"Let's look at the garden again. Do you see a shelter for the bird?\"* (Point to plants and pot area.) \n   - *\"Where is food?\"* (Plants, seeds from flowers.)\n   - *\"How does the bird find water?\"* (Garden is watered; there may be puddles.)\n   - *\"Does the bird have space to move?\"* (Yes, the whole garden!)\n\n5. **Check for Understanding:**\n   - Show a picture of an empty room with nothing in it. Ask: *\"Could a bird live here happily? Why or why not?\"* \n   - Show the dove photo again. Ask: *\"Why is this garden a better home for a bird?\"*\n   - Thumbs up/sideways/down: *\"Do you think animals need shelter to be safe?\"*\n\n6. **Expected Student Outcomes:**\n   - Students can name and point to at least 3-4 things animals need (using vocabulary or simpler language).\n   - Students understand that habitats are special homes with all the things animals need.\n   - Students recognize these needs in both the classroom habitat they made and the photograph.\n\n---\n\n### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply their understanding to a new context and deepen their learning about how animals' body parts help them survive.\n\n**Materials:**\n- Picture cards of different birds or animals (robin, squirrel, bee, butterfly, etc.)\n- Pre-made habitat scenario cards (see below)\n- Chart paper and markers\n- Body part feature cards (wings, beak, feathers, strong legs, etc.)\n\n**Activity:**\n\n**Option A: Habitat Problem-Solving (Recommended for whole-group deepening)**\n\n1. **Present a Scenario:** Tell students: \"A new animal needs a home. Let's help it!\"\n   - Scenario 1: *\"A bunny needs a habitat. What should we add to our garden to help a bunny? What does a bunny need?\"*\n   - Scenario 2: *\"A butterfly needs food. What plant should we grow? Why?\"*\n\n2. **Small Group or Pair Task:** Give each group a habitat scenario card with a picture of an animal. Ask them to:\n   - *\"What does this animal need to survive?\"*\n   - *\"Draw or point to what we should add to a garden to help this animal.\"*\n   - *\"Tell us one thing about this animal's body that helps it live in a garden.\"* (e.g., \"A bee has wings to fly to flowers.\")\n\n3. **Group Share-Out:** Each group presents their animal and one need they identified.\n\n**Option B: \"Animal Superpowers\" Body-Part Connection (If time allows with advanced learners)**\n\n1. Say: *\"The dove in our photo has special body parts that help it live in the garden. Let's discover them!\"*\n\n2. Show a large picture of a dove. Point to:\n   - **Feathers:** Keep the bird warm and help it fly to find food and escape danger.\n   - **Beak:** Picks up seeds and small foods from the ground.\n   - **Eyes:** Helps the dove see where food is and spot dangers.\n   - **Strong legs:** Let the dove stand on branches, rocks, and ground.\n\n3. Activity: \"Match the Body Part to the Need\"\n   - Show picture cards of the dove's features.\n   - Ask: *\"Which body part helps the dove find food? Which helps it stay warm? Which helps it escape from danger?\"*\n   - Create a simple matching anchor chart.\n\n4. **Deepen the Connection:** Ask: *\"How is your body like the dove's body? We have eyes to see, mouths to eat, and skin to keep us warm. The dove has these things too—just different!\"* (This connects to 1-LS3-1.)\n\n**Teacher Role:**\n- Facilitate discussions without giving all answers; ask students to explain their thinking.\n- Use think-aloud: *\"I notice the bird has a small beak. I think that helps it... what do you think?\"*\n- Validate all reasonable responses and gently redirect misconceptions with questions.\n\n**Expected Student Outcomes:**\n- Students apply their understanding of habitats to a different animal scenario.\n- Students recognize that animals' body parts help them survive in their habitats.\n- Students can explain at least one connection between a body part and a survival need (e.g., \"Wings help birds fly away from danger\").\n\n---\n\n### 5. EVALUATE\n\n**Objective:** Assess student understanding of animal habitats, needs, and adaptations throughout and at the conclusion of the lesson.\n\n**Activity:**\n\n**Formative Assessment (During Lesson):**\n- **Observation Checklist** (use during Explore and Elaborate):\n  - ✓ Student identified at least 2-3 elements needed in a habitat\n  - ✓ Student explained why at least one element is important\n  - ✓ Student used vocabulary (shelter, food, water, space) or understood concepts in simpler language\n  - ✓ Student made connection between their habitat and the photograph\n  \n- **Listen-Fors During Discussions:**\n  - *\"My animal hides in the rocks because...\"*\n  - *\"The plant is important because...\"*\n  - *\"This is like the garden photo because...\"*\n\n**Exit Ticket / Summative Assessment (End of Day 2):**\n\nChoose one format based on your students' abilities:\n\n**Format A: Drawing with Labeling (Recommended)**\n- Give students a blank paper with a simple habitat outline (a circle or box representing a garden).\n- Ask: *\"Draw the things an animal needs to live in a garden. Label them.\"*\n- Success Criteria: Student draws at least 3 elements from this list: plant/food, shelter, water, space.\n\n**Format B: Sentence Stem Response**\n- Read aloud: *\"An animal needs a _____ to stay safe.\"*\n- Read aloud: *\"Plants give animals _____.\"*\n- Read aloud: *\"A _____ is a place where animals live.\"*\n- Success Criteria: Student provides reasonable responses to at least 2 out of 3 stems.\n\n**Format C: Photograph-Based Question**\n- Show the original dove photo one more time.\n- Ask: *\"Point to one thing in this garden that helps the bird survive. Tell me why.\"*\n- Success Criteria: Student points to an element (plant, soil, rock, space) and gives a reason (food, shelter, space to move, etc.).\n\n**Expected Student Outcomes:**\n\nStudents will demonstrate understanding by:\n1. Naming or pointing to at least 3 things animals need in a habitat.\n2. Explaining at least one reason why each element is important (e.g., \"Shelter keeps the animal safe\").\n3. Making a connection between the classroom habitat or their drawing and the photograph.\n4. Using vocabulary or simpler language to describe animal needs (students don't need to use formal terms, but should show the concept).\n\n**Success Criteria for Meeting Learning Objectives:**\n- **LS1-1:** Student demonstrates use of at least 2-3 materials in a habitat design and can explain one reason each material helps an animal survive.\n- **LS1-2:** Student recognizes that animals have parents and behaviors that help them survive (e.g., birds hide in shelter, birds eat seeds from plants—these are ways their parents taught them or how they learned to survive).\n\n---\n\n## Differentiation\n\n### Support (For Struggling Learners)\n\n1. **Simplified Habitat Building:** Pre-assemble one habitat element (e.g., rocks are already arranged as a shelter). Student adds one more element and explains it with teacher prompting: *\"Is this a hiding place or food?\"*\n\n2. **Guided Vocabulary Practice:** Pair student with a peer or aide. Use real objects (a plant, water in a cup, a rock) and repeat vocabulary while pointing: *\"This is shelter. Shelter keeps animals safe.\"* Student repeats and points.\n\n3. **Sentence Starters and Word Banks:** Provide visual word cards or a word bank during the exit ticket:\n   - Word Bank: food, water, shelter, space, safe, hide, eat\n   - Sentence Frame: *\"The _____ helps the animal _____.\"*\n\n### Challenge (For Advanced Learners)\n\n1. **Multi-Animal Habitat Design:** Challenge advanced students to design a habitat for TWO different animals (e.g., a bird and a butterfly). Ask: *\"What does each animal need? Are some things the same? Are some different? Why?\"* This introduces the idea that different animals have different habitat needs.\n\n2. **Field Observation & Sketching:** If possible, take students outdoors to observe a real garden or natural area. Have them sketch or mark with a clipboard: *\"Where do you see shelter? Where might an animal find food? Where is water?\"* This extends observation skills.\n\n3. **Compare Habitats Across Seasons:** Show pictures of the same garden in different seasons (spring, summer, fall, winter). Ask: *\"What animals might live here in spring? In winter? Why?\"* This introduces adaptation to seasonal changes.\n\n4. **Design for a Specific Animal:** Provide a picture of a less common animal (hedgehog, ladybug, salamander) and ask: *\"What special things would this animal need in a habitat? Why?\"* Challenge them to research or hypothesize based on the animal's body structure.\n\n---\n\n## Extension Activities\n\n1. **\"Adopt an Animal\" Poster Project:**\n   - Students choose one animal (real or from a picture).\n   - They draw or collage a habitat for that animal on a large poster.\n   - They write or dictate three things the animal needs: *\"[Animal name] needs food because ___.\"*\n   - Display in the classroom or hallway.\n   - **Time:** 30-45 minutes (can be homework or a follow-up lesson)\n\n2. **Garden Visitor Journal:**\n   - Provide a simple observation journal template (drawn garden outline with space for sketches and labels).\n   - Over one to two weeks, students observe the class or school garden (or a photograph of a garden).\n   - Each day or every few days, they sketch or draw one animal visitor they see or predict might visit.\n   - They label what the animal is eating, where it hides, or what it needs.\n   - Share journal entries in a circle discussion.\n   - **Time:** Ongoing (5-10 minutes per day)\n\n3. **Story: \"A Day in the Life of [Animal Name]\":**\n   - Read aloud or listen to a simple picture book about an animal in its habitat (e.g., *\"The Busy Bee,\"* *\"Little Robin Redbreast,\"* or *\"The Very Hungry Caterpillar\"*).\n   - Have students dictate or write a sentence or two about what that animal does during the day and what it needs.\n   - Repeat with different animals throughout the week.\n   - Create a class book titled *\"Garden Friends' Daily Adventures.\"*\n   - **Time:** 20-30 minutes per animal story\n\n---\n\n## Teacher Notes\n\n- **Real-World Connection:** Consider setting up a small, accessible classroom or outdoor garden where students can observe real animals and plants over time. This deepens engagement with the concepts.\n- **Photography Follow-Up:** Take photos of student habitats and the original dove photo, then create a bulletin board displaying them side-by-side with labels and student observations.\n- **Safety Note:** Ensure all water containers are shallow and secure. Wash hands after handling soil or plants.\n- **Inclusive Language:** Use \"living things,\" \"creatures,\" or \"animals\" when discussing to be respectful of diverse family beliefs around animals.\n- **NGSS Connection:** This lesson particularly supports LS1-1 (designing habitats using materials and mimicking animal/plant needs) and begins groundwork for LS1-2 (understanding behaviors that help survival). LS3-1 connections (young animals like but not identical to parents) can be deepened in future lessons about animal families.\n\n---\n\nThis lesson grounds abstract concepts in tangible, hands-on exploration while maintaining strong connections to the photograph's core image: a small animal thriving in a garden ecosystem. First-graders will leave with a concrete understanding that animals, like people, need specific things to survive—and that gardens provide those things.",
  "inputTokens": 2887,
  "outputTokens": 4883,
  "cost": 0.027302,
  "generatedAt": "2026-02-12T21:07:35.536Z"
}