{
  "title": "Nurse_log",
  "category": "life-science",
  "imageFile": "nurse_log.jpg",
  "imagePath": "images/life-science/nurse_log.jpg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n- A large, hollow tree trunk (cross-section) with significant decay and cavities\n- Exposed wood grain showing rings and layers\n- Deteriorating bark and rotting wood (brown/dark interior)\n- Surrounding vegetation: grass, shrubs, and small plants growing nearby\n- Background: residential setting with houses, fences, and mature trees\n\n### Reasonable Inferences\n- **From decay pattern**: This log is decomposing naturally, breaking down over time and creating space inside—*inference: organisms (insects, fungi, microbes) are actively breaking down the wood structure*.\n- **From surrounding vegetation**: Small plants are thriving near the decaying log—*inference: the decomposing wood provides nutrients to the soil that support new plant growth*.\n- **From hollow interior**: The cavity suggests the log once supported weight and structure, but material has been removed—*inference: this space could shelter small animals or organisms*.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\n**\"Build a Home for Bugs in a Decaying Log\"**\n\nImagine you find a hollow log like this one. Your challenge: **Design and build a safe home where small bugs can live.** You can use sticks, leaves, bark pieces, soil, and small twigs to create rooms and spaces inside a paper tube or cardboard roll. Make sure your bug home has:\n- At least one opening for bugs to get in and out\n- Layers or hiding spots inside\n- A way to keep it from falling apart\n\nTest your design by gently shaking it—does it stay together?\n\n---\n\n**3-5 Version:**\n**\"Engineer a Decomposition Chamber to Speed Up Wood Breakdown\"**\n\nThis log is slowly rotting due to natural decomposition. Your challenge: **Design a container or structure that speeds up how fast wood breaks down while keeping moisture and organisms inside.**\n\n**Constraints:**\n- Use only classroom materials (no chemicals)\n- Your chamber must allow air to enter (organisms need oxygen)\n- It must retain moisture (decomposition requires water)\n- It must fit in a 12\" × 12\" space\n- Test it for 2 weeks and measure wood mass before and after\n\n**Success Criteria:**\n- Chamber holds layers of wood pieces and soil without falling apart\n- Temperature inside stays warmer than room temperature (use a thermometer)\n- Wood shows visible decay or softening after 2 weeks\n- Moisture is visible but not dripping out\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThe decaying log is a *real environmental phenomenon* that naturally raises questions: \"Why is the log hollow?\" \"What's breaking it down?\" \"Could we help it decompose faster?\" Students identify the problem of slow decomposition before designing solutions, making this phase foundational. The photo shows a need (accelerating nutrient cycling) rather than a finished solution, perfect for problem-scoping.\n\n---\n\n### Suggested Materials\n\n1. **Paper towel tubes or cardboard rolls** (chamber structure)\n2. **Soil, wood chips, and small bark pieces** (organic matter to decompose)\n3. **Spray bottle** (moisture control)\n4. **Thermometer** (temperature monitoring, 3-5 only)\n5. **Mesh or cheesecloth** (air circulation while containing materials)\n6. **Newspaper or cardboard** (layering and structure)\n\n---\n\n### Estimated Time\n\n- **K-2**: 30-45 minutes (single session: design, build, test)\n- **3-5**: Two 20-30 minute sessions over 2 weeks (setup + observation, then data collection and analysis)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K-LS1-1 and 3-LS1-1** (organism structures support life functions) and **ETS1-1** (defining engineering problems based on real-world constraints like decomposition rates and material properties).",
  "inputTokens": 2195,
  "outputTokens": 900,
  "cost": 0.0066949999999999996,
  "generatedAt": "2026-02-10T18:51:04.066Z"
}