{
  "title": "Orb Weaver",
  "category": "life-science",
  "imageFile": "orb_weaver.jpg",
  "imagePath": "images/life-science/orb_weaver.jpg",
  "content": "# NGSS Engineering Design Challenge: Orb Weaver Spider\n\n### Visible Elements in Photo\n- An orb weaver spider (brown/tan coloring, long legs with dark markings)\n- A human hand holding the spider\n- Long, thin spider legs extending outward\n- Blurred green background (natural outdoor setting)\n- Spider's small body relative to leg span\n\n### Reasonable Inferences\n- **From spider's long, thin legs + natural setting**: The spider needs to move quickly across surfaces and climb to build webs in elevated locations; lightweight leg structure allows this.\n- **From orb weaver body type**: This spider builds intricate webs to catch flying insects, so its legs must be precise enough to weave and maintain delicate structures.\n- **From hand placement**: Spiders are small but resilient creatures; any structure they build must work despite environmental forces (wind, rain, moving objects).\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nYour classroom has a friendly spider that needs a safe web-building spot! Design and build a \"web frame\" using string and craft sticks that the spider could use to stretch its web. Your frame should:\n- Hold up on its own (not fall over)\n- Have corners or edges where a spider's web could attach\n- Be bigger than your hand but small enough to fit on a shelf\n\n**3-5 Version:**\nOrb weaver spiders must build webs that can catch flying insects while surviving wind and rain. Design a lightweight frame structure (using only string, straws, popsicle sticks, or dowels) that mimics the support points of a natural orb web. Your design must:\n- Support a web span of at least 20 cm across its widest point\n- Withstand a gentle tug (10 N force) without collapsing\n- Use only 5 pieces of building material (frame supports only—string doesn't count)\n- Allow at least 4 attachment points for \"web threads\" (string)\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real organism in nature with no visible engineering solution yet. Students must observe the spider's structure and infer *why* a web-building support system matters (catching food, surviving weather, efficient geometry). This naturally launches the \"Ask\" phase: *\"What does a spider need to build a successful web, and how can we create a structure that helps?\"*\n\n---\n\n### Suggested Materials\n- Popsicle sticks or wooden dowels (3–4 mm diameter)\n- Cotton string or yarn\n- Tape (masking or painter's tape)\n- Straws (plastic or paper)\n- Hot glue gun (teacher-supervised) or craft glue\n\n---\n\n### Estimated Time\n- **K-2**: 40–50 minutes (15 min. discussion + building, 10 min. testing/display)\n- **3-5**: Two 40-minute sessions (Session 1: design sketch, material selection, building; Session 2: testing with force application, iteration, reflection)\n\n---\n\n### Why This Works for Teachers\nThis task directly aligns with **NGSS 3-5-ETS1-1** (*Ask questions to clarify design problem*) and **K-2-ETS1-1** (*Ask questions to improve designs*) by asking students to observe a real organism, identify its structural needs, and prototype a human-made solution inspired by nature.",
  "inputTokens": 1806,
  "outputTokens": 780,
  "cost": 0.005706,
  "generatedAt": "2026-02-09T13:36:18.218Z"
}