{
  "title": "Owl",
  "category": "life-science",
  "gradeLevel": "kindergarten",
  "questions": [
    {
      "questionText": "What special body parts does this owl have that help it find food?",
      "bloomsLevel": "Identify",
      "dokLevel": 1,
      "rubric": {
        "exceeds": "Student identifies three or more owl body parts (big eyes, pointed ears, sharp beak) and explains how each helps the owl hunt or find food with specific details (e.g., big eyes see in the dark, sharp beak catches food).",
        "meets": "Student identifies two owl body parts that help it find food and provides a simple explanation of how each part helps (e.g., big eyes to see, sharp beak to catch).",
        "approaching": "Student identifies one or two owl body parts but provides limited or incomplete explanations of how they help find food; may describe the part without connecting it to hunting.",
        "beginning": "Student names one body part with vague or missing explanation, or gives an inaccurate response about how owl body parts help find food."
      }
    },
    {
      "questionText": "Why do you think the owl's feathers are brown and gray instead of bright colors like a parrot?",
      "bloomsLevel": "Infer",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that brown and gray feathers help the owl hide or blend in with its surroundings and makes a connection to survival (e.g., so predators can't see it, or so it can sneak up on prey).",
        "meets": "Student correctly explains that the owl's brown and gray feathers help it blend in or hide, showing understanding of camouflage as a protective feature.",
        "approaching": "Student attempts to explain why the owl has these colors but the reasoning is incomplete or partially unclear (e.g., mentions hiding but doesn't fully explain why that matters).",
        "beginning": "Student provides a vague answer or one without clear connection to camouflage or blending in (e.g., just says the colors look nice, or that owls are brown)."
      }
    },
    {
      "questionText": "If this owl moved to a green forest, would its gray and brown feathers still help it hide? Why or why not?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student correctly answers that the feathers would not work as well, explains that green and brown colors don't match a green forest, and may extend thinking to how different environments require different colored camouflage.",
        "meets": "Student correctly answers that the gray and brown feathers would not hide the owl as well in a green forest and provides a basic explanation comparing the owl's color to the forest color.",
        "approaching": "Student attempts to answer whether the feathers would help but reasoning is incomplete or partially incorrect (e.g., says they won't help but gives unclear reasoning, or shows mixed understanding).",
        "beginning": "Student gives an inaccurate answer, provides little to no explanation, or shows minimal understanding that color matters for hiding in different places."
      }
    },
    {
      "questionText": "What else do you think this owl needs besides its special body parts to stay alive?",
      "bloomsLevel": "Infer",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student identifies three or more basic needs (food/prey, water, shelter/place to rest, air) with age-appropriate explanations of why each is necessary for the owl to survive.",
        "meets": "Student identifies two basic needs the owl requires to stay alive (such as food, water, shelter, or a safe place to live) and provides simple explanations for each.",
        "approaching": "Student identifies one or two needs but explanations are vague or incomplete; may list items without explaining why the owl needs them to survive.",
        "beginning": "Student provides a vague or minimal answer with little explanation; may name something that isn't actually necessary for survival, or give an unclear response."
      }
    }
  ],
  "generatedAt": "2026-02-15T06:30:15.588Z",
  "cost": 0.005429
}