{
  "title": "Owl",
  "category": "life-science",
  "gradeLevel": "first-grade",
  "questions": [
    {
      "questionText": "Why do you think the owl's feathers are brown and gray instead of bright colors like a parrot?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that brown and gray feathers help the owl hide or blend in with trees and rocks, and connects this to camouflage keeping the owl safe from danger or helping it hunt.",
        "meets": "Student identifies that the owl's brown and gray feathers help it blend in or hide in its surroundings, showing understanding of camouflage.",
        "approaching": "Student mentions that the owl's feathers are brown and gray for hiding or blending, but the explanation is vague or incomplete.",
        "beginning": "Student makes a simple observation about the feather colors or provides an answer with little connection to camouflage or survival."
      }
    },
    {
      "questionText": "If you were designing a hiding place for an owl, what materials would you use to help it blend in, and why?",
      "bloomsLevel": "Create",
      "dokLevel": 3,
      "rubric": {
        "exceeds": "Student selects multiple specific natural materials (bark, branches, leaves, rocks) and explains how each matches the owl's brown and gray coloring to provide camouflage, demonstrating detailed understanding of how colors help animals hide.",
        "meets": "Student chooses at least one appropriate natural material (bark, branches, or rocks) and explains how its color would help the owl blend in and hide.",
        "approaching": "Student suggests a material that could provide hiding but gives limited or incomplete reasoning about how the owl's colors match the material.",
        "beginning": "Student names a material for a hiding place but provides minimal or unclear explanation of how it helps the owl hide."
      }
    },
    {
      "questionText": "How are baby owls similar to their parents, and how might they be different?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student identifies multiple similarities (feathers, ear tufts, body shape, eyes) and differences (size, feather patterns may be more spotted, or behavior changes as they grow), showing understanding of how young animals resemble but differ from adults.",
        "meets": "Student describes at least one clear similarity and one difference between baby and adult owls, such as similar body shape but different size.",
        "approaching": "Student identifies either similarities or differences but not both, or explanations lack specific details about owl features.",
        "beginning": "Student provides a vague answer about baby and adult owls with minimal accurate comparisons."
      }
    },
    {
      "questionText": "What problems would an owl have if its feathers were bright red or blue instead of brown and gray?",
      "bloomsLevel": "Analyze",
      "dokLevel": 2,
      "rubric": {
        "exceeds": "Student explains that bright colors would make the owl easy to see and find, preventing it from hiding from danger or sneaking up on prey, demonstrating deep understanding of how camouflage helps animals survive.",
        "meets": "Student identifies that bright red or blue feathers would make the owl visible and harder to hide, which could be unsafe or make hunting difficult.",
        "approaching": "Student mentions that bright colors would be visible or noticeable but provides incomplete reasoning about how this affects the owl's survival or hunting.",
        "beginning": "Student acknowledges bright colors would be different but provides minimal explanation of the problems this would cause."
      }
    }
  ],
  "generatedAt": "2026-02-15T06:30:23.102Z",
  "cost": 0.004923
}