{
  "title": "Pelican",
  "category": "life-science",
  "imageFile": "pelican.jpeg",
  "imagePath": "images/life-science/pelican.jpeg",
  "content": "# NGSS Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- A pelican with a long, pointed beak perched on a rock\n- Water in the background (ocean or bay setting)\n- The bird's streamlined body and folded wings\n- A distinctive pouch visible below the beak\n- The rock serving as a resting platform\n\n### Reasonable Inferences\n\n- **Long beak + water setting**: The pelican uses its beak to catch fish from water, so it needs a tool designed for reaching into and gripping slippery objects underwater.\n- **Pouch structure**: The pelican has a specialized pouch that likely helps scoop, hold, or drain water while catching prey—suggesting a container design problem.\n- **Rock perch**: The bird needs stable resting places between hunting trips, implying the need for platforms that won't tip or collapse under weight and motion.\n\n### Engineering Task\n\n**K-2 Version:**\n*Design a fishing scoop for a pelican.* Make a tool using a stick, string, and a cup or net that can scoop up small objects (like foam balls or pom-poms) from a water table. Your scoop must hold at least 5 small objects at once and not spill them when you lift it out of the water. Test it and make it better if it doesn't work the first time.\n\n**3-5 Version:**\n*Design a fish-catching tool inspired by the pelican's beak and pouch.* Using a paper cup, dowel, and netting material, engineer a scoop that can:\n- Reach at least 12 inches into a container of water\n- Capture and hold at least 8 small objects (representing fish) without losing them\n- Drain water effectively when lifted from the water\n- Remain structurally sound through at least 10 repeated scooping cycles\n\nTest your prototype, measure results, and redesign one component to improve performance.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This phase fits best because the photo shows a real animal solving a real survival need (catching food from water). Students observe the problem the pelican faces and design a solution, rather than being handed a problem statement. They must identify *why* the beak and pouch shapes matter before building.\n\n### Suggested Materials\n\n- Paper cups or plastic cups (for pouch structure)\n- Wooden dowels or pencils (for beak/handle)\n- Netting, cheesecloth, or mesh fabric (for filtering and holding)\n- String or rubber bands (for assembly)\n- Small foam balls, pom-poms, or craft beads (to represent fish)\n- Water table, large container, or bucket\n\n### Estimated Time\n\n**45–60 minutes** (one extended session or two 30-minute sessions: 15 min for design/build, 30 min for testing and redesign)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (*Define a simple design problem reflecting a need or a want*) by anchoring the engineering challenge in observable animal behavior, making the \"need\" tangible and biologically relevant rather than abstract.",
  "inputTokens": 2331,
  "outputTokens": 717,
  "cost": 0.005916,
  "generatedAt": "2026-02-09T13:21:32.946Z"
}