{
  "title": "Bell Pepper",
  "category": "life-science",
  "imageFile": "pepper.jpeg",
  "imagePath": "images/life-science/pepper.jpeg",
  "content": "# Engineering Design Challenge: Green Pepper Structure\n\n### Visible Elements in Photo\n\n- A green bell pepper, cut in half lengthwise\n- Interior cavity with visible seeds and pale yellow-white seed core (placenta)\n- Thick, textured green outer walls\n- Red surface beneath the pepper (work surface)\n- Water droplets on the pepper's exterior\n\n### Reasonable Inferences\n\n- **From the hollow interior and thick walls**: The pepper's structure protects seeds inside while the walls provide strength and flexibility—a natural design for keeping contents safe during transport and growth.\n- **From the seed arrangement**: Seeds are clustered in the center on a central core, suggesting an efficient packing system that minimizes wasted space.\n- **From the water droplets**: The pepper's waxy exterior sheds water, implying it is designed to protect the interior from excess moisture.\n\n### Engineering Task\n\n**K-2: Build a Seed Keeper**\n\nYour job is to build a container that holds small items (like beads or dried beans) safely inside, just like a pepper keeps its seeds safe. Your container must:\n- Have thick walls that don't break easily\n- Have a space inside to hold things\n- Keep the things inside from falling out\n\nYou can use paper, clay, or foam. Test it by shaking it gently—do your items stay put?\n\n---\n\n**3-5: Design a Protective Seed Pod**\n\nDesign and build a model seed pod that mimics the pepper's protective function. Your design must:\n- Protect 10–15 small seeds (beads, peas, or dried beans) from falling out when dropped from 1 meter\n- Use only natural or recycled materials (paper, clay, leaves, or plant fibers)\n- Have walls at least 1 cm thick\n- Fit the total mass of seeds plus structure within 150 grams\n- Allow the pod to be opened and closed at least 3 times without tearing\n\nTest your design by dropping it and counting how many \"seeds\" remain inside. Redesign if more than 2 seeds escape.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo works best for the *Ask* phase because students observe a natural structure solving a specific problem (protecting seeds) and must first articulate what challenge the pepper \"solves\" before designing their own solution. The visible interior naturally prompts questions like \"Why are the walls thick?\" and \"How does it keep seeds safe?\"—core to problem definition.\n\n### Suggested Materials\n\n- Air-dry clay or modeling clay\n- Recycled paper, newspaper, or paper towels\n- Small dried beans, beads, or peas (for \"seeds\")\n- Tape (masking or clear)\n- Leaves, plant stems, or raffia (optional, for natural materials)\n- Rulers and safety scissors\n\n### Estimated Time\n\n- **K-2**: 45–60 minutes (one session with materials prep and testing)\n- **3-5**: 90–120 minutes across two sessions (design and sketch in session 1; build and test in session 2; redesign optional)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining and delimiting engineering problems) by asking students to identify how a real biological structure solves a design challenge, then reverse-engineer a solution using measurable constraints tied to the pepper's observable features.",
  "inputTokens": 2330,
  "outputTokens": 760,
  "cost": 0.00613,
  "generatedAt": "2026-02-09T13:21:44.938Z"
}