{
  "title": "Plant Reproduction",
  "category": "life-science",
  "imageFile": "plant_reproduction.jpg",
  "imagePath": "images/life-science/plant_reproduction.jpg",
  "content": "# Engineering Design Challenge: Squash Seed Dispersal\n\n### Visible Elements in Photo\n- Two halved squash or pumpkin specimens showing internal structure\n- Visible seed cavity (the large central opening)\n- Fibrous, string-like seed matrix surrounding the cavity\n- Green skin/rind on exterior\n- Concrete surface and grass visible in background context\n\n### Reasonable Inferences\n- **From seed cavity & fibrous structure**: Seeds are housed in a protective, cushioned chamber designed to keep them intact until dispersal is needed.\n- **From the split/open halves**: The fruit naturally splits or rots to release seeds—this is the organism's strategy for spreading offspring to new locations.\n- **From two identical specimens**: Seed dispersal is a repeatable, reliable biological process, suggesting an engineered solution (not random).\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nYour squash plant grew lots of seeds inside a big fruit. But the seeds are stuck inside! Design a **seed shaker** using a paper cup, string, and dried beans (or rice) to show how seeds can rattle loose and fall out when you shake it. Can you make it so the seeds drop out when you tip it upside down? Test it 5 times.\n\n**3-5 Version:**\nA squash plant's seeds are protected inside a fibrous cavity until the fruit decays or splits. Design a **seed-release container** using a paper or plastic cup with a removable lid and dried beans as model seeds. Your container must:\n- Hold at least 20 beans without leaking\n- Release all seeds within 10 seconds when tilted 45 degrees\n- Be made from only paper, plastic, string, and tape (no glue)\n- Allow seeds to roll, not fall straight down\n\nTest your design 3 times. Which shape (round hole, slot, or flaps) releases seeds fastest without jamming?\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo naturally leads to identifying a *need*: \"How does the plant get its seeds out into the world?\" Students observe the seed cavity and infer a dispersal challenge. Rather than showing a solution already built, the halved fruit prompts students to ask questions about *why* seeds are packaged this way and *how* they escape—making this an ideal entry point for problem definition before imagining solutions.\n\n---\n\n### Suggested Materials\n- Paper or plastic cups (various sizes)\n- Dried beans, lentils, or uncooked rice (model seeds)\n- Tape and string\n- Scissors\n- Optional: paper towel tubes, plastic bags, small wooden dowels\n\n---\n\n### Estimated Time\n**K-2**: 25–35 minutes (design + 5 test trials)  \n**3-5**: 45–60 minutes (design + planning sketch + 3 test cycles + redesign discussion)\n\n---\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS K-LS1-1 / 2-LS2-1** (*life cycles and plant reproduction*) and **3-5-ETS1-1** (*defining engineering problems based on criteria and constraints*) by having students engineer a solution to a real biological challenge: seed dispersal.",
  "inputTokens": 2328,
  "outputTokens": 736,
  "cost": 0.0060079999999999995,
  "generatedAt": "2026-02-09T13:43:45.276Z"
}