{
  "title": "Praying Mantis",
  "category": "life-science",
  "imageFile": "praying_mantis.jpg",
  "imagePath": "images/life-science/praying_mantis.jpg",
  "content": "# Engineering Design Process Challenge\n\n### Visible Elements in Photo\n\n- A praying mantis (green, elongated body with distinctive raptorial front legs bent at a sharp angle)\n- Magenta and yellow flowers (blurred in background but visible as landing spots)\n- Green plant stems and foliage surrounding the mantis\n- A dark insect (possibly a bee or wasp) near the flowers in the background\n- The mantis positioned on a thin plant stem, elevated above the flower cluster\n\n### Reasonable Inferences\n\n- **From the mantis's posture and location**: The mantis is a predator that hunts other insects by remaining still on plants, then striking with its front legs—this suggests it needs a body design optimized for stealth, gripping, and rapid movement.\n- **From the flower and insect proximity**: The mantis hunts insects attracted to flowers, so it positions itself along pollinator flight paths—this implies predator-prey interaction and the need for camouflage or strategic positioning.\n- **From the spiky leg texture visible**: The mantis's legs have spines and rough surfaces that help it grip prey and plant material—indicating that surface texture matters for function.\n\n---\n\n### Engineering Task\n\n#### **K–2 Version**\n**\"Build a Bug Trap for the Mantis\"**\n\nYour job: Design a trap that will catch small bugs so the mantis has food. Use pipe cleaners, sticks, and string to build a sticky web or cage that insects can land on but cannot escape. Test it by rolling a marble (the bug) toward it—can your trap stop it? Make it green so it blends in with plants!\n\n---\n\n#### **3–5 Version**\n**\"Design a Hunting Perch for a Praying Mantis\"**\n\nThe praying mantis is a hunter. It needs a perch (a place to stand) that:\n- Is **at least 15 cm tall** so the mantis can see insects coming\n- Has a **textured surface** (bumpy or sticky) so the mantis's legs can grip it\n- Allows the mantis to **strike in at least 3 different directions** without falling\n- Can support a **weight of 200 grams** (a small toy) without bending more than 1 cm\n\nBuild your perch using craft sticks, foam, and sandpaper or textured tape. Test it by placing the weight on top and measuring how much it bends. Does it meet all four criteria?\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real creature in nature with a clear survival need (finding food and staying safe while hunting). Students start by observing *what* the mantis does and *why* it needs a special body and position—this natural need drives the engineering challenge. The problem comes from nature, not from a pre-built solution, so the task launches with curiosity and observation first.\n\n---\n\n### Suggested Materials\n\n- **Craft sticks or dowels** (for building the perch frame)\n- **Sandpaper, textured tape, or velcro** (to add grip for the mantis's legs)\n- **Pipe cleaners or twine** (to secure joints and add flexible grip surfaces)\n- **Foam blocks or foam sheet** (lightweight building base; easier to construct with than wood)\n- **Ruler and small weights** (200g toy, book, or bean bag to test structural load)\n\n---\n\n### Estimated Time\n\n**Two 30–40 minute sessions**\n- Session 1: Observe the photo, list what the mantis needs, sketch designs (15 min), build the perch (25 min)\n- Session 2: Test the perch against the four criteria, measure, and adjust (30–40 min)\n\n(Can be compressed to one 60-minute block for experienced 4–5 graders; K–2 works best with a single 30-minute hands-on build.)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K.ETS1.1** (asking questions about the world) and **3.ETS1.1** (defining engineering problems from observations), because it anchors the design challenge in real animal behavior and structural needs visible in the photograph, making the engineering problem authentic and observable.",
  "inputTokens": 2330,
  "outputTokens": 972,
  "cost": 0.00719,
  "generatedAt": "2026-02-09T13:39:22.637Z"
}