{
  "title": "Praying Mantis",
  "category": "life-science",
  "imageFile": "praying_mantis.jpg",
  "imagePath": "images/life-science/praying_mantis.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: A Praying Mantis in the Garden\n\n### Core Science Concepts from Image Analysis\n\n- **Animal body parts and their functions:** The praying mantis has distinctive legs, eyes, and front limbs (raptorial legs) that help it survive and hunt for food in its environment.\n- **Animal needs for survival:** The mantis is shown near flowering plants, illustrating how animals need food, water, and shelter in their habitats to stay alive.\n- **Camouflage and adaptation:** The mantis's green color blends with the plants around it, helping it hide and survive by catching prey undetected.\n- **Habitat relationships:** The image shows the mantis in an environment with plants and flowers, demonstrating how animals depend on their surroundings to meet their survival needs.\n\n### Lesson Title\n\nWhat Do Praying Mantises Need to Live?\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 30-minute sessions (or one 60-minute block)\n- **NGSS Standards:** K-LS1-1\n\n### Learning Objectives\n\nStudents will be able to:\n- Use observations of the praying mantis to identify what animals need to survive (food, water, shelter, air).\n- Describe the body parts of a praying mantis and explain what each part helps the animal do.\n- Explain how the praying mantis's green color helps it survive in its garden habitat.\n- Make a simple drawing or model showing where a praying mantis would find what it needs to live.\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student interest and activate prior knowledge about animals and survival needs using the praying mantis photograph.\n\n- **Materials:** \n  - Printed or projected photograph of the praying mantis on flowers\n  - Chart paper and markers\n  - Pointer or stick\n\n- **Activity:**\n  Display the photograph on the board or project it on a screen. Ask students to sit in a circle where they can all see clearly. Point to the praying mantis without identifying it yet. Use these discussion questions to spark curiosity:\n  \n  1. \"What do you see in this picture? Can you describe this animal to a friend?\" (Allow 2-3 student responses; they may call it a \"stick bug\" or \"grasshopper.\")\n  2. \"Look at its front legs—what does it look like the animal is doing? Why do you think it holds its legs that way?\" (Accept creative answers: \"It looks like it's praying!\" \"It's reaching for something!\" \"It's holding the flowers!\")\n  3. \"This animal is called a praying mantis. What do you think it needs to live happy and healthy, just like you need food, water, and a home?\" (Record student ideas on chart paper as a web or list.)\n  4. \"Why do you think the mantis is green, like the plant it's sitting on? Can you think of any reasons?\" (Lead them toward the idea that green color helps it hide.)\n\n- **Transition:** \"Today, we're going to be bug detectives and discover exactly what a praying mantis needs to survive in its garden home!\"\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate and discover what animals need to survive by exploring the mantis photograph and creating their own habitat.\n\n- **Materials:**\n  - Photograph of the praying mantis (printed copies, one per pair)\n  - Small plastic containers or shoe boxes (one per small group)\n  - Soil or sand\n  - Dried flowers, leaves, twigs, and grass clippings\n  - Small plastic insects or toy mantis (optional)\n  - Hand lenses or magnifying glasses\n  - Observation worksheet (with simple pictures and checkboxes—see below)\n  - Crayons or colored pencils\n\n- **Activity:**\n\n  **Part A: Photograph Exploration (10 minutes)**\n  \n  Pair students and give each pair a printed copy of the mantis photograph. Provide hand lenses if available. Guide students with these prompts:\n  \n  - \"Look very carefully at the picture. Point to where you think the mantis finds food.\" (Students should point to the flowers and insects in the photo.)\n  - \"Where is the water in this picture?\" (Guide them to notice the moisture on the plants, the moist garden environment.)\n  - \"Where is the mantis's shelter or home? Where could it hide?\" (Point out the plants, stems, flowers.)\n  - \"Does the mantis have air to breathe here?\" (Yes—it's outside in the open garden.)\n  \n  As students observe, they check off boxes on an observation worksheet with pictures representing: food (insects, flowers), water (rain drops, wet soil), shelter (plants, leaves), and air (sky/outside).\n\n  **Part B: Habitat Building (10-15 minutes)**\n  \n  Organize students into small groups (3-4 students per group). Give each group a container and natural materials. Explain:\n  \n  \"Now you're going to build a mantis home using what you see in the picture! Use the soil, plants, leaves, and twigs to make a place where a praying mantis could live. Make sure your home has:\n  - **Food** (where insects might hide)\n  - **Shelter** (a place to hide and rest)\n  - **Water** (spray a little water on the soil)\n  - **Air** (leave it open to the outside)\"\n  \n  Students work together to arrange materials. They may place a toy mantis or drawing of one in their habitat if available.\n\n- **Teacher Role:** \n  Circulate among groups. Ask guiding questions: \"Where is your mantis hiding?\" \"What would it eat here?\" \"Does it have water?\" Do NOT tell students what to do; instead, ask questions that help them think about survival needs. Take photos of completed habitats for later reflection.\n\n- **Expected Student Outcomes:** \n  Students create a simple habitat that includes elements supporting survival (plants for shelter and as a resting place near insects, moist soil, open space for air). They can articulate (verbally or through drawings) at least two needs the mantis has.\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Introduce formal vocabulary and scientific concepts about animal survival needs after exploration.\n\n- **Materials:**\n  - Chart paper with the four survival needs\n  - Large, labeled pictures of mantis body parts\n  - Video clip (optional, 2-3 minutes): \"Life of a Praying Mantis\" or still images showing mantis eating, in plants, drinking\n  - Vocabulary cards with pictures\n\n- **Activity:**\n\n  **Group Share-Out (5 minutes)**\n  \n  Invite 2-3 groups to show their habitats to the class. Ask: \"What did you put in your mantis home? Why?\" As each group shares, write their ideas on the chart under the heading \"What Animals Need to Survive.\"\n\n  **Vocabulary Introduction (7 minutes)**\n  \n  Introduce and define these terms using the photograph and student-built habitats as references:\n  \n  - **Shelter:** A safe place where an animal can hide, rest, and stay safe from danger. (Point to plants in the photo.)\n  - **Food:** What an animal eats to grow and have energy. (Show insects and flowers in the photo.)\n  - **Water:** A liquid that all animals need to drink to stay alive and healthy. (Gesture to moisture on plants.)\n  - **Habitat:** The place where an animal lives—it has everything the animal needs. (The flower garden in the photo.)\n\n  **Mantis Body Parts Connection (5-8 minutes)**\n  \n  Show labeled pictures or use the photograph to point out:\n  \n  - **Eyes:** Help the mantis see insects moving so it can hunt for food.\n  - **Front legs (raptorial legs):** Special folded legs that help catch and grab insects for food—like a hunter's trap!\n  - **Body color (green):** Helps the mantis hide in plants so other animals don't see it, and so it can surprise insects. This is called **camouflage**.\n  \n  Demonstrate the raptorial leg position: Fold your own arms like the mantis's front legs to show students how it holds them.\n\n- **Vocabulary:**\n  - **Shelter:** A safe home where an animal can hide and rest.\n  - **Food:** What animals eat to grow strong and stay alive.\n  - **Water:** A liquid that animals drink to stay healthy.\n  - **Habitat:** The place where an animal lives that has everything it needs.\n  - **Camouflage:** Colors or patterns on an animal's body that help it hide in its environment.\n\n- **Check for Understanding:** \n  Ask individual students: \"Point to the mantis's eyes and tell me what they do.\" \"Why is the mantis green?\" \"What does the mantis eat?\" Listen for their use of vocabulary and concepts.\n\n- **Expected Student Outcomes:** \n  Students understand that all animals need shelter, food, water, and air to survive. They can identify basic body parts of the mantis and explain one function (e.g., \"The legs catch bugs for food.\"). They recognize that the mantis's green color helps it hide in plants.\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Students apply and deepen understanding by exploring how different animals have different survival needs and how the mantis's adaptations help it survive.\n\n- **Materials:**\n  - Pictures of 2-3 other garden animals (butterfly, bird, bee, ladybug)\n  - Comparison chart with mantis (with pictures and words)\n  - Magazine clippings or printed images of animals\n  - Scissors, glue, and poster board (optional for advanced activity)\n  - \"Animal Survival\" sorting game with cards\n\n- **Activity:**\n\n  **Option A: Animal Comparison (for whole group or small group)**\n  \n  Show pictures of other garden animals (butterfly, bee, ladybug, bird). Ask:\n  - \"Does a butterfly need the same things a mantis needs?\"\n  - \"Where does a bee find its shelter?\"\n  - \"Do all these animals live in the same habitat?\"\n  \n  Create a simple chart on the board comparing 2-3 animals. Use pictures and single words (e.g., Mantis: shelter=plant, food=insects; Bee: shelter=hive, food=flowers).\n  \n  Guide students to the idea that all animals need food, water, shelter, and air, but different animals find these things in different places based on their body parts and abilities.\n\n  **Option B: Mantis Adaptation Hunt**\n  \n  Give students a \"Detective Sheet\" with simple drawings and checkboxes:\n  - ☐ The mantis is **green** so it can hide in green plants.\n  - ☐ The mantis has **big eyes** so it can see insects moving.\n  - ☐ The mantis has **strong front legs** to catch insects.\n  - ☐ The mantis lives on **flowers and plants** where insects visit.\n  \n  As you review the photograph again, students check off each adaptation as you discuss how it helps the mantis survive. Discuss: \"All of these things work together to make the praying mantis a great hunter!\"\n\n  **Option C: Create a Mantis Survival Poster**\n  \n  Provide large paper divided into 4 sections labeled: Food, Shelter, Water, and Air. Students draw or glue pictures showing where the mantis finds each thing. Display in the classroom.\n\n- **Teacher Role:** \n  Facilitate discussion without leading to one \"correct\" answer. Validate student thinking: \"You noticed that the mantis's legs help it catch food—that's an important adaptation!\"\n\n- **Expected Student Outcomes:** \n  Students recognize that the mantis's special features (color, legs, eyes) help it survive in its garden habitat. They can explain one or two ways the mantis is adapted to its environment. They begin to understand that different animals have different survival strategies.\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of animal survival needs and the praying mantis habitat.\n\n- **Activity:**\n\n  **Formative Assessment Throughout Lesson:**\n  \n  - Observe students during Explore: Are they identifying the four survival needs when building habitats?\n  - Listen during Explain: Can they use vocabulary words correctly (shelter, food, water, habitat)?\n  - Monitor during Elaborate: Do they recognize connections between mantis adaptations and survival?\n\n  **Exit Ticket (Summative Assessment):**\n  \n  Use this simple 1-2 minute assessment at the end of the lesson. You may use drawings, verbal responses, or both.\n  \n  **For students who can draw/write:**\n  - Show the praying mantis photograph again. Ask: \"Draw or write: What does a praying mantis need to survive?\" (Expect pictures or words showing: food, shelter, water, plants, or hiding places.)\n  \n  **For verbal response (teacher-led or peer partnership):**\n  - \"Tell me one thing a praying mantis needs to live. Why does it need that?\"\n  - \"Point to something in this picture that helps the mantis survive.\"\n  - \"What color is the mantis? Why is it that color?\"\n\n  **Success Criteria:**\n  - Student can identify at least **two** survival needs (food, shelter, water, air).\n  - Student can point to or name one body part or color of the mantis and explain why it helps the animal survive.\n  - Student demonstrates understanding through drawing, spoken words, or responses to questions.\n\n- **Expected Student Outcomes:** \n  Most students can identify that animals need food, shelter, and water. They understand that the mantis lives in a garden habitat (plants and flowers). They recognize that the mantis's green color and special legs help it survive. Advanced students may explain how adaptations work together for survival.\n\n### Differentiation\n\n- **Support (for struggling learners):**\n  1. **Simplified Vocabulary:** Use only two survival needs (food and shelter) instead of four. Use consistent, repeated language throughout the lesson.\n  2. **Visual Supports:** Provide large, laminated picture cards for shelter, food, water, and air. Let students point to or match pictures instead of speaking.\n  3. **Structured Habitat Building:** Provide a template or example habitat in a shoebox so students can copy and fill in materials. Use very tactile, safe materials (large leaves, plastic bugs, soil).\n  4. **Partner Pairing:** Pair struggling students with peer helpers during Explore and Elaborate phases.\n\n- **Challenge (for advanced learners):**\n  1. **Extended Observation:** Provide a live praying mantis (in a safe, well-maintained enclosure) for careful observation. Have students sketch the mantis and label body parts with descriptive words (spiky, folded, large, green).\n  2. **Research Extension:** Introduce the concept that mantises are \"predators\" and their prey are \"herbivores\" (very simply: \"The mantis eats bugs, and bugs eat plants\"). Have advanced students sort pictures of garden animals by what they eat.\n  3. **Habitat Complexity:** Challenge students to create a more detailed habitat including water (a small cup or damp soil), multiple shelter levels, and multiple food sources. Ask: \"How could you make a mantis home even better?\"\n  4. **Comparison Writing:** Have advanced students dictate or write 1-2 sentences comparing the mantis to another garden animal. Example: \"A bee needs flowers for food. A mantis needs insects for food. They both live in the garden.\"\n\n### Extension Activities\n\n1. **Garden Observation Walk:** If possible, take students on a guided nature walk around the school garden or local park. Have them look for insects, plants with water drops, and places where animals might hide. Create a simple checklist: \"We saw places where animals could find food/shelter/water.\" Discuss findings back in the classroom.\n\n2. **\"Feed the Mantis\" Sorting Game:** Create a simple sorting activity where students move picture cards of insects, flowers, soil, and other garden items into a \"Mantis Habitat\" container. Discuss which items help the mantis survive (insects as food, plants as shelter) and which do not.\n\n3. **Mantis Movement Activity:** Teach students the \"Praying Mantis Pose\" (standing with arms folded like the mantis's front legs). Have them practice moving slowly and carefully like a hunting mantis. Discuss: \"Why does the mantis move slowly and carefully?\" (To sneak up on insects without being noticed—camouflage in motion!)\n\n4. **Letter Home: \"My Mantis Discovery\":** Send home a simple worksheet where families draw or write one thing their child learned about what animals need to survive. Families can share a photo of their own garden or backyard and identify plants, shelter, or insects they see there.\n\n5. **Dramatic Play: \"Mantis in the Garden\":** Set up a dramatic play area with green fabric, plastic flowers, toy insects, and a toy or picture of a mantis. Students role-play as the mantis hunting, hiding, drinking water, and resting—acting out survival behaviors in an imaginative way.\n\n---\n\n**Teacher Notes:**\n\nThis lesson is designed to build foundational understanding that all animals have basic needs and that their habitats provide these needs. The praying mantis is an engaging example because of its distinctive appearance, predatory role, and visibility in gardens. Kindergarteners learn best through observation, hands-on exploration, and imaginative play, so multiple opportunities for building, observing, and moving are included. The vocabulary is intentionally simple and repeated throughout all five phases. If a live mantis is available (local nature centers often have them), showing students a real insect briefly during the Explain phase can deepen engagement, though the photograph alone is sufficient.",
  "inputTokens": 125,
  "outputTokens": 4145,
  "cost": 0.0274475,
  "generatedAt": "2026-02-13T04:25:04.297Z"
}