{
  "title": "Praying Mantis",
  "category": "life-science",
  "imageFile": "praying_mantis.jpg",
  "imagePath": "images/life-science/praying_mantis.jpg",
  "gradeLevel": "First Grade",
  "gradeLevelKey": "first-grade",
  "content": "### Core Science Concepts from Image Analysis\n\n- **External body parts and their functions:** The praying mantis has distinctive body structures (long legs, triangular head, large eyes, raptorial front legs) that help it survive and catch food in its habitat.\n- **Predator adaptations:** The mantis's camouflage coloring (green), positioning, and specialized front legs are adaptations that help it hunt insects and hide from predators.\n- **Animal behavior and survival:** The mantis's hunting posture and presence near flowers demonstrates how animals use behaviors and body structures to meet their needs (finding food).\n- **Insect diversity and habitats:** The photograph shows an insect in a garden habitat among flowers and other organisms, illustrating where different animals live and find resources.\n\n---\n\n### Lesson Title\n\n**How Does the Praying Mantis Use Its Body to Survive?**\n\n---\n\n### Lesson Overview\n\n- **Grade Level:** 1st Grade\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 40-minute sessions (or four 20-minute mini-lessons spread across a week)\n- **NGSS Standards:** \n  - 1-LS1-1: Use materials to design a solution to a human problem by mimicking how plants and/or animals use their external parts to help them survive, grow, and meet their needs.\n\n---\n\n### Learning Objectives\n\nStudents will be able to:\n- Identify external body parts of a praying mantis and explain what each part helps the mantis do.\n- Describe how specific body parts help the mantis survive and find food.\n- Design a simple model or tool that mimics how the mantis uses its body parts to solve a problem.\n- Observe and record details about how animals use their bodies to survive in their habitats.\n\n---\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n**Objective:** Capture student interest and activate prior knowledge about animal body parts and how they help animals survive.\n\n**Materials:**\n- Praying mantis photograph (projected or printed for display)\n- Chart paper and markers\n- Student observation notebooks or paper\n\n**Activity:**\n\n1. **Display the photograph** on a large screen or print it for a classroom display. Allow students 30-60 seconds to look without talking.\n\n2. **Ask these specific discussion questions:**\n   - \"What animal do you see in this picture? What do you notice about the shape of its body?\"\n   - \"Look at the legs of this animal. How are they different from the legs on a grasshopper or a butterfly? What do you think those front legs are used for?\"\n   - \"Why do you think this animal is green? Where do you think it lives?\"\n   - \"If you were this insect, how would you catch food to eat? What would you use?\"\n\n3. **Prediction/Wonder Prompt:** \"This animal is called a praying mantis. I wonder... if you could give yourself one special body part from an animal to help you do something, what would it be and why? Turn to a partner and share your idea.\"\n\n4. **Collect responses** on chart paper under the heading \"What Body Parts Help Animals Survive?\"\n\n**Transition:** \"Today we're going to explore how the praying mantis's special body parts help it survive and hunt for food, just like you imagined. Then we'll design our own tool that works the same way!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n**Objective:** Students investigate how different body parts function by observing, manipulating models, and making predictions.\n\n**Materials:**\n- Pipe cleaners (green and brown, 4 per student)\n- Craft foam or paper cut into mantis body shapes (head, body, abdomen—pre-cut triangular/rectangular pieces)\n- Glue sticks and tape\n- Images of a praying mantis from different angles (side view, front view, top view showing the raptorial legs)\n- Student observation sheets with labeled diagrams of a mantis (optional)\n- Small objects to \"catch\" (pom-poms, craft foam squares, dried pasta pieces)\n- Shallow containers or paper plates to simulate plants/flowers\n\n**Activity:**\n\n1. **Introduce the task:** \"We're going to build a model praying mantis using materials. As you build, you'll discover how each body part helps the mantis survive.\"\n\n2. **Step-by-step student directions:**\n   - \"Fold two pipe cleaners in half to make the front legs of the mantis. These should look like they're ready to grab something. Bend them so they're flat and ready—like this!\" (Demonstrate the raptorial posture—front legs folded up and ready to strike.)\n   - \"Use two more pipe cleaners to make the back legs. These legs should help the mantis stand and balance. Make them straight and sturdy.\"\n   - \"Attach all four legs to your foam body piece using glue or tape. Make sure the front legs stick up and forward!\"\n   - \"Add a triangular foam head to the top of the body. This is where the mantis's big eyes are.\"\n   - \"Now, let's test your model! Place small objects (pom-poms) near your mantis. Can your front legs grab them? Move your mantis around. Can it balance on its back legs?\"\n\n3. **Connection to the photograph:** \"Look at the real mantis in the photograph. See how it's standing? See how its front legs are ready to grab? Your model works the same way!\"\n\n4. **What students should record:**\n   - Draw a picture of their mantis model in their science notebook.\n   - Write or dictate: \"My mantis's front legs help it _____. My mantis's back legs help it _____.\"\n   - Record how many insects they were able to \"catch\" with their model.\n\n**Teacher Role:**\n- Circulate and ask open-ended questions: \"What happens when you move those front legs? Why did you bend them that way? How does your mantis stay balanced?\"\n- Do NOT tell students the answer; instead, guide observation: \"Try moving the back legs. What do you notice?\"\n- Encourage students to test and refine their models.\n\n**Expected Student Outcomes:**\n- Students will build a functional model that demonstrates the mantis's body structure.\n- Students will discover through trial and error that the front legs are designed for grabbing and the back legs provide stability.\n- Students will make simple observations: \"The front legs are bent to catch bugs\" or \"The back legs help it stand.\"\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n**Objective:** Introduce formal vocabulary and connect observations to survival and adaptation concepts.\n\n**Materials:**\n- Chart paper with labeled diagram of praying mantis\n- Praying mantis photograph\n- Picture cards showing close-ups of mantis body parts (eyes, front legs, back legs, camouflage coloring)\n- Observation data from Explore phase\n\n**Activity:**\n\n1. **Group share-out:** Ask 3-4 volunteers to show their mantis models and explain what they discovered. Ask the class: \"What did you notice about the front legs? What did you notice about the back legs?\"\n\n2. **Teacher-led instruction** (Keep this brief and visual for 1st graders):\n   - \"The praying mantis is a hunter. It uses its special body parts to catch insects for food. Let's look at how each body part helps it survive.\"\n   - Point to the photograph and label each key part as you discuss it.\n\n3. **Key vocabulary with grade-appropriate definitions:**\n\n   - **External parts:** The outside parts of an animal's body that you can see (like legs, head, eyes, and wings).\n   - **Raptorial legs:** Special front legs that can fold up and grab things very quickly—the word \"raptorial\" means \"grasping\" or \"catching.\"\n   - **Camouflage:** The color and pattern of an animal's body that helps it hide in its environment so predators can't see it or prey doesn't see it coming.\n   - **Adaptation:** A special body part or behavior that helps an animal survive in its habitat.\n   - **Habitat:** The place where an animal lives, like a garden with flowers and plants.\n\n4. **Connections back to the photograph and Explore activity:**\n   - \"See in the picture? The mantis is green, just like the plants around it. That's camouflage! It helps the mantis hide while it waits for insects to come to the flowers.\"\n   - \"Your model showed us that those front legs are folded and ready. In the real world, when a bug gets close, the mantis strikes SO FAST—faster than you can blink! Those legs snap shut in a split second.\"\n   - \"The back legs and the way the mantis stands on the plant help it balance and stay still while it waits for food.\"\n\n5. **Check for understanding strategy:**\n   - Ask simple questions: \"If a mantis didn't have strong back legs, what might happen?\" (It might fall off the plant.)\n   - \"Why is it helpful that the mantis is green?\" (Insects don't see it coming.)\n   - \"What do the front legs do?\" (Catch insects.)\n\n**Vocabulary:**\n- **External parts:** The outside parts of an animal you can see (legs, head, eyes).\n- **Raptorial legs:** Front legs that fold and grab things very quickly.\n- **Camouflage:** Colors and patterns that help an animal hide in its environment.\n- **Adaptation:** A special body part or behavior that helps an animal survive.\n- **Habitat:** The place where an animal lives (like a garden).\n\n**Expected Student Outcomes:**\n- Students will use basic vocabulary to describe the mantis's body parts and their functions.\n- Students will understand that different body parts have different jobs.\n- Students will connect the idea that body parts help animals survive and meet their needs.\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n**Objective:** Students apply and deepen understanding by designing a tool that mimics the mantis's body parts to solve a human problem.\n\n**Materials:**\n- Craft materials (wooden spoons, foam cups, pipe cleaners, clothespins, popsicle sticks, rubber bands, tape, glue)\n- Small objects to \"pick up\" (cotton balls, pom-poms, small blocks, beads)\n- Challenge cards with problems (optional, see activity below)\n- Observation sheets for documenting designs\n\n**Activity:**\n\n1. **Set the context:** \"Now you're going to use what you learned about the mantis to design a tool that solves a problem. The mantis uses its raptorial legs to catch insects. What if we designed something that could pick up small objects the way the mantis picks up bugs?\"\n\n2. **Present the design challenge:**\n   - **Problem:** \"Can you build a grabber tool that can pick up small objects from a distance, just like a mantis catches insects?\"\n   - **Constraints:** Use only the materials provided; your tool must be able to pick up and hold at least three different objects (cotton ball, pom-pom, small block).\n\n3. **Step-by-step student directions:**\n   - \"Think about what the mantis's front legs do. They fold and grab. What materials could you use to make something that folds and grabs?\"\n   - \"Build your grabber tool. You can use clothespins (already fold like mantis legs!), pipe cleaners bent into a claw shape, or foam cups taped together.\"\n   - \"Test your tool. Can you pick up the objects? Did you succeed? What was hard? What worked well?\"\n   - \"Refine your design. If something didn't work, change it and try again.\"\n\n4. **Documentation:**\n   - Have students draw a picture of their grabber tool next to a picture of a mantis's front legs.\n   - Have them write or dictate: \"My tool works like the mantis's legs because _____.\"\n\n5. **Gallery walk or showcase:**\n   - Students show their tools to a partner or the class.\n   - Ask: \"How does this tool copy what the mantis does?\"\n\n**Teacher Role:**\n- Facilitate, not direct: \"What part of the mantis are you trying to copy? What material might work?\"\n- Encourage trial and error: \"That didn't work—what could you try next?\"\n- Celebrate multiple solutions: Different designs are all valid as long as they're inspired by the mantis.\n\n**Expected Student Outcomes:**\n- Students will design a functional tool inspired by mantis anatomy.\n- Students will articulate the connection between animal body parts and human-designed tools.\n- Students will demonstrate deeper understanding that external body parts have specific purposes that help animals survive.\n\n---\n\n#### 5. EVALUATE\n\n**Objective:** Assess student understanding of how praying mantis external body parts help it survive and their ability to apply this learning to a design challenge.\n\n**Activity:**\n\n**Formative assessment** (ongoing throughout the lesson):\n- Observe and listen during Explore phase: Can students explain what each leg does? Can they describe balance, grabbing, and stability?\n- Listen to explanations in Elaborate phase: Do students reference the mantis's body parts when describing their tool?\n- Look at drawings and models: Do they show understanding of external parts and their functions?\n\n**Exit Ticket / Summative Assessment** (Choose one or use both):\n\n**Option 1—Drawing and Dictation (works well for 1st grade):**\n- Show students the praying mantis photograph again.\n- Ask them to draw the mantis and label (or you label) one body part they learned about.\n- Dictate to the teacher or write/say: \"This body part helps the mantis _____ because _____.\"\n\n**Option 2—Sorting Activity:**\n- Provide picture cards of different animals and their body parts (bird wings, rabbit ears, fish fins, mantis front legs, mantis back legs, etc.).\n- Ask students to sort them into two groups: \"Parts that help animals catch food\" and \"Parts that help animals move and balance.\"\n- Listen for accurate reasoning.\n\n**Option 3—Think-Pair-Share:**\n- Ask: \"If a praying mantis didn't have strong back legs, would it be a good hunter? Why or why not?\"\n- Have students turn to a partner, discuss, and share with the class.\n\n**Success Criteria for Student Understanding:**\n- ✓ Student can identify at least two external body parts of the praying mantis.\n- ✓ Student can explain (in simple words) how at least one body part helps the mantis survive or catch food.\n- ✓ Student can describe one way their design tool is similar to the mantis's body.\n- ✓ Student demonstrates that they understand body parts have specific functions related to survival.\n\n**Expected Student Outcomes:**\n- Most students will be able to point to and name the mantis's front and back legs.\n- Most students will say something like: \"The front legs catch bugs\" or \"The back legs help it stand.\"\n- Students will show their designs with basic awareness that they're copying something the mantis does.\n- Advanced students will use vocabulary like \"camouflage\" and \"adaptation\" and explain multi-step cause-and-effect (e.g., \"The mantis is green so insects don't see it, and then it can catch them\").\n\n---\n\n### Differentiation\n\n**Support (for struggling learners):**\n1. **Simplified model building:** Pre-assemble the basic body shape of the mantis so the student only needs to attach legs. Focus on moving the legs and discovering their functions rather than construction.\n2. **Visual labels and sentence frames:** Provide a large labeled diagram of the mantis in the classroom. Use sentence frames for writing: \"The front legs help the mantis _____\" (choices: catch bugs, hide, run).\n3. **Peer partnerships:** Pair struggling learners with confident peers during Explore. The peer can model the process while the struggling learner participates in testing and refining.\n4. **Reduced design challenge:** For the Elaborate phase, pre-make two or three tool options and have the student choose which one works best and test it, rather than design from scratch. Focus on explaining why it works.\n\n**Challenge (for advanced learners):**\n1. **Research extension:** Provide picture books or short articles about praying mantis behavior. Ask advanced learners to identify and report on other adaptations (e.g., the triangular head shape helps them see prey; the way they sway mimics plant movement).\n2. **Multi-step design challenge:** \"Design a tool that can catch small insects, then transport them from one location to another without dropping them. How is this like what a mantis does?\"\n3. **Comparative anatomy:** Show images of other predator insects (dragonfly, antlion, robber fly) and ask: \"Which of these insects would you predict also have raptorial front legs? Why?\" Have them research and confirm their predictions.\n4. **Detailed observation:** Ask advanced learners to sketch the mantis from multiple angles (top view, side view, front view) and label more body parts (compound eyes, antennae, abdomen, thorax if age-appropriate).\n\n---\n\n### Extension Activities\n\n1. **Praying Mantis Life Cycle Observation (connects to 1-LS1-2):**\n   - If possible, order a praying mantis egg case (ootheca) from a biological supply company. Have students observe the egg case, care for it, and document the behaviors of hatchlings as they emerge. Discuss how baby mantises look similar to adults but are much smaller. Record observations in a journal.\n\n2. **Garden Habitat Hunt:**\n   - Take students outside (or show photos/video) to look for insects in a garden or green space. Have them identify which insects might be prey for a praying mantis and which might be predators. Create a simple \"Food Web\" diagram showing: Plants → Insects → Praying Mantis.\n\n3. **Design a Better Grabber Challenge:**\n   - Extend the grabber tool design to make it more efficient. Challenge: \"Can you make your tool grab an object from 2 feet away? From 3 feet away? How did changing the tool help?\" This deepens understanding of tool design and adaptation principles.\n\n4. **Interactive Read-Aloud with Engagement:**\n   - Read a simple book about praying mantises (e.g., *Praying Mantis: Master of Camouflage* by Sandra Markle or *National Geographic Little Kids First Big Book of Insects*).\n   - Pause frequently to ask: \"How is the mantis in the book using its body parts? Did we learn about this?\"\n\n5. **Mantis Movement Role-Play:**\n   - Have students move around the classroom like a praying mantis: \"Stand on your back legs. Keep very still, like you're hiding. Now, a bug lands near you—grab it!\" This kinesthetic activity reinforces understanding of posture and hunting behavior.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 207,
  "outputTokens": 4369,
  "cost": 0.0225798,
  "generatedAt": "2026-02-13T04:25:49.919Z"
}