{
  "title": "Raccoon",
  "category": "life-science",
  "imageFile": "raccoon.jpeg",
  "imagePath": "images/life-science/raccoon.jpeg",
  "content": "### Visible Elements in Photo\n- A raccoon standing on a weathered tree stump or log\n- Water (pond or wetland) in the background\n- Dense vegetation and hanging vines along the water's edge\n- The tree stump shows deep cracks and decay\n- Grassy ground around the base of the stump\n\n### Reasonable Inferences\n- **From raccoon's position on the stump**: The animal is using the elevated log as a resting platform and vantage point to observe its surroundings, suggesting it seeks safe, dry places above water level.\n- **From water + vegetation combination**: This is a wetland habitat where animals need stable resting or nesting spots that won't sink or flood; natural platforms like logs are in demand.\n- **From stump decay**: Fallen trees in wetlands deteriorate quickly and become unstable; a more durable structure would better serve the animal's needs.\n\n### Engineering Task\n\n**K-2**: \nMake a safe platform for a small animal (like a toy raccoon or stuffed animal) to rest above water. Use wood pieces, rocks, or logs to build a dry spot that won't tip over or sink. Test it by placing your toy animal on it.\n\n**3-5**: \nDesign a wildlife resting platform that floats or sits stably in shallow water and can support the weight of a small animal (simulated with a 2-pound weight). Your platform must be at least 12 inches across, built from natural or recycled materials (branches, bark, cork, foam, or cardboard), remain above the waterline when tested in a bucket or tub, and resist tipping when the weight is placed on one edge. Sketch your design first, build a prototype, test it, and explain how you would improve it.\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a real animal using found materials to solve a survival problem (staying dry and safe in a wetland). Students should start by asking: \"Why does the raccoon rest on logs? What problem does that solve? How could we design something better?\" This observation-to-question approach grounds the engineering challenge in authentic need.\n\n### Suggested Materials\n- Branches, twigs, and bark pieces\n- Cork pieces or cork sheets\n- Foam scraps or foam blocks\n- Cardboard tubes or flat cardboard (pre-waterproofed with wax or plastic wrap)\n- Plastic crate or platform frame (for 3–5 students to modify)\n- Waterproof tape or zip ties\n- Bucket or shallow tub of water (for testing)\n\n### Estimated Time\n**K-2**: 30–45 minutes (including build and one test cycle)  \n**3-5**: Two 40-minute sessions (design sketch + planning on Day 1; build, test, and redesign on Day 2)\n\n### Why This Works for Teachers\nThis task directly addresses **NGSS ETS1.A** (*defining engineering problems*) by asking students to identify what living things need in their environment and design a structure to meet that need, anchored in observation of a real animal's behavior.",
  "inputTokens": 2331,
  "outputTokens": 698,
  "cost": 0.005821,
  "generatedAt": "2026-02-09T13:22:05.172Z"
}