{
  "title": "Scavenger",
  "category": "life-science",
  "imageFile": "scavenger.jpg",
  "imagePath": "images/life-science/scavenger.jpg",
  "gradeLevel": "Kindergarten",
  "gradeLevelKey": "kindergarten",
  "content": "# 5E Lesson Plan: What Does This Animal Need to Survive?\n\n### Core Science Concepts from Image Analysis\n\n- **Animal body structures and adaptations:** The bird has large wings for flying, long legs for walking/wading, and a specialized beak for finding food on the ground—these external parts help it survive.\n- **Habitat and environment:** The bird lives in a natural outdoor environment with grass and open ground, showing where certain animals can find what they need.\n- **Animal behavior and feeding:** The bird is foraging/searching for food on the ground, demonstrating how animals actively work to meet their survival needs.\n- **Basic survival needs:** Animals need food, shelter, water, and space to move around—this bird's behavior and habitat show these essential requirements.\n\n### Lesson Title\n\nWhat Does a Scavenger Bird Need to Live?\n\n### Lesson Overview\n\n- **Grade Level:** Kindergarten\n- **Subject:** Science (Life Science)\n- **Time Allotment:** Two 30-minute sessions (60 minutes total)\n- **NGSS Standards:** K-LS1-1\n\n### Learning Objectives\n\nStudents will be able to:\n- Describe what an animal (specifically the bird in the photo) needs to survive\n- Identify at least three things this bird needs: food, water, and a safe place to live\n- Explain how the bird's body parts help it meet its survival needs\n- Make observations about where animals find what they need\n\n### 5E Lesson Sequence\n\n#### 1. ENGAGE (10-15 minutes)\n\n- **Objective:** Capture student curiosity about what animals need by examining the photograph and thinking about the bird's daily life.\n\n- **Materials:**\n  - Large, clear photograph of the vulture/scavenger bird (printed or projected)\n  - Chart paper and markers\n  - Optional: toy bird or bird figurine\n\n- **Activity:**\n  \n  1. Display the photograph where all students can see clearly. Allow 30 seconds of silent observation.\n  \n  2. Ask students to turn to a partner and whisper one thing they notice about this bird. Listen to a few responses without correcting.\n  \n  3. Pose these discussion questions, pausing after each for student responses:\n     - \"What is this bird doing right now?\" (Looking for food on the ground)\n     - \"Do you think this bird is hungry? What makes you think so?\" (It's looking at the ground; it's searching)\n     - \"What does this bird need to stay alive and healthy?\" (Accept all answers—food, water, home, etc.)\n     - \"Where do you think this bird finds these things?\" (On the ground, in nature, outside)\n  \n  4. Introduce the wonder prompt: \"I wonder what happens when this bird cannot find food. What would happen?\" Encourage wild predictions without judgment.\n  \n  5. Create a simple T-chart on chart paper titled \"What This Bird Needs to Survive\" and \"Where It Finds It.\" Leave blank to fill in during Explain phase.\n\n- **Transition:** \"Let's go on a hunt to discover what animals need to survive, just like this bird hunts for its food!\"\n\n---\n\n#### 2. EXPLORE (20-25 minutes)\n\n- **Objective:** Students investigate survival needs through observation and hands-on discovery.\n\n- **Materials:**\n  - Picture cards of animal habitats (forest, desert, pond, grassland—include images showing food, water, shelter)\n  - Real or toy animals (plastic birds, rabbits, fish, insects) OR animal picture cards\n  - Index cards with pictures of items: food (apple, seeds, meat), water (stream, pond), shelter (nest, burrow, tree), safe space (open ground, tall grass)\n  - Large workspace or floor area\n\n- **Activity:**\n\n  1. Show students 4-5 habitat picture cards, one at a time. Point to specific features: \"I see water here. I see plants where an animal could hide.\"\n  \n  2. Hold up a plastic bird (or show its picture card). Ask: \"If this bird lives here (point to grassland), what does it need? Let's find it!\"\n  \n  3. Give each small group of 3-4 students a habitat card and a set of survival-needs index cards (food, water, shelter, space). Students work together to:\n     - Look at their habitat picture\n     - Place the survival-need cards on or near the places in the habitat where that animal would find those needs\n     - Talk quietly about their choices: \"Where is the food?\" \"Where can it get water?\" \"Where is a safe home?\"\n  \n  4. Circulate and ask guiding questions without telling answers:\n     - \"Can the bird find food here? Show me where.\"\n     - \"Is there water? What does it look like?\"\n     - \"Where could this animal sleep safely?\"\n  \n  5. Have students point to each card and tell one thing the animal needs from that place.\n\n- **Teacher Role:** \n  - Facilitate by asking open-ended questions\n  - Ensure each child touches and participates\n  - Record observations on sticky notes if needed for later reference\n  - Avoid giving answers; instead, ask \"What do you think?\" repeatedly\n\n- **Expected Student Outcomes:**\n  - Students identify food, water, shelter, and space as survival needs\n  - Students connect habitat features to what animals need\n  - Students use words like \"food,\" \"water,\" \"home,\" and \"safe place\"\n\n---\n\n#### 3. EXPLAIN (15-20 minutes)\n\n- **Objective:** Formalize vocabulary and connect exploration back to the scavenger bird photograph using teacher guidance.\n\n- **Materials:**\n  - T-chart started in Engage phase (chart paper)\n  - Photograph of the bird (displayed again)\n  - Picture chart with vocabulary words and simple icons\n  - Optional: real bird feather, images of bird nests\n\n- **Activity:**\n\n  1. Gather students on the carpet with the bird photograph visible. Review: \"Let's look at this bird again. Now we know what it needs!\"\n  \n  2. Return to the blank T-chart. As a group, fill it in together:\n     - **\"What This Bird Needs\":** Food, Water, Shelter/Home, Space to Move\n     - **\"Where It Finds It\":** Finds food on the ground (insects, seeds), drinks from puddles/streams, builds a nest or finds a cave, walks and flies in open areas\n  \n  3. Introduce vocabulary with simple pictures and gestures:\n     - **\"Food\"** — Something to eat (act like you're eating)\n     - **\"Water\"** — Something to drink (pretend to drink from your hand)\n     - **\"Shelter\" or \"Home\"** — A safe, cozy place to rest (make a tent with your arms; point to the nest image)\n     - **\"Survive\"** — To stay alive and healthy (point to the bird and say \"This bird survives by finding these things every day\")\n  \n  4. Point back to the photograph and explain: \"This bird is looking for food on the ground. See how its long legs help it walk? See how its beak helps it pick up small things? This bird's body helps it get what it needs!\"\n  \n  5. Check for understanding:\n     - \"What does every animal need to survive?\" (Call on volunteers)\n     - \"Point to something in our room that a bird would need.\" (Students point to windows for flying space, etc.)\n     - \"Can you survive without water? Why not?\" (Simple answers: our body needs it; we get thirsty)\n\n- **Vocabulary:**\n  - **Survive:** To stay alive and be healthy\n  - **Food:** Something an animal eats to have energy and grow\n  - **Water:** A liquid every animal must drink to live\n  - **Shelter:** A safe home where an animal can rest and be protected\n  - **Habitat:** The place where an animal lives (has food, water, shelter, and space)\n\n- **Expected Student Outcomes:**\n  - Students use the four vocabulary words correctly in simple sentences\n  - Students understand that all animals (including humans) need the same four things\n  - Students can point to or describe where the scavenger bird finds what it needs\n\n---\n\n#### 4. ELABORATE (15-20 minutes)\n\n- **Objective:** Apply understanding by predicting and role-playing survival needs in a new context.\n\n- **Materials:**\n  - Picture cards of different animals (cat, rabbit, fish, squirrel, butterfly)\n  - Habitat pictures (home, forest, pond, garden)\n  - Sticky notes and markers\n  - Optional: dress-up props (bird wings, animal ears headband)\n\n- **Activity:**\n\n  1. Show a different animal photo (e.g., a rabbit). Ask: \"What does this rabbit need to survive? Can it find these things in a forest?\"\n  \n  2. Give each small group a different animal and a habitat card. Groups decide and discuss:\n     - Does this animal find food here? What would it eat?\n     - Is there water?\n     - Is there shelter/a safe home?\n     - Is there space to move?\n  \n  3. Optional: Students act out being the animal. \"If you are a squirrel in the forest, show me how you find food. Show me your home.\"\n  \n  4. Have groups share one thing their animal needs and where it finds it in its habitat.\n  \n  5. Return to the scavenger bird: \"Our bird needs the same four things. What would happen if we took away the bird's food (the ground where insects live)? What would the bird do?\" Let students brainstorm: fly away, get hungry, find a different place.\n\n- **Teacher Role:**\n  - Guide thinking with \"what if\" questions\n  - Validate all responses while gently redirecting unclear ideas\n  - Encourage dramatic play and role-play\n  - Connect back to the original photograph\n\n- **Expected Student Outcomes:**\n  - Students apply survival-needs concept to a new animal\n  - Students understand that different animals find their needs in different ways\n  - Students make predictions about what happens when an animal cannot find what it needs\n\n---\n\n#### 5. EVALUATE\n\n- **Objective:** Assess student understanding of what animals need to survive using formative and summative strategies.\n\n- **Activity:**\n\n  1. **Formative Assessment (ongoing during lesson):**\n     - Listen to student responses during discussions\n     - Observe which students correctly place survival-need cards in the Explore activity\n     - Note whether students use vocabulary words appropriately\n     - Watch for students who understand that all animals need food, water, shelter, and space\n  \n  2. **Exit Ticket / Summative Assessment (end of second session):**\n     - Show the bird photograph one final time\n     - Ask each student (or small group) these three questions; accept simple one-word or phrase answers:\n       - \"What is ONE thing this bird needs to survive?\" (Student answer: food, water, home, or space)\n       - \"Show me with your hands how big this bird's wings are. Why does it need big wings?\" (Demonstrates observation; answers might be \"to fly,\" \"to move,\" \"to find food\")\n       - \"If you were this bird, what would you look for first—food or water?\" (Accept either; listen for reasoning)\n  \n  3. **Success Criteria for Meeting K-LS1-1:**\n     - Student can name at least 2 of the 4 survival needs (food, water, shelter, space)\n     - Student can point to or describe where the bird finds at least one need in its habitat\n     - Student uses or understands survival-related vocabulary (survive, food, water, shelter, home)\n\n- **Expected Student Outcomes:**\n  - Kindergarteners may give simple, one-word answers—this is developmentally appropriate\n  - Students recognize that the bird in the photo needs food and possibly water\n  - Students begin to understand that habitats provide what animals need\n  - Students demonstrate curiosity about how animals live\n\n---\n\n### Differentiation\n\n- **Support (Struggling Learners):**\n  1. Provide a \"Needs Card\" visual reference showing the four survival needs with pictures and one-word labels posted throughout all activities. Point to it when asking questions.\n  2. Pair students who are less verbal with a buddy for small-group activities. Encourage the buddy to help explain where food or water is found.\n  3. Simplify questions to yes/no format: \"Does this bird need food?\" instead of open-ended \"What does this bird need?\"\n\n- **Challenge (Advanced Learners):**\n  1. Ask why questions: \"Why do you think this bird has long legs? How do long legs help it survive?\" Encourage deeper thinking about adaptations.\n  2. Introduce a third habitat and ask students to compare: \"In the grassland, this bird finds insects. In the desert, what would it find? Would it survive there?\"\n  3. Ask students to predict: \"What would happen if this bird's habitat disappeared? Where would it go? What would it do?\" (Introduction to habitat loss and animal movement)\n\n---\n\n### Extension Activities\n\n1. **Bird Feeder Design Project:** Bring in bird feeders or show pictures. Ask students: \"How does a bird feeder help birds survive?\" Have students design or decorate a bird feeder from a paper cup, string, and birdseed. Place it outside (with permission) and observe which birds visit. Discuss: \"What need does the feeder meet?\" (Food)\n\n2. **Animal Survival Homes:** Students use natural materials (twigs, leaves, grass) to build a small model shelter for a toy animal (or animal picture card). Ask: \"What does your animal need in its home to survive? Is it safe? Is it warm?\" Display creations and have a gallery walk where students observe peers' shelters.\n\n3. **\"I Am a Scavenger Bird\" Picture Book:** Students draw or dictate a simple 4-page story about the bird from the photograph:\n   - Page 1: \"I need food\" (draw bird eating)\n   - Page 2: \"I need water\" (draw bird drinking)\n   - Page 3: \"I need a home\" (draw bird in nest)\n   - Page 4: \"I need space to fly\" (draw bird flying)\n   \n   Bind pages together with brads or staples. Students \"read\" their books to a partner or take home to share.\n\n---\n\n**End of Lesson Plan**",
  "inputTokens": 123,
  "outputTokens": 3322,
  "cost": 0.0233305,
  "generatedAt": "2026-02-13T06:26:23.924Z"
}