{
  "title": "Scavenger",
  "category": "life-science",
  "imageFile": "scavenger.jpg",
  "imagePath": "images/life-science/scavenger.jpg",
  "content": "### Visible Elements in Photo\n\n- A large black bird (appears to be a vulture or condor) with dark plumage and a textured grey head and neck\n- Grass and low vegetation covering the ground\n- Rocky or gravelly soil with sparse plant growth\n- The bird's posture suggests foraging or searching behavior\n- Open, exposed terrain with limited shelter or shade\n\n### Reasonable Inferences\n\n- **From bird's body shape and head texture**: This scavenging bird needs to access food sources on the ground efficiently; its long neck and downward posture suggest it hunts or searches in vegetation and soil.\n- **From sparse vegetation and rocky terrain**: The landscape offers limited natural cover; animals living here must either adapt to exposure or create their own shelter solutions.\n- **From foraging posture**: The bird's design (long legs, angled neck, keen vision) solves a real problem—reaching food in difficult terrain while maintaining awareness of surroundings.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\nYou are a scavenger bird looking for food in tall grass. Design and build a long-necked tool using straws, string, and paper that can help you reach down into grass clumps to find hidden treats (small pom-poms or crackers). Your tool must be at least 12 inches long and let you pick up a snack without using your hands.\n\n**3-5 Version:**\nDesign a foraging tool inspired by this scavenging bird that allows a person to safely locate and retrieve small objects hidden in tall grass or leaf litter without bending or kneeling. Your tool must:\n- Be at least 18 inches long\n- Have a functional \"neck\" that can bend or angle to reach into vegetation\n- Successfully pick up at least 3 small objects in under 2 minutes\n- Use only natural materials (sticks, twine, leaves) or recyclables (plastic cups, straws, string)\n\nTest your prototype in a grassy area or simulated \"search zone\" and measure success by speed and accuracy.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo naturally invites observation of *how* an animal solves a real-world problem (accessing food in open terrain with limited mobility). Students start by asking: \"What challenge does this bird face, and how does its body design help?\" This observation-to-problem-definition sequence is the strongest entry point.\n\n---\n\n### Suggested Materials\n\n- Straws or rolled paper tubes (for the \"neck\" structure)\n- String, twine, or yarn (for joints and flexibility)\n- Small cups or baskets (for the \"head\" or retrieval end)\n- Tape or rubber bands (for assembly)\n- Pom-poms, crackers, or small foam balls (for practice objects to retrieve)\n\n---\n\n### Estimated Time\n\n**K-2**: 45–60 minutes (planning sketch, build, 2–3 test trials, reflection)  \n**3-5**: Two 40-minute sessions (Session 1: design, sketch, material selection; Session 2: build, test, redesign, measure results)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly supports **NGSS 3-5-ETS1-1** (*Ask questions to define engineering problems based on situational analysis*) by grounding the design challenge in observable animal adaptation, making the \"need\" tangible and visible rather than abstract.",
  "inputTokens": 2328,
  "outputTokens": 772,
  "cost": 0.006187999999999999,
  "generatedAt": "2026-02-09T13:44:45.773Z"
}