{
  "title": "Slime Mold",
  "category": "life-science",
  "imageFile": "slime_mold.jpg",
  "imagePath": "images/life-science/slime_mold.jpg",
  "content": "# NGSS Engineering Design Challenge: Slime Mold\n\n---\n\n### Visible Elements in Photo\n\n- Bright yellow, bumpy-textured organism (slime mold) covering an area roughly 10–15 cm across\n- Multiple rounded, finger-like projections extending from a central mass\n- Decaying wood chips, leaf fragments, and dark soil surrounding the organism\n- Moist environment (visible moisture on debris)\n- No visible animal or human activity in the immediate area\n\n---\n\n### Reasonable Inferences\n\n1. **From the moist environment + organism growth** — The slime mold thrives in damp conditions and requires moisture to spread and feed; it is seeking out nutrients in decomposing material.\n2. **From the finger-like projections + scattered placement** — The organism is actively exploring and moving across surfaces to find food sources; it adapts its shape to navigate obstacles.\n3. **From the yellow color + healthy appearance** — This organism is in an active growth phase; conditions (moisture, temperature, food) support its survival and expansion.\n\n---\n\n### Engineering Task\n\n**K–2 Version:**\n\n*Build a damp home for a creeping creature.*\n\nYour job: Design a small box or container that stays wet and dark so a slow-moving creature like a slime mold can explore and grow. Use soil, leaves, and wood chips. Add water to keep it moist. Make sure your creature can move from one side to the other without drying out. Can you help it find a snack (oatmeal or a piece of banana)?\n\n**3–5 Version:**\n\n*Engineer an optimal habitat for slime mold exploration.*\n\nDesign a controlled growing environment (a shallow container or petri dish setup) that meets these criteria:\n- Maintains consistent moisture (measured by a damp-but-not-soggy paper towel or sponge layer)\n- Provides at least 3 different substrate options (soil, wood chips, leaf litter) for the organism to choose from\n- Includes a food source (oatmeal flakes or banana) placed 15 cm away from the starting point\n- Allows observation without opening the container (clear lid or sides)\n- Keeps the environment dark or dimly lit\n\nTest your design over 5–7 days. Measure the organism's movement distance daily and sketch the path it takes. Which substrate did it explore first? Where did it go when it found food?\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real organism thriving in nature with no human intervention visible. Students benefit from first observing and asking: *What does this creature need to survive? How does it move? What conditions help it grow?* The slime mold's presence in a moist, debris-rich environment naturally prompts students to identify the problem of *how to recreate and support these conditions*—making **Ask/Define** the ideal entry point before jumping to design solutions.\n\n---\n\n### Suggested Materials\n\n- Shallow plastic container or clear petri dish (with lid)\n- Potting soil or garden soil\n- Wood chips or bark mulch\n- Dried leaf fragments\n- Paper towel or cotton padding (to hold moisture)\n- Water (spray bottle)\n- Slime mold culture (or collected sample from moist outdoor areas)\n- Oatmeal flakes or banana slice (food source)\n- Ruler (for measuring movement)\n- Notebook or graph paper (for sketching and data recording)\n\n---\n\n### Estimated Time\n\n**K–2:** 20–30 minutes for setup; 3–5 days of observation (5 minutes daily).\n\n**3–5:** 25–35 minutes for design and setup; 5–7 days of structured observation and daily measurement (10 minutes daily); 15–20 minutes for data analysis and reflection.\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining engineering problems by identifying criteria and constraints) and **NGSS ETS1.B** (designing solutions through iterative prototyping), while grounding the challenge in observable biology that sparks genuine curiosity about how organisms interact with their environment.",
  "inputTokens": 2330,
  "outputTokens": 943,
  "cost": 0.007044999999999999,
  "generatedAt": "2026-02-09T13:30:29.743Z"
}