{
  "title": "Snail",
  "category": "life-science",
  "imageFile": "snail.jpg",
  "imagePath": "images/life-science/snail.jpg",
  "content": "### Visible Elements in Photo\n\n- A garden snail with a brown spiral shell, positioned on what appears to be a gray or concrete surface\n- Fine, wispy lichen or moss (pale green/gray) covering the snail's immediate environment\n- The snail's muscular foot and extended tentacles (antennae) visible as it moves\n- A blurred background suggesting an outdoor or garden setting\n- The snail's moist, glistening body surface\n\n### Reasonable Inferences\n\n- **From shell and slow movement**: The snail carries its shelter with it and moves deliberately to conserve energy and water, suggesting a need to protect itself from drying out and predators.\n- **From lichen/moss coverage**: The snail's habitat is damp and shaded, indicating it requires moisture and protection from direct sun and wind.\n- **From body moisture**: The snail depends on a wet environment; any design or shelter must help it retain moisture without trapping it completely.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\n*Design a safe, wet home for a snail.* You have moss, small stones, and soil. Build a shelter that keeps a snail cool and damp. Your snail home should have a place for the snail to hide, and water should not drain away too fast. Test it by sprinkling water on top—does the water stay inside?\n\n**3-5 Version:**\n*Design and build a portable snail habitat that maintains moisture while allowing air flow.* Your habitat must (1) retain water for at least 24 hours without becoming waterlogged, (2) provide at least one hiding space, (3) be small enough to carry (no larger than a shoebox), and (4) use only natural or recycled materials. Success criteria: Measure water loss over 24 hours; observe whether the snail hides in your designed space within 1 hour of placement.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis task works best starting here because the photo reveals a *real organism with genuine survival needs*. Students aren't just building a random structure—they're identifying the snail's actual problem (needing moisture, protection, and stable temperature) and defining what their solution must accomplish. This grounds the engineering challenge in observable biology and real constraints, not fiction.\n\n---\n\n### Suggested Materials\n\n- Moss, grass clippings, or dead leaves (collected from outside)\n- Small stones or pebbles\n- Soil or potting mix\n- Plastic container or cardboard box (recycled)\n- Water / spray bottle\n- Optional: small pieces of wood, cork, or bark\n\n---\n\n### Estimated Time\n\n**K-2:** 30–40 minutes (planning and building in one session; observation the next day)  \n**3-5:** Two 40-minute sessions (Session 1: design, build, initial setup; Session 2: measure water loss, test snail behavior, iterate)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K-ETS1-1 / 1-ETS1-1 / 2-ETS1-1** (asking questions and defining problems based on natural needs) and **3-5-ETS1-1** (defining design problems with specific criteria and constraints), grounding abstract engineering in the observable behavior and survival requirements of a real organism.",
  "inputTokens": 2327,
  "outputTokens": 754,
  "cost": 0.006097,
  "generatedAt": "2026-02-09T13:33:33.139Z"
}