{
  "title": "Snake Skin",
  "category": "life-science",
  "imageFile": "snake_skin.jpg",
  "imagePath": "images/life-science/snake_skin.jpg",
  "content": "### Visible Elements in Photo\n\n- A snake (patterned, tan/brown coloring) camouflaged among dried wood chips, bark fragments, and plant debris\n- Scattered wooden pieces of varying sizes and textures (some thin and splintered, some chunky)\n- Dry, dead plant material (straw-like stems and leaves) interspersed throughout\n- Scattered soil or mulch visible between debris\n- Green plant growth (grass or weeds) emerging from the edges\n\n### Reasonable Inferences\n\n- **From snake's coloring and positioning**: The snake's patterned skin closely matches the browns and tans of surrounding wood and debris, suggesting that camouflage (blending with environment) is a survival strategy animals use to hide from predators or approach prey undetected.\n- **From mixed debris pile**: The habitat contains layers and crevices created by different-sized materials, implying that snakes and other ground-dwelling creatures need shelter with gaps, cover, and protection from weather and larger animals.\n- **From scattered materials**: The natural breakdown of wood and plant matter creates a complex, three-dimensional microhabitat—animals depend on structural diversity to survive.\n\n### Engineering Task\n\n**K-2:**\nBuild a cozy hiding place for a toy snake using sticks, leaves, and bark pieces. Your snake should be hard to find when it's tucked inside! Use only natural materials you can collect outside. How can you make your hideout blend in so it looks like part of the forest floor?\n\n**3-5:**\nDesign and build a camouflaged shelter for a small reptile (represented by a toy snake or lizard figurine) using natural materials (twigs, bark, leaves, soil). Your shelter must:\n- Provide at least two entry/exit points\n- Conceal the animal so it is not visible from directly above when placed inside\n- Remain structurally stable for at least 48 hours outdoors or in a terrarium\n- Use only materials found in nature or the classroom recycling bin\n\nTest your design by having classmates try to spot the hidden animal. Redesign one element based on feedback and test again.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real animal in its natural habitat facing a genuine survival need: hiding and blending in. Students start by asking, *\"What problem does this snake solve by looking like its surroundings? How does it build or find shelter?\"* This observational, problem-identification phase makes the engineering challenge feel purposeful and grounded in nature.\n\n### Suggested Materials\n\n- Twigs, bark pieces, and wood chips (collected outdoors or saved from yard waste)\n- Dried leaves, grass, and plant stems\n- Potting soil or sand\n- Small cardboard box or plastic container (to contain the structure or serve as a base)\n- Toy snake or lizard figurine (or clay model)\n- Tape or natural binding materials (raffia, string) for optional reinforcement\n\n### Estimated Time\n\n**K-2**: 30–45 minutes (collection + building in one session)  \n**3-5**: Two 30-minute sessions (design/building session 1; observation, testing, and redesign session 2, with 24–48 hours observation time between)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K-LS1-1 / 1-LS1-1 (life structures and functions)** and **3-LS3-2 / 4-LS1-1 (adaptation and survival)** while embedding the full **ETS1.A (defining and delimiting problems)** standard—students observe an animal's real-world need, ask what problem camouflage and shelter solve, and then engineer a solution using available resources.",
  "inputTokens": 2328,
  "outputTokens": 849,
  "cost": 0.006573000000000001,
  "generatedAt": "2026-02-09T13:33:23.243Z"
}