{
  "title": "Snow Geese",
  "category": "life-science",
  "imageFile": "snow_geese.jpg",
  "imagePath": "images/life-science/snow_geese.jpg",
  "content": "### Visible Elements in Photo\n\n- Large flock of white snow geese resting and standing on brown plowed farmland\n- Several geese in flight above the field (at least 3 visible)\n- Two tall electrical transmission towers on either side of the field\n- Flat agricultural landscape extending to distant tree line and hills\n- Clear sky with minimal clouds\n\n### Reasonable Inferences\n\n- **From resting geese on open field**: Birds need safe places to land and rest during migration; open fields offer visibility to spot predators but lack natural shelter.\n- **From geese in flight + ground flock**: Geese communicate and coordinate movement; flying birds may be scouting or signaling to the resting group.\n- **From flat terrain + distant trees**: Geese depend on accessible water and vegetation for food; they must travel between feeding/resting sites and may face obstacles (structures, weather, human activity).\n\n### Engineering Task\n\n**K-2:**\nMake a safe landing spot for migrating birds! Use natural materials (sticks, leaves, grass, small rocks) to build a cozy resting area on a tray or sandbox. Your design should give birds a place to sit where they can see around them and feel protected. Test it by having a toy bird \"land\" there.\n\n**3-5:**\nDesign a bird rest station for a migration stopover area. Your station must:\n- Provide visible open sightlines (birds can see 360° for predators) while offering wind protection using only natural or recycled materials\n- Fit within a 2-foot × 2-foot ground footprint\n- Support at least 5 toy birds standing simultaneously without collapsing\n- Include a shallow water feature (bowl or tray) for drinking\n\nTest your design by placing it outdoors for 1-2 days and observe: Do birds (or toy birds) interact with it? Does it withstand wind and weather?\n\n### EDP Phase Targeted\n\n**Ask / Define Problem** — This photo shows a real environmental need (safe migration habitat) without showing an existing solution. Students must first understand what geese need during stopover before designing. The task invites observation and questioning: *Why do geese stop here? What makes a good resting spot?*\n\n### Suggested Materials\n\n- Small branches, twigs, and dried grasses\n- Recycled plastic or wooden pallets (for framework)\n- Burlap or landscape fabric (for wind breaks)\n- Shallow containers or aluminum pie pans (for water)\n- Toy birds or craft foam cutouts\n\n### Estimated Time\n\n**K-2**: 45–60 minutes (includes building, testing with toy bird, and simple observation)  \n**3-5**: Two 40-minute sessions (Day 1: design and build; Day 2: outdoor placement and observation/iteration)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS 3-5-ETS1-1** (ask questions to define design problems) and **K-2-ETS1-1** (ask questions, make observations) by grounding engineering in observable animal behavior and real migration ecology.",
  "inputTokens": 2329,
  "outputTokens": 696,
  "cost": 0.005809,
  "generatedAt": "2026-02-09T13:38:02.565Z"
}