{
  "title": "Spider Web",
  "category": "life-science",
  "imageFile": "spider_web.JPG",
  "imagePath": "images/life-science/spider_web.JPG",
  "content": "# Engineering Design Challenge: Spider Web Structure\n\n### Visible Elements in Photo\n\n- A large, intricately patterned spider web with radial and concentric silk strands\n- Water droplets or dewdrops clinging to the web structure\n- Green leafy plant stems and branches on both sides of the web\n- Dark background (foliage or soil)\n- Web anchored between multiple plant structures\n\n### Reasonable Inferences\n\n- **From the radial-concentric pattern**: The spider web is engineered to be lightweight yet strong enough to catch and hold prey; the geometric design distributes tension evenly across the structure.\n- **From the water droplets and plant anchors**: The web must be flexible and sticky to retain caught moisture and insects; it must also connect securely to natural anchor points that may sway or move.\n- **From the exposed web in an open area**: The structure needs to span gaps between plants efficiently while remaining visible enough to catch flying insects.\n\n### Engineering Task\n\n**K-2:**\nMake a sticky web that catches small things like pom-poms or yarn balls. Use string or yarn to build a web pattern between two chairs or a frame. Test it by gently tossing soft balls at it to see if they stick. What shape makes the best catcher?\n\n**3-5:**\nDesign and build a web structure using string, yarn, or dental floss that can span a 30-centimeter gap between two anchor points (e.g., branch segments, dowels, or frames). Your web must:\n- Support at least 5 small weighted objects (washers, beads, or modeling clay balls) without tearing or sagging more than 5 centimeters\n- Use a radial or web-like geometric pattern to distribute weight\n- Be anchored securely at a minimum of 4 points\n\nTest your design by adding weights gradually and measure how much it sags. Redesign if it fails, and explain how your final pattern distributes tension.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis task starts with identifying a real-world engineering challenge visible in nature: how do spiders create structures that are both strong and lightweight? The photo shows the *problem* (spanning gaps, holding weight, flexibility) without showing the *solution* already built. Students must first observe the web's properties and infer the engineering requirements before imagining their own designs.\n\n### Suggested Materials\n\n- String, yarn, or dental floss\n- Two anchor points (wooden dowels, branches, or PVC frames)\n- Small weighted objects (washers, metal beads, craft foam balls, or modeling clay)\n- Tape or small hooks to secure anchor points\n- Ruler or measuring tape\n- Optional: water spray bottle to test weight-holding with added moisture\n\n### Estimated Time\n\n**K-2:** 20–30 minutes (one session: build and test)  \n**3-5:** 45–60 minutes across two sessions (Session 1: design and build; Session 2: test, measure, and redesign)\n\n### Why This Works for Teachers\n\nThis challenge directly supports **NGSS ETS1.A: Defining and Delimiting Engineering Problems** by asking students to identify how a natural structure solves a real engineering need (spanning gaps, distributing load, flexibility), then apply those principles to build and test their own design.",
  "inputTokens": 2333,
  "outputTokens": 743,
  "cost": 0.0060479999999999996,
  "generatedAt": "2026-02-09T13:38:12.649Z"
}