{
  "title": "Sunflower",
  "category": "life-science",
  "imageFile": "sunflower.jpeg",
  "imagePath": "images/life-science/sunflower.jpeg",
  "content": "### Visible Elements in Photo\n\n- A green plant stem with a smooth, cylindrical structure\n- Two seed pods or buds attached to the stem (one at top, one at bottom left)—tan/beige colored with visible ridged or textured surfaces\n- Water droplets on the green stem, indicating moisture\n- Blurred background suggesting an outdoor or natural growing environment\n- The overall structure shows a young plant in an early growth stage\n\n### Reasonable Inferences\n\n- **From seed pods + stem structure**: The plant is designed to protect developing seeds inside a tough outer casing until they are ready to be dispersed or grow.\n- **From water droplets on stem**: The plant absorbs and transports water upward through the stem to nourish growing buds—the stem must be strong enough to support the weight of developing pods while remaining flexible.\n- **From pod texture and form**: The ridged, hard exterior of each pod is a protective structure that shields delicate seeds inside from damage, weather, and predators.\n\n### Engineering Task\n\n**K-2:**\nMake a safe home for a pretend seed! Using clay, paper, and tape, build a pod or shell that protects a small object (like a pea or marble) inside. Your pod must be hard on the outside but have a soft, comfy space for the seed on the inside. Can you make it sturdy enough that it doesn't crack when you gently squeeze it?\n\n**3-5:**\nDesign and build a seed pod that protects a fragile object (raw egg or water balloon) during a 1-meter drop onto a hard surface. Your pod must:\n- Use only natural or recycled materials (paper, leaves, sticks, clay, cotton).\n- Weigh no more than 100 grams.\n- Protect the contents so no liquid leaks on impact.\n- Be able to hold and display the seed inside after opening (design for visibility).\nTest your design, record what happens, and redesign to improve protection.\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis photo shows a real biological structure solving a protection problem in nature. Students can observe the seed pod and ask: *\"How does nature keep seeds safe?\"* This observation-based question naturally leads to identifying the engineering challenge (how to protect something delicate) before imagining solutions. The visible structure makes the problem concrete and motivates curiosity.\n\n### Suggested Materials\n\n- Air-dry clay or modeling clay\n- Recycled paper, newspaper, or paper towels\n- Natural materials: leaves, twigs, grass, straw\n- Tape (masking or clear)\n- Cotton balls or fabric scraps\n- Raw eggs or small balloons (for testing, 3-5 only)\n- Ruler or measuring tape\n\n### Estimated Time\n\n- **K-2**: 45–60 minutes (one session: 15 min. observation + discussion, 25 min. building, 15 min. testing and sharing)\n- **3-5**: Two 40-minute sessions (Session 1: observation, brainstorm, and first build; Session 2: drop test, analysis, and redesign)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS K-ETS1-1 / 2-ETS1-1 / 3-ETS1-1** (Ask questions, make observations, and define engineering problems) by grounding the challenge in a visible natural structure, making the problem statement emerge from student observation rather than teacher instruction alone.",
  "inputTokens": 2332,
  "outputTokens": 782,
  "cost": 0.006242,
  "generatedAt": "2026-02-09T13:22:29.445Z"
}