{
  "title": "Toad",
  "category": "life-science",
  "imageFile": "toad.jpg",
  "imagePath": "images/life-science/toad.jpg",
  "content": "# EDP Challenge Analysis\n\n### Visible Elements in Photo\n\n- A dark-colored toad sitting on sandy/rocky ground\n- Small purple/pink flowering plants scattered across the ground\n- Dry twigs and plant debris around the toad\n- A blurred background showing more vegetation and natural habitat\n- The toad's bumpy, textured skin and alert posture\n\n### Reasonable Inferences\n\n- **From toad's squat body and bumpy skin**: Toads are adapted to camouflage and hide in rocky, dry environments; they need shelter from predators and harsh sun exposure.\n- **From sparse, low-growing plants**: This is a dry or semi-arid habitat where water and shade are scarce resources; creatures must find ways to stay cool and moist.\n- **From toad's stationary position**: Toads hunt by waiting; they need places to perch where they can spot insects without being seen themselves.\n\n### Engineering Task\n\n**K-2: Build a Toad Home**\n\nDesign and build a cozy hiding spot for a toy toad. Your toad needs to stay cool, stay hidden from enemies, and have a place to wait for bugs to eat. Use rocks, sticks, soil, and leaves to make a shelter the toad would like. Test it: Can you hide your toad inside? Does it stay cool when you touch the shelter?\n\n**3-5: Design a Desert Shelter for a Toad**\n\nDesign a small shelter (no larger than a shoebox) that meets these criteria:\n- Provides shade and keeps the interior at least 5°C cooler than direct sunlight\n- Uses only natural materials found outdoors (rocks, soil, leaves, sticks, bark)\n- Has an entrance opening no larger than 2 cm (large enough for a toad, small enough to exclude large predators)\n- Allows the toad to remain in the shelter for at least 10 minutes without escaping\n\nTest your design by placing a thermometer inside and in direct sun. Measure the temperature difference. Can a toy toad stay hidden inside without tipping over?\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows an animal in its natural habitat with visible environmental challenges (dry ground, sparse vegetation, need for concealment). Students must first observe what toads need to survive in this environment before designing solutions. The problem—\"How can we create shelter for a creature that lives in dry, exposed places?\"—emerges directly from observing the toad and its surroundings.\n\n### Suggested Materials\n\n- Rocks or pebbles of various sizes\n- Garden soil or sand\n- Sticks, twigs, and bark pieces\n- Dried leaves and grass\n- A thermometer (for 3-5 version)\n- A shoebox or similar container as a testing frame\n- A small toy toad or figurine for testing\n\n### Estimated Time\n\n- **K-2**: 30–45 minutes (building + simple testing)\n- **3-5**: Two 30-minute sessions (design + build in session 1; test, measure, and refine in session 2)\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining engineering problems based on criteria and constraints) by asking students to identify what a real organism needs and then design a solution that must meet specific environmental and functional requirements.",
  "inputTokens": 1692,
  "outputTokens": 758,
  "cost": 0.005482,
  "generatedAt": "2026-02-09T13:32:02.924Z"
}