{
  "title": "Vine",
  "category": "life-science",
  "imageFile": "vine.jpg",
  "imagePath": "images/life-science/vine.jpg",
  "content": "# Engineering Design Process Challenge: Climbing Plant Support System\n\n### Visible Elements in Photo\n\n- A wooden fence (weathered, gray, vertical pickets with horizontal rails)\n- Climbing vines with large, lobed leaves growing over and along the fence\n- Small yellow flowers visible among the foliage\n- Twining vine stems wrapping around the horizontal fence rails\n- Evidence of plant growth over time (established vines covering significant fence area)\n\n### Reasonable Inferences\n\n1. **From vine structure and fence interaction**: The vines naturally seek support structures; the fence provides a framework the plant uses to climb and spread, suggesting plants need well-designed support systems to grow efficiently in desired directions.\n\n2. **From size and coverage**: These vines have grown substantially, implying a support structure must be durable enough to bear increasing weight over weeks and months without collapsing or sagging.\n\n3. **From leaf and stem visibility**: The vines climb by wrapping around available surfaces; a well-designed trellis or support must have graspable features (rails, strings, or protrusions) for vines to grip.\n\n---\n\n### Engineering Task\n\n**K-2 Version:**\n*Design and build a climbing tower for beans or ivy plants.* Use straws, sticks, or string to make a frame that a climbing plant can grab onto and grow around. Your tower should be at least 12 inches tall and strong enough that the plant doesn't knock it over as it gets heavier. Test it by gently pulling on the frame—does it wobble or stay firm?\n\n**3-5 Version:**\n*Design a trellis system that supports a climbing plant's weight while maximizing sunlight exposure.* Your structure must:\n- Support at least 500 grams of added weight (simulating a mature vine with leaves) without bending more than 1 cm\n- Provide at least 6 distinct contact points for vines to grip or wrap around\n- Allow sunlight to reach 80% of an imaginary garden bed behind it (use a grid overlay to measure)\n- Use only biodegradable or reusable materials (wood, bamboo, twine, or plastic stakes)\n\nTest your design by hanging weight, observing how well climbing stems hold on to the structure, and measuring light penetration.\n\n---\n\n### EDP Phase Targeted\n\n**Ask / Define Problem**\n\nThis phase fits best because the photo shows a real-world scenario where a natural need exists (plants need support to climb and spread efficiently). Students can observe the fence doing its job and ask: *Why do climbing plants need support? What makes a good support structure? How do we design one that lasts and holds weight?* The challenge invites students to identify constraints (durability, weight capacity, grip-ability) before they build.\n\n---\n\n### Suggested Materials\n\n1. **Wooden dowels or bamboo skewers** (for frame structure)\n2. **Twine, jute, or cotton string** (for horizontal and diagonal supports)\n3. **Small bean or pea seeds** (to grow real climbing plants, or use artificial vines for faster testing)\n4. **Weights** (washers, sand bags, or water bottles to simulate plant weight)\n5. **Paper clips or wire** (to connect frame joints securely)\n\n---\n\n### Estimated Time\n\n**K-2**: 45–60 minutes (20 min. design discussion, 20 min. building, 15 min. testing and sharing)\n\n**3-5**: Two 45-minute sessions (Session 1: planning, material selection, building; Session 2: load testing, light measurement, redesign and iteration)\n\n---\n\n### Why This Works for Teachers\n\nThis task directly addresses **NGSS ETS1.A** (defining engineering problems in terms of criteria and constraints) and **ETS1.B** (designing solutions that meet real-world constraints) by asking students to solve an observable plant-support challenge using measurable success criteria, just as the fence does in nature.",
  "inputTokens": 2326,
  "outputTokens": 892,
  "cost": 0.0067859999999999995,
  "generatedAt": "2026-02-09T13:37:37.793Z"
}