{
  "title": "Vine",
  "category": "life-science",
  "imageFile": "vine.jpg",
  "imagePath": "images/life-science/vine.jpg",
  "content": "# Engineering Design Process Challenge: Vine Support System\n\n### Visible Elements in Photo\n- Wooden fence (weathered, vertical planks with horizontal rails)\n- Green climbing vine with large leaves and tendrils\n- Long, green pod-like fruit growing from the vine\n- Thin, curling tendrils wrapping around fence rail\n- Yellow flowers visible among the foliage\n\n### Reasonable Inferences\n- **From vine growth pattern:** The vine is actively climbing and needs structural support to grow vertically rather than collapse under its own weight and fruit load.\n- **From fence condition and vine placement:** The fence rail is bearing the weight of mature fruit and leafy growth; without support, heavy vines can damage wooden structures.\n- **From tendril behavior:** The plant naturally seeks attachment points, suggesting an engineering solution should work *with* this growth habit rather than against it.\n\n---\n\n### Engineering Task\n\n**K-2: Build a Vine Helper**\nBuild a strong \"ladder\" or \"frame\" out of sticks or straws that helps a vine climb up without falling over. Your vine helper must be tall enough and strong enough to hold up pretend leaves and fruit (cotton balls or paper leaves). Test it by gently pulling on the leaves to make sure it doesn't tip over.\n\n**3-5: Design a Trellis System**\nDesign and build a trellis structure that supports a climbing vine without damaging it. Your trellis must:\n- Support at least 10 ounces of hanging weight (simulating fruit) without bending or breaking\n- Provide at least 4 attachment points where soft materials (string, fabric strips) can secure the vine safely\n- Stand independently for at least 30 seconds when the weight is applied\n- Use only materials provided (no glue or fasteners beyond what is included)\n\nTest different angles, spacing, and materials. Compare which design holds weight longest and allows easiest vine attachment.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo shows a *real need*—vines grow, they get heavy, they need support. Students observe the problem (vine drooping, struggling to climb, fruit weighing it down) and identify what's required. This phase naturally leads them to ask: \"How can we keep this plant healthy and upright?\" Before designing solutions, students should understand *why* the structure matters.\n\n---\n\n### Suggested Materials\n- Wooden dowels or thin sticks (6–12 inches)\n- String or twine\n- Fabric strips or old cloth (soft, won't cut into plant stems)\n- Straws (plastic or paper)\n- Connectors: pipe cleaners, zip ties, or rubber bands\n\n---\n\n### Estimated Time\n- **K-2:** 30–45 minutes (building + testing)\n- **3-5:** 45–60 minutes for one iteration; 90 minutes if testing multiple designs\n\n---\n\n### Why This Works for Teachers\nThis task aligns with **NGSS 3-5-ETS1-1** (define problems with specific criteria and constraints) and **NGSS K-2-ETS1-1** (ask questions to understand how something works), while grounding students in observable plant biology and real-world problem-solving.",
  "inputTokens": 2193,
  "outputTokens": 727,
  "cost": 0.005828,
  "generatedAt": "2026-02-11T18:24:33.339Z"
}