{
  "title": "White_ibises",
  "category": "life-science",
  "imageFile": "white_ibises.jpg",
  "imagePath": "images/life-science/white_ibises.jpg",
  "content": "# Engineering Design Process Challenge: White Ibis Feeding Habitat\n\n---\n\n### Visible Elements in Photo\n- White ibises (7 birds visible) with long, curved red-orange beaks\n- Shallow water (muddy, shallow wetland environment)\n- Muddy substrate with exposed soil and water channels\n- Long, thin red legs adapted for wading\n- Birds in various postures: standing, bent forward (feeding position), walking\n\n---\n\n### Reasonable Inferences\n1. **From curved beaks + muddy substrate**: Ibises probe into soft mud to find food (invertebrates, small fish); their beak shape is specialized for this hunting method.\n2. **From shallow water + leg length**: Birds need water shallow enough to wade safely while maintaining balance and reaching the substrate.\n3. **From group behavior**: Ibises forage communally, suggesting they require accessible, food-rich wetland areas that support multiple birds without competition for space.\n\n---\n\n### Engineering Task\n\n#### **K-2: Build a Bird Feeding Station**\nDesign and build a shallow \"mud dish\" where toy birds can feed. Use a shallow container filled with sand or mud, add a little water, and place it where your toy birds can reach the \"food\" (small pebbles or beads buried in the mud). Test: Can your bird's beak (a stick or craft probe) pick up the hidden food? Make it better so the bird can find more food!\n\n#### **3-5: Design a Wetland Probe Tool**\nWhite ibises use their curved beaks to probe into soft mud without getting stuck. Your challenge: design and build a probe tool (like an ibis beak) that can:\n- **Push into soft mud** at least 3 inches deep without breaking\n- **Retrieve a small object** (bead or pebble) buried in the mud\n- **Remain stable** when inserted at a 45-degree angle\n- **Be reusable** for at least 10 successful probes\n\nTest your prototype in a container of sand/mud mixture. Measure success by counting how many objects you can retrieve without the tool breaking or bending permanently. Refine the shape, material thickness, or angle if needed.\n\n---\n\n### EDP Phase Targeted\n**Ask / Define Problem**\n\nThis photo documents a real animal solving a feeding problem in a specific habitat. Students should start by observing: *What problem do ibises face when hunting? What features of their body help them solve it?* This observation-based inquiry naturally leads to replicating the beak function—the core engineering challenge. The problem is already defined by nature; students just need to articulate it and prototype a solution.\n\n---\n\n### Suggested Materials\n- Shallow containers or trays\n- Sand, soil, or kinetic sand\n- Straws, dowels, or wooden skewers (to test as \"beaks\")\n- Craft wire or foam tubing (bendable materials to simulate curved beak)\n- Small objects to hide/retrieve: beads, pebbles, or dried beans\n- Plastic spoons or craft sticks\n- Water for shallow wetland simulation\n\n---\n\n### Estimated Time\n- **K-2**: 30–40 minutes (one session: observation + building + testing)\n- **3-5**: 60–90 minutes (two sessions: design planning + prototype building + testing + refinement)\n\n---\n\n### Why This Works for Teachers\nThis task addresses **NGSS ETS1.A: Defining and Delimiting Engineering Problems** by having students observe how an organism's body structure solves a real-world feeding challenge, then prototype a human-made tool that mimics that biological solution—bridging life science observation and engineering design.",
  "inputTokens": 2196,
  "outputTokens": 831,
  "cost": 0.006351,
  "generatedAt": "2026-02-10T19:00:46.720Z"
}