{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Crab's Eye Stalks",
      "fact": "Crabs have special body parts called eye stalks that stick up so they can see in all directions while staying hidden in the sand. These eyes help the crab sense changes in light and darkness, which tells it about day and night cycles. This is called **sensory adaptation** — that's when an animal's body has special features that help it survive in its environment.",
      "vocabulary": {
        "term": "Sensory Adaptation",
        "definition": "A special body part or ability that helps an animal notice and respond to things in its environment, like light, sound, or movement."
      }
    },
    {
      "id": 2,
      "x": "40%",
      "y": "60%",
      "label": "Sandy Beach Habitat",
      "fact": "This crab lives on a sandy beach, which is a special type of **landform** made of tiny pieces of rock and shell. Beaches are shaped by water from the ocean and can change over time as waves and tides move the sand around. Many animals make their homes in sand because it provides shelter and protection.",
      "vocabulary": {
        "term": "Landform",
        "definition": "A natural shape or feature of Earth's surface, like a beach, mountain, valley, or desert."
      }
    },
    {
      "id": 3,
      "x": "55%",
      "y": "55%",
      "label": "Crab's Walking Legs",
      "fact": "Crabs have eight legs that help them walk sideways across the sand and dig burrows to hide from the sun. Moving across sandy areas requires special adaptations because sand is loose and can be hard to walk on. The crab's body shape and leg design help it survive in this coastal **ecosystem**.",
      "vocabulary": {
        "term": "Ecosystem",
        "definition": "A community of living things and their non-living environment working together, like all the animals and plants that live on a beach."
      }
    },
    {
      "id": 4,
      "x": "25%",
      "y": "50%",
      "label": "Burrow Opening",
      "fact": "You can see the crab's burrow, which is a hole dug into the sand where it hides during the hottest parts of the day. This burrow provides shelter and keeps the crab cooler and safer from predators and harsh weather conditions. The sand itself acts as a natural insulator, which means it helps keep heat in or out — just like the walls of a house!",
      "vocabulary": {
        "term": "Insulator",
        "definition": "A material that keeps heat from moving in or out, helping something stay warm or cool."
      }
    }
  ]
}