{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Sun and Light",
      "fact": "The bright sun in the sky gives energy to Earth and causes day and night. The sun's light and heat help plants grow and warm our planet. This is called **insolation** — that's the energy from the sun that reaches Earth's surface.",
      "vocabulary": {
        "term": "Insolation",
        "definition": "The amount of the sun's energy that reaches Earth's surface."
      }
    },
    {
      "id": 2,
      "x": "30%",
      "y": "65%",
      "label": "River and Water",
      "fact": "The river in front of the city is part of Earth's water system and helps shape the land. Water flows from high places to low places, and it is always moving around our planet. This continuous movement of water is called the **water cycle** — water evaporates from oceans and rivers, forms clouds, and falls as rain.",
      "vocabulary": {
        "term": "Water Cycle",
        "definition": "The continuous movement of water as it evaporates, condenses into clouds, falls as precipitation, and returns to oceans and rivers."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "25%",
      "label": "Tall Buildings and Resources",
      "fact": "These buildings are made from materials like steel and concrete that come from Earth's rocks and minerals. Humans dig up and use natural resources from Earth to build cities and homes. This is called **natural resource extraction** — taking materials from the Earth to use for building and other purposes.",
      "vocabulary": {
        "term": "Natural Resources",
        "definition": "Materials from Earth that people use, such as rocks, metals, water, and trees."
      }
    },
    {
      "id": 4,
      "x": "25%",
      "y": "55%",
      "label": "Trees and Vegetation",
      "fact": "The green trees and plants in this area help clean our air and prevent soil from washing away. Plants are living things that grow in soil and depend on the sun, water, and nutrients from Earth. These plants are part of Earth's **biosphere** — the layer of Earth where all living things exist.",
      "vocabulary": {
        "term": "Biosphere",
        "definition": "All the places on Earth where living things, like plants and animals, can be found."
      }
    }
  ]
}