{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "50%",
      "label": "Cracked, Dry Soil",
      "fact": "When soil dries out completely, it shrinks and cracks into pieces like a puzzle. This happens because water is very important for soil, and when there's no rain for a long time, the soil loses all its moisture and breaks apart. This is called **drought** — that's when an area doesn't get enough water for a long period of time.",
      "vocabulary": {
        "term": "Drought",
        "definition": "A long period of time when there is very little rain and the ground becomes very dry."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "75%",
      "label": "Small Plants Growing",
      "fact": "Even in this dry, cracked soil, small plants are trying to grow! Plants are living things that need water, sunlight, and nutrients from soil to survive. These hardy plants show us that life can adapt to tough conditions, which is an example of **adaptation** — that's when living things change to survive in their environment.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special feature or behavior that helps a living thing survive in its environment."
      }
    },
    {
      "id": 3,
      "x": "30%",
      "y": "35%",
      "label": "Gaps Between Soil Pieces",
      "fact": "The dark spaces between the soil cracks show us how soil shrinks when it loses water. Healthy soil should have tiny spaces in it that hold water, air, and nutrients that plants need to grow. These gaps tell us this soil needs water badly to become healthy again!",
      "vocabulary": {
        "term": "Soil",
        "definition": "The top layer of Earth made of tiny bits of rock, minerals, water, air, and dead plant and animal material that helps plants grow."
      }
    },
    {
      "id": 4,
      "x": "45%",
      "y": "20%",
      "label": "Earth's Surface",
      "fact": "This is the surface of Earth where land, weather, and living things all interact together. When there is no rain for a very long time, Earth's surface becomes dry and hard, and it can crack like this. Understanding how water changes Earth's surface helps us learn about the water cycle and how **weathering** breaks down rock.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The slow breaking down of rocks and soil by wind, water, ice, and other natural forces."
      }
    }
  ]
}