{
  "hotspots": [
    {
      "id": 1,
      "x": "45%",
      "y": "50%",
      "label": "Spiral Fossil",
      "fact": "This is a fossil, which is the preserved remains of an animal or plant that lived long ago! Scientists study fossils to learn about creatures that lived on Earth millions of years ago, like this ancient sea creature with a spiral shell. By looking at fossils, we can understand how life has changed over time.",
      "vocabulary": {
        "term": "Fossil",
        "definition": "The hardened remains or trace of a plant or animal that lived a very long time ago, preserved in rock."
      }
    },
    {
      "id": 2,
      "x": "25%",
      "y": "25%",
      "label": "Rock and Sediment",
      "fact": "This fossil is preserved in sedimentary rock, which forms when layers of sand and mud pile up and harden over millions of years. The rock protects the fossil and helps scientists figure out how old it is by studying the layers around it. Different rock layers tell us the story of what Earth was like in the past!",
      "vocabulary": {
        "term": "Sedimentary rock",
        "definition": "Rock that forms when layers of sediment like sand, mud, and shells get pressed together and harden over time."
      }
    },
    {
      "id": 3,
      "x": "55%",
      "y": "65%",
      "label": "Ancient Sea Life",
      "fact": "This spiral-shaped fossil came from a creature called an ammonite that lived in oceans hundreds of millions of years ago. These animals are extinct, which means there are none left alive today. By finding their fossils in rocks, we learn that oceans covered areas that are now on land!",
      "vocabulary": {
        "term": "Extinct",
        "definition": "When a type of plant or animal no longer exists anywhere on Earth because they all died out long ago."
      }
    },
    {
      "id": 4,
      "x": "70%",
      "y": "30%",
      "label": "Shell Pattern",
      "fact": "The detailed spiral pattern on this fossil shows us exactly how the ancient animal's shell grew, kind of like growth rings on a tree. Fossils like this help scientists understand the history of life on Earth and how different organisms evolved and changed over millions of years. This evidence helps us piece together Earth's story!",
      "vocabulary": {
        "term": "Evolution",
        "definition": "The slow change in living things over a very long time, as they adapt to survive in their environment."
      }
    }
  ]
}