{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Autumn Leaves",
      "fact": "The trees are showing beautiful fall colors because the weather is getting colder and there's less sunlight. When trees get less sunlight and warmth, they stop making food and their green color fades, revealing pretty red, orange, and yellow colors underneath. This is called **seasonal change** — that's when things in nature change as the seasons go from summer to fall to winter.",
      "vocabulary": {
        "term": "Seasonal change",
        "definition": "The way nature changes as the seasons go from spring to summer to fall to winter."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "50%",
      "label": "Lake or Pond Water",
      "fact": "This body of water is an important part of Earth's water cycle, where water moves between the sky, land, and water bodies. The trees and plants around this water depend on it to survive and grow. This type of water body is called a **freshwater ecosystem** — that's a place where freshwater plants and animals live together.",
      "vocabulary": {
        "term": "Freshwater ecosystem",
        "definition": "A community of plants and animals that live together in or around fresh water like lakes, ponds, or rivers."
      }
    },
    {
      "id": 3,
      "x": "45%",
      "y": "65%",
      "label": "Fallen Log",
      "fact": "This fallen tree trunk is decomposing, which means it's breaking down and becoming part of the soil again. As the log breaks down, it returns nutrients to the earth that help new plants grow, showing how matter cycles through nature. This process is called **decomposition** — that's when dead plants and animals break down and turn back into soil.",
      "vocabulary": {
        "term": "Decomposition",
        "definition": "The natural process where dead plants and animals break down and turn into soil."
      }
    },
    {
      "id": 4,
      "x": "20%",
      "y": "25%",
      "label": "Forested Shoreline",
      "fact": "The forest along the water's edge helps protect the land from erosion and provides homes for many animals and plants. Trees and their roots hold the soil in place, preventing it from washing away into the water. This area where land and water meet is called a **riparian zone** — that's where special plants and animals live along rivers and lakes.",
      "vocabulary": {
        "term": "Riparian zone",
        "definition": "The area of land right next to a river or lake where special plants and animals live."
      }
    }
  ]
}