{
  "hotspots": [
    {
      "id": 1,
      "x": "25%",
      "y": "20%",
      "label": "Gravel and Rocks",
      "fact": "These rocks and gravel are made from larger rocks that have been broken down over time by wind, water, and weather. Rocks come in different sizes, from huge boulders to tiny grains of sand, and they are important parts of Earth's surface. This process is called **weathering** — that's when rocks and minerals are slowly broken into smaller pieces by rain, wind, and temperature changes.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The slow breaking down of rocks into smaller pieces by wind, water, ice, and temperature changes."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "45%",
      "label": "Flowing Water and Erosion",
      "fact": "The water flowing through this area is moving rocks and soil from one place to another in a process called erosion. Moving water is very powerful and can carve channels and change the shape of land over time. This is called **erosion** — that's when water, wind, or ice moves soil and rocks to create new landforms.",
      "vocabulary": {
        "term": "Erosion",
        "definition": "The movement of soil and rocks from one place to another by water, wind, or ice."
      }
    },
    {
      "id": 3,
      "x": "75%",
      "y": "65%",
      "label": "Soil and Plants",
      "fact": "You can see grass and plants growing in the soil on the right side of the image. Plants need soil, water, and sunlight to grow, and they help hold soil in place and prevent erosion. When it rains, water soaks into the soil and helps plants get the nutrients they need to survive. This area shows how living things and Earth materials work together.",
      "vocabulary": {
        "term": "Soil",
        "definition": "The mix of tiny rock pieces, minerals, and decaying plants that covers much of Earth's land and helps plants grow."
      }
    },
    {
      "id": 4,
      "x": "10%",
      "y": "5%",
      "label": "Railroad Bed",
      "fact": "The railroad tracks at the top of the image show how people build on Earth's surface and change the land. Railroads are built on top of layers of rocks and gravel to create a strong, flat surface for trains to travel on safely. These materials must be strong enough to support heavy objects moving across them.",
      "vocabulary": {
        "term": "Landform",
        "definition": "A natural shape or feature of Earth's surface, like a hill, valley, mountain, or plain."
      }
    }
  ]
}