{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "25%",
      "label": "Falling Snow",
      "fact": "What you see falling from the sky in this image is precipitation, which is water that falls to Earth from clouds. Snow forms when it's very cold and water vapor in the air freezes into ice crystals instead of becoming rain. This type of weather helps us understand Earth's water cycle and how water moves between the sky, land, and oceans.",
      "vocabulary": {
        "term": "Precipitation",
        "definition": "Water that falls from clouds to Earth in the form of rain, snow, sleet, or hail."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "50%",
      "label": "Climbing Ivy Plants",
      "fact": "The green plants climbing on these brick buildings are living things that grow on structures, getting energy from the sun and water from the environment. Plants like this help scientists understand how living things interact with their surroundings, which is called the environment. These plants show us how different materials, like brick and soil, support life on Earth.",
      "vocabulary": {
        "term": "Environment",
        "definition": "All the living things (like plants and animals) and non-living things (like water, soil, and air) in a place that affect each other."
      }
    },
    {
      "id": 3,
      "x": "40%",
      "y": "35%",
      "label": "Brick Building Materials",
      "fact": "This building is made from bricks, which are made from clay and other materials found in Earth's soil. Bricks are a solid material that people use to construct buildings and structures that can last for hundreds of years. Understanding materials like rocks, soil, and clay helps us learn about Earth's composition and how humans use Earth's resources.",
      "vocabulary": {
        "term": "Materials",
        "definition": "The substances that things are made from, like rock, clay, metal, wood, or plastic."
      }
    },
    {
      "id": 4,
      "x": "80%",
      "y": "60%",
      "label": "Slate Roof",
      "fact": "The dark gray roof of this building is made from slate, which is a type of rock formed from layers of minerals that hardened deep inside Earth over time. Rocks like slate are very strong and can protect buildings from weather, including heavy snow and rain. Learning about different types of rocks helps us understand how Earth's solid materials protect structures we build.",
      "vocabulary": {
        "term": "Rock",
        "definition": "A solid, natural material made of minerals that comes from Earth and has been formed over a very long time."
      }
    }
  ]
}