{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Weathered Rock",
      "fact": "This rock has been broken down and changed by weathering over many years. Wind, rain, and temperature changes slowly crack and crumble rocks into smaller pieces. This is called **weathering** — that's when rocks are broken apart by water, ice, wind, and temperature changes without being moved to a new place.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The process where rocks and minerals are broken down and worn away by wind, water, ice, and temperature changes."
      }
    },
    {
      "id": 2,
      "x": "65%",
      "y": "55%",
      "label": "Moss and Lichen Growth",
      "fact": "The green and brown growth covering this rock shows how living things help break down rocks! Plants like moss and lichen can grow on rocks and help weather them into soil. This is called **biological weathering** — that's when living things help break rocks apart.",
      "vocabulary": {
        "term": "Biological Weathering",
        "definition": "When plants, animals, and other living things help break down and wear away rocks."
      }
    },
    {
      "id": 3,
      "x": "35%",
      "y": "70%",
      "label": "Soil and Vegetation",
      "fact": "Around the rock, you can see soil covered with grass and small plants. This soil was created over thousands of years as rocks like this one broke down into smaller and smaller pieces. Weathered rocks become the material that helps plants grow in soil. This is called **erosion and deposition** — that's when broken rock pieces are moved by water and wind to new locations where they help form soil.",
      "vocabulary": {
        "term": "Erosion",
        "definition": "The movement of weathered rock and soil from one place to another by water, wind, or ice."
      }
    },
    {
      "id": 4,
      "x": "70%",
      "y": "40%",
      "label": "Rock Surface Pitting",
      "fact": "The small holes and pits on the rock's surface show how water has slowly dissolved and carved away at the rock over time. Different types of rocks weather at different rates depending on what minerals they contain. Rocks that are softer or have more cracks tend to weather faster and break down into soil more quickly.",
      "vocabulary": {
        "term": "Mineral",
        "definition": "A natural solid material made of elements from the Earth that combines to make rocks."
      }
    }
  ]
}