{
  "hotspots": [
    {
      "id": 1,
      "x": "45%",
      "y": "35%",
      "label": "Layered Rock Bands",
      "fact": "See how this rock has many colorful bands or stripes? These layers formed over millions of years as sand and mud settled in ancient oceans and lakes. Each band tells us a story about Earth's history! This is called **stratification** — that's when layers of rock form one on top of another over long periods of time.",
      "vocabulary": {
        "term": "Stratification",
        "definition": "The formation of layers of rock, soil, or sediment stacked on top of each other over time."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "55%",
      "label": "Weathered Rock Surface",
      "fact": "Notice how the top of this rock is rough and broken? Wind, water, and ice have worked on this rock for a very long time, breaking it into smaller and smaller pieces. This slow process is called **weathering**, and it's how big rocks become sand and soil that we see all around us.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The slow breaking down of rocks by wind, water, ice, and other natural forces."
      }
    },
    {
      "id": 3,
      "x": "35%",
      "y": "70%",
      "label": "Pebbles and Gravel",
      "fact": "All these small pebbles and gravel around the big rock used to be part of larger rocks, just like this one! Over time, weathering broke them down into smaller pieces. These smaller rocks can be carried by water and wind to new places, and eventually they might become sand or soil. This process of moving rock pieces is called **erosion**.",
      "vocabulary": {
        "term": "Erosion",
        "definition": "The process of rocks and soil being worn away and carried from one place to another by wind, water, or ice."
      }
    },
    {
      "id": 4,
      "x": "48%",
      "y": "20%",
      "label": "Stripes and Color Changes",
      "fact": "The different colored stripes in this rock show us that different materials were deposited at different times in Earth's history. The tan, brown, and white bands might represent different seasons, different water levels, or different sources of sediment. Scientists read these layers like a history book to understand what Earth was like long ago!",
      "vocabulary": {
        "term": "Sediment",
        "definition": "Small pieces of rock, sand, and soil that are carried by water or wind and settle in layers."
      }
    }
  ]
}