{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "25%",
      "label": "Green Plants Growing",
      "fact": "Plants are living things that grow in soil and need sunlight, water, and nutrients to survive. These green plants are using the soil as their home and getting everything they need from the earth to grow strong and healthy. This is called **photosynthesis** — that's when plants use sunlight to make their own food and energy to grow.",
      "vocabulary": {
        "term": "Photosynthesis",
        "definition": "The process where plants use sunlight, water, and air to make food and energy so they can grow."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "55%",
      "label": "Soil Layers",
      "fact": "This picture shows different layers of soil, which is made up of tiny pieces of rock and rotting plants and animals mixed together. Soil is very important because it holds water and nutrients that plants need to grow, and it's home to many tiny living creatures. The darker soil at the bottom has more **organic matter** — that's dead plants and animals that break down and help soil stay healthy.",
      "vocabulary": {
        "term": "Organic Matter",
        "definition": "Dead plants, animals, and other living things that break down in soil and make it rich with nutrients that plants need."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "70%",
      "label": "Rock Layer",
      "fact": "Under the soil, you can see a layer of reddish-brown rock, which is a natural material made from minerals that have been pressed together over a very long time. Rocks are very important to Earth because they make up the ground we walk on and break down into small pieces to help form soil. This process is called **weathering** — that's when rocks break down into smaller and smaller pieces over many years.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The slow process where rocks break down into smaller pieces because of wind, water, ice, and sunlight."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "35%",
      "label": "Plant Root System",
      "fact": "The light-colored threads you see are plant roots that grow down into the soil to find water and nutrients that the plant needs to survive and grow. Roots act like straws, pulling water and minerals from the soil up into the plant's stem and leaves. This is called **nutrient absorption** — that's when roots soak up important minerals and water that help plants stay healthy and strong.",
      "vocabulary": {
        "term": "Nutrient Absorption",
        "definition": "The way plant roots take in water and minerals from the soil to use for growth and energy."
      }
    }
  ]
}