{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Lake or Pond Water",
      "fact": "This body of water is an important part of Earth's water cycle! Water from lakes and ponds can evaporate into the air, turn into clouds, and fall back down as rain or snow. This process, called the water cycle, helps distribute water around our planet and is essential for all living things.",
      "vocabulary": {
        "term": "Water Cycle",
        "definition": "The continuous movement of water from Earth's surface into the atmosphere and back again through evaporation, condensation, and precipitation."
      }
    },
    {
      "id": 2,
      "x": "20%",
      "y": "45%",
      "label": "Large Tree Trunk",
      "fact": "Trees are living organisms that grow over many years, and their thick trunks show how old they are! You can count the rings inside a tree trunk to figure out its age—each ring represents one year of growth. Trees also help clean our air and prevent soil erosion on hillsides like this one.",
      "vocabulary": {
        "term": "Erosion",
        "definition": "The slow wearing away of rocks and soil by water, wind, or ice, which can change the shape of the land over time."
      }
    },
    {
      "id": 3,
      "x": "75%",
      "y": "55%",
      "label": "Bare Soil and Slope",
      "fact": "The bare, sloped ground near the water shows how gravity pulls things downhill! Weathering and erosion break down rocks into smaller pieces of soil and sediment, which can be transported by water and wind. Over time, these processes shape the landscape and create different landforms.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The breaking down of rocks and soil into smaller pieces by wind, water, ice, or the sun's heat."
      }
    },
    {
      "id": 4,
      "x": "60%",
      "y": "70%",
      "label": "Fence and Grassland",
      "fact": "This fenced area is a habitat where different plants and animals live together! The grass, shrubs, and trees provide food and shelter for insects, birds, and other creatures. Each organism in this ecosystem has a role—some eat plants, some eat other animals, and some break down dead material to help plants grow.",
      "vocabulary": {
        "term": "Habitat",
        "definition": "A place where a plant or animal lives and finds the food, water, and shelter it needs to survive."
      }
    }
  ]
}