{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "45%",
      "label": "Yellow Daffodil Flower",
      "fact": "This bright yellow flower is blooming in spring, even though there is snow all around it! Plants are adapted to survive in many different weather conditions, including cold snaps with unexpected snow. This is called **adaptation** — that's when a plant or animal has special features that help it survive in its environment.",
      "vocabulary": {
        "term": "Adaptation",
        "definition": "A special feature or behavior that helps a plant or animal survive and thrive in its environment."
      }
    },
    {
      "id": 2,
      "x": "55%",
      "y": "25%",
      "label": "Snow and Ice Crystals",
      "fact": "The snow covering the leaves and buds is made of frozen water that fell from clouds in the sky. When water freezes, it changes from a liquid to a solid and forms ice crystals in beautiful patterns. This process is called **freezing** — that's when water gets cold enough to turn into ice.",
      "vocabulary": {
        "term": "Freezing",
        "definition": "When a liquid, like water, gets so cold that it turns into a solid, like ice."
      }
    },
    {
      "id": 3,
      "x": "35%",
      "y": "55%",
      "label": "Green Plant Leaves",
      "fact": "Even under the snow, these green leaves are still alive and ready to help the plant grow! Plants need sunlight, water, and air to survive and make food through their leaves. These leaves are covered with snow, which is a form of **precipitation** — that's water that falls from clouds to Earth as rain, snow, sleet, or hail.",
      "vocabulary": {
        "term": "Precipitation",
        "definition": "Any form of water that falls from clouds to the ground, such as rain, snow, sleet, or hail."
      }
    },
    {
      "id": 4,
      "x": "68%",
      "y": "35%",
      "label": "Buds Ready to Bloom",
      "fact": "These reddish-brown buds on the branches contain baby flowers waiting to open when it gets warmer! Plants change with the seasons and respond to temperature and sunlight. This is called **seasonal change** — that's when plants and animals behave differently as the weather gets warmer or colder throughout the year.",
      "vocabulary": {
        "term": "Seasonal Change",
        "definition": "The way plants and animals change their behavior and appearance as seasons change from winter to spring to summer to fall."
      }
    }
  ]
}