{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "15%",
      "label": "Dark Storm Clouds",
      "fact": "Those dark, thick clouds are a sign that severe weather might be coming soon! Clouds form when water vapor rises into the atmosphere and cools down, creating tiny water droplets. Dark clouds like these often bring heavy rain, strong winds, or even severe thunderstorms to an area.",
      "vocabulary": {
        "term": "Weather",
        "definition": "The day-to-day conditions of the atmosphere, including temperature, clouds, wind, and precipitation (rain or snow)."
      }
    },
    {
      "id": 2,
      "x": "25%",
      "y": "60%",
      "label": "Power Lines and Poles",
      "fact": "These poles carry electricity through wires to homes and businesses in the community. Electricity is a form of energy that powers our lights, refrigerators, and many other devices we use every day. During severe storms like the one shown here, power lines can sometimes be damaged by high winds or lightning.",
      "vocabulary": {
        "term": "Energy",
        "definition": "The ability to do work or make things happen; electricity is one type of energy that we use in our daily lives."
      }
    },
    {
      "id": 3,
      "x": "60%",
      "y": "50%",
      "label": "Industrial Area Below Storm",
      "fact": "This shows how humans have changed the land by building factories, warehouses, and roads in communities. Weather patterns and climate can affect where people choose to build and how they design buildings to stay safe during storms. This is an example of how Earth's systems interact with human activities.",
      "vocabulary": {
        "term": "Landforms",
        "definition": "Natural features of Earth's surface, like mountains, valleys, and plains; human-made structures like buildings and roads change the landscape too."
      }
    },
    {
      "id": 4,
      "x": "35%",
      "y": "25%",
      "label": "Water Body in Distance",
      "fact": "You can see what appears to be a lake or large body of water in the distance beneath the storm clouds. Water is constantly moving between Earth's surface and the atmosphere in a cycle called the water cycle—water evaporates from oceans and lakes, forms clouds, and then falls as rain or snow.",
      "vocabulary": {
        "term": "Water Cycle",
        "definition": "The continuous movement of water from Earth's surface (oceans, lakes, rivers) into the atmosphere as water vapor, and back down as precipitation like rain or snow."
      }
    }
  ]
}