{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Wind Turbine",
      "fact": "Wind turbines are giant machines that use moving air to create electricity for homes and schools. When the wind blows, it pushes the blades around, and this spinning motion generates clean energy without burning fuel or making pollution. This is called **renewable energy** — that's energy that comes from nature and doesn't run out, like wind, sun, and water.",
      "vocabulary": {
        "term": "Renewable Energy",
        "definition": "Energy that comes from nature and can be used again and again without running out, like wind and sunshine."
      }
    },
    {
      "id": 2,
      "x": "15%",
      "y": "55%",
      "label": "Farmland & Soil",
      "fact": "The flat, organized rows of soil you see here show how farmers prepare land to grow food crops. Healthy soil contains nutrients that help plants grow strong, and farmers must take care of this land so it stays fertile for many years. The soil is a natural resource that we need to protect because **conservation** — that's taking care of nature and using resources wisely — keeps our Earth healthy.",
      "vocabulary": {
        "term": "Conservation",
        "definition": "Taking good care of nature and using natural resources wisely so they last a long time."
      }
    },
    {
      "id": 3,
      "x": "70%",
      "y": "25%",
      "label": "Clear Blue Sky",
      "fact": "The clear, blue sky in this image shows ideal weather conditions for wind turbines to work well. When there is plenty of wind and clear skies, turbines can spin faster and produce more electricity for people to use. Scientists study **weather patterns** — that's how wind, temperature, and clouds change over time — to predict when wind farms will be most productive.",
      "vocabulary": {
        "term": "Weather Patterns",
        "definition": "The way weather changes over time, like how wind blows harder on some days or how clouds move across the sky."
      }
    },
    {
      "id": 4,
      "x": "40%",
      "y": "70%",
      "label": "Power Lines",
      "fact": "The electrical lines running across the landscape carry electricity from the wind turbines to homes, schools, and businesses far away. Energy from wind turbines is converted and sent through these wires as a form of **kinetic energy** — that's the energy of something that is moving, like spinning turbine blades — which people can then use to power lights and devices.",
      "vocabulary": {
        "term": "Kinetic Energy",
        "definition": "The energy that something has because it is moving, like a spinning wheel or blowing wind."
      }
    }
  ]
}