{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Wind Turbine",
      "fact": "These tall machines called wind turbines use the power of wind to create electricity for homes and schools! The wind pushes the blades around, and this spinning motion generates energy that we can use instead of burning coal or oil. This is called **renewable energy** — that's energy that comes from natural resources like wind, sun, and water that won't run out.",
      "vocabulary": {
        "term": "Renewable Energy",
        "definition": "Energy that comes from nature and can be replaced, like wind, sunlight, and flowing water."
      }
    },
    {
      "id": 2,
      "x": "15%",
      "y": "55%",
      "label": "Farmland Soil",
      "fact": "The brown soil you see here is very important for growing crops like corn and soybeans that feed people and animals. Good soil needs nutrients, water, and air to help plants grow strong and healthy. Farmers must take care of the land by rotating crops and protecting it from erosion, which is called **soil conservation** — that's when we protect dirt from being washed or blown away.",
      "vocabulary": {
        "term": "Soil Conservation",
        "definition": "The practice of protecting and taking care of soil so it stays healthy and fertile for growing plants."
      }
    },
    {
      "id": 3,
      "x": "60%",
      "y": "20%",
      "label": "Weather and Sky",
      "fact": "The blue sky above shows clear weather conditions that are perfect for wind turbines to spin and generate electricity! Wind patterns and weather change throughout the year and seasons, and these changes affect how much energy we can get from wind. This is why scientists study **weather patterns** — that's how weather repeats in certain ways so we can predict what might happen next.",
      "vocabulary": {
        "term": "Weather Patterns",
        "definition": "The way weather tends to repeat or change in regular ways, like seasons or daily temperature changes."
      }
    },
    {
      "id": 4,
      "x": "75%",
      "y": "45%",
      "label": "Flat Landform",
      "fact": "This flat landscape is perfect for wind turbines because wind can blow freely across open land without being blocked by mountains or buildings! Different landforms like plains, hills, and mountains affect how wind moves and where we can best use renewable energy. The shape of the land is called **topography** — that's the natural features and shape of Earth's surface in a certain place.",
      "vocabulary": {
        "term": "Topography",
        "definition": "The natural shape and features of the land, including mountains, valleys, plains, and hills."
      }
    }
  ]
}