{
  "hotspots": [
    {
      "id": 1,
      "x": "55%",
      "y": "35%",
      "label": "Electrical Wires",
      "fact": "These colored wires are made of metal that carries electricity from one place to another. Different colors help electricians know which wire does what job, kind of like a color-coded map! This is called a **circuit** — that's a path that electricity flows through to power things.",
      "vocabulary": {
        "term": "Circuit",
        "definition": "A closed loop or path that electricity travels through to power devices and make them work."
      }
    },
    {
      "id": 2,
      "x": "40%",
      "y": "55%",
      "label": "Terminal Blocks",
      "fact": "These green blocks are where wires connect together to transfer electrical energy. When wires are attached to these blocks, they create a connection that lets electricity flow through the system. Energy can be transferred from one wire to another through these connection points, which is how electrical devices get the power they need to work.",
      "vocabulary": {
        "term": "Energy Transfer",
        "definition": "When energy moves from one object or place to another, like electricity moving through wires to power a light bulb."
      }
    },
    {
      "id": 3,
      "x": "75%",
      "y": "40%",
      "label": "Capacitor or Switch",
      "fact": "This yellow component is either a **capacitor** (which stores electrical energy) or a switch (which controls whether electricity can flow or not). When you flip a light switch, you're opening and closing a path for electricity to travel through, which demonstrates how we can control energy flow in our homes!",
      "vocabulary": {
        "term": "Capacitor",
        "definition": "A device that stores electrical energy temporarily, like a tiny battery that holds electricity for short amounts of time."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "80%",
      "label": "Wires with Color Coding",
      "fact": "The different colored wires (red, black, blue, green, yellow) each carry electricity and serve different purposes in a circuit. This color-coding system helps us organize and understand how electrical systems are built. Different materials, like the plastic coating on these wires, have different physical properties that make them safe to handle and effective at their jobs.",
      "vocabulary": {
        "term": "Conductor",
        "definition": "A material that allows electricity to flow easily through it, like the metal inside these wires."
      }
    }
  ]
}