{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Jumping Motion",
      "fact": "When this student jumps, their muscles push down on the ground with force, and the ground pushes back up with equal force. This causes the student to move upward into the air! This is called **force** — a push or pull that makes something move or change direction.",
      "vocabulary": {
        "term": "Force",
        "definition": "A push or pull that makes something move, stop, or change direction."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "60%",
      "label": "Orange Cone Target",
      "fact": "The student is using force to jump over this cone as part of an athletic challenge. The cone stays still on the ground because nothing is pushing or pulling it hard enough to move it. Objects at rest stay at rest unless a force acts on them!",
      "vocabulary": {
        "term": "Motion",
        "definition": "When something changes position or moves from one place to another."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "20%",
      "label": "Arms Out for Balance",
      "fact": "The student spreads their arms out while jumping to help balance their body in the air. This spreading out changes how the student's weight is distributed, which helps with stability and control during the jump. Balanced **forces** help keep things stable!",
      "vocabulary": {
        "term": "Balance",
        "definition": "When forces are equal on all sides, keeping something stable and steady."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "75%",
      "label": "Shoes Making Contact",
      "fact": "The student's shoes are pushing against the ground with great force to launch them into the air. When the student lands, their shoes will experience a large force from the ground pushing back up. These **action and reaction forces** happen in pairs and are equal in strength!",
      "vocabulary": {
        "term": "Action and Reaction Forces",
        "definition": "When one object pushes on another, the second object pushes back with equal force in the opposite direction."
      }
    }
  ]
}