{
  "hotspots": [
    {
      "id": 1,
      "x": "60%",
      "y": "50%",
      "label": "Digital Temperature Display",
      "fact": "This thermometer uses energy to create light and display numbers on a screen. The display shows that thermal energy (heat) from the sun is being measured and converted into a number we can read and understand.",
      "vocabulary": {
        "term": "Thermal energy",
        "definition": "The heat energy that makes things warm or hot; it flows from hot objects to cold objects."
      }
    },
    {
      "id": 2,
      "x": "60%",
      "y": "20%",
      "label": "Temperature Reading",
      "fact": "The thermometer shows 113.5 degrees, which is very hot! This reading tells us how much thermal energy is in the brick surface. Different materials absorb different amounts of heat energy from the sun depending on their color and texture.",
      "vocabulary": {
        "term": "Temperature",
        "definition": "A measurement of how hot or cold something is."
      }
    },
    {
      "id": 3,
      "x": "60%",
      "y": "75%",
      "label": "Measurement Tool",
      "fact": "This infrared thermometer is a tool that detects invisible heat rays coming from objects. It helps us measure thermal energy without touching things, showing that energy can travel through space and be detected in different ways.",
      "vocabulary": {
        "term": "Infrared",
        "definition": "A type of invisible energy, similar to light, that we feel as heat."
      }
    },
    {
      "id": 4,
      "x": "20%",
      "y": "50%",
      "label": "Dark Brick Surface",
      "fact": "The dark brick is very hot because dark colors absorb more thermal energy from sunlight than light colors do. This shows how the physical property of color affects how much heat energy an object can take in.",
      "vocabulary": {
        "term": "Absorb",
        "definition": "To take in or soak up energy, like how a dark surface soaks up heat from the sun."
      }
    }
  ]
}