{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "50%",
      "label": "Metal Arch Sculpture",
      "fact": "This beautiful arch is made of metal that was bent and shaped by engineers and artists! The curved shape of the arch helps it stand strong and support its own weight, which is an example of how we use geometry and forces to build things that don't fall down. This is called **structural design** — that's when engineers plan the shape and materials of something to make sure it's strong and safe.",
      "vocabulary": {
        "term": "Force",
        "definition": "A push or pull that can make something move, stop, or change shape. The arch uses forces to stay balanced."
      }
    },
    {
      "id": 2,
      "x": "35%",
      "y": "35%",
      "label": "Palm Tree",
      "fact": "This tall palm tree shows how living things grow and take in energy from the sun! Plants use sunlight, water, and air to make their own food through a process that gives them energy to grow tall and strong. The tree's height and structure are physical properties that help it reach sunlight, which is the energy it needs to survive.",
      "vocabulary": {
        "term": "Energy",
        "definition": "The ability to make things move or change. The sun gives plants energy so they can grow."
      }
    },
    {
      "id": 3,
      "x": "25%",
      "y": "55%",
      "label": "Brick Building Materials",
      "fact": "The red bricks used to build this structure are a great example of how we choose materials based on their physical properties! Bricks are hard, durable, and can stack together because of their rectangular shape and smooth surfaces. Engineers pick bricks for buildings because they have the right properties to protect people inside from weather and last for many years.",
      "vocabulary": {
        "term": "Physical Properties",
        "definition": "Characteristics of a material that you can see or measure, like color, shape, size, and hardness. Red bricks have the property of being hard and rectangular."
      }
    },
    {
      "id": 4,
      "x": "70%",
      "y": "20%",
      "label": "Tall Office Building",
      "fact": "This tall building was designed and built by engineers who had to solve the problem of making a structure stand up straight and stable! Engineers use their knowledge of forces and motion to make sure buildings don't tip over and can hold the weight of all the walls, floors, and people inside. This is an example of how we use science and technology to design and build solutions to real-world problems.",
      "vocabulary": {
        "term": "Stability",
        "definition": "When something is balanced and doesn't easily tip over or fall down. A tall, wide building is more stable than a tall, skinny building."
      }
    }
  ]
}