{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Railroad Crossing Signal",
      "fact": "This red light is a signal that tells cars and people to stop when a heavy train is coming! The signal uses electrical energy to light up and warn everyone that a powerful force is about to move through this crossing. This is called a **force** — it's a push or pull that can move objects, like when a train pushes forward on its tracks.",
      "vocabulary": {
        "term": "Force",
        "definition": "A push or pull that can make something move, stop, or change direction."
      }
    },
    {
      "id": 2,
      "x": "35%",
      "y": "55%",
      "label": "Train Wheels on Tracks",
      "fact": "The big metal wheels on the train roll along the steel tracks to move the train forward. The wheels are circular, which makes rolling easier than sliding and helps the heavy train move smoothly down the track. This is called **friction** — it's a force that happens when two things rub together and can slow things down or help them grip better.",
      "vocabulary": {
        "term": "Friction",
        "definition": "A force that happens when two surfaces rub together and makes it harder for things to slide or move."
      }
    },
    {
      "id": 3,
      "x": "55%",
      "y": "50%",
      "label": "Large Train Cars",
      "fact": "These enormous metal train cars are very heavy and hold lots of material inside! Even though they weigh thousands of pounds, the engine can pull them forward because it has a very strong force. The heavier something is, the more force you need to move it — this is called **mass**, and it matters a lot when moving big objects like trains.",
      "vocabulary": {
        "term": "Mass",
        "definition": "How much stuff or material something is made of; heavier things have more mass."
      }
    },
    {
      "id": 4,
      "x": "70%",
      "y": "65%",
      "label": "Metal Bumper and Coupling",
      "fact": "This metal bumper and connector link the train cars together so they move as one unit! When the engine pulls with a strong force, all the connected cars move together down the tracks. The metal is hard and strong, which are **physical properties** — these are things we can observe about matter without changing what it's made of.",
      "vocabulary": {
        "term": "Physical Properties",
        "definition": "Characteristics of something we can see or measure, like color, shape, size, or how hard it is, without changing what it's made of."
      }
    }
  ]
}