{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Rough Rock Surface",
      "fact": "This rock has a bumpy, uneven surface that you can feel with your hands. The texture of an object is a physical property that tells us how something feels — rough, smooth, bumpy, or bumpy. Different materials have different textures, and we can describe and identify objects by how they feel!",
      "vocabulary": {
        "term": "Physical Property",
        "definition": "A characteristic of matter that you can observe or measure, like color, size, texture, or shape."
      }
    },
    {
      "id": 2,
      "x": "55%",
      "y": "55%",
      "label": "Weathering and Erosion",
      "fact": "Over many years, wind, rain, and sun have worn away and changed this rock's shape. This process is called weathering and erosion. Natural forces like water and wind push and pull on rocks, breaking them into smaller pieces and moving them around.",
      "vocabulary": {
        "term": "Weathering",
        "definition": "The process where rocks and materials slowly break down and change because of wind, water, sun, and other natural forces."
      }
    },
    {
      "id": 3,
      "x": "40%",
      "y": "45%",
      "label": "Color Changes from Heat",
      "fact": "You can see reddish and darker patches on this rock where the sun's heat and air have changed its color over time. Heat is a form of energy that can change the properties of materials. The sun's energy heats rocks and can change how they look and feel.",
      "vocabulary": {
        "term": "Energy",
        "definition": "The ability to make something move, change, or happen. Heat, light, and motion are all types of energy."
      }
    },
    {
      "id": 4,
      "x": "25%",
      "y": "50%",
      "label": "Lichen and Moss Growth",
      "fact": "The green and gray fuzzy patches growing on the rock are lichens and moss. These organisms grow on rocks and help break them down over time. Sound travels through solid materials like rocks, and vibrations from wind and water can help crack and split rocks into smaller pieces.",
      "vocabulary": {
        "term": "Lichen",
        "definition": "A living organism that grows on rocks and tree bark, often appearing as crusty or bumpy patches in gray, green, or orange colors."
      }
    }
  ]
}