{
  "hotspots": [
    {
      "id": 1,
      "x": "50%",
      "y": "35%",
      "label": "Egg Yolk",
      "fact": "The yellow yolk is made of matter that contains energy, which helps living things grow and stay healthy. When you cook an egg with heat, the yolk changes from liquid to solid—that's a physical change! This is called **matter** — everything around us, like the egg yolk, is made of matter and has physical properties we can observe.",
      "vocabulary": {
        "term": "Matter",
        "definition": "Anything that takes up space and has weight, like solids, liquids, and gases."
      }
    },
    {
      "id": 2,
      "x": "50%",
      "y": "55%",
      "label": "Blue Flame Heat",
      "fact": "The blue flame under the pan is a source of energy that transfers heat to cook the egg! Energy from the fire moves to the pan and then to the egg, causing it to change. This is called **thermal energy** — the heat that makes things warmer and can cause materials to change from one state to another.",
      "vocabulary": {
        "term": "Thermal Energy",
        "definition": "Heat energy that moves from hot things to cold things and can change how materials look or behave."
      }
    },
    {
      "id": 3,
      "x": "50%",
      "y": "65%",
      "label": "Hot Pan Surface",
      "fact": "The dark pan is a conductor of heat, meaning it allows thermal energy to flow through it easily from the flame to the egg! Materials like metal are good heat conductors because heat can travel through them quickly. This property makes pans perfect for cooking. This is called **conduction** — when heat moves through something by direct contact.",
      "vocabulary": {
        "term": "Conductor",
        "definition": "A material that lets heat or electricity pass through it easily, like metal pans."
      }
    },
    {
      "id": 4,
      "x": "50%",
      "y": "50%",
      "label": "Egg White Texture",
      "fact": "The white part of the egg changes from a clear, runny liquid into a white, solid substance when heat is applied—this is a physical change caused by energy! The egg white goes from one state of matter to another as the heat energy rearranges how the molecules are organized. This is called **states of matter** — the different forms things can be, like solid, liquid, and gas.",
      "vocabulary": {
        "term": "States of Matter",
        "definition": "The different forms that materials can take: solid (hard), liquid (flows), or gas (floats in air)."
      }
    }
  ]
}